{
    "Symbol": "STEELXIND",
    "ISIN": "INE503B01021",
    "News": [
        {
            "Title": "Steel Exchange India CFO Resigns Due to Medical Reasons",
            "Summary": "Steel Exchange India Limited announces CFO Mr. Brahmaiah Telaprolu's resignation effective February 11, 2026, citing medical reasons as the cause for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1770835851573,
            "Source": "stocks"
        },
        {
            "Title": "Steel Exchange India Pays ₹1.99 Cr Debenture Interest",
            "Summary": "Steel Exchange India Limited successfully paid ₹1,99,80,414 interest to secured non-convertible debenture holders on February 07, 2026, as per scheduled due date.",
            "Sentiment": "neutral",
            "PublishDate": 1770661509175,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Exchange India Pays ₹2.03 Cr Debenture Interest",
            "Summary": "Steel Exchange India Limited successfully paid ₹2.03 crores as monthly interest to secured non-convertible debenture holders on the due date of January 7, 2026, maintaining its debt servicing commitments.",
            "Sentiment": "positive",
            "PublishDate": 1767874434668,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Exchange India Director Nagoji Ram Mohan Resigns",
            "Summary": "Steel Exchange India Limited announced the resignation of Nominee Director Mr. Nagoji Ram Mohan effective January 02, 2026, following withdrawal of nomination by lender Vishwa Samudra Holdings Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767425409211,
            "Source": "stocks"
        },
        {
            "Title": "Steel Exchange India Completes Scheduled NCD Redemption",
            "Summary": "Steel Exchange India Limited completed scheduled redemption of secured NCDs worth ₹3.55 crores on January 7, 2026, reducing face value from ₹5,18,700 to ₹5,09,438 with ₹195.01 crores outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1767180697342,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Exchange India Gets Credit Rating Upgrade",
            "Summary": "Steel Exchange India receives comprehensive credit rating upgrades from Infomerics with Non-Convertible Debentures upgraded to IVR BBB-/Stable and multiple bank facilities receiving enhanced ratings.",
            "Sentiment": "positive",
            "PublishDate": 1767169467922,
            "Source": "stocks"
        },
        {
            "Title": "Steel Exchange India Gets Investment-Grade Rating",
            "Summary": "Steel Exchange India achieves investment-grade credit rating from Infomerics for ₹398.56 crore facilities while board approves ₹700 crore fundraising proposal for growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767078168669,
            "Source": "stocks"
        },
        {
            "Title": "Steel Exchange India Board Meet on Dec 30 for Fundraising",
            "Summary": "Steel Exchange India Limited has scheduled a board meeting on December 30, 2025, to consider and approve proposals for raising funds through equity shares, convertible bonds, debentures, warrants, or other equity-linked securities.",
            "Sentiment": "neutral",
            "PublishDate": 1766396354358,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Exchange India Gets GreenPro Certification",
            "Summary": "Steel Exchange India receives GreenPro Ecolabel certification for its Simhadri TMT Fe550D and Fe500D HSCRM bars, recognizing the company's commitment to eco-friendly manufacturing practices.",
            "Sentiment": "positive",
            "PublishDate": 1765965998860,
            "Source": "stocks"
        },
        {
            "Title": "Steel Exchange India Share Encumbrance Update",
            "Summary": "Vizag Profiles Private Limited disclosed share encumbrance transactions involving Steel Exchange India shares worth ₹171.60 crores, including pledge release and creation activities under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765954949304,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Exchange India Shares Pledged to Catalyst Trusteeship",
            "Summary": "Catalyst Trusteeship Limited receives pledge of 18.61 crore equity shares of Steel Exchange India Ltd, representing 14.93% of total share capital, as debenture trustee for Vizag Profiles Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765945608724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Exchange India Sees ₹171.60 Cr Pledge Release",
            "Summary": "Catalyst Trusteeship Limited released pledged equity shares worth ₹171.60 crores of Steel Exchange India Ltd on behalf of debenture holders, reducing encumbrance from 13.76% to nil.",
            "Sentiment": "positive",
            "PublishDate": 1765865548706,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vizag Profiles Private Limited Restructures Share Pledge in Steel Exchange India Limited",
            "Summary": "Vizag Profiles Private Limited disclosed the release of existing pledge and creation of new pledge over 17.16 crore equity shares (13.76% of total share capital) of Steel Exchange India Limited in favor of Catalyst Trusteeship Limited as debenture trustee. The restructuring is part of a debenture trust deed dated December 6, 2025, involving 18,500 unrated, unlisted, secured, redeemable, non-convertible debentures aggregating up to INR 185 crores with nominal value of INR 1 lakh each.",
            "Sentiment": "neutral",
            "PublishDate": 1765353562105,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Limited Makes Monthly Interest Payment on Secured Non-Convertible Debentures",
            "Summary": "Steel Exchange India Limited paid interest of ₹1,95,83,838 to holders of its secured non-convertible debentures on December 6, 2025, one day ahead of the December 7 due date. The payment relates to debentures with ISIN INE503B07036 having an issue size of ₹382.8 crore, with monthly interest payment frequency.",
            "Sentiment": "positive",
            "PublishDate": 1765180060896,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Limited Signs MoUs with Andhra Pradesh Government for 1 MTPA Steel Plant Expansion",
            "Summary": "Steel Exchange India Limited and its wholly-owned subsidiary SEIL Infra Logistics Limited have entered into separate MoUs with Andhra Pradesh Economic Development Board for expanding integrated steel plant capacity by 1 Million Tonnes Per Annum to manufacture green steel and alloy products. The non-binding agreements also cover development of a Multi-Modal Logistics Park and General Cargo Terminal, with the expansion planned in 3 phases over 5 years and financing through strategic equity partners and loans.",
            "Sentiment": "positive",
            "PublishDate": 1763175094966,
            "Source": "order&deals"
        },
        {
            "Title": "Steel Exchange India Reports Mixed Q2 Results, Raises Rs 1,500 Crores in New Funding",
            "Summary": "Steel Exchange India Limited posted a net profit of Rs 1,022.88 lakhs for the quarter ended September 30, 2025, compared to Rs 272.48 lakhs in the previous quarter, with revenue declining to Rs 28,176.30 lakhs from Rs 29,999.89 lakhs. The company secured term loans of Rs 1,500 crores from Kotak Mahindra Investment Ltd and Oxyzo Financial Services Ltd at 12% interest rate, using proceeds to prepay high-cost debt and repay Rs 843 crores of outstanding NCDs.",
            "Sentiment": "positive",
            "PublishDate": 1763112128990,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Q2 Results: EBITDA Rises to 274M Rupees Despite Revenue Decline",
            "Summary": "Steel Exchange India reported Q2 EBITDA of 274M rupees compared to 263M rupees year-over-year, with EBITDA margin improving to 11.9% from 10.3%. The company's Q2 revenue declined to 2.32B rupees from 2.61B rupees year-over-year, while net profit dropped to 21M rupees from 27.2M rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1763110260682,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Secures ₹350 Crore Refinancing Deal, Cuts Borrowing Costs by 5.50%",
            "Summary": "Steel Exchange India has secured a ₹350 crore refinancing deal with improved terms. The company's borrowing costs have decreased by approximately 5.50% from the previous rate of 18.75% per year. This refinancing arrangement is expected to result in significant savings on interest costs for the company.",
            "Sentiment": "positive",
            "PublishDate": 1759474327186,
            "Source": "stock"
        },
        {
            "Title": "Steel Exchange India Promoters Create Non-Disposal Undertaking on 50.80% Shareholding",
            "Summary": "Steel Exchange India Limited's promoters and promoter group have created a non-disposal undertaking on 63,35,95,550 equity shares, representing 50.80% of the company's total share capital. The encumbrance was created on September 27, 2025, in favor of VISTRA ITCL (INDIA) LIMITED as security trustee, along with lenders Kotak Mahindra Investments Limited and Oxyzo Financial Services Limited. This restriction prevents promoters from diluting their stake without prior written approval from lenders, except for permitted equity events and outstanding warrants. The undertaking is part of a facility agreement where the company will utilize INR 150 crores primarily for repaying existing debt. The encumbered shares represent 99.95% of total promoter shareholding and involve 16 individual promoters and promoter group entities.",
            "Sentiment": "neutral",
            "PublishDate": 1759302765449,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Board Approves Business Expansion into Real Estate, Infrastructure & Logistics",
            "Summary": "Steel Exchange India's board has approved the expansion of its Memorandum of Association to include real estate, infrastructure, and logistics businesses. This decision broadens the company's operational scope beyond its current activities.",
            "Sentiment": "positive",
            "PublishDate": 1756905653155,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Limited Reports 296% Jump in Net Profit for Q1 FY26",
            "Summary": "Steel Exchange India Limited reported strong quarterly results with net profit surging 296% year-on-year to Rs 10.23 crores from Rs 2.58 crores. Total income grew 14.53% to Rs 304.95 crores, while EBITDA increased 32.66% to Rs 36.35 crores with margins improving to 11.92%. The company secured a Rs 210 crore contract from RINL for converting 1.2 lakh tons per annum of billets into TMT bars, expected to begin operations in December. SIMHADRI TMT rebars were approved for Machilipatnam Port and Mulapeta Port projects in Andhra Pradesh. The company incorporated a wholly-owned subsidiary SEIL Infra Logistics Ltd for infrastructure and logistics operations. Management expects FY26 revenue of Rs 1,400-1,500 crores and EBITDA of Rs 170-180 crores. Current debt stands at Rs 340 crores with plans to reduce it by Rs 75 crores through a proposed rights issue of Rs 200 crores. The company owns 400 acres of land valued at Rs 1.2-1.5 crores per acre, with plans to monetize 200 surplus acres through logistics and real estate development.",
            "Sentiment": "positive",
            "PublishDate": 1754991105698,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Forms Strategic Partnerships for Multimodal Logistics in Vizag",
            "Summary": "Steel Exchange India has established strategic partnerships aimed at enhancing multimodal logistics operations in Vizag. The partnerships are focused on improving logistics capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1754461290684,
            "Source": "stock"
        },
        {
            "Title": "Steel Exchange India Partners with Two Companies for Visakhapatnam Logistics Development",
            "Summary": "Steel Exchange India Limited announced a strategic non-binding collaboration with Vizag Profiles Logistics Pvt. Ltd. and Hind Terminals Pvt. Ltd. to explore development of a General Cargo Terminal and Multi-Modal Logistics Park in Visakhapatnam. The partnership aims to evaluate opportunities in container train operations, coastal shipping, rail-based inland transport, and end-to-end multimodal logistics services. The collaboration combines SEIL's developing rail siding, VPL's regional logistics infrastructure, and HTPL's port-linked cargo expertise to improve logistics efficiency and reduce transit times. Joint Managing Director Suresh Kumar Bandi stated this represents a strategic expansion beyond steel manufacturing into infrastructure and logistics. The company reported total income of ₹1,163.37 crores, EBITDA of ₹143.60 crores, and net profit of ₹25.93 crores for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1754461234721,
            "Source": "order&deals"
        },
        {
            "Title": "Steel Exchange India Secures ₹210 Crore RINL Contract and Launches New Subsidiary",
            "Summary": "Steel Exchange India received approval for major port projects in Andhra Pradesh and secured a ₹210 crore contract from RINL for billet conversion. The company launched a new infra-logistics subsidiary aimed at boosting growth in specialty steels under the PLI scheme.",
            "Sentiment": "positive",
            "PublishDate": 1754407474310,
            "Source": "stock"
        },
        {
            "Title": "Steel Exchange India Reports 296% Jump in Q1 Net Profit on Strong Operating Performance",
            "Summary": "Steel Exchange India Limited announced its Q1 FY26 financial results showing significant growth across key metrics. Total income increased 14.53% to ₹304.95 crores compared to ₹266.26 crores in Q1 FY25. EBITDA grew 32.66% to ₹36.35 crores with margins improving to 11.92% from 10.29%. Net profit surged 296.30% to ₹10.23 crores from ₹2.58 crores, with profit margins expanding to 3.35% from 0.97%. The company's SIMHADRI TMT rebars were approved for two major Andhra Pradesh port projects at Machilipatnam and Mulapeta. Steel Exchange India incorporated a wholly owned subsidiary SEIL Infra Logistics Ltd on June 29, 2025, to focus on infrastructure and logistics operations. The company also received a contract worth up to ₹210 crores from RINL for converting 1.2 LTPA billets to Vizag Steel TMT rebars. Joint Managing Director Suresh Kumar Bandi attributed the performance to growing demand for SIMHADRI TMT products and operational efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1754365829546,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Board Approves ₹150 Crore Fundraising Plan",
            "Summary": "Steel Exchange India's board has approved a fundraising initiative of up to ₹150 crore. The company's board has given its approval for this capital raising exercise.",
            "Sentiment": "positive",
            "PublishDate": 1754293555530,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Reports Strong Q1 Performance with Revenue Up 14% to 3B Rupees",
            "Summary": "Steel Exchange India delivered robust quarterly results with revenue increasing to 3 billion rupees from 2.64 billion rupees year-over-year. Net profit surged significantly to 102 million rupees compared to 26 million rupees in the same period last year. EBITDA grew to 314 million rupees from 252 million rupees, while EBITDA margin improved to 10.47% from 9.5% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754293144142,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Limited Pays Rs 3.67 Crore Interest on Secured Non-Convertible Debentures",
            "Summary": "Steel Exchange India Limited made an interest payment of Rs 3,67,71,711 to holders of Secured Non-Convertible Debentures on July 31, 2025. The payment was made on the scheduled due date for debentures with ISIN INE503B07036, which have an issue size of Rs 3,828 crore. The interest payments follow a monthly frequency, with the previous payment made on June 30, 2025. The company confirmed there were no delays or issues with the payment.",
            "Sentiment": "neutral",
            "PublishDate": 1753962874343,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Limited Schedules Board Meeting for Q2 2025 Results and Rights Issue Re-approval",
            "Summary": "Steel Exchange India Limited has scheduled a Board of Directors meeting on August 4, 2025, to approve unaudited financial results for the quarter ended June 30, 2025. The board will also reconsider a rights issue of up to Rs 150 crore that was previously approved on February 14, 2024. The company seeks fresh board approval to pursue the rights issue under new simplified SEBI regulations issued on March 3, 2025, which make the process more time, process and cost efficient. The rights issue involves fully paid-up equity shares with face value of Re 1/- each for eligible equity shareholders. The company clarified this is not an additional offer but a fresh approval for the same matter announced earlier. The trading window for company shares has been closed since July 1, 2025, and will remain closed until 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1753713331324,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Secures ₹210 Crore Order",
            "Summary": "Steel Exchange India has received a ₹210 crore order. The company's market capitalization stands at ₹1,300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753082249995,
            "Source": "order&deals"
        },
        {
            "Title": "Steel Exchange India Reports Q4 Financial Results",
            "Summary": "Steel Exchange India has reported its Q4 financial results. The company's net profit for the quarter was 48 million rupees, compared to 198 million rupees year-over-year and 159 million rupees quarter-over-quarter. Revenue for Q4 was 2.9 billion rupees, down from 3.1 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747660490000,
            "Source": "result"
        },
        {
            "Title": "Steel Exchange India's 'Simhadri TMT' Rebars Approved for NHAI Project",
            "Summary": "Steel Exchange India's 'Simhadri TMT' steel rebars have received source approval for use in the National Highways Authority of India's (NHAI) Bengaluru-Vijayawada Economic Corridor project, specifically for packages 11, 12, and 14.",
            "Sentiment": "positive",
            "PublishDate": 1745312985000,
            "Source": "default"
        },
        {
            "Title": "Steel Exchange India Receives Approval for Use of 'Simhadri TMT' Steel Rebars in Port Construction",
            "Summary": "Steel Exchange India has obtained approval from the Andhra Pradesh Maritime Board to use its 'Simhadri TMT' steel rebars in the construction of new greenfield ports at Machilipatnam and Mulapeta.",
            "Sentiment": "positive",
            "PublishDate": 1745228162000,
            "Source": "default"
        },
        {
            "Title": "Steel Exchange India Expands Steel Plant Capacity by 50%",
            "Summary": "Steel Exchange India has announced a significant expansion of its steel plant capacity. The company has increased its output capacity for billets and rolling bar mill by 50%. This expansion represents a major corporate action aimed at boosting production capabilities and potentially increasing market share in the steel industry.",
            "Sentiment": "positive",
            "PublishDate": 1742371312000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India: Promoter Updates Stock Pledge, Shares Surge 8%",
            "Summary": "Steel Exchange India's promoter, Vizag Profiles Private Limited, released a pledge on 50,00,000 shares (0.42% of total share capital) and re-pledged them to a different entity. The stock jumped 8.03% to ₹8.47 in intraday trading following this news.",
            "Sentiment": "positive",
            "PublishDate": 1740978173000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Reports Significant Profit Increase in Q3",
            "Summary": "Steel Exchange India has announced its financial results for the third quarter. The company reported a net profit of 159 million rupees, a substantial increase from 2 million rupees in the same period last year. Revenue also saw growth, rising to 3.27 billion rupees from 2.56 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737936793000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Steel Exchange India has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 394 million rupees, up from 233 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 12.05% from 9.11% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737730370000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Reports Significant Profit Growth in Q3",
            "Summary": "Steel Exchange India has announced its financial results for the third quarter. The company reported a net profit of 159 million rupees, a substantial increase from 2 million rupees in the same quarter last year. Revenue also saw growth, rising to 3.27 billion rupees from 2.56 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737730324000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Exchange India Approves Fundraising of Up to 6 Billion Rupees",
            "Summary": "The Board of Directors of Steel Exchange India has approved a plan to raise funds up to 6 billion rupees. This decision indicates a significant financial move for the company, potentially aimed at expansion, debt reduction, or other strategic initiatives. The specific details of how the funds will be raised or utilized have not been provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1734569368000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Approves Fundraising of Up to 6 Billion Rupees",
            "Summary": "The board of Steel Exchange India has approved a plan to raise funds up to 6 billion rupees. This decision indicates the company's intent to secure additional capital, potentially for expansion, debt reduction, or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1734531146000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India to Consider Fund Raising via Securities Issuance",
            "Summary": "Steel Exchange India has announced a board meeting scheduled for December 18 to discuss and consider raising funds through the issuance of securities. The company is exploring various modes of issuance, including Qualified Institutional Placement (QIP).",
            "Sentiment": "neutral",
            "PublishDate": 1733922484000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Exchange India Reports Improved Q2 EBITDA Performance",
            "Summary": "Steel Exchange India has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 263 million rupees from 190 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 10.11% from 7.07% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1729171431000,
            "Source": "result"
        },
        {
            "Title": "Steel Exchange India Reports Q2 Revenue Decline",
            "Summary": "Steel Exchange India has reported a revenue of 2.61 billion rupees for the second quarter, compared to 2.69 billion rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729171419000,
            "Source": "result"
        },
        {
            "Title": "Steel Exchange India Reports Q2 Profit Turnaround",
            "Summary": "Steel Exchange India has reported a net profit of 27.2 million rupees in Q2, compared to a loss of 36 million rupees in the same quarter last year. The company also saw a slight increase in profit from the previous quarter, up from 25.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729171404000,
            "Source": "result"
        },
        {
            "Title": "Steel Exchange India Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class=\"neutral\">Steel Exchange India</span> has announced a <span class=\"neutral\">board meeting</span> to be held on <b>October 17</b> to <span class=\"neutral\">consider and approve</span> the <span class=\"neutral\">financial results</span> for the <span class=\"neutral\">second quarter</span> of the current <span class=\"neutral\">fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728568111000,
            "Source": "corporate_action"
        }
    ]
}