{
    "Symbol": "STEL",
    "ISIN": "INE577L01016",
    "News": [
        {
            "Title": "STEL Holdings Reports Strong Q3FY26 Performance",
            "Summary": "STEL Holdings Limited announced Q3FY26 results with revenue of Rs 1,693.78 lacs and net profit of Rs 1,257.75 lacs. Company also appointed new Company Secretary effective March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769597043961,
            "Source": "co_actions_results"
        },
        {
            "Title": "STEL Holdings Acquires 18,850 CEAT Shares for ₹7 Cr",
            "Summary": "STEL Holdings Limited acquired 18,850 equity shares of CEAT Limited through market purchase for approximately ₹7 crores at ₹3,713.00 per share, increasing its stake by 0.047%.",
            "Sentiment": "neutral",
            "PublishDate": 1769146637943,
            "Source": "co_actions_results"
        },
        {
            "Title": "STEL Holdings Board Meet Set for Jan 28 Q3 Results",
            "Summary": "STEL Holdings Limited has scheduled a board meeting on January 28, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window remains closed until January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768806079318,
            "Source": "co_actions_results"
        },
        {
            "Title": "STEL Holdings Company Secretary Resigns Feb 2026",
            "Summary": "STEL Holdings Limited announces resignation of Company Secretary Ms. Lakshmi P.S. effective February 28, 2026, citing relocation to different state as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1767170341320,
            "Source": "stocks"
        },
        {
            "Title": "Sofreal Mercantrade Increases Stake in STEL Holdings",
            "Summary": "Sofreal Mercantrade Private Limited and its promoter group acquired 3,70,351 shares of STEL Holdings Limited, increasing their collective stake to 71.33% through open market purchases between March and December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766144474387,
            "Source": "co_actions_results"
        },
        {
            "Title": "STEL Holdings Acquires 12 Lakh Shares in PCBL Chemical for Rs 33.6 Crores",
            "Summary": "STEL Holdings Limited acquired 12,00,000 equity shares of PCBL Chemical Limited at Rs 280 per share through conversion of warrants allotted on preferential basis. The acquisition represents 1.043% of PCBL Chemical's post-issue paid-up share capital. PCBL Chemical is a carbon black manufacturer with production facilities across India and reported turnover of Rs 5904.63 crores. The company also acquired Aquapharma Chemical, a leading phosphonate producer. STEL Holdings falls under the promoter group of PCBL Chemical, making this a related party transaction conducted at arm's length. The acquisition was completed on November 3, 2025, with cash consideration and requires no regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1762202245810,
            "Source": "corporate_action"
        },
        {
            "Title": "STEL Holdings Reports Quarterly Results and Approves Policy Changes",
            "Summary": "STEL Holdings Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs. 777.68 lakhs for the quarter, with dividend income of Rs. 857.67 lakhs. Net profit for the quarter stood at Rs. 664.52 lakhs on a consolidated basis. The company's board also approved changes to the Policy for Determining Materiality of Events. STEL Holdings operates as a Core Investment Company, earning income through dividends, interest and gains from investments held. The company's total assets increased to Rs. 2,03,268.48 lakhs as of September 30, 2025, compared to Rs. 1,91,251.06 lakhs as of March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761844778193,
            "Source": "earnings"
        },
        {
            "Title": "STEL Holdings Approves Q1 2025 Results, Reappoints Wholetime Director and Names Interim Chairperson",
            "Summary": "STEL Holdings Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 47.00 lacs and net profit of Rs 35.15 lacs for Q1 2025, compared to Rs 38.73 lacs revenue and Rs 8.69 lacs net profit in the same quarter last year. The Board reappointed Abraham Ittyipe as Wholetime Director for five years from August 13, 2025 to August 12, 2030, subject to shareholder approval. Alok Kalani, a Non-Executive Non-Independent Director, was appointed as interim Chairperson from July 24, 2025 to October 1, 2025. The company also decided to convene its 35th Annual General Meeting with details to be shared separately. STEL Holdings operates as a Core Investment Company earning income through dividends, interest and investment gains, with Doon Doars Plantations Ltd as its wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753355460407,
            "Source": "earnings"
        },
        {
            "Title": "STEL Holdings Approves Q1 FY2026 Results, Reappoints Wholetime Director and Names Interim Board Chairman",
            "Summary": "STEL Holdings Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 47.00 lakhs and net profit of Rs 35.15 lakhs, with basic and diluted earnings per share of Rs 0.19. The Board reappointed Abraham Ittyipe as Wholetime Director for five years from August 13, 2025 to August 12, 2030, subject to shareholder approval. Alok Kalani was appointed as temporary Board Chairperson from July 24, 2025 to October 1, 2025. The company also decided to convene its 35th Annual General Meeting. STEL Holdings operates as a Core Investment Company earning income through dividends, interest and gains on investments, with Doon Doars Plantations Ltd as its wholly owned subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1753354498073,
            "Source": "corporate_action"
        },
        {
            "Title": "STEL Holdings Reports Q4 Financial Results",
            "Summary": "STEL Holdings has announced its financial results for the fourth quarter. The company reported revenue of 134.4 million rupees, compared to 134.8 million rupees in the same quarter last year. The consolidated net profit for Q4 was 99.8 million rupees, slightly up from 99.6 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747664145000,
            "Source": "result"
        },
        {
            "Title": "Stel Holdings: Q3 Profit Drops 10% YoY, Revenue Stagnant",
            "Summary": "Stel Holdings reported Q3 FY25 results with profit at ₹0.09 crore, down 10% YoY. Revenue remained flat at ₹0.3 crore. The company faced a sharp 96.14% QoQ decline in revenue and 98.43% drop in profit. Operating income fell 98.3% QoQ. SG&A expenses increased by 33.33% both QoQ and YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737695993000,
            "Source": "earnings"
        }
    ]
}