{
    "Symbol": "STERTOOLS",
    "ISIN": "INE334A01023",
    "News": [
        {
            "Title": "Sterling Tools Q3FY26 Results & Leadership Changes",
            "Summary": "Sterling Tools reported Q3FY26 results with revenue of ₹18,035.89 lakhs and profit of ₹950.38 lakhs. Board approved re-appointments of key directors and allotted 1,60,108 ESOP shares.",
            "Sentiment": "positive",
            "PublishDate": 1770131647805,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling Tools Partners With China's Minieye For ADAS",
            "Summary": "Sterling Tools announces strategic partnership with China's Minieye to deliver ADAS and driver monitoring solutions for Indian market, aligned with mandatory regulations effective January 2027.",
            "Sentiment": "positive",
            "PublishDate": 1768804282963,
            "Source": "stocks"
        },
        {
            "Title": "Sterling Tools CFO Pankaj Gupta Resigns",
            "Summary": "Sterling Tools Limited confirms resignation of Chief Financial Officer Pankaj Gupta, effective December 31, 2025, to pursue other professional opportunities after 5-year tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1765796272490,
            "Source": "stocks"
        },
        {
            "Title": "Sterling Tools Promoter Group Completes Inter-Family Share Transfer",
            "Summary": "Atul Aggarwal, Managing Director of Sterling Tools Limited, transferred 4,000 equity shares as a gift to his daughter Ayesha Aggarwal, who is part of the promoter group. The transaction was conducted through off-market inter-se transfer with no change in the total shareholding of the promoter and promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1763702566604,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Reports Q2 H1 FY26 Results, Expands EV Portfolio with New Partnerships",
            "Summary": "Sterling Tools' standalone fastener business posted total income of INR 172.2 crores in Q2 FY26 with flat EBITDA margins, while receiving INR 9.5 crores exceptional compensation from Delhi Metro Rail Corporation for land acquisition. The company expanded its EV business through partnerships with Landworld Technology for onboard chargers and DC/DC converters, with subsidiary STML set to begin commercial production of HVDC contactors and relays in December 2025, targeting INR 200 crores revenue potential within 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1763378644040,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Plans Multi-Segment Growth Through EV Components and Premium Fasteners Diversification",
            "Summary": "Sterling Tools announced a diversification strategy targeting growth across multiple segments including EV powertrain, high-voltage components, and premium fasteners. The company plans to commercialize HVDC relays and contactors by FY27, with a revenue target of ₹150-200 crores over five years from these products. The growth strategy includes strengthening global technology alliances and enhancing in-house R&D capabilities for import substitution. Sterling Tools is focusing on margin expansion through automation, localization, and increasing value-added manufacturing content.",
            "Sentiment": "positive",
            "PublishDate": 1762872064573,
            "Source": "stock"
        },
        {
            "Title": "Sterling Tools Reports 79% Jump in Q2 Profit, Appoints New Manufacturing Chief",
            "Summary": "Sterling Tools Limited reported a profit of Rs 1,979.86 lakhs for the second quarter ended September 30, 2025, compared to Rs 1,104.98 lakhs in the previous quarter, marking a significant increase. Total income for the quarter stood at Rs 7,216.76 lakhs versus Rs 7,632.05 lakhs in the preceding quarter. The company received exceptional income of Rs 949.64 lakhs as enhanced compensation from Delhi Metro Rail Corporation for land acquired in an earlier year. The board approved the unaudited financial results for the second quarter and half year ended September 30, 2025. Additionally, the company appointed Mr. Roney John as Chief Manufacturing Officer effective November 11, 2025. Mr. John brings over 30 years of manufacturing operations experience, having previously worked with organizations including Mahindra CIE Automotive Limited and Endurance Technologies Ltd. The company operates primarily in manufacturing automotive components and fasteners.",
            "Sentiment": "positive",
            "PublishDate": 1762861867742,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Reports Q2 Revenue Drop to 2.1 Billion Rupees",
            "Summary": "Sterling Tools reported quarterly revenue of 2.1 billion rupees compared to 2.84 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1762853510940,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Reports Decline in Q2 EBITDA Despite Margin Improvement",
            "Summary": "Sterling Tools reported Q2 EBITDA of 236 million rupees compared to 322 million rupees in the same quarter last year, representing a year-over-year decline. The company's EBITDA margin improved slightly to 11.36% from 11.34% in the previous year. Consolidated net profit for the quarter was 172 million rupees, down from 175 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762853062476,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Limited Receives Credit Rating Reaffirmation from ICRA with Outlook Revision",
            "Summary": "ICRA Limited reaffirmed Sterling Tools Limited's credit ratings across multiple instruments totaling Rs. 204.19 crore. The company received ICRA [A1+] rating for short-term unallocated limits of Rs. 25.63 crore and non-fund based facilities of Rs. 1.64 crore. Long-term fund-based facilities including cash credit of Rs. 144 crore and term loans of Rs. 32.92 crore were rated ICRA [AA-] with stable outlook. The outlook was revised from positive to stable for the long-term ratings. The ratings are subject to surveillance within one year and ICRA reserves the right to review based on new information or changing circumstances.",
            "Sentiment": "neutral",
            "PublishDate": 1762815127490,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Limited Schedules Earnings Conference Call for Q2 and H1 FY26 Results",
            "Summary": "Sterling Tools Limited will hold a conference call with investors and analysts to discuss the company's financial and operational performance for the quarter and half-year ended September 30, 2025. The earnings call is scheduled for Wednesday, November 12, 2025, at 12:00 PM IST. Key participants include Managing Director Atul Aggarwal, Directors Jaideep Wadhwa and Anish Agarwal, and Chief Financial Officer Pankaj Gupta. The call details and schedule will be hosted on the company's website at www.stlfasteners.com.",
            "Sentiment": "neutral",
            "PublishDate": 1762279768797,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Rebrands Subsidiary to Sterling E-Mobility Solutions Limited",
            "Summary": "Sterling Tools Limited announced the rebranding of its subsidiary Sterling Gtake to Sterling E-Mobility Solutions Limited, signifying a strategic shift towards becoming a comprehensive provider of electric vehicle technologies. The name change reflects the company's expanding portfolio and commitment to delivering integrated solutions for EV powertrains and power electronics. Chairman Anil Aggarwal stated the rebranding reflects their commitment to delivering integrated EV solutions powered by global innovation and local expertise. The company has entered technology licensing agreements with Advanced Electric Machines (UK) in May 2025 for magnet-free motors and with Landworld Technology Co. Ltd. (China) in September 2025 for on-board chargers and DC/DC converters. Sterling maintains its exclusive relationship with Jiangsu Gtake Electric Co., Ltd. for the Indian market, with multiple products being developed and localized to meet domestic requirements.",
            "Sentiment": "positive",
            "PublishDate": 1760419290111,
            "Source": "stock"
        },
        {
            "Title": "Sterling Tools Re-appoints Rakesh Batra as Independent Director for Five-Year Term",
            "Summary": "Sterling Tools Limited shareholders approved the re-appointment of Mr. Rakesh Batra as Non-Executive Independent Director for a five-year term beginning November 10, 2025, at their 46th Annual General Meeting held on September 25, 2025. Batra is a B.Tech graduate from IIT Kharagpur with a PGDM from IIM Ahmedabad and MBT from University of New South Wales. He brings over 43 years of management and consulting experience in automotive, industrial equipment and manufacturing industries, having served as Partner and leader of Automotive Sector with EY India. He holds positions as Industry Expert and Independent Director on boards of leading automotive companies in the United States and India. The company confirmed that Batra has not been debarred from holding directorship by SEBI or any other authority.",
            "Sentiment": "positive",
            "PublishDate": 1758796783341,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sterling Tools Partners With Landworld Technology For Local Production Of EV Charging Components",
            "Summary": "Sterling Tools has entered into a partnership with Landworld Technology Co. Ltd. to establish local production of on-board chargers and converters in India. This collaboration focuses on manufacturing key electric vehicle charging infrastructure components domestically.",
            "Sentiment": "positive",
            "PublishDate": 1757919108945,
            "Source": "order&deals"
        },
        {
            "Title": "Sterling Tools Q1 FY26 Revenue Drops 31% to ₹195 Crores Due to Customer In-sourcing",
            "Summary": "Sterling Tools Limited reported a 31% year-on-year decline in consolidated revenue to ₹195 crores for Q1 FY26, primarily due to product in-sourcing by a key customer. Despite the overall automobile industry declining 5.1% in the quarter, the company's standalone fasteners business remained stable with new customer additions including Hyundai. The company is expanding its EV ecosystem portfolio through subsidiaries SGEM and STML. SGEM is working on 28 customer programs across various vehicle segments and secured its first DC/DC converter nomination from a leading e-CV OEM, with revenues expected by end of calendar year. The company has formed a strategic alliance with UK-based Advanced Electric Machines for rare earth magnet-free motors, expecting production to start in FY27. STML is completing construction of its Bangalore facility for high-voltage DC contactors, with commercial production expected in the second half of FY26. Management projects revenue recovery by end of FY27 and outlined total investments of ₹150-200 crores over the next 3 years across new businesses, with potential combined revenue of ₹500-1,000 crores depending on market penetration.",
            "Sentiment": "neutral",
            "PublishDate": 1755165729231,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Board Approves Q1 2025 Results and Key Appointments",
            "Summary": "Sterling Tools Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 16,110.86 lakhs and profit before tax of Rs. 1,485.51 lakhs. The company reported basic earnings per share of Rs. 3.05. The Board made several key appointments including Ms. Komal Malik as Company Secretary and Compliance Officer, and approved the re-appointment of Mr. Rakesh Batra as Non-Executive Independent Director for a five-year term starting November 10, 2025. The company re-appointed M/s Jitender Navneet & Co as Cost Auditors and appointed M/s Dhananjay Shukla & Associates as Secretarial Auditors for five years. The Board also approved a Rs. 20 crore equity investment in wholly-owned subsidiary Sterling Tech-Mobility Limited to support expansion into new automotive product lines. The 46th Annual General Meeting is scheduled for September 13, 2025, with book closure from September 7-13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754578924872,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Focuses on EV Growth with New Product Diversification and OEM Partnerships",
            "Summary": "Sterling Tools is concentrating on electric vehicle growth through product diversification and new OEM partnerships for long-term expansion. STML is set to begin HVDC production, while SGEM has secured its first DC/DC approval alongside launching REM-free motors.",
            "Sentiment": "positive",
            "PublishDate": 1754577956414,
            "Source": "stock"
        },
        {
            "Title": "Sterling Tools Reports Q1FY26 Results with 31% Revenue Decline, Plans EV Component Expansion",
            "Summary": "Sterling Tools Limited reported consolidated revenue of Rs 195 crore for Q1FY26, down 31.3% from Rs 283.7 crore in Q1FY25. Profit after tax declined 51.2% to Rs 9 crore from Rs 18.4 crore. The standalone fasteners business remained stable with revenue of Rs 163.2 crore, maintaining EBITDA margin at 15%. The decline was primarily attributed to revenue drop in subsidiary Sterling Gtake E-Mobility (SGEM) due to product insourcing by a key customer. Despite domestic automobile industry declining 5.1%, the company added new customers including Hyundai. SGEM is working on 28 customer programs across 2W, 3W, LCVs and HCVs, and secured its first nomination for DC/DC convertors from a leading e-CV OEM. The company's other subsidiary Sterling Tech-Mobility Limited will commence commercial production of HVDC contactors and relays by second half of FY26 through partnership with Kunshan GLVAC Yuantong.",
            "Sentiment": "neutral",
            "PublishDate": 1754576528196,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Approves Q1 Results and Key Appointments in Board Meeting",
            "Summary": "Sterling Tools Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 16,110.86 lakhs and profit before tax of Rs 1,485.51 lakhs for the quarter. The Board made several key appointments: Ms. Komal Malik as Company Secretary & Compliance Officer, re-appointed Mr. Rakesh Batra as Non-Executive Independent Director for a second five-year term starting November 10, 2025, and re-appointed M/s Jitender Navneet & Co as Cost Auditors for FY 2025-26. The company also approved investment of Rs 20 crore in its wholly owned subsidiary Sterling Tech-Mobility Limited for automotive sector expansion. The 46th Annual General Meeting is scheduled for September 13, 2025, with book closure from September 7-13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754558804141,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Reports 51% Decline in Q1 Net Profit to 90 Million Rupees",
            "Summary": "Sterling Tools reported quarterly consolidated net profit of 90 million rupees compared to 184 million rupees in the same period last year. The company's revenue fell to 1.9 billion rupees from 2.8 billion rupees year-over-year. EBITDA decreased to 220 million rupees from 321 million rupees, though EBITDA margin improved slightly to 11.47% from 11.40%.",
            "Sentiment": "negative",
            "PublishDate": 1754557712432,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Receives GST Notice for ₹99 Million",
            "Summary": "Sterling Tools has been issued a GST notice for ₹99 Million by CGST Dehradun. The notice pertains to a tax liability, though specific details about the nature or period of the liability are not provided in the given information.",
            "Sentiment": "negative",
            "PublishDate": 1750938183000,
            "Source": "default"
        },
        {
            "Title": "Sterling Tools to License Rare Earth-Free EV Motor Technology",
            "Summary": "Sterling Tools is entering into a technology licensing agreement with Advanced Electric Machines (AEM) Ltd, UK. The agreement is for the development, manufacture, and marketing of rare earth magnet-free traction motors for electric vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1747191386000,
            "Source": "default"
        },
        {
            "Title": "Sterling Tools: Exclusive Deal for EV Motor Manufacturing",
            "Summary": "Sterling Tools' subsidiary Sterling Gtake signed an exclusive manufacturing technology licensing agreement with Advanced Electric Machines (AEM) Ltd, UK, to produce magnet-free traction motors for electric vehicles. The company will manufacture these motors at its Faridabad plant, aiming to drive import substitution. Sterling Tools also reported Q4 revenue of ₹165.24 crore and FY2025 revenue of ₹651.61 crore. The board recommended a final dividend of ₹2.5 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747188794000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Reports Q4 Financial Results",
            "Summary": "Sterling Tools has released its Q4 financial results, showing a decline in performance compared to the previous year. The company's EBITDA decreased from 309 million rupees to 185 million rupees year-over-year, with EBITDA margin falling from 11.46% to 9.28%. Consolidated net profit dropped from 163 million rupees to 88 million rupees, while revenue decreased from 2.69 billion rupees to 1.99 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1747127563000,
            "Source": "result"
        },
        {
            "Title": "NCLT Approves Amalgamation of Haryana Ispat with Sterling Tools",
            "Summary": "Sterling Tools has announced that the National Company Law Tribunal (NCLT) has approved the scheme of amalgamation between Haryana Ispat and Sterling Tools. This corporate action signifies a significant structural change for the company.",
            "Sentiment": "positive",
            "PublishDate": 1743164147000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Reports Q3 EBITDA and Margin",
            "Summary": "Sterling Tools has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 268 million rupees, compared to 261 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased to 10.28% from 11.25% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738662588000,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Reports Q3 Revenue Growth",
            "Summary": "Sterling Tools has announced its third quarter revenue results. The company reported revenue of 2.6 billion rupees, compared to 2.3 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738662569000,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Reports Steady Q3 Consolidated Net Profit",
            "Summary": "Sterling Tools has announced its Q3 consolidated net profit of 136 million rupees, compared to 135 million rupees in the same quarter of the previous year, showing a slight increase year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738662538000,
            "Source": "earnings"
        },
        {
            "Title": "Sterling Tools Announces Rs. 200 Crore Business Projection and New Facility in Bengaluru",
            "Summary": "Sterling Tools expects to generate Rs. 200 crores in business by FY30. The company plans to establish a new facility in Bengaluru, India, with an initial investment of approximately Rs. 20 crore. This facility will manufacture and assemble latching relays locally, bringing niche technology to the country.",
            "Sentiment": "positive",
            "PublishDate": 1733121963000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Signs Agreement with China's Meishuo Electric for Power Transmission Solutions in India",
            "Summary": "Sterling Tools has entered into an agreement with Meishuo Electric, a Chinese company, to provide power transmission solutions in the Indian market. This partnership aims to expand Sterling Tools' offerings in the power transmission sector within India.",
            "Sentiment": "positive",
            "PublishDate": 1733121846000,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Upgrades Sterling Tools' Rating Outlook",
            "Summary": "ICRA, a credit rating agency, has reaffirmed Sterling Tools' long-term rating while revising the outlook from stable to positive. This change suggests an improvement in the company's financial or operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1731997058000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Reports Q2 EBITDA Growth",
            "Summary": "Sterling Tools has reported its Q2 financial results. The company's EBITDA increased to 322 million rupees from 254 million rupees year-over-year. However, the EBITDA margin decreased to 11.34% from 12.08% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731573459000,
            "Source": "result"
        },
        {
            "Title": "Sterling Tools Reports Q2 Revenue Growth",
            "Summary": "Sterling Tools has announced its Q2 revenue, which stands at 2.84 billion rupees, compared to 2.1 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731573448000,
            "Source": "result"
        },
        {
            "Title": "Sterling Tools Reports Q2 Profit Increase",
            "Summary": "Sterling Tools has reported a consolidated net profit of 175 million rupees for the second quarter, up from 125 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731573407000,
            "Source": "result"
        },
        {
            "Title": "Sterling Tools Partners for Local Manufacturing of EV Components",
            "Summary": "Sterling Tools has announced a partnership to localize the manufacturing of high voltage direct current contactors and relays. This move is likely aimed at strengthening the company's position in the electric vehicle (EV) component market.",
            "Sentiment": "positive",
            "PublishDate": 1730874039000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling Tools Partners with China's GLVAC for EV Component Manufacturing",
            "Summary": "Sterling Tools has entered into a partnership with China's GLVAC to manufacture advanced high voltage DC contactors and relays in India for electric and hybrid vehicles. The company aims to generate revenue of 250 crore rupees from this venture by the fiscal year 2030.",
            "Sentiment": "positive",
            "PublishDate": 1730873980000,
            "Source": "corporate_action"
        }
    ]
}