{
    "Symbol": "STLNETWORK",
    "ISIN": "INE1VXE01018",
    "News": [
        {
            "Title": "STL Networks Wins ₹206.49 Cr NIC Order",
            "Summary": "STL Networks Limited secures major purchase order worth ₹206.49 crore from National Informatics Centre Services Incorporated for network equipment procurement through NKN.",
            "Sentiment": "positive",
            "PublishDate": 1770742811771,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL Networks Q3FY26 Revenue Jumps 14.6% to ₹304.76 Cr",
            "Summary": "STL Networks reported Q3FY26 revenue of ₹304.76 crores, up 14.6% YoY, but posted net loss of ₹2.24 crores due to exceptional labour code impact of ₹4.96 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770126386491,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL Networks Secures ₹175 Cr NKN Equipment Order",
            "Summary": "STL Networks receives Letter of Intent worth ₹175 crore for supplying network equipment to National Knowledge Network, marking significant business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1770121712866,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL Networks Allots ₹100 Crore NCDs at 10.35% Coupon",
            "Summary": "STL Networks Limited successfully allotted 10,000 non-convertible debentures worth ₹100 crore on private placement basis with quarterly coupon payments at 10.35% interest rate.",
            "Sentiment": "positive",
            "PublishDate": 1769754624879,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL Networks Issues ₹150 Cr Second Tranche NCDs",
            "Summary": "STL Networks Limited announces issuance of second tranche of secured, redeemable non-convertible debentures worth up to ₹150 crores through private placement, to be listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769004154805,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL Networks Subsidiary Faces £83.5K Adjudication Loss",
            "Summary": "STL Networks' UK subsidiary STUKVL ordered to pay £83.5 thousand plus interest to All Fiber Solutions Limited following adjudicator's decision on unpaid dues under infrastructure framework agreement.",
            "Sentiment": "negative",
            "PublishDate": 1768482984944,
            "Source": "stocks"
        },
        {
            "Title": "STL Networks Grants 18.76 Lakh Stock Options Under Special Purpose ESOP Scheme 2025",
            "Summary": "STL Networks' Nomination and Remuneration Committee approved granting 18,76,412 stock options under its Special Purpose Employee Stock Option Scheme 2025 at face value of ₹2 per share. The scheme was formulated pursuant to a demerger arrangement with Sterlite Technologies Limited to restore value for eligible employees by providing equivalent options with similar terms and conditions.",
            "Sentiment": "positive",
            "PublishDate": 1764915793263,
            "Source": "corporate_action"
        },
        {
            "Title": "STL Networks Allots INR 150 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "STL Networks Limited allotted 15,000 non-convertible debentures worth INR 150 crore with a coupon rate of 10.25% per annum payable quarterly, maturing on September 02, 2027. The debentures are listed, rated, senior, secured and transferable, issued on private placement basis with first ranking pari passu charge created over certain company assets.",
            "Sentiment": "positive",
            "PublishDate": 1764660585545,
            "Source": "corporate_action"
        },
        {
            "Title": "STL Networks Approves ₹300 Crore NCD Issuance on Private Placement Basis",
            "Summary": "STL Networks Limited's Authorization and Allotment Committee approved raising funds through issuance of listed, secured, redeemable, non-convertible debentures worth up to ₹300 crores via private placement in one or more tranches. The decision affects the company's capital structure and provides access to debt funding for business operations and growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763467317551,
            "Source": "corporate_action"
        },
        {
            "Title": "STL Networks Head-Legal Manish Ranjan Resigns Due to Personal Reasons",
            "Summary": "Manish Ranjan, Head-Legal and Senior Management Personnel at STL Networks Limited, tendered his resignation on November 17, 2025, citing personal reasons. His last working day will be March 17, 2026, marking the departure of a key senior management position at the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763400025743,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Ratings Assigns INDA-/Stable Rating to STL Networks' Proposed NCDs",
            "Summary": "India Ratings assigned INDA-/Stable rating to STL Networks' proposed non-convertible debentures and affirmed bank loan facilities rating, citing robust business profile and strong order book of over INR 65 billion. The rating reflects expected healthy revenue growth over 2HFY26-FY27 but remains constrained by modest credit metrics, elongated working capital cycle, and working capital lockup in disputed projects.",
            "Sentiment": "neutral",
            "PublishDate": 1763386665708,
            "Source": "corporate_action"
        },
        {
            "Title": "STL Networks Seeks Shareholder Approval to Modify Employee Stock Option Scheme Vesting Conditions",
            "Summary": "STL Networks Limited is conducting a postal ballot through remote e-voting from November 14 to December 13, 2025, to amend its Employee Stock Option Scheme 2025 vesting conditions. The proposed modification changes the vesting structure from 25% based on continued employment and 75% on corporate performance to 70% based on continued employment and 30% on corporate performance for 1.95 crore ungranted stock options.",
            "Sentiment": "neutral",
            "PublishDate": 1763091579892,
            "Source": "corporate_action"
        },
        {
            "Title": "STL Networks Committee to Consider ₹300 Crore NCD Fundraising",
            "Summary": "STL Networks Limited has scheduled an Authorization and Allotment Committee meeting for November 18, 2025, to consider raising funds through issuance of non-convertible debentures up to ₹300 crores on private placement basis. The fundraising will be conducted in one or more tranches, with exact terms and conditions to be disclosed after committee approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763058561710,
            "Source": "corporate_action"
        },
        {
            "Title": "STL Networks Reports Q2 Net Loss of 193M Rupees, Revenue Drops to 2.31B Rupees",
            "Summary": "STL Networks reported a net loss of 193 million rupees in Q2 compared to a profit of 50.5 million rupees in the same period last year. Revenue declined to 2.31 billion rupees from 3.56 billion rupees year-over-year. EBITDA fell to 64.4 million rupees from 256.2 million rupees, while EBITDA margin compressed to 2.79% from 7.19% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762533747171,
            "Source": "earnings"
        },
        {
            "Title": "STL Networks Secures ₹359 Crore Data Center Contract from PowerGrid Teleservices",
            "Summary": "STL Networks Limited has secured a contract worth over ₹360 crore from PowerGrid Teleservices Limited, a wholly owned subsidiary of Power Grid Corporation of India Limited. Under the agreement, Invenia will design, build, commission, and maintain complete IT and cloud infrastructure for a greenfield Tier III data center at PowerGrid's Manesar facility. The project includes establishing a Disaster Recovery Data Center and delivering Infrastructure as a Service solution with Disaster Recovery Services. The comprehensive project also encompasses Operation & Maintenance services to ensure long-term performance. The data centers will integrate advanced cooling systems and energy-efficient designs aligned with India's digital and sustainability vision.",
            "Sentiment": "positive",
            "PublishDate": 1757911563921,
            "Source": "order&deals"
        }
    ]
}