{
    "Symbol": "STLTECH",
    "ISIN": "INE089C01029",
    "News": [
        {
            "Title": "Sterlite Technologies Board Meet on Feb 7 for Fund Raising",
            "Summary": "Sterlite Technologies has scheduled a board meeting on February 7, 2026, to consider raising funds through equity shares, warrants, or convertible securities via preferential issue to promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1770208411717,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterlite Technologies clarifies price movement",
            "Summary": "Sterlite Technologies responds to BSE inquiry on significant share price movement, confirms no unpublished price sensitive information pending disclosure under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770096049929,
            "Source": "stocks"
        },
        {
            "Title": "STL Seeks Shareholder Approval for Director Appointments",
            "Summary": "Sterlite Technologies Limited has issued a postal ballot notice seeking member approval for re-appointment of Mr. Bangalore Jayaram Arun and appointment of Mr. Sathia Jeeva Krishnan Chidambara as Independent Directors through e-voting from January 30 to February 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769604271024,
            "Source": "stocks"
        },
        {
            "Title": "Sterlite Technologies Q3 Revenue Jumps 26.3% YoY",
            "Summary": "Sterlite Technologies reported strong Q3 performance with revenue rising to ₹12.60 billion from ₹9.98 billion in the previous year, marking significant growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1769162707535,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL completes successful MCF trials with Colt in UK",
            "Summary": "Sterlite Technologies successfully collaborated with Colt Technology Services for Multi-Core Fibre trials across London's metro optical network, achieving 800 Gbps line rate and validating next-gen connectivity solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769087734587,
            "Source": "stocks"
        },
        {
            "Title": "Sterlite Technologies Board Approves Director Changes",
            "Summary": "Sterlite Technologies board re-appoints B J Arun as Independent Director for 5 years and appoints S K Chidambara as new Independent Director for 2 years. S Madhavan to step down after tenure completion.",
            "Sentiment": "neutral",
            "PublishDate": 1768388892823,
            "Source": "stocks"
        },
        {
            "Title": "Sterlite Technologies Board Approves Director Changes",
            "Summary": "Sterlite Technologies board re-appoints B J Arun as Independent Director for 5 years and appoints S K Chidambara as new Independent Director for 2 years, while S Madhavan completes his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1768388375304,
            "Source": "stocks"
        },
        {
            "Title": "Sterlite Technologies Board Approves Key Changes",
            "Summary": "Sterlite Technologies' board approved re-appointment of B.J. Arun as Independent Director for 5 years and appointed S.K. Chidambara as new Independent Director for 2 years, while S. Madhavan's tenure concludes.",
            "Sentiment": "neutral",
            "PublishDate": 1768387769668,
            "Source": "stocks"
        },
        {
            "Title": "Sterlite Technologies Grants 24,621 Stock Options",
            "Summary": "Sterlite Technologies Limited granted 24,621 stock options to eligible employees under ESOP 2016 scheme at exercise price of ₹2 per option, with 3-year vesting period and 5-year exercise window.",
            "Sentiment": "positive",
            "PublishDate": 1768379359566,
            "Source": "stocks"
        },
        {
            "Title": "STL schedules Q3FY26 earnings call for Jan 23, 2026",
            "Summary": "Sterlite Technologies Limited announces earnings call on January 23, 2026 at 4:30 PM IST to discuss Q3FY26 financial results and performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768307806104,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterlite Technologies Board Meet Set for Jan 23",
            "Summary": "Sterlite Technologies has scheduled its board meeting for January 23, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until January 25, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768307040869,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL Allots 24,600 Shares Under ESOP Scheme",
            "Summary": "Sterlite Technologies Limited allotted 24,600 equity shares to employees under its ESOP schemes, increasing total share capital to 488,104,085 shares on January 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767972542112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterlite Technologies Gets Credit Rating Reaffirmation",
            "Summary": "CRISIL removes 'Watch Negative' status and reaffirms Sterlite Technologies' credit ratings across bank facilities worth ₹4,045 crores and debt instruments, while reducing total rated facilities from ₹5,767 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767869944719,
            "Source": "stocks"
        },
        {
            "Title": "STL Receives ₹36.83 Cr Income Tax Demand Order",
            "Summary": "Sterlite Technologies receives income tax demand order worth ₹36.83 crores from Assessment Unit related to transfer pricing adjustments on intra-group services and plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767285672687,
            "Source": "stocks"
        },
        {
            "Title": "Sterlite Tech Subsidiary Gets Credit Rating Affirmed",
            "Summary": "India Ratings affirms IND AA-/Stable rating for Sterlite Tech Cables Solutions' ₹3,080 million bank loan facilities, reduced from previous ₹3,380 million limit.",
            "Sentiment": "positive",
            "PublishDate": 1766829084739,
            "Source": "stocks"
        },
        {
            "Title": "STL Faces Mixed Patent Ruling in UK Court Against Fujikura",
            "Summary": "Sterlite Technologies Limited received a split judgment from the UK High Court in a patent infringement case filed by Fujikura Ltd, with the court ruling that STL's ultra-high-fibre-count cables do not infringe while low-fibre-count cables are infringing. The financial impact remains unascertainable as STL plans to file an appeal against the ruling.",
            "Sentiment": "negative",
            "PublishDate": 1764932933075,
            "Source": "stock"
        },
        {
            "Title": "Sterlite Technologies Allots 60,865 Shares Under Employee Stock Option Scheme",
            "Summary": "Sterlite Technologies' Authorization and Allotment Committee allotted 60,865 equity shares to employees who exercised options under the company's ESOP schemes from 2010 and 2016. The allotment increases the company's total share capital from 488,018,620 shares to 488,079,485 shares, with new shares ranking equally with existing shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763555300243,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Reaffirms Credit Ratings for Sterlite Technologies' Rs 4,975 Crore Bank Facilities",
            "Summary": "ICRA has reaffirmed credit ratings for Sterlite Technologies Limited across multiple facilities totaling Rs 4,975 crores and 425.15 million euros. The ratings include ICRA [AA-] (stable) for long-term fund-based facilities of Rs 913 crores working capital, Rs 95 crores term loan, and 25.15 million euros term loan. Short-term non-fund based facilities of Rs 3,433 crores received ICRA [A1+] rating. Unallocated facilities of Rs 16 crores were rated ICRA [AA-] (Stable)/ICRA [A1+], while commercial paper facilities of Rs 500 crores received ICRA [A1+] rating. All ratings were reaffirmed with stable outlook.",
            "Sentiment": "positive",
            "PublishDate": 1763011879787,
            "Source": "stock"
        },
        {
            "Title": "Sterlite Tech Reports Q2 Net Profit of 40M Rupees, Reversing Previous Year Loss",
            "Summary": "Sterlite Tech reported a consolidated net profit of 40 million rupees in Q2, compared to a loss of 140 million rupees in the same period last year. The company's revenue declined to 10.3 billion rupees from 14 billion rupees year-over-year. However, EBITDA improved to 1.41 billion rupees from 1.19 billion rupees, with EBITDA margin expanding to 13.6% from 11.1% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762421057672,
            "Source": "earnings"
        },
        {
            "Title": "Sterlite Technologies Partners With Qnu Labs for Quantum Communications Research",
            "Summary": "Sterlite Technologies has entered into an agreement with Qnu Labs to enhance research in quantum communications using optical fiber technology. The partnership aims to improve research and development capabilities and develop scalable quantum-secure networks.",
            "Sentiment": "positive",
            "PublishDate": 1759997779169,
            "Source": "order&deals"
        },
        {
            "Title": "STL Expands Partnership with UK's Netomnia for Full-Fibre Network Rollout",
            "Summary": "Sterlite Technologies Limited (STL) has expanded its partnership with Netomnia, the UK's second-largest alternative network provider. Under the multi-year agreement, STL will provide end-to-end fiber-to-the-home (FTTH) connectivity solutions, including optical fiber cables and connectivity solutions for faster network rollouts. Netomnia is deploying a native 10 Gbps XGS-PON full-fibre network and currently serves 2.8 million premises serviceable with approximately 400,000 connected premises. The company maintains an annual build rate of one million premises and targets three million premises serviceable by end of 2025, expanding to five million by end of 2027. STL's optical fiber cable solutions offer approximately 20% average area reduction, improving duct utilization and reducing material consumption and carbon footprint. Netomnia has over £1.6 billion in funding to support its rollout plans.",
            "Sentiment": "positive",
            "PublishDate": 1758774656084,
            "Source": "stock"
        },
        {
            "Title": "STL Showcases Advanced Multi-Core Fiber Indoor Cable at Connected Britain 2025",
            "Summary": "Sterlite Technologies Limited (STL) showcased its Unitube Single Jacket Indoor Fibre Optic Cable with 4-core Multi-Core Fiber (MCF) technology at Connected Britain 2025. The cable packs 4 cores into the same cladding diameter as standard single-mode fiber while maintaining coating size at 250/200 micrometers. STL is among the first companies to demonstrate real-world MCF deployments across underground and duct networks. The cable is certified under Construction Products Regulation (CPR) EuroClass Cca-s2, d1, a1 for fire resistance, making it suitable for data centers, campus networks, and commercial buildings. The technology offers enhanced security through Quantum Key Distribution, supports next-generation applications with 4× throughput potential, and provides compact efficiency by multiplying fiber count while maintaining smaller diameter. STL's CTO Dr. Badri Gomatam highlighted the company's role in accelerating advanced optical technology adoption through continuous innovation and global partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1758713762467,
            "Source": "stock"
        },
        {
            "Title": "Sterlite Tech Subsidiary Launches Ultra-Thin 864F IBR Cable for U.S. Hyperscalers",
            "Summary": "Sterlite Tech's subsidiary has introduced what it claims is the thinnest IBR cable with 864 fibers, specifically designed for hyperscalers in the U.S. market. The new cable product targets the hyperscale data center segment.",
            "Sentiment": "positive",
            "PublishDate": 1756989374815,
            "Source": "stock"
        },
        {
            "Title": "Sterlite Tech Shares Drop 7% After US Jury Orders $96.5 Million Penalty for Trade Secret Misuse",
            "Summary": "Sterlite Technologies shares fell 7% following a US jury ruling that ordered the company's US subsidiary to pay $96.5 million (₹810 crore) in damages to Italian rival Prysmian for misusing trade secrets. The case involved Stephen Szymanski, a Prysmian executive, who allegedly breached non-compete and confidentiality agreements by sharing Prysmian's confidential information with Sterlite, providing an unfair advantage. The penalty represents 15.5% of Sterlite Tech's market capitalization of over ₹5,200 crore. Sterlite plans to file an appeal and will assess financial implications upon final resolution. Shares traded 6.4% lower at ₹107.45 and are down similarly on a year-to-date basis.",
            "Sentiment": "negative",
            "PublishDate": 1756700987792,
            "Source": "stock"
        },
        {
            "Title": "Sterlite Technologies' US Subsidiary Faces $96.5 Million Jury Decision Against Prysmian",
            "Summary": "Sterlite Technologies' US subsidiary received an adverse jury decision of $96.5 million in a legal case against Prysmian. The company plans to appeal the decision and states that the matter remains open in court.",
            "Sentiment": "negative",
            "PublishDate": 1756475750625,
            "Source": "stock"
        },
        {
            "Title": "STL Appoints Senior Executives in US and Europe to Drive Growth",
            "Summary": "STL announced the appointment of three senior executives to strengthen its leadership team in the US and Europe regions. The company hired Jimi Barker as Chief Business Officer for Data Centres, Tom Boswell as Head of Presales for Europe/UK Optical Connectivity Business, and Amir Sekhawat as Business Head of Copper Business. Jimi brings expertise in telecommunications and data infrastructure industries with U.S. Military experience. Tom has 30 years of experience at British Telecom/Openreach with expertise in access, carrier networks, and physical infrastructure. Amir has over twenty years of global experience in copper and fibre communication solutions, having worked with Superior Essex in the US and Nexans in Europe. CEO Rahul Puri stated these appointments mark a pivotal moment for STL's Optical Business and will accelerate innovation and growth while delivering transformative solutions to customers in these key markets.",
            "Sentiment": "positive",
            "PublishDate": 1754969436874,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sterlite Technologies Reports Strong Q1 FY26 Results with 17% Revenue Growth and Improved Margins",
            "Summary": "Sterlite Technologies Limited posted revenue of Rs.1,019 crores in Q1 FY26, marking 17% year-on-year growth. EBITDA improved to Rs.140 crores with margins expanding to 13.7%, while the company achieved PAT of Rs.10 crores compared to a loss of Rs.48 crores in Q1 FY25. The optical networking business generated Rs.961 crores revenue with 14.3% EBITDA margin. Order intake surged nearly 3x to Rs.1,529 crores from Rs.566 crores in Q1 FY25, including a three-year contract with a European telecom operator and strong inflows from North American operators. The company's open order book rose to Rs.4,888 crores. STL Digital business posted Rs.64 crores revenue with Rs.1 crore EBITDA and added four new marquee clients. The company launched new data center portfolio and India's first multi-core fiber. Net debt stands at Rs.1,300 crores with debt-to-equity ratio of 0.64x. Management expects continued improvement in capacity utilization and margins as market recovery gains momentum, particularly in North America and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1753944935816,
            "Source": "earnings"
        },
        {
            "Title": "Sterlite Technologies Targets 18-20% EBITDA Margin by FY26 Through Higher Capacity Utilization",
            "Summary": "Sterlite Technologies aims to achieve an EBITDA margin of 18-20% in FY26, up from the current 13-14%, by increasing factory utilization from 45-50% to over 70% by the third or fourth quarter. Managing Director Ankit Agarwal noted that the company previously achieved similar margins when operating at 70% utilization. The optical fiber and connectivity solutions provider is enhancing its connectivity solutions business, targeting to increase its attach rate from 20-22% to higher levels. The company has identified data centers as a key growth area, with India's data center capacity expected to triple from one gigawatt to three gigawatts by 2030. While the US and Europe remain primary markets, India offers growth potential through BharatNet Phase 3, though it represents less than 5% of the global optical fiber market. Sterlite Technologies is working to reduce its net debt-to-EBITDA ratio to two times by year-end and is exploring potential partnerships with Starlink for connectivity requirements. Shares traded 0.84% higher at Rs 127.95.",
            "Sentiment": "positive",
            "PublishDate": 1753836590536,
            "Source": "stock"
        },
        {
            "Title": "Sterlite Tech Expects Improved Margins and Lower Debt Ratios in Coming Quarters",
            "Summary": "Sterlite Tech anticipates better utilization and margins in the upcoming quarter. The company aims to maintain employee costs at 10-12% of annual revenue and targets lowering its debt/EBITDA ratio below 2X. Finance costs are expected to drop by approximately 5-6%. The company declined to provide specific revenue or utilization targets, citing competitive sensitivity concerns.",
            "Sentiment": "positive",
            "PublishDate": 1753672994287,
            "Source": "stock"
        },
        {
            "Title": "Sterlite Technologies Reports Strong Q1 FY26 Results with 17% Revenue Growth and Key Leadership Appointments",
            "Summary": "Sterlite Technologies Limited announced its quarterly results for the period ended June 30, 2025, reporting revenue of INR 1,019 crores (17% YoY growth) and EBITDA of INR 140 crores (94% YoY growth). The company secured order intake of INR 1,529 crores and maintains an open order book of INR 4,888 crores. The Optical Networking Business achieved 18.6% revenue growth and 55.7% EBITDA growth compared to the same period last year. STL Digital acquired 4 new customers, bringing total count to 30 global customers, and signed multi-million contracts with healthcare providers. The company appointed Ajay Jhanjhari as permanent CFO, Naveen Bolalingappa as permanent CEO for Digital Business Unit, and Saumya Mondal as Interim Chief Human Resource Officer, all effective July 25, 2025. STL also launched India's first Multi-Core Fiber technology and expanded its AI-led Data Centre portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1753437982877,
            "Source": "earnings"
        },
        {
            "Title": "Sterlite Tech Reports Strong Q1 Performance with Revenue Growth and Return to Profitability",
            "Summary": "Sterlite Tech delivered strong quarterly results with revenue increasing to 10.2 billion rupees from 8.7 billion rupees year-over-year. The company returned to profitability with a consolidated net profit of 100 million rupees, compared to a loss of 480 million rupees in the same period last year. EBITDA nearly doubled to 1.4 billion rupees from 720 million rupees year-over-year, while EBITDA margin expanded significantly to 13.74% from 8.26%.",
            "Sentiment": "positive",
            "PublishDate": 1753437530819,
            "Source": "earnings"
        },
        {
            "Title": "Sterlite Technologies: Partners with Hygenco for Green Hydrogen Facility",
            "Summary": "Sterlite Technologies collaborates with Hygenco to establish Maharashtra's first green hydrogen production facility for optical fibre manufacturing. The facility will supply green hydrogen and oxygen to Sterlite's glass preform facility in Chhatrapati Sambhaji Nagar. This initiative aims to make Sterlite one of the world's first optical fibre manufacturers to use 100% green hydrogen in production, supporting its 2030 net-zero goal. Hygenco will build, own, and operate the facility for 20 years.",
            "Sentiment": "positive",
            "PublishDate": 1752734814000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterlite Tech Advances Sustainable Optical Fiber Production",
            "Summary": "Sterlite Tech has made progress in sustainable optical fiber production by using green hydrogen. The company is implementing environmentally friendly practices in its manufacturing process, focusing on reducing carbon emissions in the optical fiber industry.",
            "Sentiment": "positive",
            "PublishDate": 1752728798000,
            "Source": "default"
        },
        {
            "Title": "Sterlite Tech Wins Legal Case, Receives 90.6 Million Rupees",
            "Summary": "Sterlite Tech has won a legal case resulting in a payment of 90.6 million rupees. The company successfully resolved a legal dispute in its favor, leading to this financial outcome.",
            "Sentiment": "positive",
            "PublishDate": 1750768410000,
            "Source": "default"
        },
        {
            "Title": "Sterlite Technologies: Share Price Surges 9% on AI-Driven Data Centre Solutions",
            "Summary": "Sterlite Technologies' stock rose over 9% after a brief dip, reaching a 19-month high. The company recently launched AI-driven data centre solutions, ranging from cabling to end-to-end connectivity offerings. This new product line is designed to meet the demands of hyperscalers, colocation players, enterprises, and telecom service providers.",
            "Sentiment": "positive",
            "PublishDate": 1750307666000,
            "Source": "normal_news"
        },
        {
            "Title": "Sterlite Technologies Ltd: Shares Surge 35% on Data Centre Expansion for AI Demand",
            "Summary": "Sterlite Technologies' stock rose 35% in two days after announcing expansion of data centre solutions to meet AI infrastructure demand. The company launched new cabling and connectivity solutions for various sectors, expecting the global data centre market to reach $517 billion by 2030. Sterlite also partnered with Tech Data – India for distribution and secured a Rs 2,631 crore order from BSNL for a BharatNet project.",
            "Sentiment": "positive",
            "PublishDate": 1750138457000,
            "Source": "normal_news"
        },
        {
            "Title": "Sterlite Technologies Ltd: Shares Surge on AI Data Centre Solutions Launch",
            "Summary": "Sterlite Tech shares rose 10% after announcing expansion of its Data Centre portfolio with new AI-focused solutions. The company launched high-performance fibre and copper cabling solutions for modern data centres, partnering with Tech Data - India for distribution. This follows a recent ₹2,631 crore order from BSNL for broadband network development in Jammu & Kashmir and Ladakh.",
            "Sentiment": "positive",
            "PublishDate": 1750049837000,
            "Source": "normal_news"
        },
        {
            "Title": "Sterlite Technologies Expands Data Centre Portfolio for AI Demand",
            "Summary": "Sterlite Technologies is expanding its data centre portfolio to meet the growing needs of AI data centres. The company is enhancing its capabilities to address the increasing demand in this sector.",
            "Sentiment": "positive",
            "PublishDate": 1750043705000,
            "Source": "default"
        },
        {
            "Title": "Sterlite Technologies: Shares Surge on Rs 2,631-Crore BSNL Contract",
            "Summary": "Sterlite Technologies Ltd. shares hit a six-month high, rising over 15% after winning a Rs 2,631-crore contract from BSNL. The project involves designing and maintaining a middle-mile network for BharatNet in Jammu and Kashmir, and Ladakh Telecom Circles over a 13-year period.",
            "Sentiment": "positive",
            "PublishDate": 1749708153000,
            "Source": "order&deals"
        },
        {
            "Title": "Sterlite Technologies Secures 26.31 Billion Rupee Network Project from BSNL",
            "Summary": "Sterlite Technologies has entered into an agreement with BSNL (Bharat Sanchar Nigam Limited) for a network project. The project is valued at 26.31 billion rupees, including GST.",
            "Sentiment": "positive",
            "PublishDate": 1749687223000,
            "Source": "default"
        },
        {
            "Title": "Sterlite Technologies: Secures ₹2,631 Crore BSNL Contract for J&K, Ladakh Project",
            "Summary": "Sterlite Technologies, partnering with Dilip Buildcon, has signed a ₹2,631.14 crore contract with BSNL for the BharatNet middle-mile network in Jammu & Kashmir and Ladakh. The project includes a 3-year construction phase and 10-year maintenance period, aiming to improve digital connectivity in remote areas.",
            "Sentiment": "positive",
            "PublishDate": 1749647279000,
            "Source": "order&deals"
        },
        {
            "Title": "Sterlite Technologies Secures ₹26.31 Billion Agreement with BSNL",
            "Summary": "Sterlite Technologies has entered into an agreement with BSNL for a network project. The deal is valued at ₹26.31 billion, including GST. The project details and specific scope were not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749642357000,
            "Source": "default"
        },
        {
            "Title": "Sterlite Technologies Ltd: Q4 Loss Narrows, Revenue Surges 25%",
            "Summary": "Sterlite Technologies Ltd reported a narrowed net loss of ₹40 crore in Q4FY25, down from ₹82 crore last year. Revenue increased 25% YoY to ₹1,052 crore. EBITDA rose to ₹146 crore with margins improving to 13.9%. The company completed the demerger of its Global Services Business and saw improvements in its Digital segment. Net debt-to-equity ratio improved to 0.68.",
            "Sentiment": "positive",
            "PublishDate": 1747394590000,
            "Source": "earnings"
        },
        {
            "Title": "Sterlite Tech Reports Q4 Financial Results",
            "Summary": "Sterlite Tech announced its Q4 financial results. EBITDA increased to 1.46 billion rupees from 440 million rupees year-over-year, with EBITDA margin rising to 13.9% from 5.2%. Revenue decreased to 10.52 billion rupees from 11.4 billion rupees year-over-year. The company reported a consolidated net loss of 400 million rupees, an improvement from the 820 million rupees loss in the same quarter last year. Sterlite Tech also stated that the global services demerger has been completed, with listing expected in Q1 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1747388922000,
            "Source": "result"
        },
        {
            "Title": "Sterlite Technologies and C-DOT Achieve Quantum-Secured Network Breakthrough",
            "Summary": "Sterlite Technologies and the Centre for Development of Telematics (C-DOT) have successfully implemented India's first quantum-secured network using multi-core fibre technology. This breakthrough represents a significant advancement in secure communication infrastructure for the country.",
            "Sentiment": "positive",
            "PublishDate": 1746518308000,
            "Source": "default"
        },
        {
            "Title": "Sterlite Technologies Partners with Swoop Holdings for FTTH Upgrade in Western Australia",
            "Summary": "Sterlite Technologies has announced a successful partnership with Swoop Holdings Limited to upgrade 1,000 homes in Western Australia with high-speed Fibre-to-the-Home (FTTH) connectivity. This collaboration aims to improve internet infrastructure and provide faster internet speeds to residents in the region.",
            "Sentiment": "positive",
            "PublishDate": 1744168418000,
            "Source": "order&deals"
        },
        {
            "Title": "Sterlite Technologies Completes Demerger of Global Services Business",
            "Summary": "Sterlite Technologies has successfully completed the demerger of its global services business. This strategic move aims to drive growth for two separate business entities. The newly demerged entity will be named STL Networks and will operate under the brand name 'Invenia'.",
            "Sentiment": "positive",
            "PublishDate": 1743477807000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterlite Technologies Secures Major Contract from BSNL",
            "Summary": "Sterlite Technologies, in consortium with Dilip Buildcon, has been awarded a work order worth ₹2,631.14 crore from BSNL. The project comprises a CAPEX component of ₹1,620.50 crore and an OPEX component of ₹1,010.63 crore.",
            "Sentiment": "positive",
            "PublishDate": 1743128746000,
            "Source": "order&deals"
        },
        {
            "Title": "Sterlite Technologies Partners with Wyre for FTTH Network Development",
            "Summary": "Sterlite Technologies (STL) has announced a successful partnership with Wyre to support the development of their multigigabit Fibre-to-the-Home (FTTH) network. As part of this collaboration, STL will supply high-performance optical cables and advanced solutions to Wyre for their expansive network infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1743034343000,
            "Source": "order&deals"
        },
        {
            "Title": "Sterlite Technologies Partners with Wyre for FTTH Network Development",
            "Summary": "Sterlite Technologies (STL) has announced a successful partnership with Wyre to support the development of their multigigabit Fibre-to-the-Home (FTTH) network. As part of this collaboration, STL will supply high-performance optical cables and advanced solutions to Wyre for their expansive network infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1743001392000,
            "Source": "order&deals"
        }
    ]
}