{
    "Symbol": "STOVEKRAFT",
    "ISIN": "INE00IN01015",
    "News": [
        {
            "Title": "Stove Kraft Targets Debt-Free Status by Year-End",
            "Summary": "Stove Kraft aims to become cash debt-free by year-end with bank loans nearing zero and current debt under Rs. 30 crore. Company anticipates growth in cooktop sector post-September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770002685172,
            "Source": "stocks"
        },
        {
            "Title": "Stove Kraft Sets Ambitious Margin Targets",
            "Summary": "Stove Kraft targets 39% gross margin this quarter with plans to reach 41-42% in three years while improving EBITDA margins by 1% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1770002653773,
            "Source": "stocks"
        },
        {
            "Title": "Stove Kraft Eyes IKEA Export Revenue Growth in FY27",
            "Summary": "Stove Kraft anticipates significant revenue from IKEA exports starting FY27, with sales commencing this quarter and overall export growth expected if tariffs remain stable.",
            "Sentiment": "positive",
            "PublishDate": 1770002624463,
            "Source": "stocks"
        },
        {
            "Title": "Stove Kraft Q3FY26 Profit Drops 66% to ₹41.46 Million",
            "Summary": "Stove Kraft Limited reported a 66% decline in Q3FY26 net profit to ₹41.46 million compared to ₹121.39 million in Q3FY25, despite revenue declining 6.4% to ₹3,783.74 million.",
            "Sentiment": "negative",
            "PublishDate": 1769871175438,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stove Kraft Board Meet on Jan 31 for Q3FY26 Results",
            "Summary": "Stove Kraft Limited has scheduled a board meeting on January 31, 2026, to consider and approve standalone unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768385530622,
            "Source": "co_actions_results"
        },
        {
            "Title": "StoveKraft Credit Rating Revised by ICRA",
            "Summary": "ICRA has revised StoveKraft's long-term credit rating to [ICRA]A (Stable) from [ICRA]A- (Positive) and short-term rating to [ICRA]A1 from [ICRA]A2, reflecting improved creditworthiness.",
            "Sentiment": "positive",
            "PublishDate": 1766061302547,
            "Source": "stocks"
        },
        {
            "Title": "StoveKraft Allots 5,821 Equity Shares Under Employee Stock Option Plan",
            "Summary": "StoveKraft's Nomination and Remuneration Committee allotted 5,821 equity shares of Rs. 10 each to eligible employees under the StoveKraft Employee Stock Option Plan 2018. The allotment increased the company's paid-up capital from Rs. 33,10,15,000 to Rs. 33,10,73,210, with total equity shares rising to 3,31,07,321.",
            "Sentiment": "neutral",
            "PublishDate": 1763442110112,
            "Source": "corporate_action"
        },
        {
            "Title": "StoveKraft Reports 13.4% Revenue Growth in Q2 FY26, Expands to 300 Exclusive Stores",
            "Summary": "StoveKraft Limited reported consolidated revenue of Rs. 474.4 crores for Q2 FY26, marking 13.4% year-on-year growth from Rs. 418.3 crores. The company achieved gross margins of 38.5% and EBITDA margins of 12%, with profit after tax growing 27.8% year-on-year. For H1 FY26, revenue stood at Rs. 814.5 crores versus Rs. 732.8 crores in the previous year, representing 11.2% growth. The company reached a milestone of 300 standalone Pigeon exclusive outlets across 120 cities and 21 states, adding 16 new stores during the quarter. Channel mix in Q2 comprised 41% e-commerce, 26% general trade, 14% modern trade, 11% OEM exports, 6% own retail, and 3% corporate/institutional sales. StoveKraft benefited from GST rate reduction from 12% to 5% on approximately 35% of its business, particularly pressure cookers and cookware. The company targets expanding to 500 standalone stores by 2027 and expects to become debt-free within four quarters. Export business grew 25% in Q2 and 19% in H1, with IKEA partnership starting FY26 for ceramic cookware replacing PTFE non-stick products.",
            "Sentiment": "positive",
            "PublishDate": 1762891916810,
            "Source": "earnings"
        },
        {
            "Title": "Stove Kraft Sets Growth Targets with 500 Stores by 2027 and Margin Improvement Plans",
            "Summary": "Stove Kraft announced guidance to improve EBITDA margins by 1% over the previous year. The company expects gross margins to reach around 39% for the second half of FY26, with aspirations to achieve 40% in the near term. For retail expansion, Stove Kraft aims to operate 500 stores by 2027 with a revenue target of INR 300 crores. Management expects H2 FY26 revenue to be close to H1 levels, with potential variation of INR 25-30 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762401199297,
            "Source": "stock"
        },
        {
            "Title": "StoveKraft Chief Revenue Officer Rohit Mago Resigns Due to Personal Reasons",
            "Summary": "StoveKraft Limited announced the resignation of Rohit Mago from his position as Chief Revenue Officer, effective November 5, 2025. Mago cited personal reasons for his departure after serving the organization for 7 years in different roles. The company has notified stock exchanges BSE and NSE about this senior management personnel change. In his resignation letter, Mago expressed gratitude for his experience at the company and indicated his willingness to support the organization when needed in the future.",
            "Sentiment": "neutral",
            "PublishDate": 1762343279454,
            "Source": "corporate_governance"
        },
        {
            "Title": "Stove Kraft Targets 13% Revenue Growth Through Distribution Expansion and Premium Products",
            "Summary": "Stove Kraft has provided guidance for robust revenue growth of approximately 13% year-on-year. The company plans to achieve this through distribution expansion across 21 states, launching premium products, and improving operational efficiency. The company is targeting improved return on capital employed (ROCE) and aims to maintain stable gross margins above 38%.",
            "Sentiment": "positive",
            "PublishDate": 1762181781466,
            "Source": "stock"
        },
        {
            "Title": "Stove Kraft Reports Revenue Growth to Rs 4.7 Billion in Q2",
            "Summary": "Stove Kraft reported quarterly revenue of Rs 4.7 billion compared to Rs 4.2 billion in the same period last year. The company's EBITDA increased to Rs 533 million from Rs 464 million year-on-year, with EBITDA margin improving to 11.25% from 11.09%. Net profit rose to Rs 214 million versus Rs 167 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762159161902,
            "Source": "earnings"
        },
        {
            "Title": "Stove Kraft Schedules Earnings Call for Q2 & H1 FY26 Results",
            "Summary": "Stove Kraft Limited announced a conference call with analysts and institutional investors scheduled for November 4, 2025, at 3:00 PM IST. The call, organized by MUFG Intime, will discuss the company's standalone unaudited financial results for the quarter and half year ended September 30, 2025. Key participants include Managing Director Rajendra Gandhi, CFO Ramakrishna Pendyala, and VP Investor Relations Hemant Kumar Kothari. The company will submit an investor presentation to stock exchanges and host it on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1761632694265,
            "Source": "earnings"
        },
        {
            "Title": "Stove Kraft Targets 500 Exclusive Stores by 2027, Crosses 300-Store Milestone",
            "Summary": "Stove Kraft Limited announced plans to expand its retail footprint to 500 exclusive stores by April 2027, having recently crossed the 300-store milestone with its Pigeon brand outlets. The company expects standalone stores to contribute 15-20% of overall revenue over the next two years. The expansion will focus on North and West India, particularly Uttar Pradesh, Maharashtra, Madhya Pradesh, and Bihar. Stove Kraft operates through a franchise model offering rent-sharing arrangements and comprehensive support to partners. The company reported Q1 2025 revenue growth of 8.2% to ₹340 crores and expects 15% year-on-year growth over the next three years. Stove Kraft operates brands including Pigeon, Gilma, and BLACK+DECKER, with an annual turnover exceeding ₹1,450 crores and a distribution network of 600 distributors across over 125,000 retail touchpoints.",
            "Sentiment": "positive",
            "PublishDate": 1761194619706,
            "Source": "stock"
        },
        {
            "Title": "Stove Kraft Portfolio Positioned to Benefit from Potential GST Modifications",
            "Summary": "Stove Kraft has indicated that 35% of its product portfolio stands to gain from possible changes to GST regulations. The company appears positioned to capitalize on potential tax structure modifications that could impact its business segments.",
            "Sentiment": "positive",
            "PublishDate": 1755677722940,
            "Source": "stock"
        },
        {
            "Title": "Stove Kraft Reports 8.2% Revenue Growth in Q1 with Margin Expansion and Export Surge",
            "Summary": "Stove Kraft Limited reported revenue of Rs. 340.1 crore in Q1 FY'26, marking 8.2% year-over-year growth. The kitchen appliances manufacturer saw EBITDA margin improve to 10.5% and PAT margin reach 3.1%. Exports grew 14% year-over-year and now constitute 20% of total revenue. The company opened 19 new stores across 18 cities and expanded its retail presence to 110 cities across 19 states. Cast iron cookware generated Rs. 17.7 crore in revenue during the quarter. Management has guided for 12-15% overall revenue growth in FY'26, with domestic business expected to grow around 10% and exports up to 50%. The company started in-house manufacturing of kitchen chimneys and reduced raw material imports from China to 30%. Production for IKEA partnership is set to begin in December 2025, with the company targeting Rs. 200-300 crore revenue from this partnership over 2-3 years. The company aims to achieve 40% gross margin and become near debt-free by end of FY'26.",
            "Sentiment": "positive",
            "PublishDate": 1754922421932,
            "Source": "earnings"
        },
        {
            "Title": "Stove Kraft Expects Margin Growth in Coming Quarters",
            "Summary": "Stove Kraft anticipates margin growth in upcoming quarters, attributing the expected improvement to increasing operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754323844300,
            "Source": "stock"
        },
        {
            "Title": "Stove Kraft Reports Strong Q1 Growth with Revenue Rising to 3.4 Billion Rupees",
            "Summary": "Stove Kraft delivered solid quarterly results with revenue increasing to 3.4 billion rupees from 3 billion rupees in the same period last year. Net profit grew to 104 million rupees compared to 82 million rupees year-over-year. EBITDA rose to 370 million rupees from 320 million rupees, while EBITDA margin improved to 10.8% from 10.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754295211809,
            "Source": "earnings"
        },
        {
            "Title": "Stove Kraft: Share Price Surges 41% in Three Months Despite YTD Decline",
            "Summary": "Stove Kraft Ltd.'s share price has increased by over 41% in the last three months, despite a 32.27% year-to-date decline. Six analysts maintain a 'buy' rating on the stock. The company's revenue declined 3.8% year-on-year in January-September, while Q4 net profit slumped 45%. FY2025 saw a 6.3% revenue growth and 12.8% net profit increase. Small appliances were the main contributor to topline growth.",
            "Sentiment": "neutral",
            "PublishDate": 1751272228000,
            "Source": "normal_news"
        },
        {
            "Title": "Stove Kraft: Export Growth and Small Appliances to Drive FY26 Performance",
            "Summary": "Stove Kraft expects 55-60% growth in export revenue and continued strong performance in small appliances segment for FY26. The company aims to improve gross and EBITDA margins by 1 percentage point each. Deliveries to IKEA are set to begin from Q3, with potential for significant contribution by end of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747904625000,
            "Source": "earnings"
        },
        {
            "Title": "Stove Kraft Q4 Results and Dividend Announcement",
            "Summary": "Stove Kraft has reported its Q4 financial results. The company's EBITDA increased to 300 million rupees from 263 million rupees year-over-year, with EBITDA margin improving to 9.58% from 8.09%. Net profit decreased to 15 million rupees from 27 million rupees year-over-year, but increased from 121 million rupees quarter-on-quarter. Revenue for Q4 was 3.13 billion rupees, down from 3.25 billion rupees in the previous year. The company has also recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747829212000,
            "Source": "result"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Stove Kraft",
            "Summary": "Investor Dolly Khanna has increased her stake in Stove Kraft by 0.28% during the fourth quarter. Her total shareholding in the company now stands at 1.31%.",
            "Sentiment": "positive",
            "PublishDate": 1744788769000,
            "Source": "default"
        },
        {
            "Title": "Stove Kraft Reports Q3 Revenue Growth",
            "Summary": "Stove Kraft Limited has reported a revenue of 4 billion rupees for the third quarter, compared to 3.61 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738574118000,
            "Source": "earnings"
        },
        {
            "Title": "Stove Kraft Reports Significant Increase in Q3 Net Profit",
            "Summary": "Stove Kraft Limited has announced its financial results for the third quarter, reporting a net profit of 121 million rupees. This represents a substantial increase from the 68 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738574059000,
            "Source": "earnings"
        },
        {
            "Title": "Dolly Khanna Acquires 1.07% Stake in Stovekraft During Q3",
            "Summary": "Investor Dolly Khanna has acquired a 1.07% stake in Stovekraft, as revealed in the company's shareholding pattern for the third quarter.",
            "Sentiment": "positive",
            "PublishDate": 1736488183000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Stove Kraft Aims to Expand Global Presence",
            "Summary": "Stove Kraft has announced a strategic objective to expand its global footprint and strengthen its presence in international markets. This move indicates the company's ambition to grow beyond its current market boundaries and potentially increase its revenue streams from international operations.",
            "Sentiment": "positive",
            "PublishDate": 1734588527000,
            "Source": "corporate_action"
        },
        {
            "Title": "Stove Kraft Selected as IKEA Supply Partner",
            "Summary": "Stove Kraft Limited has been chosen by IKEA, the global retail chain, as a supply partner. This partnership suggests a significant business opportunity for Stove Kraft to provide products to IKEA's extensive international retail network.",
            "Sentiment": "positive",
            "PublishDate": 1734588507000,
            "Source": "corporate_action"
        },
        {
            "Title": "Stove Kraft Expands Cast Iron Foundry Capacity",
            "Summary": "Stove Kraft has commissioned a new cast iron foundry at its Harohalli factory. The company plans to increase the foundry's installed capacity to 4.4 million pieces per annum in the future.",
            "Sentiment": "positive",
            "PublishDate": 1732535802000,
            "Source": "corporate_action"
        },
        {
            "Title": "Stovekraft: Retail Sales to Boost Revenue Share to 10% in Coming Quarters",
            "Summary": "Stovekraft expects retail sales contribution to overall revenue to increase from 4% to 8-10% in the next 10 quarters. The company plans to add 100 new stores annually for the next three years, expanding its current 200-store network. Pigeon brand continues to drive growth, contributing 95% of revenue.",
            "Sentiment": "positive",
            "PublishDate": 1730257779000,
            "Source": "normal_news"
        },
        {
            "Title": "Stove Kraft Reports Improved Q2 EBITDA and Margin",
            "Summary": "Stove Kraft has announced its Q2 financial results. The company's EBITDA increased to 464 million rupees from 396 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 11.09% from 10.43% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730107388000,
            "Source": "result"
        },
        {
            "Title": "Stove Kraft Reports Q2 Revenue Growth",
            "Summary": "Stove Kraft, an Indian kitchenware and appliances company, has reported a revenue of 4.2 billion rupees for the second quarter, compared to 3.8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730107355000,
            "Source": "result"
        },
        {
            "Title": "Stove Kraft Reports Slight Increase in Q2 Net Profit",
            "Summary": "Stove Kraft, an Indian kitchenware and appliances company, has reported a net profit of 167 million rupees for the second quarter, compared to 165 million rupees in the same period last year. This represents a marginal year-over-year increase in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1730107329000,
            "Source": "result"
        },
        {
            "Title": "Stove Kraft Schedules Q2 Results Board Meeting",
            "Summary": "<p>Stove Kraft has announced a <span class='neutral'>board meeting</span> scheduled for <b>October 28</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728302347000,
            "Source": "corporate_action"
        }
    ]
}