{
    "Symbol": "STUDDS",
    "ISIN": "INE00Q601028",
    "News": [
        {
            "Title": "Studds Accessories Q3FY26 Results Show Strong Growth",
            "Summary": "Studds Accessories reported Q3FY26 standalone revenue of Rs. 1,614.47 million, up 8.49% YoY, with net profit rising 15.58% to Rs. 205.15 million. Manufacturing Facility-V delayed due to GRAP standards.",
            "Sentiment": "positive",
            "PublishDate": 1769873342514,
            "Source": "co_actions_results"
        },
        {
            "Title": "Studds Accessories cancels investor meetings",
            "Summary": "Studds Accessories Limited has cancelled its scheduled investor and analyst meetings planned for January 7, 2026, citing business exigencies as the reason for the last-minute cancellation.",
            "Sentiment": "neutral",
            "PublishDate": 1767763632967,
            "Source": "stocks"
        },
        {
            "Title": "Studds Accessories Reports 6.5% Revenue Growth in Q2 FY26 Earnings Call",
            "Summary": "Studds Accessories Limited reported consolidated revenue of INR 154.4 crores for Q2 FY26, growing 6.5% year-on-year, with EBITDA margins improving to 19.3% from 18.4% in the previous year. The world's largest helmet manufacturer by volume guided for 10-11% topline growth and 20-22% PAT growth for the full year, while targeting revenue of over INR 1,000 crores by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1764750547655,
            "Source": "earnings"
        },
        {
            "Title": "Studds Accessories Reports 6.4% Revenue Growth and 17.9% EBITDA Jump in H1FY26",
            "Summary": "Studds Accessories delivered revenue of Rs 303.7 crore (up 6.4% YoY) and EBITDA of Rs 60.2 crore (up 17.9% YoY) in H1FY26, driven by superior product mix and operational efficiency. The company onboarded Decathlon as a strategic customer for bicycle helmets and is expanding capacity by 1.5 million units in the first phase, expected to be operational by Q1FY27.",
            "Sentiment": "positive",
            "PublishDate": 1764236004681,
            "Source": "earnings"
        },
        {
            "Title": "Studds Accessories Launches New Unit in Spain for European Expansion",
            "Summary": "Studds Accessories has established a new operational unit in Spain as part of its global growth strategy. The move is aimed at expanding the company's distribution network across European markets.",
            "Sentiment": "positive",
            "PublishDate": 1764207619812,
            "Source": "corporate_action"
        },
        {
            "Title": "Studds Accessories Approves USD 99,897 Investment in US Subsidiary Bikerz",
            "Summary": "Studds Accessories Limited's Board approved a further investment of USD 99,897.378 in its wholly owned subsidiary Bikerz US Inc., which distributes SMK helmets in the United States. The capital infusion aims to support Bikerz's future business expansion plans and strengthen the company's distribution network in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1764180033374,
            "Source": "corporate_action"
        }
    ]
}