{
    "Symbol": "STYLEBAAZA",
    "ISIN": "INE01FR01028",
    "News": [
        {
            "Title": "Baazar Style Retail Files Q3FY26 IPO Proceeds Report",
            "Summary": "Baazar Style Retail Limited submitted its monitoring agency report for Q3FY26 regarding IPO proceeds utilization under Regulation 30, showing complete utilization of Rs.185 crore proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1770389902895,
            "Source": "stocks"
        },
        {
            "Title": "Baazar Style Retail Q3FY26 Results & Leadership Changes",
            "Summary": "Baazar Style Retail reported Q3FY26 results with ₹46,646.29 lakhs revenue and ₹1,896.67 lakhs net profit. Company appointed Rohit Kedia as Chairman while Pradeep Kumar Agarwal resigned from the position.",
            "Sentiment": "positive",
            "PublishDate": 1770387820679,
            "Source": "co_actions_results"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in Jharkhand",
            "Summary": "Baazar Style Retail Limited has opened its 253rd store in Lohardaga, Jharkhand, expanding its retail footprint across India as disclosed under regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1769152737095,
            "Source": "stocks"
        },
        {
            "Title": "Bazaar Style Retail Approves ₹331.53 Cr Warrant Issue",
            "Summary": "Bazaar Style Retail Limited's board approves preferential issue of 1.01 crore equity warrants to Cupid Limited at ₹328.25 per warrant, raising ₹331.53 crores for business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768932915434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Baazar Style Retail Senior Management Resignations",
            "Summary": "Baazar Style Retail Limited announces resignations of Chief Operating Officer Saurav Jhunjhunwala and Vice President Gaurav Saraogi due to personal reasons, effective January 13 and January 31, 2026 respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1768393107025,
            "Source": "stocks"
        },
        {
            "Title": "Baazar Style Board Meet on Jan 20 for Fund Raising",
            "Summary": "Baazar Style Retail Limited has scheduled a board meeting on January 20, 2026, to consider and approve fund raising proposals through various securities including equity shares, warrants, and debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1768390675889,
            "Source": "co_actions_results"
        },
        {
            "Title": "Baazar Style Retail Q3FY26: 13% YoY Revenue Growth",
            "Summary": "Baazar Style Retail reports 13% YoY revenue growth to ₹4,665 Mn in Q3FY26, with 9-month revenue surging 38% to ₹13,760 Mn. Company expanded to 252 stores, adding 45 new outlets during the period.",
            "Sentiment": "positive",
            "PublishDate": 1767425537895,
            "Source": "co_actions_results"
        },
        {
            "Title": "Baazar Style Retail faces ₹12.09L GST demand order",
            "Summary": "Baazar Style Retail Limited received GST assessment order with total demand of ₹12,09,250 for May-October 2018 period. Company plans to appeal the order citing legal grounds.",
            "Sentiment": "negative",
            "PublishDate": 1766754519162,
            "Source": "stocks"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in Nagaon, Assam",
            "Summary": "Baazar Style Retail Limited has opened a new Express Baazar store in Nagaon, Assam, bringing the company's total store count to 252 outlets as of December 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766211835535,
            "Source": "stocks"
        },
        {
            "Title": "Baazar Style Retail Closes Store in West Bengal, Reduces Total Count to 251",
            "Summary": "Baazar Style Retail Limited has closed its StyleBaazar store at Hind Apartment, Howrah Maidan, West Bengal. The closure brings the company's total number of stores to 251 as of the announcement date.",
            "Sentiment": "negative",
            "PublishDate": 1765352666232,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Wins Court Injunction to Protect Store Operations in Bishnupur",
            "Summary": "Baazar Style Retail Limited secured an injunction from the Civil Judge Court in Alipore against three defendants who allegedly threatened to close the company's retail store at Bishnupur, South 24 Parganas, claiming ownership. The court order restrains the defendants from causing disturbances or obstacles to the store's operations, protecting the company's lawful possession of the commercial property.",
            "Sentiment": "positive",
            "PublishDate": 1763640051984,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Reports 71% Revenue Growth in Q2 FY26, Revises Full-Year Guidance Upward",
            "Summary": "Baazar Style Retail Limited delivered strong quarterly results with revenue growing 71% year-on-year to INR 532 crores and EBITDA rising 184% to INR 69 crores, driven by festival season demand and store expansion. The company revised its FY26 revenue growth guidance from 25% to 30% and recognized a one-time exceptional gain of INR 55 crores from lease term reassessment under IndAS 116.",
            "Sentiment": "positive",
            "PublishDate": 1763203734032,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Reports Full Utilization of IPO Proceeds Worth Rs. 185 Crore",
            "Summary": "Baazar Style Retail Limited has submitted a monitoring agency report showing complete utilization of Rs. 185 crore raised through its IPO and pre-IPO placement. The company allocated Rs. 146 crore for prepayment of outstanding borrowings, Rs. 28.99 crore for general corporate purposes, and Rs. 9.43 crore for offer expenses, with Rs. 0.58 crore remaining unutilized. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from the stated objectives for the quarter ended September 30, 2025. The report indicates that debt repayment was completed in Q2 FY25 and general corporate purposes were fulfilled by Q4 FY25. The remaining balance of Rs. 0.51 crore pertains to the company's share of offer expenses.",
            "Sentiment": "positive",
            "PublishDate": 1762809237694,
            "Source": "stock"
        },
        {
            "Title": "Style Bazaar Plans Aggressive Expansion to 400+ Stores by FY27 as Q2 Revenue Grows 18% YoY",
            "Summary": "Style Bazaar reported 18% year-over-year revenue growth in Q2, driven by expansion into tier-2 and tier-3 markets. The company has outlined an aggressive expansion strategy targeting over 400 stores by FY27. The retailer is focusing on private label development and omni-channel integration while investing in supply chain efficiency, inventory analytics, and brand building initiatives to support sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1762788098086,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Reports Strong Q2 Performance with Exceptional Gains from Lease Reassessment",
            "Summary": "Baazar Style Retail Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a profit after tax of ₹5,449.42 lakhs for the quarter compared to a loss of ₹620.67 lakhs in the previous quarter. Revenue from operations stood at ₹54,802.93 lakhs for the quarter. The company recorded an exceptional gain of ₹5,525.90 lakhs (net of tax impact ₹4,135.14 lakhs) due to reassessment of lease term estimates for store leases, which led to reduction in Right-of-Use assets and lease liabilities by ₹31,920.08 lakhs and ₹36,783.78 lakhs respectively. The company also settled an insurance claim of ₹424.57 lakhs related to property damage from a May 2024 fire incident for ₹347.97 lakhs, resulting in an exceptional loss of ₹76.60 lakhs. Earnings per share for the quarter was ₹6.90 compared to ₹0.28 in the previous quarter. The company continues to pursue insurance claims for inventory losses from the warehouse fire.",
            "Sentiment": "positive",
            "PublishDate": 1762775022548,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in Uttar Pradesh, Total Count Reaches 252",
            "Summary": "Baazar Style Retail Limited opened a new Style Baazar store in Kunraghat, Uttar Pradesh. The expansion brings the company's total store count to 252. The company trades on exchanges under the symbol STYLEBAAZA with scrip code 544243.",
            "Sentiment": "positive",
            "PublishDate": 1760682376472,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in Bihar, Reaches 251 Total Stores",
            "Summary": "Baazar Style Retail Limited opened a new Style Baazar store in Rajabazaar, Bihar. The expansion brings the company's total store count to 251. The company trades under the symbol STYLEBAAZA on stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1760511744704,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Reports Strong Q2 FY26 Performance with 71% Revenue Growth",
            "Summary": "Baazar Style Retail delivered strong quarterly results with revenue surging 71% year-over-year to Rs 5,319 million. The company achieved sales per square foot of Rs 865 and same store sales growth of 22%. During the quarter, Baazar Style Retail expanded its footprint by opening 20 new stores.",
            "Sentiment": "positive",
            "PublishDate": 1759478490676,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in Uttar Pradesh, Reaches 249 Total Outlets",
            "Summary": "Baazar Style Retail Limited opened a new Style Baazar store in Basti, Uttar Pradesh. The expansion brings the company's total store count to 249 outlets. The company disclosed this information through its Chief Compliance Officer, Company Secretary and Head - Legal & Compliance, Abinash Singh.",
            "Sentiment": "positive",
            "PublishDate": 1758866110812,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in Bihar, Expands Network to 248 Outlets",
            "Summary": "Baazar Style Retail Limited opened a new Style Baazar store in Masaurhi, Bihar. The expansion brings the company's total store count to 248. The disclosure was signed by Abinash Singh, Chief Compliance Officer, Company Secretary and Head - Legal & Compliance.",
            "Sentiment": "positive",
            "PublishDate": 1758780603080,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Opens Three New Stores, Expands Network to 247 Outlets",
            "Summary": "Baazar Style Retail Limited opened three new Style Baazar stores located in Bakrahat, West Bengal, Mashrakh, Bihar and Daryapur, Bihar. The expansion brings the company's total store count to 247. The company trades on exchanges under the symbol STYLEBAAZA with scrip code 544243.",
            "Sentiment": "positive",
            "PublishDate": 1758521940424,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Opens New Express Store in West Bengal, Reaches 243 Total Stores",
            "Summary": "Baazar Style Retail has opened a new Express Baazar store in Basirhat, West Bengal. With this expansion, the company's total store count has reached 243 locations.",
            "Sentiment": "positive",
            "PublishDate": 1757656392495,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Opens New Express Store in West Bengal, Reaches 240 Total Stores",
            "Summary": "Baazar Style has opened a new Express Baazar store in Dinhata, West Bengal. With this expansion, the company's total store count has reached 240 locations.",
            "Sentiment": "positive",
            "PublishDate": 1756447515875,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Expands to 235 Stores with Two New West Bengal Locations",
            "Summary": "Baazar Style Retail has opened two new stores in West Bengal, located in Habra and Bardhaman. This expansion brings the company's total store count to 235 locations.",
            "Sentiment": "positive",
            "PublishDate": 1755243806538,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in West Bengal, Total Count Reaches 233",
            "Summary": "Baazar Style Retail Limited opened a new Style Baazar store in Raiganj, West Bengal. With this addition, the company's total store count now stands at 233. The expansion represents the company's continued retail footprint growth in the region.",
            "Sentiment": "positive",
            "PublishDate": 1754722363040,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Reports 37% Revenue Growth to INR 378 Crores in Q1 FY26",
            "Summary": "Baazar Style Retail Limited reported strong quarterly results with revenue reaching INR 378 crores, marking a 37% year-on-year increase and 9% quarter-on-quarter growth. Gross profit rose to INR 136 crores, reflecting 49% year-on-year growth with margins at 36%. The company's private label portfolio contributed 61% to revenue, amounting to INR 229 crores with 59% year-on-year growth. EBITDA for the quarter was INR 25 crores, up 14% year-on-year, while profit after tax came in at INR 9 crores, representing 531% year-on-year growth. The company expanded its store network to 232 stores, a 40% increase from the previous year, with total retail area reaching 2.11 million square feet. Management maintained revenue growth guidance of 25% for FY26 and expects to open 40-50 new stores during the year. Same-store sales growth stood at minus 3%, though normalized SSG was 11% after adjusting for Eid timing shifts. The company projects pre-IndAS EBITDA margin of 7-8% and PAT margin of 3-4% for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1754642696608,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Promoter Rohit Kedia Purchases 100,000 Equity Shares",
            "Summary": "Rohit Kedia, a promoter and Whole-Time Director of Baazar Style Retail Limited, purchased 100,000 equity shares worth Rs. 291.86 through market buying on NSE. The transaction increased his shareholding from 4,360,580 shares (5.84%) to 4,460,580 shares (5.98%). The shares were acquired on August 5, 2025, and disclosed to the company on August 6, 2025, in compliance with SEBI insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1754483641353,
            "Source": "corporate_action"
        },
        {
            "Title": "Baazar Style Retail Reports Q1 Net Profit of 21 Million Rupees, Reversing Previous Year Loss",
            "Summary": "Baazar Style Retail reported a net profit of 21 million rupees in Q1, compared to a loss of 3.8 million rupees in the same period last year. The company's revenue grew to 3.8 billion rupees from 2.75 billion rupees year-over-year. EBITDA increased to 582 million rupees from 420 million rupees, while EBITDA margin improved slightly to 15.41% from 15.24% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754266111370,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Board Approves Articles of Association Changes Ahead of AGM",
            "Summary": "Baazar Style Retail Limited's Board of Directors approved alterations to the company's Articles of Association. The changes include terminating Part II of the Articles, which was previously aligned with the Shareholders' Agreement but became irrelevant after the company filed its Updated Draft Red Herring Prospectus for IPO on August 13, 2024. The Board also approved modifications to clause 110 regarding director retirement by rotation, changing the provision so that managing directors and whole-time directors will now retire by rotation and be included in calculating the total number of directors for retirement purposes, unlike the previous arrangement where they were exempt. Both changes require shareholder approval at the upcoming Annual General Meeting through a special resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1754063349029,
            "Source": "corporate_governance"
        },
        {
            "Title": "Baazar Style Retail Closes Store in Bihar, Reduces Total Count to 230",
            "Summary": "Baazar Style Retail Limited closed operations of a Style Baazar store located in Samastipur, Bihar. Following this closure, the company's total store count now stands at 230. The closure was disclosed by Chief Compliance Officer Abinash Singh.",
            "Sentiment": "negative",
            "PublishDate": 1754060751065,
            "Source": "stock"
        },
        {
            "Title": "Baazar Style Retail Appoints Alok Kumar Prakash as Assistant VP - Supply Chain Management",
            "Summary": "Baazar Style Retail Limited appointed Mr. Alok Kumar Prakash as Assistant Vice President – Supply Chain Management, effective August 1, 2025. The Board of Directors approved the appointment based on the recommendation of the Nomination and Remuneration Committee. Prakash holds a Bachelor's degree in Science from Lucknow Christian College and an MBA from IGNOU, with over 24 years of experience in end-to-end logistics, warehouse automation, and supply chain management. He previously worked with organizations including Landmark Group, Future Group, Mashhor Group, A2Z Infrastructure Ltd, and Epack Polymers Pvt Ltd. The company sought a suitable candidate to head the Supply Chain department for better optimization of supply chain operations.",
            "Sentiment": "positive",
            "PublishDate": 1754059966079,
            "Source": "corporate_governance"
        },
        {
            "Title": "Baazar Style Retail Reports Strong Q1 Performance with Revenue Jump and Return to Profitability",
            "Summary": "Baazar Style Retail delivered strong quarterly results with revenue rising to 3.8 billion rupees from 2.75 billion rupees year-over-year. The company returned to profitability with a net profit of 21 million rupees compared to a loss of 3.8 million rupees in the same period last year. EBITDA increased to 582 million rupees from 420 million rupees, while EBITDA margin improved slightly to 15.41% from 15.24% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754055884476,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Approves Quarterly Results, Appoints New Secretarial Auditor and Senior Management Personnel",
            "Summary": "Baazar Style Retail Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹31,782.77 lakhs and profit after tax of ₹206.75 lakhs for the quarter. The Board appointed M/s. S.K. Joshi & Associates as Secretarial Auditor for five consecutive financial years from 2025-26 to 2029-30, subject to shareholder approval. Additionally, Mr. Alok Kumar Prakash was appointed as Assistant Vice President – Supply Chain Management. The company also approved alterations to its Articles of Association, including termination of Part II and modifications to director retirement provisions. An exceptional loss of ₹76.60 lakhs was recorded due to settlement of an insurance claim related to property damage from a May 2024 fire incident at the company's Serampore warehouse.",
            "Sentiment": "neutral",
            "PublishDate": 1754055788262,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Limited Schedules Board Meeting for August 1, 2025 to Approve Quarterly Financial Results",
            "Summary": "Baazar Style Retail Limited has scheduled a Board of Directors meeting for August 1, 2025, to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company trades under the symbol STYLEBAAZA with scrip code 544243. The meeting notification was signed by Abinash Singh, Chief Compliance Officer, Company Secretary and Head - Legal & Compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1753450313567,
            "Source": "corporate_action"
        },
        {
            "Title": "Baazar Style Retail Reports 37% YoY Increase in Q1 Revenue",
            "Summary": "Baazar Style Retail has reported a 37% year-over-year increase in standalone revenue from operations for the first quarter. The specific fiscal year mentioned is FY26, though this seems unusual and may be a typo in the original headline.",
            "Sentiment": "positive",
            "PublishDate": 1751506336000,
            "Source": "default"
        },
        {
            "Title": "Baazar Style Retail Ltd.: Q1 Revenue Estimated to Surge 37% YoY",
            "Summary": "Baazar Style Retail Ltd. forecasts 37% YoY revenue growth to Rs 377.7 crore in Q1 FY2026. The company opened 22 new stores in June, plans to add up to 50 stores annually over the next two years, focusing on tier 2-4 cities. Sales per square feet reached Rs 664 per month for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1751469722000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Reports Q4 Financial Results",
            "Summary": "Baazar Style has announced its Q4 financial results. The company reported a net loss of 64 million rupees, which is unchanged from the same period last year. However, this represents a significant shift from the previous quarter, where they had reported a profit of 304 million rupees. On a positive note, Q4 revenue increased to 3.5 billion rupees, up from 2.23 billion rupees in the same quarter last year, showing substantial year-over-year growth.",
            "Sentiment": "neutral",
            "PublishDate": 1747232256000,
            "Source": "result"
        },
        {
            "Title": "Style Baazar Store Temporarily Closed Due to Civil Unrest in West Bengal",
            "Summary": "Baazar Style Retail has reported a temporary disruption of operations at one of its Style Baazar stores located in Dhuliyan, West Bengal. The closure is attributed to civil unrest in the area, affecting the company's normal business activities at this specific location.",
            "Sentiment": "negative",
            "PublishDate": 1744381657000,
            "Source": "corporate_action"
        },
        {
            "Title": "Baazar Style Retail: Share Price Rises Despite Rekha Jhunjhunwala Reducing Stake",
            "Summary": "Baazar Style Retail's share price increased by 5% despite Rekha Jhunjhunwala reducing her stake from 3.65% to 3.39% in Q4FY25. JM Financial initiated coverage with a 'buy' rating and a target price of ₹400, projecting strong growth over FY24-27E.",
            "Sentiment": "positive",
            "PublishDate": 1744186236000,
            "Source": "normal_news"
        },
        {
            "Title": "Baazar Style Retail: Q4 Revenue Surges 55%, Expansion Plans Unveiled",
            "Summary": "Baazar Style Retail reported a 55% YoY increase in Q4 FY2025 revenue to Rs 345.6 crore. The company expanded to 214 stores, with plans to open 50 stores annually over the next two years. Sales per square feet rose 19% to Rs 679 per month in Q4. The stock hit a two-month high, rising up to 9.46% to Rs 284.70.",
            "Sentiment": "positive",
            "PublishDate": 1743576713000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Reports Strong Same Store Sales Growth in Q4FY25 and FY25",
            "Summary": "Baazar Style Retail has announced impressive Same Store Sales Growth (SSSG) figures for both the fourth quarter and full fiscal year of 2025. The company reported a 20% SSSG for Q4FY25 and a 13% SSSG for the entire FY25, indicating robust performance and consistent growth across its retail outlets.",
            "Sentiment": "positive",
            "PublishDate": 1743571180000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Projects Strong Revenue Growth for Q4FY25 and FY25",
            "Summary": "Baazar Style Retail anticipates significant revenue growth in the upcoming financial periods. The company forecasts a 55% year-over-year increase in revenue to Rs 3,456 million for Q4FY25. For the full fiscal year 2025, they project a 38% year-over-year growth, reaching Rs 13,438 million in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1743571150000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Opens New Store in Golaghat, Assam",
            "Summary": "Baazar Style Retail has expanded its presence by opening a new Style Baazar store in Golaghat, Assam. This move indicates the company's continued efforts to grow its retail footprint in the northeastern region of India.",
            "Sentiment": "positive",
            "PublishDate": 1741586105000,
            "Source": "corporate_action"
        },
        {
            "Title": "Baazar Style Retail: Ambitious Expansion Plan Targets 50 New Stores Annually",
            "Summary": "Baazar Style Retail Ltd. plans to open 40-50 new stores annually over the next two years, focusing on tier 2, 3, and 4 cities. The company aims for 25% revenue growth and 7-8% same-store sales growth. Investments in warehouse capacity and technology solutions are also planned.",
            "Sentiment": "positive",
            "PublishDate": 1740634605000,
            "Source": "corporate_action"
        },
        {
            "Title": "Baazar Style Retail Reports Q3 EBITDA Growth",
            "Summary": "Baazar Style Retail has reported its Q3 financial results. The company's EBITDA increased to 833 million rupees, up from 759 million rupees in the same quarter last year. However, the EBITDA margin decreased to 20.24% from 22.78% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738073944000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Reports Mixed Q3 Financial Results",
            "Summary": "Baazar Style Retail announced its Q3 financial results. The company reported a net profit of 304 million rupees, down from 384 million rupees year-over-year. However, this represents a recovery from a loss of 89 million rupees in the previous quarter. Revenue for Q3 increased to 4.1 billion rupees, up from 3.3 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738073845000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Expands with Two New Store Openings",
            "Summary": "Baazar Style Retail has expanded its presence by opening two new Style Baazar stores. One store has been launched in Buxi Bazar, Cuttack, Odisha, while the other has been opened in Mau, Uttar Pradesh. This expansion indicates the company's efforts to increase its retail footprint across different regions in India.",
            "Sentiment": "positive",
            "PublishDate": 1736488566000,
            "Source": "corporate_action"
        },
        {
            "Title": "Baazar Style Retail Reports 24% YoY Revenue Growth in Q3, Same Store Sales Decline",
            "Summary": "Baazar Style Retail announced its Q3 financial results, reporting a 24% year-over-year increase in revenue to 4,116 million rupees. However, the company experienced a 3% decline in same-store sales growth for Q3FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1736122224000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail Reports 24% Revenue Growth in Q3, Negative Same Store Sales",
            "Summary": "Baazar Style Retail has announced its Q3 financial results. The company's revenue grew by 24% year-over-year to 4,116 million rupees. However, the same store sales growth was negative at -3% for Q3FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1735904674000,
            "Source": "earnings"
        },
        {
            "Title": "Baazar Style Retail: Online Sales to Contribute 2% to Revenue in 3 Years",
            "Summary": "Baazar Style Retail's MD Shreyans Surana expects online sales to account for 1-2% of total revenue in the next three years. The company is developing its online ecosystem while maintaining focus on profitable offline stores. Q2 results show 65% revenue growth to Rs 313 crore, with narrowed losses.",
            "Sentiment": "positive",
            "PublishDate": 1731644322000,
            "Source": "normal_news"
        }
    ]
}