{
    "Symbol": "STYL",
    "ISIN": "INE04VU01023",
    "News": [
        {
            "Title": "Seshaasai Technologies Q3FY26 Call Recording Live",
            "Summary": "Seshaasai Technologies Limited makes Q3FY26 earnings conference call audio recording available on company website following January 30, 2026 investor call.",
            "Sentiment": "neutral",
            "PublishDate": 1769783375145,
            "Source": "co_actions_results"
        },
        {
            "Title": "Seshaasai Technologies Q3FY26 Earnings Call on Jan 30",
            "Summary": "Seshaasai Technologies Limited will announce Q3FY26 results on January 29, 2026, followed by an earnings conference call on January 30, 2026 at 5:00 PM IST to discuss quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769178242533,
            "Source": "co_actions_results"
        },
        {
            "Title": "Seshaasai Technologies Reports 13.3% QoQ Revenue Growth with Strong Profitability in Q2 FY26",
            "Summary": "Seshaasai Technologies Limited reported revenue from operations of ₹3,523.4 million for Q2 FY26, marking a 13.3% quarter-on-quarter growth. The technology-driven solutions company achieved an EBITDA of ₹951.1 million with a margin of 26.9%, up 336 basis points sequentially. PAT stood at ₹575.3 million, growing 56.2% sequentially with a PAT margin of 16.3%. Payment Solutions contributed 51.1% of revenues, Communication Fulfilment Solutions 37.8%, and IoT Solutions 10.8%. For the half-year, revenue was ₹6,632 million with EBITDA at ₹1,688.7 million and PAT at ₹943.7 million. The company completed its IPO of 19,226,541 equity shares at ₹423 per share, raising ₹8,190.74 million. Top 10 customers contributed 63.5% of revenues. The company repaid ₹3,000 million of debt from IPO proceeds.",
            "Sentiment": "positive",
            "PublishDate": 1762881601230,
            "Source": "earnings"
        },
        {
            "Title": "Seshaasai Technologies Schedules Q2FY26 Results Announcement and Earnings Call",
            "Summary": "Seshaasai Technologies Limited will announce its results for the second quarter and half year of FY26, ended September 30, 2025, on November 11, 2025. The company has scheduled an earnings conference call for November 12, 2025, at 5:30 PM IST. The call will be attended by Chairman Managing Director Pragnyat Lalwani and Chief Financial Officer Pavan Kumar. Seshaasai Technologies is a technology-driven solutions company focusing on payments, communication, and IoT services, with a strong presence in the banking, financial services, and insurance sector.",
            "Sentiment": "neutral",
            "PublishDate": 1762431219065,
            "Source": "earnings"
        },
        {
            "Title": "Seshaasai Technologies Reports Flat Q2 EBITDA with Margin Decline",
            "Summary": "Seshaasai Technologies reported Q2 EBITDA of 712 million rupees compared to 714 million rupees in the same period last year, showing minimal change. However, the company's EBITDA margin declined significantly to 6.42% from 12.45% year-over-year, indicating reduced profitability despite stable absolute earnings.",
            "Sentiment": "negative",
            "PublishDate": 1760633505859,
            "Source": "earnings"
        },
        {
            "Title": "Seshaasai Technologies Reports Q1FY26 Revenue of ₹3,132.15 Million with 23.7% EBITDA Margin",
            "Summary": "Seshaasai Technologies Limited announced its Q1FY26 financial results with total revenue of ₹3,132.15 million and operating revenue of ₹3,108.73 million, compared to ₹3,605.03 million in Q1FY25. The company maintained an EBITDA margin of 23.7% versus 22.7% in the previous year, supported by improved gross margin of 44.5% against 40.5% in Q1FY25. PAT margin increased to 11.7% from 11.2% in Q1FY25. Payment Solutions contributed 48.4% of consolidated revenues, Communication & Fulfilment Solutions contributed 42.7%, and IoT Solutions contributed 8.9% compared to 6.3% in Q1FY25. The top 10 customers accounted for 68.6% of total revenues. Managing Director Pragnyat Lalwani noted the quarter reflected a transitionary phase with banks and fintechs recalibrating issuance strategies due to regulatory and market dynamics. CFO Pavan Kumar highlighted that over 95% of revenues come from existing clients and emphasized the company's focus on operational discipline and cost efficiencies.",
            "Sentiment": "neutral",
            "PublishDate": 1760632322170,
            "Source": "earnings"
        }
    ]
}