{
    "Symbol": "STYLAMIND",
    "ISIN": "INE239C01020",
    "News": [
        {
            "Title": "Stylam Industries Q3FY26 Earnings Call on Jan 29",
            "Summary": "Stylam Industries Limited has scheduled an earnings conference call for January 29, 2026 at 3:00 PM IST to discuss Q3FY26 and nine-month financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769171532274,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stylam Industries Q3 Net Profit Jumps 54% to ₹46 Cr",
            "Summary": "Stylam Industries reports strong Q3FY26 results with net profit surging 54.4% to ₹46 crore. Revenue grows 6.5% to ₹271 crore while EBITDA margin expands to 20.6%.",
            "Sentiment": "positive",
            "PublishDate": 1769155923051,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stylam Industries Writes Off ₹35.63L Investment",
            "Summary": "Stylam Industries board approves write-off of ₹35.63 lakh investment in Malaysian associate company Alca Vstyle Sdn. Bhd due to continuous losses and erosion of net worth.",
            "Sentiment": "negative",
            "PublishDate": 1769154790733,
            "Source": "stocks"
        },
        {
            "Title": "Stylam Industries Board Meet on Jan 23 for Q3FY26 Results",
            "Summary": "Stylam Industries Limited has scheduled a board meeting on January 23, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768556872113,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stylam Industries Receives Open Offer Intimation",
            "Summary": "Stylam Industries formally receives detailed public statement from Aica Kogyo regarding open offer for 26% stake acquisition at ₹2,250 per share through ICICI Securities.",
            "Sentiment": "neutral",
            "PublishDate": 1767344135566,
            "Source": "co_actions_results"
        },
        {
            "Title": "Investec Sets ₹2,300 Price Target for Stylam Industries",
            "Summary": "Investment firm Investec has issued a Buy recommendation for Stylam Industries with a price target of ₹2,300, indicating positive outlook for the plywood and laminates manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1766979486710,
            "Source": "stocks"
        },
        {
            "Title": "Stylam Industries Settles Share Dispute Agreement",
            "Summary": "Stylam Industries announces settlement agreement between promoter families regarding 4.55% shareholding dispute involving 7.71 lakh shares originally registered under late Smt. Rattan Devi's name.",
            "Sentiment": "positive",
            "PublishDate": 1766737832480,
            "Source": "stocks"
        },
        {
            "Title": "Stylam Industries Open Offer Launched At ₹2,250/Share",
            "Summary": "Aica Kogyo formally launches mandatory open offer to acquire 26% stake (44.06 lakh shares) in Stylam Industries at ₹2,250 per share, totaling ₹991.46 crore consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1766735539742,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stylam Industries Receives Second Best Exporter Award for Decorative Laminates",
            "Summary": "Stylam Industries Limited has been awarded the Second Best Exporter of Decorative Laminates and received the highest recognition for exports for the year 2023-24 to 2024-25 by the Plastics Export Promotion Council. The recognition was sponsored by the Ministry of Commerce Industry, Department of Commerce, Government of India, highlighting the company's strong export performance in the decorative laminates segment.",
            "Sentiment": "positive",
            "PublishDate": 1763359590679,
            "Source": "stock"
        },
        {
            "Title": "Stylam Industries Plans ₹250 Cr Capex for Decorative Laminate and Compact Boards Expansion",
            "Summary": "Stylam Industries announced a ₹250 crore capital expenditure plan for expanding into decorative laminate and compact boards, targeting 40% export contribution by FY27. The company aims for 15-20% CAGR growth through distribution expansion across Europe and Middle East, focusing on margin expansion via high-end product mix and branding investments.",
            "Sentiment": "positive",
            "PublishDate": 1763136972307,
            "Source": "stock"
        },
        {
            "Title": "Stylam Industries Reports Q2 FY26 Financial Results",
            "Summary": "Stylam Industries Limited announced its unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025, following board approval on November 14, 2025. The company is expanding manufacturing capacity with a new laminate plant in Panchkula, Haryana, expected to commence operations in January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763127631395,
            "Source": "earnings"
        },
        {
            "Title": "Stylam Industries Denies Knowledge of AICA Kogyo Acquisition Reports",
            "Summary": "Stylam Industries Limited has denied having any knowledge of reported acquisition discussions with Japan's AICA Kogyo. The company responded to a news report on CNBCTV18 dated October 28, 2025, which suggested that AICA Kogyo was looking to acquire a majority stake in the company. Stylam Industries clarified that it is not privy to any such discussions and stated there is no material information or impending announcement that may impact the stock's price or volume behavior. The company emphasized that the media report does not have any impact on its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1761640669955,
            "Source": "stock"
        },
        {
            "Title": "Aica Kogyo Plans Majority Stake Acquisition in Stylam Industries",
            "Summary": "Aica Kogyo has announced plans to acquire a majority stake in Stylam Industries. The proposed transaction would result in Aica Kogyo taking control of the company through this majority ownership structure.",
            "Sentiment": "positive",
            "PublishDate": 1761553110920,
            "Source": "order&deals"
        },
        {
            "Title": "Stylam Industries Reports 17% Revenue Growth in Q1 FY26, Maintains Debt-Free Status",
            "Summary": "Stylam Industries Limited released its investor presentation for Q1 ended June 30, 2025, showing a 17% increase in revenue compared to the same period last year. The company sold 2.74 million laminate sheets during Q1 FY26 (1.22 million domestic, 1.52 million export) versus 2.81 million sheets in Q1 FY25 (1.14 million domestic, 1.67 million export). Stylam maintains its zero-debt status, reflecting strong financial health and effective capital management. The construction of a new expansion plant in Panchkula, Haryana is progressing well, marking the company's third laminate plant strategically located next to its existing facility at Manak Tabra. The company operates one of Asia's largest single-location laminate manufacturing plants across 80 acres with annual capacity of 16 million sheets and employs over 2,500 team members. Stylam expressed confidence in achieving its financial guidance, indicating sustained growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1754129088392,
            "Source": "earnings"
        },
        {
            "Title": "Stylam Industries Reports Flat Net Profit in Q1 at ₹282.5 Million",
            "Summary": "Stylam Industries reported a net profit of ₹282.5 million in Q1, compared to ₹283.4 million in the same period last year, representing a marginal decline of ₹0.9 million year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754118258158,
            "Source": "earnings"
        },
        {
            "Title": "Stylam Industries: Q4 Profit Drops 21%, Shares Decline",
            "Summary": "Stylam Industries reported a 21% year-on-year decline in Q4 net profit to ₹29.60 crore. Revenue increased by 11% to ₹265.30 crore. EBITDA fell 10% to ₹43 crore, with margins contracting by 367 basis points to 16.25%. Shares dropped up to 5% following the announcement.",
            "Sentiment": "negative",
            "PublishDate": 1748245774000,
            "Source": "earnings"
        },
        {
            "Title": "Stylam Industries Reports Q4 Financial Results",
            "Summary": "Stylam Industries has released its Q4 financial results. The company's EBITDA for Q4 was 429 million rupees, compared to 477 million rupees in the same quarter last year. The EBITDA margin decreased to 16.19% from 19.87% year-over-year. Revenue for Q4 increased to 2.65 billion rupees from 2.4 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748244082000,
            "Source": "result"
        },
        {
            "Title": "Stylam Industries Reports Q4 Net Profit of 290 Million Rupees",
            "Summary": "Stylam Industries has reported a net profit of 290 million rupees for the fourth quarter, compared to 376 million rupees in the same quarter of the previous year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1748244042000,
            "Source": "result"
        },
        {
            "Title": "Stylam Industries: Penny Stock Soars from ₹3.85 to ₹1680 in 16 Years",
            "Summary": "Stylam Industries, a manufacturer of high-pressure laminates, has seen its stock price rise from ₹3.85 in 2009 to ₹1,680 currently, representing a significant return for long-term investors. The company reported 18.6% year-on-year revenue growth in Q3, reaching ₹2,500 crore, despite a contraction in gross margins and a 3.8% decrease in EBITDA.",
            "Sentiment": "positive",
            "PublishDate": 1742975526000,
            "Source": "normal_news"
        },
        {
            "Title": "Stylam Industries: Anti-Dumping Duty Imposed on Chinese Acrylic Solid Surfaces",
            "Summary": "The Indian government has imposed a five-year anti-dumping duty on imports of Acrylic Solid Surfaces from China, following a petition by Stylam Industries. The company accounts for 70-80% of India's Acrylic Solid Surfaces production.",
            "Sentiment": "positive",
            "PublishDate": 1742953672000,
            "Source": "corporate_action"
        },
        {
            "Title": "Stylam Industries Reports Q3 EBITDA and Margin Decline",
            "Summary": "Stylam Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 460 million rupees from 478 million rupees in the same quarter last year. Additionally, the EBITDA margin declined to 18.07% from 22.28% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739008511000,
            "Source": "earnings"
        },
        {
            "Title": "Stylam Industries Reports Q3 Financial Results",
            "Summary": "Stylam Industries has announced its financial results for the third quarter. The company reported a net profit of 304 million rupees, slightly down from 313 million rupees in the same period last year. However, revenue increased to 2.55 billion rupees from 2.1 billion rupees year-over-year, showing strong top-line growth.",
            "Sentiment": "neutral",
            "PublishDate": 1739008505000,
            "Source": "earnings"
        },
        {
            "Title": "Stylam Industries Seeks Anti-Dumping Investigation on Acrylic Solid Surfaces Imports",
            "Summary": "Stylam Industries has requested the initiation of an anti-dumping investigation regarding imports of 'acrylic solid surfaces'. This move suggests the company believes these imports may be unfairly priced, potentially harming domestic manufacturers.",
            "Sentiment": "neutral",
            "PublishDate": 1735702863000,
            "Source": "corporate_action"
        },
        {
            "Title": "Stylam Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Stylam Industries Ltd. on the National Stock Exchange (NSE). Approximately 386,634 shares were traded at a price of Rs. 2414.90 per share, totaling Rs. 93.37 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1734493600000,
            "Source": "block_deals"
        },
        {
            "Title": "Stylam Industries: Projects Robust Revenue Growth for FY26-27",
            "Summary": "Stylam Industries expects revenue growth of 26-30% in fiscal years 2026 and 2027.",
            "Sentiment": "positive",
            "PublishDate": 1729241844000,
            "Source": "normal_news"
        },
        {
            "Title": "Stylam Industries Reports Q2 EBITDA Growth",
            "Summary": "<p>Stylam Industries has announced its <span class='neutral'>Q2 financial results</span>. The company's <span class='positive'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) <span class='positive'>increased</span> to <b>544 million rupees</b>, up from 473 million rupees in the same quarter last year. Additionally, the EBITDA margin <span class='positive'>improved</span> to <b>20.70%</b> from 20.20% year-over-year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728979983000,
            "Source": "result"
        },
        {
            "Title": "Stylam Industries Reports Q2 Revenue Decline",
            "Summary": "<p><span class='neutral'>Stylam Industries</span> has reported a <span class='neutral'>revenue</span> of <b>2.62 billion rupees</b> for the second quarter, <span class='negative'>down</span> from <b>3.34 billion rupees</b> in the same period last year, representing a year-over-year <span class='negative'>decrease</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728979845000,
            "Source": "result"
        },
        {
            "Title": "Stylam Industries Reports Q2 Net Profit Increase",
            "Summary": "<p><span class=\"neutral\">Stylam Industries</span> has reported a <span class=\"positive\">net profit</span> of <b>341 million rupees</b> for the second quarter, compared to <b>317 million rupees</b> in the same period last year, representing a <span class=\"positive\">year-over-year increase</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728979812000,
            "Source": "result"
        },
        {
            "Title": "Stylam Industries Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class='neutral'>Stylam Industries</span> has announced a <b>board meeting</b> to be held on <span class='neutral'>October 15</span> to <span class='neutral'>consider and approve</span> the <b>financial results</b> for the <span class='neutral'>second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728301425000,
            "Source": "corporate_action"
        }
    ]
}