{
    "Symbol": "STYRENIX",
    "ISIN": "INE189B01011",
    "News": [
        {
            "Title": "Styrenix Q3 FY26 Results: Revenue Dips 6.2% YoY",
            "Summary": "Styrenix Performance Materials reported Q3 FY26 standalone revenue of INR648.8 crores, down 6.2% YoY, while EBITDA remained flat at INR75.7 crores with improved margins at 11.7%.",
            "Sentiment": "neutral",
            "PublishDate": 1770637656282,
            "Source": "co_actions_results"
        },
        {
            "Title": "Styrenix Gets Income Tax Order with No Demand for AY 2013-14",
            "Summary": "Styrenix Performance Materials receives Income Tax order for AY 2013-14 related to transfer pricing matter with no tax demand as additions offset against business losses.",
            "Sentiment": "neutral",
            "PublishDate": 1769678617647,
            "Source": "stocks"
        },
        {
            "Title": "Styrenix Performance Materials Q3 Net Profit Falls 66%",
            "Summary": "Styrenix Performance Materials reports consolidated net profit of ₹160 million in Q3, marking a significant 66% decline from ₹470 million in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1769674733681,
            "Source": "co_actions_results"
        },
        {
            "Title": "Styrenix Reports Physical Share Transfer Status",
            "Summary": "Styrenix Performance Materials submits compliance report to BSE and NSE regarding re-lodgement of physical share transfer requests under SEBI's special window from November to December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768463249459,
            "Source": "stocks"
        },
        {
            "Title": "Styrenix Gets GST Order with ₹23.69L Demand for FY19",
            "Summary": "Styrenix Performance Materials receives GST order from Assistant Commissioner demanding ₹23.69 lakh plus interest and penalty for E-way bill discrepancies in FY 2018-19. Company states no material impact.",
            "Sentiment": "negative",
            "PublishDate": 1767098735244,
            "Source": "stocks"
        },
        {
            "Title": "Styrenix Gets ₹1.03 Cr Tax Demand Order from CIT(A)",
            "Summary": "Styrenix Performance Materials receives income tax appellate order confirming ₹1.03 crore demand for AY 2016-17. Company plans to appeal before Income Tax Appellate Tribunal.",
            "Sentiment": "negative",
            "PublishDate": 1766582532536,
            "Source": "stocks"
        },
        {
            "Title": "Styrenix Performance Materials Faces GST Demand of INR 931,793 for FY2018-19",
            "Summary": "Styrenix Performance Materials Limited received a GST order demanding INR 931,793 plus interest and penalty for discrepancies between E-Way Bill and GSTR1 filings for Financial Year 2018-19. The company states there is no material impact on its operations and plans to assess its right to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1764681839479,
            "Source": "stock"
        },
        {
            "Title": "Styrenix Performance Materials Reports Q2 FY26 Results with 8.1% Volume Growth",
            "Summary": "Styrenix Performance Materials reported Q2 FY26 sales volume of 45.2 KT (up 8.1% YoY) with revenue of INR 615 crores and PBDIT of INR 81.8 crores at 13.3% margin. The company continues its Phase 1 ABS expansion scheduled for mid-to-end of next financial year while Thailand operations remain at lower utilization with 32 KT volumes in H1.",
            "Sentiment": "neutral",
            "PublishDate": 1763550676936,
            "Source": "earnings"
        },
        {
            "Title": "Styrenix Performance Materials Reports Mixed Q2 Results with Revenue Decline",
            "Summary": "Styrenix Performance Materials Limited announced its quarterly results for the quarter ended September 30, 2025. On a standalone basis, the company reported total income of INR 772.00 crores compared to INR 858.50 crores in the previous quarter. The company posted a profit of INR 56.15 crores for the quarter. On a consolidated basis, total income was INR 772.90 crores with a profit of INR 49.61 crores. The company operates in Engineering Polymers segment and completed a merger of its wholly owned step-down subsidiaries in Thailand during the quarter, with Styrenix Performance Materials (Thailand) Ltd continuing as the surviving entity. The Board of Directors approved the standalone and consolidated unaudited financial results at their meeting held on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762962352257,
            "Source": "earnings"
        },
        {
            "Title": "Styrenix Performance Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Styrenix Performance announced Q2 financial results showing consolidated net profit declined to 447 million rupees from 701 million rupees year-over-year. Consolidated revenue increased to 8 billion rupees from 6.5 billion rupees. Consolidated EBITDA dropped to 584 million rupees from 990 million rupees, with EBITDA margin falling to 10.7% from 15.13%. On a standalone basis, net profit decreased to 508 million rupees from 701 million rupees, while standalone revenue declined to 6.15 billion rupees from 6.5 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1762942245904,
            "Source": "earnings"
        },
        {
            "Title": "Styrenix Performance Materials Reports Record Quarterly Sales Volume in Q1 FY26 Results",
            "Summary": "Styrenix Performance Materials Limited reported record quarterly sales volume of 51,000 tons in Q1 FY26. The company's standalone revenue reached INR 721 crores, up 28.85% quarter-on-quarter and 3.1% year-on-year, with EBITDA of INR 86.1 crores representing an 11.9% margin. Consolidated revenue was INR 943.5 crores with EBITDA of INR 99.8 crores at 10.6% margin. The consolidated results include Thailand operations acquired in January 2025, which currently operates at 50-55% capacity utilization. The company completed its debottlenecking exercise and achieved a 20% increase in HRG capacity. Management remains confident of meeting 10-12% volume growth target for FY26 despite seasonal slowdowns in air conditioning segment. The company maintains 60-70% share in the specialty ABS segment while overall ABS demand in India remains robust with approximately 50% still met through imports.",
            "Sentiment": "positive",
            "PublishDate": 1755881577413,
            "Source": "earnings"
        },
        {
            "Title": "Styrenix Performance Materials Enhances Product Range and Expands Export Markets",
            "Summary": "Styrenix Performance Materials is enhancing its product range towards specialty ABS grades and expanding export markets. The company is capitalizing on demand growth in automotive and consumer goods sectors to increase profits.",
            "Sentiment": "positive",
            "PublishDate": 1755103929128,
            "Source": "stock"
        },
        {
            "Title": "Styrenix Performance Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Styrenix Performance announced quarterly results showing revenue growth to 7.2 billion rupees from 6.99 billion rupees year-over-year. However, the company experienced declining profitability with net profit falling to 549 million rupees from 612 million rupees compared to the same period last year. EBITDA also decreased to 840 million rupees from 897 million rupees year-over-year, while EBITDA margin compressed to 11.65% from 12.84% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755098042780,
            "Source": "earnings"
        },
        {
            "Title": "Styrenix Performance Materials Declares Rs. 31 Interim Dividend, Approves Q1 FY2026 Results",
            "Summary": "Styrenix Performance Materials Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company declared an interim dividend of Rs. 31 per equity share of Rs. 10 each for FY 2025-26, with the record date fixed as August 21, 2025. The dividend will be paid within prescribed timelines. The Board meeting was held on August 13, 2025, commencing at 16:01 hours and concluding at 16:25 hours. The financial results were accompanied by a limited review report from auditors Talati & Talati LLP.",
            "Sentiment": "positive",
            "PublishDate": 1755088710092,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Materials Schedules Board Meeting for Q1 Results and Potential Interim Dividend",
            "Summary": "Styrenix Performance Materials Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider and approve standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The board will also consider declaring an interim dividend for Financial Year 2025-26. The trading window for designated persons remains closed from July 1, 2025, until 48 hours after the financial results declaration, ending on August 15, 2025. The company trades on BSE under scrip code 506222 and on NSE under the symbol STYRENIX.",
            "Sentiment": "neutral",
            "PublishDate": 1754590913247,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Materials to Acquire Stake in Clean Max Jasper",
            "Summary": "Styrenix Performance Materials has announced plans to acquire a 36.13% equity stake in Clean Max Jasper Private Limited (CMJPL). The company intends to invest up to 76.7 million rupees for this acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1738801090000,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Materials to Acquire Stake in Clean Max Jasper",
            "Summary": "Styrenix Performance Materials has announced plans to acquire a 36.13% equity stake in Clean Max Jasper. The company intends to invest up to 76.7 million rupees in this acquisition. This move suggests Styrenix is expanding its portfolio or potentially entering into the renewable energy sector, given Clean Max Jasper's likely involvement in clean energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1738763238000,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Materials Completes Acquisition of INEOS Thailand",
            "Summary": "Styrenix Performance Materials has announced that its subsidiary has completed the acquisition of 100% shareholding in INEOS Thailand. This strategic move represents a significant corporate action that expands Styrenix's presence in the Thai market.",
            "Sentiment": "positive",
            "PublishDate": 1737115367000,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Materials: Last Day to Buy for Rs 31 Interim Dividend",
            "Summary": "Styrenix Performance Materials has declared an interim dividend of Rs 31 per share for FY 2024-25. The record date is set for December 17, making today the last opportunity to purchase shares and be eligible for the dividend. The stock has shown significant performance, with a 108.2% return in the current calendar year.",
            "Sentiment": "positive",
            "PublishDate": 1734241852000,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Material Announces Dividend of 31 Rupees Per Share",
            "Summary": "Styrenix Performance Material has declared a dividend of 31 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1733729506000,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Material to Establish Subsidiary in Thailand",
            "Summary": "Styrenix Performance Material has approved the incorporation of a step-down subsidiary in Thailand. The deal is valued at USD 20 million.",
            "Sentiment": "positive",
            "PublishDate": 1733729436000,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Materials: Board to Consider Interim Dividend on Dec 9",
            "Summary": "Styrenix Performance Materials Ltd has scheduled a board meeting on December 9, 2024, to consider an interim dividend for FY 2024-25. The record date is set for December 17, 2024. The company has closed its trading window for designated persons from December 4 until 48 hours after the board meeting's outcome is announced.",
            "Sentiment": "neutral",
            "PublishDate": 1733327123000,
            "Source": "corporate_action"
        },
        {
            "Title": "Styrenix Performance Reports Q2 EBITDA Growth",
            "Summary": "Styrenix Performance has announced its Q2 financial results, showing an improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 828 million rupees to 990 million rupees, while the EBITDA margin rose from 13.90% to 15.16%.",
            "Sentiment": "positive",
            "PublishDate": 1730126759000,
            "Source": "result"
        },
        {
            "Title": "Styrenix Performance Reports Q2 Financial Results",
            "Summary": "Styrenix Performance announced its Q2 financial results. The company reported a net profit of 701 million rupees, up from 564 million rupees year-over-year and 612 million rupees quarter-over-quarter. Revenue for Q2 stood at 6.5 billion rupees, compared to 5.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730126706000,
            "Source": "result"
        }
    ]
}