{
    "Symbol": "SUBEXLTD",
    "ISIN": "INE754A01055",
    "News": [
        {
            "Title": "Subex Q3FY26 Revenue Grows 2.7% QoQ to ₹7,079 Lakhs",
            "Summary": "Subex Limited reports Q3FY26 revenue of ₹7,079 lakhs with 2.7% QoQ growth. Normalized EBITDA surges 27.3% to ₹929 lakhs, while normalized PAT doubles to ₹768 lakhs driven by operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1770799525769,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subex Secures USD 1.25 Million MEA Telecom Contract",
            "Summary": "Subex Limited announces a 3-year Business Assurance engagement worth USD 1.25 million with a leading Tier-1 telecom operator in the Middle East to implement next-generation platform solutions.",
            "Sentiment": "positive",
            "PublishDate": 1770731620364,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subex Secures Deal with North American AI Expert",
            "Summary": "Subex has successfully won a deal with a North American AI expert, marking a significant business development for the company in the artificial intelligence sector.",
            "Sentiment": "positive",
            "PublishDate": 1770303518865,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subex receives ₹4.17 cr income tax refund",
            "Summary": "Subex Limited received an income tax refund of ₹4.17 crores for assessment year 2004-05, including ₹2.10 crores in interest, following a High Court order.",
            "Sentiment": "positive",
            "PublishDate": 1768810812056,
            "Source": "stocks"
        },
        {
            "Title": "Subex Q3FY26 earnings call set for February 11, 2026",
            "Summary": "Subex Limited announces Q3FY26 results on February 10, 2026, followed by earnings call on February 11, 2026 at 10:30 AM IST. Management team including MD & CEO Ms. Nisha Dutt will participate.",
            "Sentiment": "neutral",
            "PublishDate": 1768371765914,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subex Q3FY26 Results & Earnings Call Scheduled",
            "Summary": "Subex Limited will announce Q3FY26 financial results on February 10, 2026, followed by an earnings call on February 11, 2026, at 10:30 AM IST to discuss quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768304045597,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subex Appoints Alok Ohrie as Independent Director",
            "Summary": "Subex Limited has appointed former Dell Technologies India President Alok Ohrie as Additional Director (Non-Executive, Independent) effective January 4, 2026, for a three-year term subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767507335243,
            "Source": "stocks"
        },
        {
            "Title": "Subex receives ₹5.84 crore income tax refund",
            "Summary": "Subex Limited received an income tax refund of ₹5.84 crores for AY 2011-12, including ₹1.94 crores interest, following High Court order implementation.",
            "Sentiment": "positive",
            "PublishDate": 1767013495667,
            "Source": "stocks"
        },
        {
            "Title": "Subex Wins $1M Five-Year European Contract",
            "Summary": "Subex secures comprehensive five-year contract worth approximately $1 million with major European energy and telecom provider for fraud management solutions and services.",
            "Sentiment": "positive",
            "PublishDate": 1765376547812,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subex Secures USD 1 Million 5-Year Fraud Management Deal with Major European Energy-Telecom Provider",
            "Summary": "Subex Limited won a 5-year contract worth around USD 1 million with one of Europe's largest integrated energy and telecommunications providers to deliver fraud management software, business consulting, training, managed services and support. The engagement strengthens Subex's expanding footprint in Europe and will be delivered from the company's EU offices, marking a significant new logo win for the telecom AI solutions provider.",
            "Sentiment": "positive",
            "PublishDate": 1765347722969,
            "Source": "stock"
        },
        {
            "Title": "NCLT Approves Liquidation of Subex's Account Aggregator Services Unit",
            "Summary": "The National Company Law Tribunal has approved the liquidation of Subex Account Aggregator Services, a subsidiary unit of Subex. This regulatory approval allows the company to proceed with winding down operations of its account aggregator services business.",
            "Sentiment": "neutral",
            "PublishDate": 1764593002531,
            "Source": "corporate_action"
        },
        {
            "Title": "Subex Launches New Brand Identity Emphasizing AI-Driven Telecom Solutions",
            "Summary": "Subex unveiled a new brand identity featuring a redesigned logo that reflects the convergence of business and technology. The rebranding focuses on the company's AI-driven telecom solutions and enhanced customer experience offerings.",
            "Sentiment": "positive",
            "PublishDate": 1763527608168,
            "Source": "stock"
        },
        {
            "Title": "Subex Limited Returns to Profitability in Q2 FY26 After Two Years",
            "Summary": "Subex Limited achieved operational profitability for the first time since June 2022, reporting PAT positive results without exceptional items and quarterly revenue of INR 68.9 crores against INR 66.4 crores in the previous quarter. The company announced deals worth INR 15 million and plans to reconstitute its board before Q3 results following the departure of its chairman and two independent directors after the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1763523315579,
            "Source": "earnings"
        },
        {
            "Title": "Subex Limited Reports Q2 FY26 Results with 4% Revenue Growth and Return to Profitability",
            "Summary": "Subex Limited reported quarterly revenue of ₹6,891 lakhs, representing a 4% quarter-on-quarter growth driven by improved project execution. The company achieved normalized EBITDA of ₹730 lakhs compared to ₹428 lakhs in Q1 FY26, supported by stronger contribution margins. Normalized profit before tax stood at ₹524 lakhs versus ₹271 lakhs in the previous quarter, excluding one-time gains of ₹14 crores from IT refund interest and lease termination gains. The company recorded normalized profit after tax of ₹388 lakhs, marking its first quarter of sustained profitability driven purely by operational performance. Earnings per share for Q2 FY26 was ₹0.05. Days sales outstanding stood at 100 days versus 96 days in Q1 FY26, while closing cash position remained stable at ₹13,589 lakhs. The company announced deals worth over $15 million in recent months, secured new opportunities in APAC and Europe, and renewed managed services contracts with Tier-1 operators. Subex onboarded a new Sales Head based in Europe and is building an AI-native workforce.",
            "Sentiment": "positive",
            "PublishDate": 1762908114528,
            "Source": "earnings"
        },
        {
            "Title": "Subex Reports Q2 Results with Revenue Growth and Stock Option Grant",
            "Summary": "Subex Limited announced its quarterly results for the quarter and six months ended September 30, 2025. The company's board approved the unaudited standalone and consolidated financial results and granted 6,00,000 stock options to eligible employees under the ESOP 2025 Scheme. The telecom AI solutions company reported revenue from operations of Rs 5,851 lakhs for the quarter compared to Rs 5,140 lakhs in the previous quarter. For the six months period, revenue stood at Rs 10,991 lakhs versus Rs 10,465 lakhs in the corresponding period last year. The company will host a conference call on November 12, 2025 to discuss the results.",
            "Sentiment": "positive",
            "PublishDate": 1762857276823,
            "Source": "earnings"
        },
        {
            "Title": "Subex Reports Q2 Revenue of 689 Million Rupees, Down from 742 Million Year-Over-Year",
            "Summary": "Subex reported quarterly revenue of 689 million rupees compared to 742 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1762853085236,
            "Source": "earnings"
        },
        {
            "Title": "Subex Reports Strong Q2 Performance with EBITDA Rising to 63M Rupees",
            "Summary": "Subex reported quarterly EBITDA of 63 million rupees compared to 19 million rupees in the same period last year. The company's EBITDA margin improved to 9.11% from 2.55% year-over-year. Consolidated net profit reached 29 million rupees versus 6.2 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762852509006,
            "Source": "earnings"
        },
        {
            "Title": "Subex Limited Schedules Q2FY26 Earnings Call for November 12, 2025",
            "Summary": "Subex Limited will announce its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, on November 11, 2025. The company will host an earnings call on November 12, 2025, at 11:30 A.M. IST to discuss the Q2FY26 financial results. The call will feature management representation including Managing Director & CEO Ms. Nisha Dutt, VP-Corporate Strategy Mr. Harsha Angeri, and Chief Financial Officer Mr. Sumit Kumar. Subex is a telecom AI company that enables connected experiences for communication service providers globally, with more than 300 installations across 90 countries.",
            "Sentiment": "neutral",
            "PublishDate": 1762200201475,
            "Source": "earnings"
        },
        {
            "Title": "Subex Chief Human Resources Officer Asha Subramanian Resigns",
            "Summary": "Asha Subramanian has resigned from her position as Chief Human Resources Officer at Subex Limited to pursue opportunities outside the company. Her resignation becomes effective from the close of business hours on October 30, 2025. Subramanian submitted her resignation letter in September 2025, citing the exposure, executive presence, and learning opportunities she gained during her tenure at Subex. The company has disclosed this senior management change to stock exchanges BSE and NSE as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761855379680,
            "Source": "corporate_governance"
        },
        {
            "Title": "Subex Secures $1.2 Million Five-Year Fraud Management Contract in Middle East",
            "Summary": "Subex has entered into a $1.2 million contract with a major communications provider in the Middle East for a five-year fraud management upgrade. The deal represents a significant business win for the company in the telecommunications fraud prevention sector.",
            "Sentiment": "positive",
            "PublishDate": 1760432672880,
            "Source": "stock"
        },
        {
            "Title": "Subex Secures $1.67 Million Five-Year Contract with Asia-Pacific Telecom Operator",
            "Summary": "Subex has signed a $1.67 million contract spanning five years with a major telecommunications company in the Asia-Pacific region. The agreement involves implementing Subex's Hypersense platform to enhance the telecom operator's revenue assurance and fraud management capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1760088890108,
            "Source": "order&deals"
        },
        {
            "Title": "Subex Secures $6.62 Million Contract from Dutch Telecom for MVNO Billing Services",
            "Summary": "Subex has been selected by a Dutch telecom company to provide MVNO billing services. The contract is valued at $6.62 million and includes full managed services to be delivered from Subex's UK data center.",
            "Sentiment": "positive",
            "PublishDate": 1760016692108,
            "Source": "order&deals"
        },
        {
            "Title": "Subex Extends 5-Year Partnership with Major APAC Telecom Operator",
            "Summary": "Subex has continued its 5-year partnership agreement with a major telecommunications operator in the Asia-Pacific region. The partnership extension maintains Subex's business relationship with the telecom company in the APAC market.",
            "Sentiment": "positive",
            "PublishDate": 1759232470048,
            "Source": "stock"
        },
        {
            "Title": "Subex Limited Announces Board Transition as Two Independent Directors Resign",
            "Summary": "Subex Limited announced board changes following its Annual General Meeting, with two Independent Directors tendering their resignations. The company expressed appreciation for their contributions and assured stakeholders that operations, customer commitments, and strategic priorities will continue seamlessly. The management team remains committed to driving business outcomes while maintaining the strategic roadmap focused on sustainable growth, innovation, and customer success. The Board is initiating a structured search for new directors to bring diverse expertise and strengthen governance. MD & CEO Nisha Dutt stated that the company's fundamentals remain solid and the transformation journey continues with clarity and momentum, emphasizing commitment to transparency and delivering value to shareholders and customers.",
            "Sentiment": "neutral",
            "PublishDate": 1759232257226,
            "Source": "corporate_governance"
        },
        {
            "Title": "Subex Recognized in 2025 Gartner Magic Quadrant for AI in CSP Operations for Second Consecutive Year",
            "Summary": "Subex, a global leader in AI-driven telecom solutions, has been recognized for the second consecutive year in the 2025 Gartner Magic Quadrant for AI in CSP Customer and Business Operations. The recognition highlights Subex's capabilities in helping Communication Service Providers harness AI for operational excellence and customer experience enhancement. According to Subex, this inclusion demonstrates their ability to deliver measurable outcomes across fraud management, revenue assurance, and partner settlement. MD & CEO Nisha Dutt stated that the company has focused on Generative and Agentic AI over the past year, co-innovating with customers to address critical challenges. Subex operates in over 100 countries with more than 300 installations and offers solutions through their HyperSense portfolio covering Business Assurance, Fraud Management, and Wholesale Revenue Management.",
            "Sentiment": "positive",
            "PublishDate": 1758519724513,
            "Source": "stock"
        },
        {
            "Title": "Subex Limited Reports Mixed Q1 FY26 Results with Revenue Decline but Return to Profitability",
            "Summary": "Subex Limited reported quarterly results with revenue declining to INR 664 million from INR 706 million in the previous quarter. The company returned to profitability with normalized PAT of INR 128 million compared to negative INR 6.6 million in the previous quarter. The positive results were aided by a tax refund of INR 34 crore and office optimization gains. CEO Nisha Dutt attributed the subdued top-line performance to slow order intake in the previous financial year, with deals shifting between quarters due to budgetary and geopolitical reasons. The company launched FraudZap, an AI-powered fraud detection platform targeting smaller telcos and MVNOs, and enhanced its HyperSense platform with GenAI capabilities. Subex secured a major Tier-1 contract win in the Middle East and renewed an AI-based managed services contract with a Tier-1 operator in Africa. The company reduced Sectrio operations to 2 employees and plans to invest INR 35 crore in its Middle East subsidiary to support growth opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1755502537696,
            "Source": "earnings"
        },
        {
            "Title": "Subex Leverages AI for Fraud Management and Telecom Revenue Growth",
            "Summary": "Subex is utilizing artificial intelligence technology for fraud management while generating strong revenue from the telecom sector. The company has secured key wins and maintains high customer loyalty, positioning itself for profitable global expansion.",
            "Sentiment": "positive",
            "PublishDate": 1754923289827,
            "Source": "stock"
        },
        {
            "Title": "SUBEX Reports Q1 Net Profit of 128M Rupees, Reversing Previous Year Loss",
            "Summary": "SUBEX posted a consolidated net profit of 128 million rupees in Q1, compared to a loss of 112 million rupees in the same period last year. The company's Q1 revenue was 664 million rupees, down from 682 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754914204303,
            "Source": "earnings"
        },
        {
            "Title": "Subex Limited Schedules Q1 FY26 Earnings Call for August 12, 2025",
            "Summary": "Subex Limited will announce its unaudited financial results for the quarter ended June 30, 2025, on August 11, 2025. The company has scheduled an earnings call for August 12, 2025, at 05:00 P.M. (IST) to discuss these quarterly results. The call will be attended by key management including Managing Director & CEO Ms. Nisha Dutt, VP-Corporate Strategy Mr. Harsha Angeri, and Chief Financial Officer Mr. Sumit Kumar. Subex is a telecom AI company that provides analytics solutions to communication service providers globally, with over 300 installations across 90+ countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753447378930,
            "Source": "earnings"
        },
        {
            "Title": "Subex Limited Schedules Board Meeting for Q1 FY26 Results on August 11, 2025",
            "Summary": "Subex Limited will hold a board meeting on August 11, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company has scheduled an earnings conference call on August 12, 2025 at 5:00 PM IST to discuss quarterly performance. The trading window has been closed from July 1, 2025 until 48 hours after the financial results declaration. Management representation will include Managing Director & CEO Nisha Dutt, VP Corporate Strategy Harsha Angeri, and Chief Financial Officer Sumit Kumar. Subex is a telecom analytics solution provider with over 300 installations across 90+ countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753175016565,
            "Source": "earnings"
        },
        {
            "Title": "Subex Launches FraudZap™ for Handset Fraud Detection",
            "Summary": "Subex has introduced a new lightweight fraud detection tool called FraudZap™. The initial focus of this tool is on detecting handset fraud in the telecommunications industry.",
            "Sentiment": "positive",
            "PublishDate": 1751301904000,
            "Source": "default"
        },
        {
            "Title": "Subex Integrates Embedded GenAI into HyperSense Platform",
            "Summary": "Subex has integrated embedded Generative AI into its HyperSense platform, enhancing AI-native telecom intelligence capabilities. This integration aims to improve the platform's functionality for telecom operators.",
            "Sentiment": "positive",
            "PublishDate": 1750636765000,
            "Source": "default"
        },
        {
            "Title": "Subex Integrates GenAI into Hypersense Platform",
            "Summary": "Subex has integrated embedded Generative AI (GenAI) into its Hypersense platform, enhancing its telecom intelligence capabilities. This integration aims to bring AI-native solutions to the telecommunications industry, potentially improving data analysis and decision-making processes.",
            "Sentiment": "positive",
            "PublishDate": 1750414400000,
            "Source": "default"
        },
        {
            "Title": "Subex Reports Q4 and Full Year Financial Results",
            "Summary": "Subex has reported its Q4 and full year financial results. The company posted a Q4 net loss of 176 million rupees, compared to a loss of 1.57 billion rupees in the same quarter last year. Q4 revenue decreased to 706 million rupees from 838 million rupees year-over-year. The company also reported an EBITDA loss of 130 million rupees in Q4, compared to a gain of 31 million rupees in the previous year. For the full year, Subex had an exceptional item of 1.48 billion rupees in the previous year's result.",
            "Sentiment": "negative",
            "PublishDate": 1746189802000,
            "Source": "result"
        },
        {
            "Title": "Subex to Consider Q4 Results on May 2",
            "Summary": "Subex Limited has announced that it will consider its fourth quarter (Q4) financial results on May 2. This is a routine announcement regarding the company's upcoming earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1745411730000,
            "Source": "default"
        },
        {
            "Title": "Subex Secures £5 Million Contract",
            "Summary": "Subex, a telecommunications software company, has won a new order worth 5 million pounds (approximately 50 crore rupees). This significant contract represents a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1742886463000,
            "Source": "order&deals"
        },
        {
            "Title": "SUBEX Reports Significant Improvement in Q3 EBITDA",
            "Summary": "SUBEX has reported a substantial increase in its Q3 EBITDA, which rose to 25 million rupees compared to 6 million rupees in the same quarter of the previous year. The company's EBITDA margin also improved significantly, reaching 3.44% in Q3, up from 0.70% in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739348419000,
            "Source": "earnings"
        },
        {
            "Title": "Subex Reports Reduced Q3 Net Loss and Lower Revenue",
            "Summary": "Subex, an Indian software company, has reported its financial results for the third quarter. The company's consolidated net loss narrowed to 33 million rupees, compared to a loss of 49 million rupees in the same period last year. However, revenue declined to 727 million rupees from 818 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739348355000,
            "Source": "earnings"
        },
        {
            "Title": "Subex's In-Principle Approval Revoked",
            "Summary": "Subex Limited has announced that an in-principle approval, which was previously granted based on the company's request, has been revoked. The specific nature of the approval and the reasons for its revocation are not provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1733391994000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Subex to Surrender RBI Approval for Account Aggregator Services",
            "Summary": "Subex has decided to surrender the in-principle approval granted by the Reserve Bank of India (RBI) to its subsidiary, Subex Account Aggregator Services Private Limited. This approval was likely related to providing account aggregation services in the financial sector.",
            "Sentiment": "neutral",
            "PublishDate": 1733391949000,
            "Source": "corporate_action"
        },
        {
            "Title": "Subex Reports Improved Q2 EBITDA Performance",
            "Summary": "Subex, a telecommunications software company, has reported a significant improvement in its Q2 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company turned a loss of 45 million rupees in the previous year into a gain of 19 million rupees this quarter. Additionally, Subex's Q2 EBITDA margin improved to 2.55% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731055005000,
            "Source": "result"
        },
        {
            "Title": "Subex Reports Q2 Revenue Decline",
            "Summary": "Subex, a telecommunications software company, reported a revenue of 742 million rupees for the second quarter, down from 768 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731054969000,
            "Source": "result"
        },
        {
            "Title": "Subex Reports Improved Q2 EBITDA Performance",
            "Summary": "Subex, a telecommunications software company, has reported a significant improvement in its Q2 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company achieved an EBITDA gain of 19 million rupees, compared to a loss of 45 million rupees in the same quarter of the previous year. Additionally, Subex's Q2 EBITDA margin stood at 2.55%.",
            "Sentiment": "positive",
            "PublishDate": 1731054965000,
            "Source": "result"
        },
        {
            "Title": "Subex Reports Profit in Q2 FY2024",
            "Summary": "Subex Limited, an Indian software company, has reported a consolidated net profit of 6.2 million rupees in the second quarter of the current fiscal year. This marks a significant turnaround from the 110 million rupee loss reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731054882000,
            "Source": "result"
        },
        {
            "Title": "Subex to Consider Q2 Results on November 8",
            "Summary": "Subex Limited has announced that it will consider and approve its financial results for the second quarter of the fiscal year on November 8.",
            "Sentiment": "neutral",
            "PublishDate": 1730292106000,
            "Source": "result"
        }
    ]
}