{
    "Symbol": "SUBROS",
    "ISIN": "INE287B01021",
    "News": [
        {
            "Title": "Subros Announces Postal Ballot for Director Appointments",
            "Summary": "Subros Limited seeks shareholder approval for appointing Naohisa Kuriyama as Nominee Director and Tsunenobu Hori as Alternate Director through postal ballot with remote e-voting from February 11 to March 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770728097878,
            "Source": "stocks"
        },
        {
            "Title": "Subros Q3FY26 Results: Revenue Up 15.4% YoY",
            "Summary": "Subros Limited reported Q3FY26 revenue of Rs. 94,768 lakhs, up 15.4% YoY. Net profit reached Rs. 3,484 lakhs vs Rs. 3,284 lakhs in Q3FY25. Board approved capacity expansion at Gujarat facility.",
            "Sentiment": "positive",
            "PublishDate": 1769780352038,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subros Wins ₹1280 Cr Electric Compressor Deal",
            "Summary": "Subros Ltd secures major business award from Maruti Suzuki for supplying electric compressors for hybrid vehicles worth ₹1280 crores over seven years, strengthening partnerships with MSIL and Denso Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1769671416537,
            "Source": "co_actions_results"
        },
        {
            "Title": "Subros Clarifies Volume Surge is Market Driven",
            "Summary": "Subros Limited responds to BSE inquiry about increased trading volume, stating no undisclosed price-sensitive information and attributing surge to market forces under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767604714702,
            "Source": "stocks"
        },
        {
            "Title": "Subros Limited Secures Rs. 52.18 Crore Railway Maintenance Contract",
            "Summary": "Subros Limited has secured a comprehensive annual maintenance contract for Cab HVAC Units from Indian Railways worth Rs. 52.18 crores, to be completed over three years. This expands the company's railway segment operations into service contracts beyond equipment supply, bringing their cumulative railway order booking to Rs. 86.35 crores for the financial year.",
            "Sentiment": "positive",
            "PublishDate": 1764829342588,
            "Source": "order&deals"
        },
        {
            "Title": "Subros Targets Growth Above Industry Rate and 12% Margins by FY27",
            "Summary": "Subros expects to achieve growth exceeding the industry's 3-4% rate and aims for 12% margins by FY27, unless market disruptions occur. The company anticipates better growth in FY27 compared to the current year but has not provided specific forecasts, emphasizing the need to evaluate whether the current demand increase is sustainable. The truck business revenue is projected to exceed ₹200 crore this year, up from ₹125 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1762831835265,
            "Source": "stock"
        },
        {
            "Title": "Subros Plans Multi-Segment Expansion Beyond Auto Thermal Systems",
            "Summary": "Subros is diversifying its thermal systems business into rail, electric vehicle, and non-automotive segments. The company holds a 42% market share in passenger car air conditioning systems and operates through a collaboration with Denso and Suzuki. Subros is scaling its research and development capabilities and backward integration to develop energy-efficient products. The expansion strategy leverages 8 manufacturing plants across India as the company positions itself as India's largest integrated thermal products manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1762786901067,
            "Source": "stock"
        },
        {
            "Title": "Subros Reports Mixed Q2 Results with Higher Profit but Lower Margins",
            "Summary": "Subros reported Q2 net profit of 406 million rupees, up from 365 million rupees in the same period last year. Revenue increased to 8.78 billion rupees from 8.28 billion rupees year-over-year. However, EBITDA declined to 685 million rupees from 765 million rupees, while EBITDA margin compressed to 7.78% from 9.23% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762773478211,
            "Source": "earnings"
        },
        {
            "Title": "Subros Limited Secures Rs. 27 Crore Contract from Indian Railways for Locomotive Air-Conditioning Equipment",
            "Summary": "Subros Limited has been awarded a contract worth approximately Rs. 27 crores by Indian Railways' Banaras Locomotive Works, Varanasi. The contract involves supplying cabin air-conditioning equipment for Diesel Electric Locomotives. The total value includes Rs. 22.78 crores plus GST of Rs. 4.10 crores. The project is scheduled to be completed in phases by October 16, 2026. The contract follows standard terms and conditions of Indian Railways and involves no related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1761396148243,
            "Source": "order&deals"
        },
        {
            "Title": "Subros Limited Secures ₹27 Crore Air-Conditioning Systems Order from Indian Railways",
            "Summary": "Subros Limited has won a ₹27 crore order from Indian Railways for air-conditioning systems following a bidding process. The contract involves supplying air-conditioning systems to the railway operator.",
            "Sentiment": "positive",
            "PublishDate": 1760682390543,
            "Source": "order&deals"
        },
        {
            "Title": "Subros Targets Leadership Across Multiple Thermal Segments with EV and Commercial Vehicle Expansion",
            "Summary": "Subros is positioning itself to become a leader in multiple thermal segments through strategic wins in electric vehicles, railway, and commercial vehicles. The company is focusing on maintaining stable margins while expanding capacity to support long-term sustainable development across these diversified business segments.",
            "Sentiment": "positive",
            "PublishDate": 1754576691144,
            "Source": "stock"
        },
        {
            "Title": "Subros Limited Reports Q1 FY26 Financial Results with Revenue of Rs 87,825 Lakhs",
            "Summary": "Subros Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 87,825 lakhs compared to Rs 80,982 lakhs in the same quarter last year and Rs 90,846 lakhs in the previous quarter. Net profit for the quarter was Rs 4,066 lakhs versus Rs 3,491 lakhs in the corresponding quarter last year. Total comprehensive income stood at Rs 4,052 lakhs. Earnings per share was Rs 6.23 for the quarter. On a consolidated basis, the company reported similar figures with net profit of Rs 4,083 lakhs and earnings per share of Rs 6.26. The results include contributions from joint venture Denso Subros Thermal Engineering Centre India Private Limited. The company operates in the thermal products segment.",
            "Sentiment": "positive",
            "PublishDate": 1754569495662,
            "Source": "earnings"
        },
        {
            "Title": "Subros Limited Schedules Board Meeting on August 7, 2025 to Approve Quarterly Financial Results",
            "Summary": "Subros Limited has scheduled a Board of Directors meeting on August 7, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company notified stock exchanges BSE and NSE about the scheduled board meeting through a formal communication signed by Company Secretary Kamal Samtani on July 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753532265393,
            "Source": "corporate_action"
        },
        {
            "Title": "Subros Limited Faces Rs. 35.08 Crore Customs Demand, Plans Appeal",
            "Summary": "Subros Limited received an order from the Principal Commissioner of Customs, Greater Noida, confirming demands totaling approximately Rs. 35.08 crores. The demand includes a redemption fine of Rs. 1 crore, differential duty of Rs. 16.54 crores, and penalties of Rs. 1 crore and Rs. 16.54 crores. The customs department alleged incorrect availment of benefits under a notification and misclassification of components amounting to Rs. 4.83 crores and Rs. 11.71 crores respectively. The company will file an appeal with CESTAT and expects a favorable outcome at the appellate stage based on its legal counsel assessment. The company states there is no material impact on its financials, operations, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1753528883191,
            "Source": "stock"
        },
        {
            "Title": "Subros to Begin Manufacturing New Trucks with AC's from June 8",
            "Summary": "Subros is set to start manufacturing new trucks equipped with air conditioning systems from June 8. This move is in compliance with a government mandate regarding air conditioning in trucks.",
            "Sentiment": "positive",
            "PublishDate": 1749705468000,
            "Source": "default"
        },
        {
            "Title": "Subros Reports Improved Q4 EBITDA and Margin",
            "Summary": "Subros has reported its Q4 financial results. The company's EBITDA increased to 928 million rupees from 771 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 10.21% from 9.28% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747905475000,
            "Source": "result"
        },
        {
            "Title": "Subros Reports Increased Revenue and Profit in Q4",
            "Summary": "Subros has reported its quarterly financial results. The company's revenue for Q4 increased to 9.1 billion rupees from 8.3 billion rupees in the same quarter of the previous year. The net profit for Q4 rose to 462 million rupees, up from 307 million rupees in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747905466000,
            "Source": "result"
        },
        {
            "Title": "Subros Reports Improved Q3 EBITDA and Margin",
            "Summary": "Subros, an Indian automotive components manufacturer, has reported improved financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 758 million rupees from 594 million rupees in the same quarter of the previous year. Additionally, Subros' EBITDA margin improved to 9.24% from 8.10% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738227814000,
            "Source": "earnings"
        },
        {
            "Title": "Subros Reports Increased Q3 Profit and Revenue",
            "Summary": "Subros, an Indian automotive components manufacturer, has reported improved financial results for the third quarter. The company's net profit increased to 328 million rupees from 268 million rupees in the same period last year. Additionally, Subros saw a rise in revenue, reaching 8.2 billion rupees compared to 7.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738227704000,
            "Source": "earnings"
        },
        {
            "Title": "Subros Schedules Board Meeting for Q3 Results",
            "Summary": "Subros Limited has announced a board meeting scheduled for January 30 to consider and approve the company's financial results for the third quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1736949792000,
            "Source": "result"
        },
        {
            "Title": "Subros Reports Improved Q2 EBITDA and Margin",
            "Summary": "Subros, an automotive components manufacturer, has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 765 million rupees from 702 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 9.23% from 8.63% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730967423000,
            "Source": "result"
        },
        {
            "Title": "Subros Reports Q2 Revenue Growth",
            "Summary": "Subros, an Indian automotive components manufacturer, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 8.3 billion rupees, up from 8.1 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730967267000,
            "Source": "result"
        },
        {
            "Title": "Subros Reports 37% Increase in Q2 Net Profit",
            "Summary": "Subros Limited, an Indian automotive components manufacturer, has reported a net profit of 365 million rupees for the second quarter, compared to 267 million rupees in the same period last year. This represents a year-over-year increase of approximately 37%.",
            "Sentiment": "positive",
            "PublishDate": 1730967224000,
            "Source": "result"
        }
    ]
}