{
    "Symbol": "SUDARCOLOR",
    "ISIN": "INE492A01029",
    "News": [
        {
            "Title": "Sudarshan Colorants Q3FY26 Results & Board Changes",
            "Summary": "Sudarshan Colorants reports Q3FY26 net loss of ₹200 lakhs vs profit of ₹1,722 lakhs in Q3FY25. Board appoints new independent director and notes CFO resignation.",
            "Sentiment": "negative",
            "PublishDate": 1770126345777,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudarshan Colorants clarifies price movement",
            "Summary": "Sudarshan Colorants India Limited responds to BSE inquiry on recent share price volatility, confirming compliance with disclosure norms and attributing movement to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1769487959814,
            "Source": "stocks"
        },
        {
            "Title": "Heubach Colorants Auditor Firm Converts to LLP",
            "Summary": "Heubach Colorants India Limited announces conversion of statutory auditor M S K A & Associates to LLP structure effective January 13, 2026, with continued audit services.",
            "Sentiment": "neutral",
            "PublishDate": 1768450759551,
            "Source": "stocks"
        },
        {
            "Title": "Heubach Colorants India Completes Postal Ballot Process, Passes Three Key Resolutions",
            "Summary": "Heubach Colorants India Limited successfully completed its postal ballot process with all three resolutions passed with requisite majority, including re-appointment of Sambit Roy as Managing Director, company name change approval, and appointment of Amitabha Mukhopadhyay as Non-Executive Director. The e-voting process concluded on December 6, 2025, with results announced on December 8, 2025, affecting corporate governance and operational structure of the pigments and colorants company.",
            "Sentiment": "positive",
            "PublishDate": 1765198705243,
            "Source": "corporate_action"
        },
        {
            "Title": "Heubach Colorants India Seeks Shareholder Approval for Name Change to Sudarshan Colorants India",
            "Summary": "Heubach Colorants India Limited has issued a postal ballot notice seeking shareholder approval for three key resolutions. The company proposes to change its name to Sudarshan Colorants India Limited following the acquisition of global pigment business operations by Sudarshan Chemical Group. Shareholders will vote on the re-appointment of Sambit Roy as Managing Director for five years from November 25, 2025 to November 24, 2030, with monthly remuneration including salary of ₹5,86,784, other allowances of ₹8,12,463, and performance-linked variable allowance of ₹4,28,623. The third resolution involves appointing Amitabha Mukhopadhyay as Non-Executive and Non-Independent Director. The remote e-voting period runs from November 7, 2025 at 9:00 AM to December 6, 2025 at 5:00 PM. The company has received name availability approval from the Registrar of Companies and confirmed compliance with SEBI listing regulations for the proposed name change.",
            "Sentiment": "neutral",
            "PublishDate": 1762454849281,
            "Source": "corporate_action"
        },
        {
            "Title": "Heubach Colorants Reports Decline in Q2 Financial Performance",
            "Summary": "Heubach Colorants reported Q2 net profit of 162.8 million rupees, down from 184.1 million rupees in the same period last year. Revenue decreased to 1.83 billion rupees from 2.18 billion rupees year-over-year. EBITDA fell to 177.9 million rupees compared to 279.2 million rupees in the previous year, while EBITDA margin compressed to 9.71% from 12.78% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761927880947,
            "Source": "earnings"
        },
        {
            "Title": "Heubach Colorants India Reports Quarterly Results, Approves Name Change to Sudarshan Colorants India",
            "Summary": "Heubach Colorants India Limited's Board approved unaudited standalone financial results for the quarter and half-year ended September 30, 2025. The company reported a net profit of ₹36.28 crores for the quarter, compared to ₹9.49 crores in the same period last year. The Board approved changing the company name from Heubach Colorants India Limited to Sudarshan Colorants India Limited, subject to shareholder and statutory approvals. Key leadership changes include the re-appointment of Mr. Sambit Roy as Managing Director for five years effective November 25, 2025, and the appointment of Mr. Amitabha Mukhopadhyay as Additional Director (Non-Executive and Non-Independent). The company also appointed PricewaterhouseCoopers Services LLP as Internal Auditors for Financial Year 2025-26. The company operates in the colorants business segment and experienced a warehouse fire incident in January 2025, with insurance claims being processed.",
            "Sentiment": "positive",
            "PublishDate": 1761926646037,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Handa Steps Down as Independent Director of Heubach Colorants",
            "Summary": "Kewal Handa will step down from his position as Non-Executive and Independent Director at Heubach Colorants effective October 28, 2025. Handa cited personal commitments as the reason for his resignation, with no other significant factors mentioned for his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1761710515612,
            "Source": "corporate_governance"
        },
        {
            "Title": "Heubach Colorants India Publishes Independent Directors' Recommendation on Sudarshan Europe Open Offer",
            "Summary": "Heubach Colorants India Limited disclosed that its Committee of Independent Directors has issued recommendations regarding an open offer made by Sudarshan Europe B.V. and associated entities including Sudarshan Chemical Industries Limited, Sudarshan Switzerland HLD1 AG, and Sudarshan Switzerland HLD2 AG to public shareholders. The recommendations were published in newspaper advertisements in Financial Express (English), Jansatta (Hindi), and Navshakti (Marathi) editions. The disclosure was made under regulatory requirements including SEBI Listing Obligations and Takeover Regulations. The company filed the disclosure with BSE and NSE stock exchanges, with scrip code 506390 and symbol HEUBACHIND respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1757413719457,
            "Source": "corporate_action"
        },
        {
            "Title": "Heubach Colorants India Reports Strong Q1 Performance with 21.5% Revenue Growth and Tripled Net Profit",
            "Summary": "Heubach Colorants India's board approved unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue growth of 21.5% year-on-year to Rs 21,072 lakhs, driven by strong volume growth across segments. EBITDA margin expanded significantly to 13.6% from 7.5% in the same quarter last year, while net profit more than tripled to Rs 1,709 lakhs. Gross margin improved to 42.2% from 40.9% in Q1 FY2025. The company has undergone a change in promoter ownership with Sudarshan Chemical Industries acquiring indirect control through its subsidiary Sudarshan Europe BV. Employee costs declined 12.2% year-on-year to Rs 1,938 lakhs. The company appointed Mr. Sambit Roy as Managing Director in November 2024. There is an ongoing review of unauthorized asset transfer to a related party that management expects will not result in material adjustments to the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1754929324880,
            "Source": "earnings"
        },
        {
            "Title": "Heubach Colorants Reports Q1 Financial Results",
            "Summary": "Heubach Colorants has announced its Q1 financial results. The company's net profit increased to 106.4 million rupees, up from 58.4 million rupees in the same quarter last year. Revenue for Q1 rose to 2.2 billion rupees, compared to 2.04 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752682876000,
            "Source": "result"
        },
        {
            "Title": "Sudarshan Group to Acquire Heubach Group's Pigment Business",
            "Summary": "Heubach Colorants has announced that the acquisition of Heubach Group's pigment business by Sudarshan Group is expected to be finalized by March 2025. This corporate action represents a significant development in the colorants and pigments industry.",
            "Sentiment": "neutral",
            "PublishDate": 1740096558000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Group to Acquire Heubach Group's Pigment Business",
            "Summary": "Heubach Colorants has announced that the Sudarshan Group is set to acquire the pigment business of the Heubach Group. The acquisition process is expected to be completed by March 2025, marking a significant development in the colorants industry.",
            "Sentiment": "neutral",
            "PublishDate": 1740056757000,
            "Source": "corporate_action"
        },
        {
            "Title": "Heubach Colorants India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Heubach Colorants India has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 250 million rupees from 143 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 11.7% from 8.12% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738142003000,
            "Source": "earnings"
        },
        {
            "Title": "Heubach Colorants India Reports 19.32% Revenue Increase in Q3",
            "Summary": "Heubach Colorants India has reported a significant revenue growth of 19.32% for the third quarter compared to the previous quarter. This increase indicates strong performance and potential market expansion for the company in the colorants sector.",
            "Sentiment": "positive",
            "PublishDate": 1738141931000,
            "Source": "earnings"
        },
        {
            "Title": "Heubach Colorants India Reports Significant Increase in Q3 Net Profit",
            "Summary": "Heubach Colorants India has reported a substantial year-over-year increase in its third-quarter net profit. The company's net profit for Q3 rose to 172 million rupees, compared to 64 million rupees in the same period last year, marking a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738141904000,
            "Source": "earnings"
        },
        {
            "Title": "Heubach Colorants India Reports Improved Q2 EBITDA and Margin",
            "Summary": "Heubach Colorants India has reported its Q2 financial results. The company's EBITDA increased to 279 million rupees from 219 million rupees year-over-year. Additionally, the EBITDA margin improved to 12.78% from 10.92% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731597039000,
            "Source": "result"
        },
        {
            "Title": "Heubach Colorants India Reports Q2 Financial Results",
            "Summary": "Heubach Colorants India has announced its Q2 financial results. The company's net profit increased to 184 million rupees, up from 129 million rupees year-over-year and 52 million rupees quarter-over-quarter. Revenue for Q2 rose to 2.2 billion rupees, compared to 2 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731596981000,
            "Source": "result"
        },
        {
            "Title": "Heubach Colorants: Stock Soars 25% on Quant MF Stake Increase",
            "Summary": "<p><span class='positive'>Heubach Colorants India's stock</span> hit a <span class='positive'>7-year high</span>, <span class='positive'>rising 25%</span> in 6 days. <b>Quant Mutual Fund</b> recently acquired an <span class='positive'>additional 1% stake</span>. The company benefits from <span class='positive'>growing chemical demand</span> in various sectors and <span class='positive'>India's emerging position</span> in the global pigment market.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728634760000,
            "Source": "block_deals"
        }
    ]
}