{
    "Symbol": "SUDARSCHEM",
    "ISIN": "INE659A01023",
    "News": [
        {
            "Title": "Sudarshan Chemical Q3FY26 Analyst Meet on Feb 13",
            "Summary": "Sudarshan Chemical Industries schedules analyst conference call on February 13, 2026 at 10:00 AM IST to discuss Q3FY26 unaudited financial results, hosted by Anand Rathi Research.",
            "Sentiment": "neutral",
            "PublishDate": 1770732543612,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudarshan Chemical Gets ₹59.42L GST Order",
            "Summary": "Sudarshan Chemical Industries receives GST demand order of ₹59.42 lakh from Tamil Nadu tax authorities for FY22 period, plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1767178288906,
            "Source": "stocks"
        },
        {
            "Title": "Sudarshan Chemical liquidates Swedish subsidiary",
            "Summary": "Sudarshan Chemical Industries completes liquidation of step-down subsidiary Heubach Colorants Scandinavia AB effective December 29, 2025, with no financial impact on company operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767095799883,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudarshan Chemical Appoints Four New Directors",
            "Summary": "Sudarshan Chemical Industries successfully completes postal ballot on December 26, 2025, appointing four new directors including two independent directors with overwhelming shareholder support across all resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1766748690917,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudarshan Chemical Launches Sudafast Red 313D",
            "Summary": "Sudarshan Chemical Industries announces the launch of Sudafast Red 313D, a red pigment for printing ink applications targeting both domestic and international markets globally.",
            "Sentiment": "positive",
            "PublishDate": 1766145019436,
            "Source": "stocks"
        },
        {
            "Title": "Sudarshan Chemical Seeks Shareholder Approval for Four Director Appointments via Postal Ballot",
            "Summary": "Sudarshan Chemical Industries has issued a postal ballot notice seeking shareholder approval for appointing four directors - two independent directors (Apurva Chandra and Rajendra Mariwala) for five-year terms, and two non-independent directors (Amitabha Mukhopadhyay and Sanjay K. Asher). The e-voting period runs from November 26, 2025 to December 25, 2025, with appointments aimed at strengthening board governance and leveraging diverse expertise in administration, chemicals, finance and legal domains.",
            "Sentiment": "neutral",
            "PublishDate": 1764070692545,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sudarshan Chemical's Naveen Arya Sells Equity Shares Worth Rs. 28.69 Lakh",
            "Summary": "Naveen Arya, a designated person at Sudarshan Chemical Industries Limited, sold 2,706 equity shares (0.01% shareholding) through on-market sale on NSE for Rs. 28,69,630.94 at Rs. 1,060.47 per share. The company disclosed this transaction under SEBI insider trading regulations, with the sale executed on November 18, 2025 and intimated to the company on November 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763982792381,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Revises FY26 Guidance Downward Due to Weak Global Demand and Customer Destocking",
            "Summary": "Sudarshan Chemical Industries reported flat revenue growth and reduced its acquired group guidance from €35 million to €25-30 million for FY26, citing soft global demand and high customer inventory levels following the Heubach acquisition. The company expects Q3 to remain subdued with recovery anticipated from Q4 onwards, while maintaining its 3-4 year projections despite temporary market challenges.",
            "Sentiment": "negative",
            "PublishDate": 1763640390991,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Fully Utilizes Rs 800 Crore QIP Proceeds",
            "Summary": "Sudarshan Chemical Industries Limited has completely utilized all proceeds from its Rs 80,000 lakh QIP issue, with the remaining Rs 82.81 lakh being deployed during the quarter ended September 30, 2025. The funds were used for acquiring Heubach Group's global pigment business operations through subsidiary Sudarshan Europe B.V., debt repayment, and general corporate purposes as originally planned.",
            "Sentiment": "negative",
            "PublishDate": 1763120465685,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Reports Fund Utilization for QIP and Debt Securities",
            "Summary": "Sudarshan Chemical Industries Limited disclosed its fund utilization statement for the quarter ended September 30, 2025. The company raised ₹800 crores through a Qualified Institutions Placement (QIP) on January 29, 2025, issuing 74,76,635 equity shares at ₹1,070 per share with a discount to the floor price. The funds were allocated for investment in subsidiary Sudarshan Europe B.V. for acquiring global pigment business operations of the Heubach Group, repayment of borrowings, and general corporate purposes. Out of the total net proceeds of ₹785.65 crores, ₹82.81 lakhs remained unutilized as of June 30, 2025. Additionally, the company had previously raised ₹99 crores through Non-Convertible Debentures in July 2022, which were fully utilized for working capital debt repayment, capital expenditure reimbursement, and payment of operating liabilities. The company reported no deviation in the use of funds from their stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762944766209,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Reports Q2 Results, Appoints New Director and Approves EUR 14 Million Investment",
            "Summary": "Sudarshan Chemical Industries announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board approved the appointment of Mr. Sanjay K. Asher as Additional Non-Executive and Non-Independent Director, effective November 12, 2025, subject to shareholder approval. The company also approved an investment of up to EUR 14 million in equity shares of its wholly-owned subsidiary Sudarshan Europe B.V. in multiple tranches for business purposes. The trading window for company securities will open on November 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762941589664,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Mixed Q2 Results with Higher EBITDA but Lower Margins",
            "Summary": "Sudarshan Chemical Industries reported Q2 EBITDA of 1.3 billion rupees compared to 945 million rupees in the same period last year. However, the company's EBITDA margin declined significantly to 5.54% from 13.6% year-over-year. The consolidated net profit dropped to 117 million rupees from 300 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762939401221,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Industries Receives GST Orders Totaling Rs 38.18 Lakh, Plans Appeals",
            "Summary": "Sudarshan Chemical Industries Limited received four GST orders from the Office of Superintendent Range-I, Bhabanipur, Kolkata South, West Bengal. The orders cover periods from April 2018 to March 2022, with total demands of Rs 38.18 lakh comprising taxes of Rs 11.55 lakh and penalties of Rs 26.63 lakh. The first order for April 2018-March 2019 demands Rs 5.15 lakh (tax: Rs 2.29 lakh, penalty: Rs 2.86 lakh). The second order for April 2019-March 2020 demands Rs 5.69 lakh (tax: Rs 2.83 lakh, penalty: Rs 2.86 lakh). The third order for April 2020-March 2021 demands Rs 7.35 lakh (tax: Rs 3.67 lakh, penalty: Rs 3.67 lakh). The fourth order for April 2021-March 2022 demands Rs 19.62 lakh (tax: Rs 2.75 lakh, penalty: Rs 16.87 lakh). The company states it has a good case on all points raised and is preparing to file appeals. The company believes there will be no impact on its financial, operational, or other activities due to these orders.",
            "Sentiment": "neutral",
            "PublishDate": 1760720448119,
            "Source": "stock"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Fund Utilization for QIP and Debt Securities",
            "Summary": "Sudarshan Chemical Industries Limited submitted its quarterly fund utilization statement for the quarter ended June 30, 2025. The company raised approximately ₹800 crores through a Qualified Institutions Placement (QIP) on January 29, 2025, issuing 74,76,635 equity shares at ₹1,070 per share. Out of the total funds, ₹799.17 crores have been utilized, with ₹0.83 crore remaining unutilized for issue expenses. The funds were allocated for investment in subsidiary Sudarshan Europe B.V. for acquiring Heubach Group's global pigment business operations, debt repayment, general corporate purposes, and issue expenses. Additionally, the company reported complete utilization of ₹99 crores raised through Non-Convertible Debentures in July 2022 for working capital debt repayment, capital expenditure reimbursement, and operating liabilities payment. No deviations were reported in fund utilization for either fundraising.",
            "Sentiment": "neutral",
            "PublishDate": 1758632123417,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Reports Strong Q1 Revenue Growth Despite Margin Decline",
            "Summary": "Sudarshan Chemical reported Q1 consolidated net profit of 472 million rupees compared to 294 million rupees year-over-year. Revenue surged to 25.1 billion rupees from 6.34 billion rupees in the same period last year. EBITDA increased to 1.9 billion rupees from 805 million rupees year-over-year, though EBITDA margin declined to 7.66% from 12.72%. Other income rose significantly to 259 million rupees versus 35 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1758631745830,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Industries Appoints Three New Directors and Reports Quarterly Results",
            "Summary": "Sudarshan Chemical Industries' Board approved the appointment of three new directors effective October 1, 2025, subject to shareholder approval: Apurva Chandra and Rajendra Mariwala as Independent Directors for five-year terms, and Amitabha Mukhopadhyay as a Non-Executive Director. The company also approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, revenue from operations was ₹531.2 crore compared to ₹703.6 crore in the previous quarter, while profit for the quarter increased to ₹73.3 crore from ₹22.4 crore. On a consolidated basis, revenue from operations rose to ₹2,506.9 crore from ₹1,349.4 crore in the previous quarter, with profit increasing to ₹55.0 crore from ₹0.4 crore. The company's trading window will reopen on September 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758630006153,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Declares Rs. 4.50 Final Dividend for FY2025, Details Tax Deduction Guidelines",
            "Summary": "Sudarshan Chemical Industries Limited's Board of Directors declared a final dividend of Rs. 4.50 per equity share (225%) for financial year 2024-25, subject to shareholder approval at the 74th Annual General Meeting scheduled for September 29, 2025. The record date is set for September 22, 2025. The company has provided comprehensive tax deduction at source (TDS) guidelines for shareholders, with rates varying based on shareholder category - nil TDS for dividends under Rs. 10,000 for individuals, 10% for resident shareholders with PAN, 20% without PAN, and 20% plus applicable surcharge for non-residents. Various exemptions are available for insurance companies, mutual funds, and other specified entities. Shareholders must submit required forms and documents by September 22, 2025, to claim applicable exemptions. The company emphasized that dividend payments will be made electronically and shareholders need to update their bank account details.",
            "Sentiment": "positive",
            "PublishDate": 1757593125744,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Reclassifies 8.21% Shareholding from Promoter to Public Category",
            "Summary": "Sudarshan Chemical Industries Limited completed the reclassification of certain shareholders from Promoter/Promoter Group category to Public category on September 9, 2025. The reclassification was approved by company members through postal ballot on September 6, 2025, and has been implemented in the depository system. Three individuals were reclassified: Mr. Pradeep Ramwilas Rathi (4.36% shareholding), Mr. Rahul Pradeep Rathi (3.85% shareholding), and Mrs. Subhadra Pradeep Rathi (no shares held), representing a total of 64,48,599 equity shares or 8.21% of the company. MUFG Intime India Private Limited, the company's Registrar and Share Transfer Agent, confirmed the reclassification. The company has submitted an updated shareholding pattern showing the remaining promoter and promoter group members now hold 8.19% of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1757499518706,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Discloses Independent Directors' Recommendations on Open Offer by Sudarshan Europe B.V.",
            "Summary": "Sudarshan Chemical Industries Limited disclosed recommendations from the Committee of Independent Directors of Heubach Colorants India Limited regarding an open offer made by Sudarshan Europe B.V. and its affiliates. The recommendations were published in newspaper advertisements in Financial Express, Jansatta, and Navshakti on September 9, 2025. The open offer involves Sudarshan Europe B.V. as the acquirer, along with Sudarshan Chemical Industries Limited, Sudarshan Switzerland HLD1 AG, and Sudarshan Switzerland HLD2 AG as persons acting in concert. Both companies filed disclosures with BSE and NSE under regulatory requirements for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1757418508293,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Receives Shareholder Approval for Promoter Reclassification",
            "Summary": "Sudarshan Chemical Industries Limited has received shareholder approval through postal ballot to reclassify certain individuals from the Promoter/Promoter Group category to the Public category. The reclassification affects three individuals: Mr. Pradeep Ramwilas Rathi (4.36% shareholding), Mr. Rahul Pradeep Rathi (3.85% shareholding), and Mrs. Subhadra Pradeep Rathi (no shares). This change reduces the company's promoter shareholding from 16.40% to 8.19%, while increasing public shareholding from 83.60% to 91.81%. The total shares involved in the reclassification represent 8.21% of the company's equity.",
            "Sentiment": "neutral",
            "PublishDate": 1757337029334,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Delays Q1 FY26 Results Submission Due to Cascading Effects",
            "Summary": "Sudarshan Chemical Industries Limited announced a delay in submitting its unaudited financial results for the quarter ended June 30, 2025. The delay stems from cascading effects of a previous delay in submitting audited results for the quarter and year ended March 31, 2025. The company was required to submit the June quarter results by August 14, 2025, but has applied to stock exchanges for an extension. The audited results for March 2025 were approved by the Board on July 25, 2025. The company stated that preparation of financial results and limited review is ongoing, and results will be declared after completing necessary activities. The trading window for the company's securities will remain closed until 48 hours after the declaration of the quarterly results.",
            "Sentiment": "negative",
            "PublishDate": 1755082724955,
            "Source": "stock"
        },
        {
            "Title": "Sudarshan Chemical Seeks Shareholder Approval for Promoter Group Reclassification",
            "Summary": "Sudarshan Chemical Industries has issued a postal ballot notice seeking shareholder approval to reclassify members of the Pradeep R. Rathi Group from 'Promoter/Promoter Group' category to 'Public' category. The reclassification involves three individuals: Pradeep Ramwilas Rathi (holding 34,24,740 shares, 4.36%), Rahul Pradeep Rathi (30,23,859 shares, 3.85%), and Subhadra Pradeep Rathi (no shares). Together, they hold 64,48,599 shares representing 8.21% of the company. The Board of Directors approved the request on May 29, 2025, and stock exchanges BSE and NSE provided no-objection letters on July 15, 2025. The postal ballot notice was sent electronically on August 7, 2025, with remote e-voting conducted through NSDL from August 8 to September 6, 2025. Post-reclassification, promoter shareholding would decrease from 16.40% to 8.19%, while public shareholding would increase from 83.60% to 91.81%. The applicants confirmed they meet all regulatory conditions including holding less than 10% voting rights, not exercising control, and having no special rights or board representation.",
            "Sentiment": "neutral",
            "PublishDate": 1754552378905,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sudarshan Chemical Reports Strong Growth Post-Heubach Acquisition, Eyes EUR 35 Million EBITDA Target",
            "Summary": "Sudarshan Chemical Industries completed its acquisition of Heubach Group, creating a combined entity with 19 manufacturing facilities across 11 countries and approximately 1 billion euros in turnover. The company reported quarterly sales of INR 1,349 crores versus INR 764 crores last year, with adjusted EBITDA of INR 148 crores. Legacy Sudarshan pigment business delivered 16% growth with sales of INR 744 crores. The acquired Heubach operations contributed INR 525 crores in sales for March with 55.8% gross margins. Management expects the acquired group to deliver EUR 35 million EBITDA in the current financial year and EUR 90-100 million within 3-4 years. The company paid EUR 151.9 million as purchase price and acquired assets worth EUR 181 million in tangible assets plus EUR 190 million in working capital. RIECO business faced challenges with 28% revenue decline to INR 228 crores, but management expects turnaround with improved project execution capabilities. The integration focuses on cost reduction initiatives, customer service improvements, and building unified systems across the organization.",
            "Sentiment": "positive",
            "PublishDate": 1754393055744,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Complete Utilization of QIP Proceeds for Heubach Acquisition",
            "Summary": "Sudarshan Chemical Industries Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from its Qualified Institutions Placement. The company raised Rs 80,000 lakh through the issuance of 74,76,635 equity shares at Rs 1,070 per share during January 23-28, 2025. The proceeds were allocated across three main objectives: Rs 32,500 lakh for investment in subsidiary Sudarshan Europe B.V. to fund the acquisition of Heubach Group's global pigment business operations, Rs 28,500 lakh for repayment of outstanding borrowings, and Rs 17,565.26 lakh for general corporate purposes. CRISIL Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objects. The company has fully utilized Rs 78,565.26 lakh of the net proceeds, with Rs 82.81 lakh remaining in the escrow account earmarked for issue expenses. The Heubach acquisition involves purchasing assets and business operations across multiple countries, expanding Sudarshan's pigment portfolio and market presence in Europe and the Americas.",
            "Sentiment": "positive",
            "PublishDate": 1753858342652,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Projects EUR 35M EBITDA from Heubach Business for FY26",
            "Summary": "Sudarshan Chemical projects EUR 35 million EBITDA from its Heubach business for FY26 after accounting for costs. The company's legacy business is expected to grow 10-11% going forward.",
            "Sentiment": "positive",
            "PublishDate": 1753846757071,
            "Source": "stock"
        },
        {
            "Title": "Sudarshan Chemical Industries Schedules Q4 FY25 Earnings Call for July 29, 2025",
            "Summary": "Sudarshan Chemical Industries Limited has scheduled an earnings call with analysts and investors on July 29, 2025 at 12:00 p.m. IST to discuss audited financial results for Q4 FY25. The company is providing an investor presentation covering both standalone and consolidated results for the quarter and year ended March 31, 2025. The presentation reveals ongoing integration efforts following an acquisition, with the company implementing cost optimization measures across operations, procurement, IT systems, and support functions. Management highlighted challenging market conditions including flat demand across multiple industries and customer destocking, while noting positive customer feedback and demand for reliable long-term partnerships. The acquired group comprises 48 entities with three different ERP systems that are not yet integrated, and had not been audited at consolidated level since 2022. The company is focusing on improving financial position, ensuring smooth operations, and working capital optimization across accounts receivable, payable, and inventories.",
            "Sentiment": "neutral",
            "PublishDate": 1753769204323,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Reports Full Utilization of ₹195 Crore Preferential Allotment Proceeds",
            "Summary": "Sudarshan Chemical Industries Limited disclosed the complete utilization of ₹195 crores raised through preferential allotment of 18,69,000 equity shares at ₹1,043.33 per share on January 13, 2025. The funds were fully deployed for investment in wholly-owned subsidiary Sudarshan Europe B.V. and general corporate purposes, with no deviations from stated objectives. The company also reported on its ₹800 crore QIP issue from January 29, 2025, where ₹797.13 crores have been utilized for acquisition funding and debt repayment, with ₹2.86 crores remaining unutilized. Additionally, the company confirmed full utilization of ₹99 crores raised through non-convertible debentures in July 2022 for working capital debt repayment and operational expenses. CRISIL Ratings Limited serves as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1753465859859,
            "Source": "stock"
        },
        {
            "Title": "India Imposes 25.76% Duty on Chinese Pigment Imports",
            "Summary": "The Indian government has imposed a five-year anti-dumping duty of 25.76% on certain pigments imported from China. This decision was made in response to subsidized prices from China, which were deemed harmful to the local industry. The measure specifically affects Sudarshan Chemical Industries, suggesting it is a key player in the Indian pigment industry.",
            "Sentiment": "positive",
            "PublishDate": 1750994753000,
            "Source": "default"
        },
        {
            "Title": "Sudarshan Pharma to Establish U.S. Subsidiary",
            "Summary": "Sudarshan Pharma is planning to create a fully-owned subsidiary in the United States named Sudarshan Industries LLC. The new subsidiary will focus on the production and trading of chemical, pharmaceutical, and FMCG (Fast-Moving Consumer Goods) products.",
            "Sentiment": "positive",
            "PublishDate": 1750345859000,
            "Source": "default"
        },
        {
            "Title": "Sudarshan Chemical Industries Completes Acquisition of Heubach Group",
            "Summary": "Sudarshan Chemical Industries has successfully completed its acquisition of the Heubach Group. This corporate action represents a significant expansion for Sudarshan Chemical Industries, likely enhancing its market position in the chemical industry.",
            "Sentiment": "positive",
            "PublishDate": 1741047177000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Completes Acquisition of Heubach Group",
            "Summary": "Sudarshan Chemical Industries has announced the completion of its acquisition of the Heubach Group. This strategic move is likely to expand Sudarshan's market presence and product portfolio in the chemical industry.",
            "Sentiment": "positive",
            "PublishDate": 1741000974000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Secures Anti-Trust Approvals for Heubach Acquisition",
            "Summary": "Sudarshan Chemical Industries has announced that it has received all necessary anti-trust approvals for its acquisition of Heubach. The company plans to complete this transaction by March 2025, marking a significant milestone in its corporate strategy.",
            "Sentiment": "positive",
            "PublishDate": 1739780371000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Mixed Q3 Results",
            "Summary": "Sudarshan Chemical Industries announced its Q3 financial results. The company's consolidated net profit decreased to 6 million rupees from 146 million rupees year-over-year. However, revenue increased to 6.66 billion rupees from 5.59 billion rupees. Profit before tax (PBT) rose to 355 million rupees from 221 million rupees. The company also reported an exceptional item of 308 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739751628000,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemicals Industries: Q3 Profit Plummets 96.5% YoY",
            "Summary": "Sudarshan Chemicals Industries reported Q3 FY25 results with revenue up 17.8% YoY to ₹666.43 crore, but profit fell 96.5% YoY to ₹0.51 crore. Operating income decreased by 53.4% YoY. EPS stood at ₹4, up 90.48% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739598917000,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Q3 Profit Increase",
            "Summary": "Sudarshan Chemical Industries has reported a significant increase in its Q3 profit before tax (PBT), rising to 355 million rupees compared to 221 million rupees in the same period last year. The company also noted an exceptional item of 308 million rupees, which likely contributed to the improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739533018000,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sudarshan Chemical Industries has reported an increase in its Q3 EBITDA to 790 million rupees, up from 619 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 11.85% from 11.07% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739533010000,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Significant Decline in Q3 Net Profit",
            "Summary": "Sudarshan Chemical Industries has reported a substantial decrease in its third-quarter consolidated net profit, which fell to 6 million rupees from 146 million rupees in the same period last year. However, the company's revenue showed growth, increasing to 6.66 billion rupees from 5.59 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739533006000,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical to Consider Q3 Results",
            "Summary": "Sudarshan Chemical has announced that it will consider its third quarter (Q3) financial results on February 14. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738673239000,
            "Source": "earnings"
        },
        {
            "Title": "Sudarshan Chemical Completes ₹800 Crore QIP at ₹1,070 Per Share",
            "Summary": "Sudarshan Chemical has successfully closed its Qualified Institutional Placement (QIP) of ₹800 crore. The shares were priced at ₹1,070 each, representing a 3.42% discount to the floor price. This capital raising initiative through QIP demonstrates the company's efforts to secure additional funding, potentially for expansion or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1738119053000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Sets QIP Floor Price",
            "Summary": "Sudarshan Chemical Industries has approved a floor price of 1107.89 rupees per share for its Qualified Institutional Placement (QIP). This decision sets the minimum price at which the company will issue shares to qualified institutional buyers through the QIP process.",
            "Sentiment": "neutral",
            "PublishDate": 1737678154000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries Sets QIP Floor Price",
            "Summary": "Sudarshan Chemical Industries has approved a floor price of 1107.89 rupees per share for its Qualified Institutional Placement (QIP). This decision sets the minimum price at which the company will issue shares to qualified institutional buyers through the QIP process.",
            "Sentiment": "neutral",
            "PublishDate": 1737644572000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical to Consider Fund Raising on December 5",
            "Summary": "Sudarshan Chemical Industries Limited has announced that it will hold a meeting on December 5 to consider raising funds. The company has not provided details on the amount or the purpose of the potential fund raise at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1733126072000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemical Industries: Promoters Sell 3% Stake for Rs 197 Crore",
            "Summary": "Promoters Pradeep Ramwilas Rathi and Subhadra Pradeep Rathi sold a combined 3% stake (28.35 lakh shares) in Sudarshan Chemical Industries through open market transactions on November 27, 2024. The shares were sold at around Rs 950 per share, totaling approximately Rs 197 crore. Boon Investment and Trading Co., Jovial Investment and Trading Co., and Blue Diamond Properties were the buyers in this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1732765823000,
            "Source": "block_deals"
        },
        {
            "Title": "Sudarshan Chemical Industries Ltd: Promoters Sell 3% Stake in Bulk Deals",
            "Summary": "Promoters of Sudarshan Chemical Industries Ltd. sold a combined 3% stake for Rs 1.97 crore. Subhadra Pradeep Rathi sold 1.89% and Pradeep Ramwilas Rathi sold 1.1%. Boon Investment, Jovial Investment, and Blue Daimond Properties acquired the shares at Rs 950 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1732721752000,
            "Source": "block_deals"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Improved Q2 Financial Performance",
            "Summary": "Sudarshan Chemical Industries has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA increased to 923 million rupees from 653 million rupees year-over-year. Additionally, the EBITDA margin improved to 13.39% from 10.99% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730108303000,
            "Source": "result"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Q2 Revenue Growth",
            "Summary": "Sudarshan Chemical Industries has announced its second quarter revenue of 6.9 billion rupees, showing an increase from 5.95 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730108253000,
            "Source": "result"
        },
        {
            "Title": "Sudarshan Chemical Industries Reports Q2 Profit Growth",
            "Summary": "Sudarshan Chemical Industries has announced its Q2 consolidated net profit of 300 million rupees, compared to 178 million rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730108226000,
            "Source": "result"
        },
        {
            "Title": "Sudarshan Chemical Approves Major Fund Raising Initiative",
            "Summary": "Sudarshan Chemical has approved a fund raising plan of 1,000 crore rupees with an additional 25% green shoe option. This significant financial decision indicates the company's intent to secure substantial capital, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1729136128000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sudarshan Chemicals Upgraded by HDFC Post Analyst Call",
            "Summary": "Sudarshan Chemicals held an analyst call, following which HDFC upgraded the stock to an 'Add' rating with a target price of 1160. This upgrade appears to be related to a deal involving Sudarshan Chemicals and Heubach.",
            "Sentiment": "positive",
            "PublishDate": 1729051179000,
            "Source": "normal_news"
        },
        {
            "Title": "Sudarshan Chemical: Potential Global Leader in Pigments",
            "Summary": "<p><span class=\"positive\">Sudarshan Chemical</span> is making <span class=\"positive\">significant strides</span> towards becoming a <span class=\"positive\">global leader</span> in the <b>pigments industry</b>, according to a report by <span class=\"neutral\">Dolat Capital</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1729047211000,
            "Source": "normal_news"
        }
    ]
}