{
    "Symbol": "SUDEEPPHRM",
    "ISIN": "INE0QPI01025",
    "News": [
        {
            "Title": "Sudeep Pharma Reports Strong Q3 FY26 Results",
            "Summary": "Sudeep Pharma Limited published consolidated financial results for Q3 FY26, showing significant growth in revenue and profitability with regulatory compliance announcements.",
            "Sentiment": "positive",
            "PublishDate": 1770476398805,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudeep Pharma reschedules Q3FY26 earnings call",
            "Summary": "Sudeep Pharma Limited has rescheduled its earnings call with analysts and investors to February 9, 2026 at 11:00 AM IST to discuss Q3FY26 operational and financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770456527075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudeep Pharma VP John Garcia Resigns Feb 2026",
            "Summary": "Sudeep Pharma announces resignation of Sales & Supply Chain VP John Garcia, effective February 6, 2026, as he pursues new career opportunities in leadership transition.",
            "Sentiment": "neutral",
            "PublishDate": 1770267015515,
            "Source": "stocks"
        },
        {
            "Title": "Sudeep Pharma Subsidiary Acquires Land for ₹20.97 Cr",
            "Summary": "Sudeep Advanced Materials Private Limited purchases leasehold rights in Dahej, Gujarat for ₹20.97 crores to establish battery-grade iron phosphate manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1769083681762,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudeep Pharma Updates CIN Post Stock Exchange Listing",
            "Summary": "Sudeep Pharma Limited has updated its Corporate Identification Number (CIN) from U24231GJ1989PLC013141 to L24231GJ1989PLC013141 following its listing on BSE and NSE in November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768542472035,
            "Source": "stocks"
        },
        {
            "Title": "Sudeep Pharma Submits Q2FY26 Earnings Call Recording",
            "Summary": "Sudeep Pharma Limited has submitted the audio recording of its Q2FY26 earnings call held on December 22, 2025, to stock exchanges under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1766315162012,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudeep Pharma Q2 EBITDA Falls 12.6% to ₹55.5 Cr",
            "Summary": "Sudeep Pharma's Q2 EBITDA declined to ₹55.5 crores from ₹63.5 crores YoY, with EBITDA margin compressing to 34.09% from 42.66%. Net profit also dropped 6.2% to ₹45.70 crores despite 6.7% revenue growth.",
            "Sentiment": "negative",
            "PublishDate": 1766155199303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudeep Pharma Publishes Q2FY26 Financial Results",
            "Summary": "Sudeep Pharma Limited published its Q2FY26 financial results extract in newspapers following regulatory compliance under SEBI LODR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765784037719,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sudeep Pharma Grants ₹40 Crore Unsecured Loan to Wholly Owned Subsidiary",
            "Summary": "Sudeep Pharma Limited has provided an unsecured loan of ₹40 crore to its wholly owned subsidiary Sudeep Advanced Materials Private Limited for working capital and setting up a battery-grade materials manufacturing facility at Dahej, Gujarat. The loan carries 8.5% interest rate, is repayable on demand with a maximum period of 5 years, and ₹9.25 crore is currently outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1765286083892,
            "Source": "corporate_action"
        }
    ]
}