{
    "Symbol": "SUKHJITS",
    "ISIN": "INE450E01029",
    "News": [
        {
            "Title": "Sukhjit Starch Q3FY26 Net Profit Falls 63% to ₹4.04 Cr",
            "Summary": "Sukhjit Starch & Chemicals reported standalone net profit of ₹4.04 crores for Q3FY26, down 63% from ₹10.80 crores in Q3FY25. Revenue declined 8% to ₹343.86 crores amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1770888947216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sukhjit Starch Clarifies Price Movement to BSE",
            "Summary": "Sukhjit Starch & Chemicals responds to BSE inquiry on price movement, attributing changes to market perception and conditions beyond management control while confirming compliance with disclosure norms.",
            "Sentiment": "neutral",
            "PublishDate": 1767264618386,
            "Source": "stocks"
        },
        {
            "Title": "Sukhjit Starch Chemicals Reports Revenue Decline in Q2 FY26 Amid Market Challenges",
            "Summary": "Sukhjit Starch Chemicals recorded revenue of INR 312.68 crores in Q2 FY26 compared to INR 367.20 crores in the previous quarter, with net profit declining to INR 4.07 crores from INR 4.75 crores. The company maintained healthy capacity utilization and expects sequential improvement in operating performance as maize prices soften and demand stabilizes following GST rationalization.",
            "Sentiment": "neutral",
            "PublishDate": 1763449974394,
            "Source": "earnings"
        },
        {
            "Title": "Sukhjit Starch Chemicals Reports Mixed Quarterly Performance with Revenue Decline",
            "Summary": "Sukhjit Starch Chemicals Limited reported total income of ₹316.58 crores for the quarter ended September 30, 2025, compared to ₹370.06 crores in the previous quarter, while net profit after tax decreased to ₹4.07 crores from ₹4.75 crores. The company's earnings per share dropped to ₹1.30 from ₹1.52 in the previous quarter, affecting shareholders and investors tracking the starch chemicals manufacturer's performance.",
            "Sentiment": "negative",
            "PublishDate": 1763100949607,
            "Source": "earnings"
        },
        {
            "Title": "Sukhjit Starch & Chemicals Reports 94.67% Jump in Net Profit with Improved Margins",
            "Summary": "Sukhjit Starch & Chemicals Limited reported revenue from operations of Rs. 367.20 crores with net profit of Rs. 4.75 crores, marking a 94.67% quarter-on-quarter increase. EBITDA grew 14.11% to Rs. 19.89 crores with a margin of 5.42%. The company operates at 78-85% capacity utilization and targets 85% by year-end. Management completed a 200-ton capacity expansion with another 200 tons planned. Maize prices have stabilized following government intervention in rice supply to ethanol players. The company is focusing on value-added products and deepening customer engagement through product customization and R&D partnerships with multinational companies. Indian starch manufacturers have resumed exports as maize prices became competitive, though the company is not currently exporting. Management expressed cautious optimism about the second half, expecting margin improvements with price stabilization and renewed demand across paper, packaging, FMCG, and personal care sectors.",
            "Sentiment": "positive",
            "PublishDate": 1755596940543,
            "Source": "earnings"
        },
        {
            "Title": "Sukhjit Starch and Chemicals Reports Steady Revenue Growth and Improved Profitability in Q1 FY26",
            "Summary": "Sukhjit Starch and Chemicals Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹367.20 crores, up from ₹359.14 crores in the previous quarter. Profit Before Tax improved to ₹5.67 crores compared to ₹3.49 crores in Q4 FY25, while Profit After Tax increased to ₹4.75 crores from ₹2.44 crores in the previous quarter. EBITDA stood at ₹19.89 crores with a margin of 5.42%. Managing Director K.K. Sardana attributed the improvement to operational efficiency and stabilization in raw material prices. The company expects profitability to improve in coming quarters due to stabilized finished goods prices and upward demand trends from key sectors. Sardana noted early signs of stabilization in raw material prices aided by government measures supporting maize cultivation, with better performance expected in the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755071834237,
            "Source": "earnings"
        },
        {
            "Title": "Sukhjit Starch & Chemicals Reports 65% Drop in Q1 Net Profit",
            "Summary": "Sukhjit Starch & Chemicals reported a net profit of 48 million rupees in Q1, down from 136 million rupees in the same quarter last year. The company's revenue declined to 3.7 billion rupees compared to 3.9 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754985836079,
            "Source": "earnings"
        },
        {
            "Title": "Sukhjit Starch and Chemicals Schedules Q1 FY26 Results Conference Call for August 13, 2025",
            "Summary": "Sukhjit Starch and Chemicals Limited will host a conference call for investors and analysts on August 13, 2025, at 3:00 PM IST to discuss the company's Q1 FY26 results. The call will feature senior management including Bhavdeep Sardana and Dhiraj Sardana as Sr VP & CEO, Rakesh Chawla as Sr VP & CFO, and Aman Setia as Sr VP (Finance) & Company Secretary. Multiple dial-in numbers are provided for domestic and international participants, including toll-free options for Hong Kong, Singapore, USA, and UK. The company has requested participants to pre-register to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1754727126114,
            "Source": "earnings"
        },
        {
            "Title": "Sukhjit Starch & Chemicals Announces 81st AGM for August 26, 2025",
            "Summary": "Sukhjit Starch & Chemicals Limited has announced its 81st Annual General Meeting scheduled for August 26, 2025 at 10:00 AM at Hotel Imperial Poonam, Phagwara. The company has circulated the AGM notice and Annual Report for FY 2024-25 to shareholders. Key agenda items include adoption of financial statements, declaration of dividend, director re-appointment, and approval of secretarial and cost auditors. Remote e-voting will be available from August 23-25, 2025, with August 20, 2025 as the cut-off date. The company reported revenue of ₹1,486 crores for FY 2024-25, representing 8.41% growth, though profit after tax declined to ₹39.48 crores from ₹55.62 crores in the previous year. The board has recommended a 20% dividend (₹1 per equity share of ₹5 face value).",
            "Sentiment": "neutral",
            "PublishDate": 1753787517728,
            "Source": "corporate_action"
        },
        {
            "Title": "Sukhjit Starch & Chemicals Reports Decline in Q4 EBITDA",
            "Summary": "Sukhjit Starch & Chemicals has reported a significant decrease in its Q4 EBITDA, which fell to 147 million rupees from 307 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 4.11% from 8.35% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748594750000,
            "Source": "result"
        },
        {
            "Title": "TARC Reports Increased Q4 Net Loss and Revenue",
            "Summary": "TARC has reported its Q4 financial results. The company's consolidated net loss widened to 1 billion rupees, compared to a loss of 517 million rupees in the same quarter last year. Sequentially, the loss increased from 287 million rupees in the previous quarter. However, Q4 revenue improved to 118 million rupees, up from 95 million rupees in the year-ago period.",
            "Sentiment": "negative",
            "PublishDate": 1748531383000,
            "Source": "result"
        },
        {
            "Title": "Sukhjit Starch & Chemicals Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Sukhjit Starch & Chemicals has reported a decrease in its Q3 EBITDA, which fell to 290 million rupees from 370 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 7.73% from 10.24% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739173964000,
            "Source": "earnings"
        },
        {
            "Title": "Sukhjit Starch & Chemicals Reports Q3 Financial Results",
            "Summary": "Sukhjit Starch & Chemicals has announced its Q3 consolidated financial results. The company reported a net profit of 108 million rupees, down from 160 million rupees in the same quarter last year. However, revenue increased to 3.75 billion rupees from 3.6 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739173763000,
            "Source": "earnings"
        }
    ]
}