{
    "Symbol": "SULA",
    "ISIN": "INE142Q01026",
    "News": [
        {
            "Title": "Sula Vineyards Q3FY26 Net Profit Drops 67.6% YoY",
            "Summary": "Sula Vineyards reported Q3FY26 consolidated net profit of INR 9.10 crore, down 67.6% from INR 28.06 crore YoY. Revenue declined 9.7% to INR 195.68 crore amid seasonal challenges.",
            "Sentiment": "negative",
            "PublishDate": 1770396946212,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sula Vineyards Q3 FY26 Earnings Call on Feb 9",
            "Summary": "Sula Vineyards announces earnings conference call scheduled for February 9, 2026, at 4:00 PM IST to discuss Q3 and 9M FY26 financial results with management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769691487914,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sula Vineyards Sees Limited Impact from India-EU FTA",
            "Summary": "Sula Vineyards expects minimal impact from India-EU FTA on wine industry, with minimum import price of €2.5 per bottle protecting over 90% of Indian wines retailing below ₹1,500.",
            "Sentiment": "positive",
            "PublishDate": 1769603644785,
            "Source": "stocks"
        },
        {
            "Title": "Sula Vineyards Board Meet Set for Feb 6, 2026",
            "Summary": "Sula Vineyards announces board meeting on February 6, 2026, to consider Q3FY26 financial results. Trading window remains closed until February 8, 2026, following insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769586235118,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sula Vineyards clarifies volume surge to exchanges",
            "Summary": "Sula Vineyards responds to NSE and BSE queries about recent trading volume increase, stating no undisclosed price-sensitive information exists and movement is purely market-driven.",
            "Sentiment": "neutral",
            "PublishDate": 1766735249961,
            "Source": "stocks"
        },
        {
            "Title": "Sula Vineyards Company Secretary Resigns",
            "Summary": "Sula Vineyards announces resignation of Company Secretary & Compliance Officer Ms. Shalaka Koparkar due to personal reasons, effective December 24, 2025. Company identifies suitable replacement candidate.",
            "Sentiment": "neutral",
            "PublishDate": 1766572760465,
            "Source": "stocks"
        },
        {
            "Title": "ICRA Revises Sula Vineyards Credit Rating Outlook to Negative from Stable",
            "Summary": "ICRA Limited has reaffirmed the credit ratings for Sula Vineyards Limited and its material subsidiary Artisan Spirits Private Limited while revising the outlook to Negative from Stable across various fund-based and non-fund based facilities. The rating action affects the company's term loans, working capital facilities, and bank guarantees, with detailed rationale available on ICRA's website.",
            "Sentiment": "negative",
            "PublishDate": 1763555320384,
            "Source": "stock"
        },
        {
            "Title": "Sula Vineyards' Subsidiary Gets Relief as INR 21.33 Crore Tax Demand Dropped After Rectification",
            "Summary": "Artisan Spirits Private Limited, a wholly owned subsidiary of Sula Vineyards Limited, received relief from a tax assessment order as INR 21.33 crore demand pertaining to H-form benefits was dropped following a rectification application. The original demand of INR 21.45 crore under Central Sales Tax Act for financial year 2020-2021 included tax, interest and penalty components, with the company having filed the rectification against the erroneous assessment order.",
            "Sentiment": "positive",
            "PublishDate": 1763472118549,
            "Source": "stock"
        },
        {
            "Title": "Sula Vineyards Reports Flat Q2 FY26 Revenue at INR 140 Crores, Wine Tourism Business Achieves Record Growth",
            "Summary": "Sula Vineyards maintained stable revenue at INR 140 crores in Q2 FY26 despite temporary disruptions in Telangana market, while Wine Tourism business delivered record 8% growth and launched third resort 'The Haven by Sula'. The company expects improved performance in H2 FY26 driven by Telangana market recovery, higher WIPS accruals, and sustained Wine Tourism momentum, with operating margins projected to improve by 250 basis points year-on-year.",
            "Sentiment": "neutral",
            "PublishDate": 1763371486184,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Allots 17,200 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Sula Vineyards Limited has allotted 17,200 equity shares with a face value of Rs. 2 each following the exercise of vested stock options under the Employee Stock Option Scheme 2021. The allotment was made to a grantee who exercised stock options under the ESOP 2021 scheme. The newly issued shares will rank equally with existing shares in all respects. Following this allotment, the company's total issued share capital stands at Rs. 16,88,94,450. The shares are listed on both NSE and BSE, with the company's registered office located in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1762817155427,
            "Source": "corporate_action"
        },
        {
            "Title": "Sula Vineyards Re-appoints Rajeev Samant as Managing Director CEO, Names Sahil Misra as Global Brand Ambassador",
            "Summary": "Sula Vineyards' Board of Directors approved the re-appointment of Rajeev Samant as Managing Director CEO for a three-year term from April 1, 2026 to March 31, 2029, subject to shareholder approval via postal ballot. The company also appointed Sahil Misra as Global Brand Ambassador Head of Exports under the Senior Management Personnel category, effective November 10, 2025. Rajeev Samant, the company's founder, is credited with pioneering India's modern commercial wine industry and holds degrees from Stanford University in Economics and Industrial Engineering. Sahil Misra is WSET Level 3 certified and serves as a jury member for the Young Sommeliers Olympiad, with leadership roles across various brands including Indri Single Malt Whiskey and The Oberoi Hotels.",
            "Sentiment": "positive",
            "PublishDate": 1762815632562,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sula Vineyards Reports 58% Decline in Q2 Net Profit to 60.2M Rupees",
            "Summary": "Sula Vineyards reported consolidated net profit of 60.2 million rupees for Q2, down from 144.8 million rupees in the same period last year. Revenue remained relatively stable at 1.4 billion rupees compared to 1.41 billion rupees year-over-year. EBITDA declined to 254.6 million rupees from 336 million rupees, while EBITDA margin compressed to 18.23% from 23.79% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762779398196,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports Stable Q2 FY26 Revenue; Wine Tourism Achieves Record Quarterly Performance",
            "Summary": "Sula Vineyards recorded revenue from operations of INR 139.7 crores in Q2 FY26, down 1.1% from INR 141.2 crores in Q2 FY25. The wine tourism segment delivered strong growth of 7.7% year-on-year to INR 13.2 crores, marking the highest ever Q2 revenue for this division. Own brands revenue declined 2.5% to INR 124.1 crores, primarily due to route-to-market disruption in Telangana where retailers are destocking ahead of retail license renewals. Excluding Telangana, own brands showed low single-digit growth. Wine tourism momentum was driven by increased footfalls, improved occupancy rates of 77% versus 74% last year, and higher spend per guest. The company launched its third resort, The Haven by Sula, a 30-key property near York Winery in Nashik featuring convention facilities. Elite and premium wines maintained a strong 78% share of the portfolio during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760445840858,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Receives ₹6.45 Crore Tax Demand, Plans Appeal",
            "Summary": "Sula Vineyards received a tax assessment order demanding ₹6.45 crore under the Central Sales Tax Act for FY23, issued by the Deputy Commissioner of State Tax, Nashik. The demand includes ₹3.57 crore for non-submission of F-Forms and C-Forms, plus ₹2.88 crore in interest. The company expects no financial implications at this stage and will file an appeal against the order. In quarterly results, consolidated net revenue declined 7.9% to ₹118.3 crore, with own-brand wine revenue falling 10.8% to ₹102.3 crore due to urban consumption slowdown. Wine tourism revenue increased 21.8% to ₹13.7 crore driven by higher footfalls and record resort occupancy. Shares closed at ₹264.80, down 1.73%.",
            "Sentiment": "negative",
            "PublishDate": 1758886630660,
            "Source": "stock"
        },
        {
            "Title": "Sula Vineyards Denies Premium Spirits Entry and Acquisition Talks",
            "Summary": "Sula Vineyards has denied claims about entering the premium spirits sector and stated that no acquisition discussions are currently taking place. The company clarified that any price changes are driven by market forces rather than strategic shifts or potential deals.",
            "Sentiment": "neutral",
            "PublishDate": 1755766175240,
            "Source": "stock"
        },
        {
            "Title": "Sula Vineyards Plans Expansion into Premium Spirits Market",
            "Summary": "Sula Vineyards is looking to expand its business operations by entering the premium spirits sector. The wine company is diversifying beyond its current wine portfolio to include premium spirits as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1755677718260,
            "Source": "stock"
        },
        {
            "Title": "Sula Vineyards Q1 FY26 Revenue Flat at INR 118 Crores Amid Urban Demand Softness and Maharashtra Wine Placement Disruption",
            "Summary": "Sula Vineyards reported Q1 FY26 revenue of INR 118 crores, remaining flat year-on-year after adjusting for a one-time WIPS gain of INR 10.4 crores from the previous year. The company's performance was impacted by continued softness in urban demand and temporary disruption in wine placement in Maharashtra during June following an excise duty hike announcement on spirits. Elite and premium wines grew modestly by 1% and now constitute 75% of own brand revenue, up from 71% in Q1 last year. The Source brand delivered strong double-digit growth and contributes nearly 10% to own brand revenue. Wine tourism business grew over 20% with resort occupancy rising to 82% from 70% in the previous year. Operating performance was affected by a 20% increase in cost of goods sold due to a change in wine sourcing model for the tourism business. The company expects operating margin improvement of a couple of hundred basis points in the second half of the financial year. Sula launched a new wine, Muscat Blanc, priced at INR 875 per bottle in Maharashtra and expanded CST portfolio to 9 labels. A new 30-room resort, Haven by Sula, is set to open near York winery before the festive season.",
            "Sentiment": "neutral",
            "PublishDate": 1755157515661,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Conducts Earnings Call for Quarter Ended June 30, 2025",
            "Summary": "Sula Vineyards Limited conducted an earnings call on August 8, 2025, to discuss their unaudited financial results and operations for the quarter ended June 30, 2025. The company has made the audio recording of the earnings call available on their website for investors and stakeholders. The call was held to review the company's quarterly performance and operational updates.",
            "Sentiment": "neutral",
            "PublishDate": 1754660216185,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports 7.9% Revenue Growth to Rs 118.3 Cr in Q1 FY26",
            "Summary": "Sula Vineyards recorded revenue from operations of Rs 118.3 crores, marking a 7.9% year-on-year increase in the first quarter. The company's gross profit reached Rs 89.8 crores, up 14.6% year-on-year, while operating EBITDA stood at Rs 18.3 crores, representing a 46.1% increase. Own brands sales grew 10.8% to Rs 102.3 crores, with the share of Elite & Premium categories improving to 74.7% from 71.0% in the previous year. The wine tourism segment achieved record quarterly revenue of Rs 13.7 crores, up 22.0% year-on-year, driven by over 100,000 visitor footfalls and 82% average room occupancy. The company launched India's first still Muscat wine with 7.5% ABV and expanded its facilities with a new Dindori bottle shop and tasting room. Despite revenue growth, profit after tax declined to Rs 1.9 crores from Rs 14.6 crores in the previous year, with PAT margin dropping to 1.6%. The company maintained its market leadership position with over 50% share in domestic wines and operates across 23 states through approximately 25,000 points of sale.",
            "Sentiment": "neutral",
            "PublishDate": 1754489607364,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Plans Expansion with 1 Million Litre Cellar and Premium Wine Launches",
            "Summary": "Sula Vineyards has announced plans for revenue and margin growth through multiple strategic initiatives. The company will expand its cellar capacity by 1 million litres and launch 3 new premium wines. Wine tourism will be enhanced through 'Haven By Sula' and new tasting rooms. The company also plans nationwide brand promotion targeting direct-to-consumer sales and the elite market segment.",
            "Sentiment": "positive",
            "PublishDate": 1754486656745,
            "Source": "stock"
        },
        {
            "Title": "Sula Vineyards Targets Strong Operating Profit Growth for FY26",
            "Summary": "Sula Vineyards has announced its aim to achieve strong operating profit growth for the remainder of FY26. The wine company has set this financial target as part of its business objectives.",
            "Sentiment": "positive",
            "PublishDate": 1754485749602,
            "Source": "stock"
        },
        {
            "Title": "Sula Vineyards Reports Sharp Decline in Q1 Profitability and Revenue",
            "Summary": "Sula Vineyards reported significantly weaker quarterly results with EBITDA falling to 183 million rupees from 340 million rupees year-over-year. The company's EBITDA margin compressed to 15.47% compared to 26.44% in the same period last year. Consolidated net profit dropped substantially to 19.4 million rupees from 146 million rupees year-over-year. Revenue also declined to 1.18 billion rupees from 1.28 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754483882705,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports Q1 Results with Growth in Wine Tourism",
            "Summary": "Sula Vineyards has reported stable revenue for Q1. The company's wine tourism segment grew by 21.8% year-over-year. Additionally, Sula Vineyards has launched a new low-alcohol Muscat wine.",
            "Sentiment": "positive",
            "PublishDate": 1752451692000,
            "Source": "default"
        },
        {
            "Title": "Sula Vineyards: Q1 Revenue Dips, Wine Tourism Shines",
            "Summary": "Sula Vineyards reported an 8% YoY decline in Q1 FY26 consolidated net revenue to ₹118.3 crore. Own-brand wine revenue fell 10.8%, but wine tourism revenue surged 21.8% to ₹13.7 crore. The company launched 'Sula Muscat Blanc', India's first low-alcohol Muscat wine.",
            "Sentiment": "neutral",
            "PublishDate": 1752236218000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports Q1 FY26 Results with Growth in Wine Tourism",
            "Summary": "Sula Vineyards announced its Q1 FY26 results, reporting steady revenue. The company's wine tourism segment saw a 21.8% year-over-year increase. Additionally, Sula Vineyards introduced a new low-alcohol Muscat wine to its product lineup.",
            "Sentiment": "positive",
            "PublishDate": 1752233018000,
            "Source": "default"
        },
        {
            "Title": "Sula Vineyards Invests 130 Million Rupees in Artisan Spirits Rights Issue",
            "Summary": "Sula Vineyards has invested 130 million rupees in a rights issue of Artisan Spirits. No additional details about the transaction or its implications were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751026459000,
            "Source": "default"
        },
        {
            "Title": "Sula Vineyards: Indian Wine Market Set for Recovery in FY26",
            "Summary": "Sula Vineyards forecasts a brighter outlook for the Indian wine market in FY26 after a challenging FY25. The company expects stronger momentum and growth, driven by planned expansions in own brands and wine tourism. Sula posted record operational revenue of ₹619.4 crore in FY25 despite market disruptions. The firm aims to expand cellar capacity to 19.2 million litres per annum by FY26 end.",
            "Sentiment": "positive",
            "PublishDate": 1750578429000,
            "Source": "normal_news"
        },
        {
            "Title": "Maharashtra Hikes Excise Duty on Liquor",
            "Summary": "The Maharashtra state cabinet has approved an increase in excise duty on liquor. This decision will lead to higher prices for alcoholic beverages in the state. Sula Vineyards, a prominent wine producer, is mentioned in the context of this news.",
            "Sentiment": "negative",
            "PublishDate": 1749600256000,
            "Source": "default"
        },
        {
            "Title": "Maharashtra Increases Excise Duty on Alcohol, Impacting Sula Vineyards",
            "Summary": "The Maharashtra State Cabinet has implemented an increase in excise duty on alcohol, leading to higher prices for liquor in the state. This regulatory change by the government has resulted in a price surge for alcoholic beverages, potentially affecting companies like Sula Vineyards.",
            "Sentiment": "negative",
            "PublishDate": 1749568556000,
            "Source": "default"
        },
        {
            "Title": "Sula Vineyards: Q4 Profit Dips, Wine Tourism Revenue Hits Record High",
            "Summary": "Sula Vineyards reported a 4.4% YoY decline in Q4 net profit to ₹13 crore. Revenue increased 1% to ₹133 crore. Wine tourism revenue reached an all-time high of ₹60.3 crore in FY25. Elite and premium wine segments grew 5% YoY. The company declared a final dividend of ₹3.60 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1746716538000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Announces Q4 Results and Dividend",
            "Summary": "Sula Vineyards has declared a dividend of 3.60 rupees per equity share. The company's Q4 financial results show a slight year-over-year decline in key metrics. EBITDA decreased to 290 million rupees from 295 million, with EBITDA margin dropping to 21.80% from 22.37%. Consolidated net profit fell to 130 million rupees from 136 million year-over-year, but improved from 281 million quarter-over-quarter. Revenue for Q4 was 1.3 billion rupees, down from 1.32 billion in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1746713603000,
            "Source": "result"
        },
        {
            "Title": "Sula Vineyards to Consider Q4 Results on May 8",
            "Summary": "Sula Vineyards has announced that it will consider its fourth quarter (Q4) financial results on May 8. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745933232000,
            "Source": "default"
        },
        {
            "Title": "Sula Vineyards: Record FY25 Revenue Boosts Share Price",
            "Summary": "Sula Vineyards reported record revenue of Rs 618.8 crore for FY2025, up 1.7% year-on-year. Q4 revenue was flat at Rs 132.6 crore. Wine tourism revenue grew 24.6% in Q4 and 10.2% for the full year. The company listed four new wines with Canteen Stores Department. Share price rose 2.61% to Rs 282.70 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1744699177000,
            "Source": "result"
        },
        {
            "Title": "Sula Vineyards Reports Modest Revenue Growth in Q4 FY25",
            "Summary": "Sula Vineyards announced its financial results for the fourth quarter of fiscal year 2025. The company reported revenue from operations of 1.33 billion rupees, representing a slight increase of 0.7% compared to the same period in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1744677373000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports Modest Revenue Growth in Q4 FY25",
            "Summary": "Sula Vineyards announced its Q4 FY25 financial results, reporting revenue from operations of 1.33 billion rupees, representing a modest year-over-year growth of 0.7%. The company acknowledged the modest nature of this revenue increase in their statement.",
            "Sentiment": "neutral",
            "PublishDate": 1744381079000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards: India's Leading Wine Producer Poised for Growth",
            "Summary": "Sula Vineyards, with a 50% market share in India's grape wine segment, is well-positioned for growth due to favorable demographics and low per capita alcohol consumption. The company's stock is trading at a discount compared to competitors. Sula's focus on premium segments, wine tourism expansion, and new initiatives like canned wines are expected to drive long-term growth. However, recent sales have slowed due to elections and urban demand softening.",
            "Sentiment": "positive",
            "PublishDate": 1743869309000,
            "Source": "normal_news"
        },
        {
            "Title": "Sula Vineyards Reports Q3 Financial Results",
            "Summary": "Sula Vineyards announced its Q3 consolidated net profit at 281 million rupees, compared to 430 million rupees year-over-year and 145 million rupees quarter-over-quarter. The company's Q3 revenue remained stable at 2.17 billion rupees, unchanged from the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738801305000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards: Q3 Profit Drops 35% Amid Margin Pressure",
            "Summary": "Sula Vineyards reported a 34.9% decline in Q3 FY25 net profit to ₹28 crore. Revenue decreased 1.4% to ₹200 crore, while EBITDA fell 26.1% to ₹53 crore. Margins contracted to 26.5% from 35.3%. Elite & Premium wines grew 5.6%, reaching 80.5% share. Wine tourism showed strong performance with improved occupancy and higher guest spending.",
            "Sentiment": "negative",
            "PublishDate": 1738763897000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Sula Vineyards experienced a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 530 million rupees from 718 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 24.42% from 33.09% year-over-year, indicating a substantial reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738760124000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports Q3 Financial Results",
            "Summary": "Sula Vineyards announced its Q3 consolidated net profit of 281 million rupees, showing a decrease from 430 million rupees year-over-year. However, it increased from 145 million rupees quarter-over-quarter. The company's Q3 revenue remained stable at 2.17 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738760068000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards: Stock Plummets 51% from Peak Amid Q3 Demand Slump",
            "Summary": "Sula Vineyards Ltd. shares have fallen 51% from their life high of Rs 699, dropping nearly 18% in 2025. The decline is attributed to subdued demand and pressured margins. The stock is approaching its listing price after previously gaining 110% since its debut on Indian exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1738041571000,
            "Source": "normal_news"
        },
        {
            "Title": "Sula Vineyards: Mukul Agrawal Reduces Stake in Q3",
            "Summary": "Investor Mukul Agrawal reduced his stake in Sula Vineyards from 2.37% to 2.19% in Q3 FY25. The company reported 1% growth in own brand revenue and 11.5% growth in wine tourism revenue YoY for Q3, but net revenue dipped 0.7% to ₹217.3 crore.",
            "Sentiment": "negative",
            "PublishDate": 1737014889000,
            "Source": "normal_news"
        },
        {
            "Title": "Sula Vineyards Reports Record Q3 Revenues for Own Brands and Wine Tourism",
            "Summary": "Sula Vineyards has announced its highest ever revenues for own brands and wine tourism in the third quarter of fiscal year 2025. The company's elite and premium portfolio led this growth. However, overall net revenue for Q3 decreased by 0.7% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1736900139000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards Reports Record Q3 Revenues Amid Overall Decline",
            "Summary": "Sula Vineyards achieved its highest-ever revenues from own brands and wine tourism in Q3 FY25, with the elite and premium portfolio leading the growth. However, the company's overall net revenue for the quarter decreased by 0.7% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736856076000,
            "Source": "earnings"
        },
        {
            "Title": "Sula Vineyards: CEO Sees No Return to 30% EBITDA",
            "Summary": "Sula Vineyards' CEO Rajeev Samant indicates that the company does not anticipate returning to 30% EBITDA levels in the near future.",
            "Sentiment": "neutral",
            "PublishDate": 1731494351000,
            "Source": "normal_news"
        },
        {
            "Title": "Sula Vineyards: Telangana Emerges as New Growth Market Amid Q2 Challenges",
            "Summary": "Sula Vineyards reports Telangana catching up with Maharashtra in wine demand. Q2 sees revenue drop 1.1% YoY to Rs 132.36 crore, net profit down 37% to Rs 14.48 crore. Wine tourism shows promise. Four new brands approved for Canteen Stores Department sales. Company plans re-entry into Andhra Pradesh market.",
            "Sentiment": "neutral",
            "PublishDate": 1731480788000,
            "Source": "result"
        },
        {
            "Title": "Sula Vineyards: Stock Plunges 8% on Weak Q2 Results",
            "Summary": "Sula Vineyards' stock dropped 8.13% to ₹382, nearing its IPO price, following a 37.3% decline in Q2FY25 net profit to ₹14.5 crore. Revenue fell 1.2% YoY to ₹142 crore, with Own Brands segment affected by urban demand slowdown and regulatory disruptions. EBITDA decreased 23.85% YoY, while finance costs increased 16% due to higher debt.",
            "Sentiment": "negative",
            "PublishDate": 1731477856000,
            "Source": "result"
        },
        {
            "Title": "Sula Vineyards Expands Wine Tourism Facilities",
            "Summary": "Sula Vineyards has announced expansions to its wine tourism facilities. ND Wines, a subsidiary, will have an expanded bottle shop operational from November 2024, with a tasting room and restaurant set to open in Q4. Additionally, Domaine Sula is planning to expand its wine tourism facilities, with the opening slated for Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1731469232000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sula Vineyards Reports Q2 Financial Results",
            "Summary": "Sula Vineyards announced its Q2 consolidated net profit of 144 million rupees, down from 231 million rupees year-over-year, but slightly up from 146 million rupees quarter-over-quarter. The company's Q2 revenue stood at 1.4 billion rupees, marginally lower than the 1.43 billion rupees reported in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731456075000,
            "Source": "result"
        },
        {
            "Title": "Sula Vineyards Reports Q2 Revenue Decline",
            "Summary": "<p><span class=\"neutral\">Sula Vineyards</span> has reported a <span class=\"negative\">1.3% year-over-year decrease</span> in <b>net revenue</b> for the second quarter. Despite this <span class=\"negative\">setback</span>, the company remains <span class=\"positive\">optimistic</span>, stating that these <span class=\"negative\">challenges</span> are <b>temporary</b> and expected to <span class=\"positive\">resolve</span> in the coming months.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728659315000,
            "Source": "result"
        }
    ]
}