{
    "Symbol": "SUMEETINDS",
    "ISIN": "INE235C01036",
    "News": [
        {
            "Title": "Sumeet Industries Q3 FY26 Earnings Call on Feb 13",
            "Summary": "Sumeet Industries Limited has scheduled an earnings conference call for February 13, 2026 at 11:00 AM IST to discuss Q3 & 9M FY26 results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770641093401,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sumeet Industries Gets NSE Nod for Promoter Reclassification",
            "Summary": "Sumeet Industries received NSE approval to reclassify 16 erstwhile promoters from Promoter Group to Public category under Regulation 31A(9), along with a warning letter for delayed disclosure compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769677539704,
            "Source": "stocks"
        },
        {
            "Title": "Sumeet Industries Seeks Promoter Reclassification",
            "Summary": "Sumeet Industries applies for reclassification of 16 erstwhile promoters from promoter group to public category under SEBI regulations following NCLT-approved resolution plan.",
            "Sentiment": "neutral",
            "PublishDate": 1768891828599,
            "Source": "stocks"
        },
        {
            "Title": "Sumeet Industries Board Approves ₹200 Cr Rights Issue",
            "Summary": "Sumeet Industries board has approved a rights issue to raise up to ₹200 crore through equity shares, subject to regulatory approvals and shareholder consent.",
            "Sentiment": "positive",
            "PublishDate": 1768834112044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sumeet Industries Plans Equity Fundraising Meeting",
            "Summary": "Sumeet Industries has announced plans to consider raising funds through equity share issuance during a board meeting scheduled for January 19th, marking a potential capital expansion initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1768219739481,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sumeet Industries Board Meet on Jan 19 for Fund Raising",
            "Summary": "Sumeet Industries Limited has scheduled a board meeting on January 19, 2026, to evaluate raising funds through equity shares and other eligible securities via various modes including preferential or rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1768213478952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sumeet Industries Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Sumeet Industries reported quarterly net profit of 98.6 million rupees, down from 138.7 million rupees in the same period last year. Revenue increased to 2.69 billion rupees from 2.42 billion rupees year-over-year. EBITDA rose significantly to 145.1 million rupees from 33.4 million rupees, with EBITDA margin improving to 5.39% from 1.38%. The company recorded an exceptional gain of 157.7 million rupees during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762965603424,
            "Source": "earnings"
        }
    ]
}