{
    "Symbol": "SUMICHEM",
    "ISIN": "INE258G01013",
    "News": [
        {
            "Title": "Sumitomo Chemical Q3FY26 Net Profit Drops 11.2%",
            "Summary": "Sumitomo Chemical India reported Q3FY26 net profit of ₹748.26 million, down 11.2% YoY, despite revenue declining 11.4% to ₹5,517.58 million. Exceptional items of ₹151.86 million impacted results.",
            "Sentiment": "negative",
            "PublishDate": 1769503356763,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sumitomo Chemical Board Meet on Jan 27 for Q3FY26",
            "Summary": "Sumitomo Chemical India Limited has scheduled its board meeting for January 27, 2026, to consider Q3FY26 standalone and consolidated unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767683578312,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sumitomo Chemical Reports Insider Trading Violation",
            "Summary": "Sumitomo Chemical India reports violation by General Manager who pledged 250 shares without pre-clearance, resulting in ₹5,000 penalty transferred to SEBI-IPEF.",
            "Sentiment": "negative",
            "PublishDate": 1767338051614,
            "Source": "stocks"
        },
        {
            "Title": "Sumitomo Chemical India Reports 9% Revenue Growth Despite Weather Challenges in H1 FY26",
            "Summary": "Sumitomo Chemical India Limited reported consolidated revenue of INR 1,987 crores in H1 FY26, representing 9% year-on-year growth, with profit after tax increasing 11% to INR 356 crores. However, Q2 FY26 revenue declined to INR 930 crores from INR 988 crores in the previous year due to excessive rainfall from July to September that disrupted farming activities and delayed spray applications. The company maintained gross margins at 43.1% in Q2 and EBITDA margins at 22% for H1 despite weather-related volume impacts. Domestic business contributed 85% of revenue with 11% growth, while exports declined 4% due to reduced sales in South America and Africa. The company launched new products including rice herbicide Lentigo and fungicide Excalia Max, both performing ahead of targets. Cash and cash equivalents stood at INR 2,089 crores, providing strong liquidity. Management expects recovery in the Rabi season due to improved field conditions and adequate water reserves. The company plans capex of INR 500-600 crores over five years for seven products at the upcoming Dahej facility, pending approvals from the parent company.",
            "Sentiment": "neutral",
            "PublishDate": 1762167660730,
            "Source": "earnings"
        },
        {
            "Title": "Sumitomo Chemical India Sets Ambitious FY27 Targets with Revenue Goal of ₹6,500-7,000 Crore",
            "Summary": "Sumitomo Chemical India has announced comprehensive financial and operational targets for FY27. The company aims to achieve revenue of ₹6,500-7,000 crore with 18% profit after tax growth. The growth strategy includes launching 40 new agricultural molecules and scaling exports to ₹2,500 crore. The company also targets maintaining zero debt while building cash reserves above ₹2,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761581754460,
            "Source": "stock"
        },
        {
            "Title": "Sumitomo Chemical India Reports Decline in Q2 Financial Performance",
            "Summary": "Sumitomo Chemical India reported Q2 revenue of 9.3 billion rupees, down from 9.9 billion rupees in the same period last year. The company's consolidated net profit decreased to 1.78 billion rupees from 1.9 billion rupees year-over-year. EBITDA fell to 2.18 billion rupees compared to 2.45 billion rupees previously, while EBITDA margin compressed to 23.45% from 24.82% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1761552590926,
            "Source": "earnings"
        },
        {
            "Title": "Sumitomo Chemical India Reappoints Anil Nawal as CFO and Submits Quarterly Results",
            "Summary": "Sumitomo Chemical India Limited has appointed Anil Nawal as Chief Financial Officer effective August 15, 2025, following his retirement under the company's retirement policy. Nawal, a Chartered Accountant and Company Secretary with 37 years of experience, has been serving as the company's CFO since 2019. The appointment maintains the same terms as his existing role. The company also submitted its unaudited financial results for the quarter ended June 30, 2025, with the board meeting held on August 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754293910701,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sumitomo Chemical India Reports Strong Q1 Growth with Revenue Up 26% and Profit Rising 42%",
            "Summary": "Sumitomo Chemical India delivered robust quarterly performance with revenue increasing to 10.6 billion rupees from 8.4 billion rupees year-over-year. The company's consolidated net profit grew to 1.8 billion rupees compared to 1.27 billion rupees in the same period last year. EBITDA expanded to 2.2 billion rupees from 1.61 billion rupees, while EBITDA margin improved to 20.74% from 19.2% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754292311294,
            "Source": "earnings"
        },
        {
            "Title": "Sumitomo Chemical Provides Guidance for FY '26",
            "Summary": "Sumitomo Chemical has provided guidance for FY '26, aiming to sustain margins through tight cost controls and optimized operations. The company plans to launch new products in FY '25-'26 and expects volume growth driven by a supportive external environment and normal monsoon forecast. Sumitomo Chemical anticipates a 10% net growth in the domestic market and a 20% total top-line growth in exports. The company focuses on profitability and expects to meet expectations, even if revenues are lower. While they expect a period of growth supported by favorable agro-climatic outlook and stability in commodity pricing, they cannot commit to specific revenue growth numbers at this time.",
            "Sentiment": "positive",
            "PublishDate": 1748489299000,
            "Source": "default"
        },
        {
            "Title": "Sumitomo Chemical India Reports Q4 Results and Dividend",
            "Summary": "Sumitomo Chemical India has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit decreased to 996 million rupees from 1.1 billion rupees year-over-year. Q4 revenue slightly increased to 6.79 billion rupees from 6.74 billion rupees year-over-year. EBITDA for Q4 declined to 1.19 billion rupees from 1.4 billion rupees, with EBITDA margin dropping to 17.60% from 20.79% year-over-year. The company has recommended a dividend of 1.2 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748267306000,
            "Source": "result"
        },
        {
            "Title": "Sumitomo Chemical India: Q3 Profit Surges 58.93% YoY",
            "Summary": "Sumitomo Chemical India reported Q3 FY25 results with profit rising 58.93% YoY to ₹86.95 crore. Revenue increased 18.43% YoY to ₹641.92 crore. However, compared to Q2, revenue declined 35.05% and profit decreased 54.78%. Operating income grew 75.15% YoY but fell 62.08% QoQ. EPS stood at ₹1.74, up 58.18% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1738045164000,
            "Source": "earnings"
        },
        {
            "Title": "Sumitomo Chemical Reports Q3 Revenue Increase",
            "Summary": "Sumitomo Chemical has reported a revenue of 6.4 billion rupees for the third quarter, compared to 5.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737967074000,
            "Source": "earnings"
        },
        {
            "Title": "Sumitomo Chemical Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Sumitomo Chemical has announced its Q3 financial results, showing a substantial year-over-year improvement. The company's EBITDA rose to 1.06 billion rupees, up from 658 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 16.54%, compared to 12.14% in the year-ago period, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737967059000,
            "Source": "earnings"
        },
        {
            "Title": "Sumitomo Chemical Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Sumitomo Chemical has announced its third-quarter consolidated net profit of 870 million rupees, showing a significant increase from 547 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737967024000,
            "Source": "earnings"
        },
        {
            "Title": "Sumitomo Chemical India Reports Strong Q2 Financial Performance",
            "Summary": "Sumitomo Chemical India has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.45 billion rupees from 1.88 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 24.82% from 20.80% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1730105945000,
            "Source": "result"
        },
        {
            "Title": "Sumitomo Chemical India Reports Q2 Revenue Growth",
            "Summary": "Sumitomo Chemical India has announced its second quarter revenue for the current fiscal year. The company reported revenue of 9.9 billion rupees, compared to 9 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730105913000,
            "Source": "result"
        },
        {
            "Title": "Sumitomo Chemical India Reports Q2 Profit Growth",
            "Summary": "Sumitomo Chemical India has announced its Q2 consolidated net profit of 1.9 billion rupees, compared to 1.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730105886000,
            "Source": "result"
        }
    ]
}