{
    "Symbol": "SUMIT",
    "ISIN": "INE748Z01013",
    "News": [
        {
            "Title": "Sumit Woods Subsidiary Secures ₹737 Cr Mahim Project",
            "Summary": "Sumit Woods subsidiary enters agreement for Nav Vidya Laxmi CHSL redevelopment project in Mahim worth approximately ₹737 crores with 170,000 sq ft FSI area.",
            "Sentiment": "positive",
            "PublishDate": 1767167793053,
            "Source": "stocks"
        },
        {
            "Title": "Sumit Woods Receives Approval for Second Building in Borivali West Project",
            "Summary": "Sumit Woods has obtained approval for Building No. 2 in its 'Sumit KMR Param' project located in Borivali West, covering 26,000 square feet. The approved building has a potential income generation capacity of ₹43 crores for the company.",
            "Sentiment": "positive",
            "PublishDate": 1763544233045,
            "Source": "stock"
        },
        {
            "Title": "Sumit Woods Secures Redevelopment Project in Borivali East Worth ₹695 Crores",
            "Summary": "Sumit Woods has undertaken a redevelopment project for Pruthvi Enclave CHS Ltd. in Borivali East. The project spans 6.70 lakh square feet with a gross development value of ₹695 crores. The development is situated near Magathane Metro Station.",
            "Sentiment": "positive",
            "PublishDate": 1762758648663,
            "Source": "stock"
        },
        {
            "Title": "Sumit Woods Reports Project Revenue Potential of Rs 90 Crores with FY25 Sales Target of Rs 120 Crores",
            "Summary": "Sumit Woods announced details of a real estate project with a saleable carpet area of approximately 32,888 square feet. The project has an estimated revenue potential of Rs 90 crores. The company also reported FY25 sales figures of Rs 120 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761896752823,
            "Source": "stock"
        },
        {
            "Title": "Sumit Woods Receives Development Commencement Certificate for Kolekalayan Plot",
            "Summary": "Sumit Woods has obtained a commencement certificate from the Municipal Corporation for development activities at Plot No. 501B in Village Kolekalayan. The certificate is valid until October 29, 2026, and comes with certain conditions that must be met during the development process.",
            "Sentiment": "positive",
            "PublishDate": 1761896193210,
            "Source": "stock"
        },
        {
            "Title": "Sumit Woods Selected as Redeveloper for 700 Crore Rupee Project",
            "Summary": "Sumit Woods has been chosen as the redeveloper for a project with a Gross Development Value (GDV) of 700 crore rupees. The company's current market capitalization is 400 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747201397000,
            "Source": "default"
        },
        {
            "Title": "Sumit Woods Subsidiary Signs ₹737 Crore Redevelopment Project in Mumbai",
            "Summary": "A subsidiary of Sumit Woods has entered into an agreement for a redevelopment project in Mahim, Mumbai, valued at ₹737 crore. This project represents a significant business opportunity for the company in the real estate sector of Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1743491808000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sumit Woods Receives Commencement Certificate for New Development Project",
            "Summary": "Sumit Woods has been granted a commencement certificate for a new development project. The project is expected to generate a revenue potential of approximately 400 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742377714000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sumit Woods Reports Increased Q3 Profit Despite Revenue Decline",
            "Summary": "Sumit Woods has reported a significant increase in its consolidated net profit for the third quarter, rising to 29 million rupees from 16 million rupees in the same period last year. However, the company's revenue for Q3 decreased to 298 million rupees from 429 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739199379000,
            "Source": "earnings"
        },
        {
            "Title": "Sumit Woods Announces Prabhadevi Project with 5 Billion Rupee Development Value",
            "Summary": "Sumit Woods, a company with a market capitalization of 450 crore rupees, has announced a new project in Prabhadevi. The project is expected to offer a gross development value of approximately 5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734331090000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sumit Woods Injects 860 Million Rupees for Future Projects",
            "Summary": "Sumit Woods, a real estate company, has invested 860 million rupees as fresh capital to fund its upcoming projects. This significant injection of funds indicates the company's commitment to growth and expansion in its future endeavors.",
            "Sentiment": "positive",
            "PublishDate": 1733920173000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sumit Woods Signs Development Agreement for Mumbai Project",
            "Summary": "Sumit Woods has entered into a development agreement for a construction and redevelopment project in Malad, Mumbai. The project has an estimated revenue potential of approximately 230 crore rupees. The company's current market capitalization is 420 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733730698000,
            "Source": "corporate_action"
        }
    ]
}