{
    "Symbol": "SUMMITSEC",
    "ISIN": "INE519C01017",
    "News": [
        {
            "Title": "Summit Securities Q3FY26 Results Show Strong Growth",
            "Summary": "Summit Securities Limited reported Q3FY26 standalone profit of ₹654.98 lakhs vs loss of ₹422.92 lakhs in Q3FY25. Nine-month profit reached ₹5,218.07 lakhs, up from ₹3,249.97 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769679368808,
            "Source": "co_actions_results"
        },
        {
            "Title": "Summit Securities Board Meet Set for Jan 29, 2026",
            "Summary": "Summit Securities Limited has scheduled a board meeting on January 29, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769006202013,
            "Source": "co_actions_results"
        },
        {
            "Title": "Summit Securities Independent Director Abhay Vasant Nerurkar's Term Concludes",
            "Summary": "Summit Securities Limited announced that Abhay Vasant Nerurkar's second consecutive term as Independent Director concluded on October 28, 2025. Nerurkar ceased to be an Independent Director with effect from close of business hours on October 28, 2025, following the completion of his five-year term. The company disclosed this information under SEBI Listing Regulations to the National Stock Exchange and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761648133270,
            "Source": "corporate_governance"
        },
        {
            "Title": "Summit Securities Reports Strong Q2 Performance with ₹9,066 Crore Profit",
            "Summary": "Summit Securities Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a consolidated profit of ₹9,066.16 crore for the quarter, compared to ₹7,515.04 crore in the same period last year. For the half year, consolidated profit reached ₹11,084.78 crore versus ₹7,809.50 crore in the previous year. Revenue from operations for the quarter stood at ₹11,968.02 crore, driven primarily by dividend income of ₹11,534.73 crore and net gains on fair value changes of ₹354.98 crore. On a standalone basis, the company posted quarterly profit of ₹3,624.35 crore with revenue from operations of ₹4,678.84 crore. The company operates as a single segment focused on holding and investing to earn income through dividends, interest and gains from investments. Basic earnings per share for the consolidated entity was ₹83.16 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760516247122,
            "Source": "earnings"
        },
        {
            "Title": "Summit Securities Pays Rs 52,000 Fine to BSE for Delayed PDF Submission of Annual Secretarial Compliance Report",
            "Summary": "Summit Securities Limited has paid a fine of Rs 52,000 plus applicable taxes to BSE for delayed submission of its Annual Secretarial Compliance Report for the year ended March 31, 2025 in PDF format. The company had submitted the report on time in XBRL format to BSE and in both formats to NSE within prescribed timelines. The Board of Directors noted that the delayed PDF submission to BSE was unintentional and due to oversight. The fine has been reported in the company's Integrated Governance Report for the quarter ended June 30, 2025. The Board has advised management to ensure timely compliance in the future.",
            "Sentiment": "neutral",
            "PublishDate": 1753795191694,
            "Source": "corporate_governance"
        },
        {
            "Title": "Summit Securities Reports Strong Q1 Results with 938.74 Lakh Profit and 8.61 EPS",
            "Summary": "Summit Securities Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone profit of ₹938.74 lakh compared to ₹849.09 lakh in the same quarter last year, with earnings per share of ₹8.61. Total revenue from operations reached ₹1,177.75 lakh, driven primarily by net gain on fair value changes of ₹1,131.62 lakh and interest income of ₹45.58 lakh. On a consolidated basis, the company achieved a profit of ₹2,018.62 lakh with earnings per share of ₹18.52. The consolidated revenue from operations was ₹2,754.29 lakh, including net gain on fair value changes of ₹2,665.78 lakh. The company operates as a single segment focused on holding and investing to earn income through dividends, interest and gains from investments. The results were approved by the Board of Directors at a meeting held on July 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753780694402,
            "Source": "earnings"
        },
        {
            "Title": "Summit Securities Reports Q4 Net Loss of 46M Rupees",
            "Summary": "Summit Securities has reported a consolidated net loss of 46 million rupees for the fourth quarter, compared to a profit of 144 million rupees in the same period last year. The company's revenue also decreased to 98 million rupees from 197 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1746435074000,
            "Source": "result"
        },
        {
            "Title": "Summit Securities Reports Strong Q2 Revenue Growth",
            "Summary": "Summit Securities has reported a significant increase in its second-quarter revenue. The company's revenue for Q2 reached 1.1 billion rupees, compared to 533 million rupees in the same period last year, representing a year-over-year growth of approximately 106%.",
            "Sentiment": "positive",
            "PublishDate": 1729675070000,
            "Source": "result"
        },
        {
            "Title": "Summit Securities Reports Significant Profit Growth in Q2",
            "Summary": "Summit Securities has announced its Q2 consolidated net profit of 751 million rupees, showing a substantial increase from 383 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729675033000,
            "Source": "result"
        }
    ]
}