{
    "Symbol": "SUNCLAY",
    "ISIN": "INE0Q3R01026",
    "News": [
        {
            "Title": "Sundaram-Clayton merges US subsidiaries",
            "Summary": "Sundaram-Clayton Limited announces merger of wholly owned US subsidiaries SCL USA and SHUI, effective December 16, 2025, with Certificate of Merger received February 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770291616871,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram Clayton Q3 Loss Widens to ₹520M",
            "Summary": "Sundaram Clayton reports consolidated net loss of ₹520 million in Q3, marking an increase from ₹441 million loss in the same quarter last year, reflecting continued operational challenges.",
            "Sentiment": "negative",
            "PublishDate": 1769671619254,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram-Clayton Gets CRISIL AA-/Negative Rating Reaffirmed",
            "Summary": "CRISIL reaffirmed Sundaram-Clayton's AA-/Negative rating on ₹1,735.24 crore bank facilities while withdrawing ₹50 crore NCD rating. Company expects debt reduction from ₹560.67 crore land sale proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1769149323550,
            "Source": "stocks"
        },
        {
            "Title": "Sundaram Clayton Sells Chennai Land for ₹560.67 Cr",
            "Summary": "Sundaram Clayton Limited executes agreement to sell 16.381 acres Chennai land to Canopy Living LLP for ₹560.67 crores under Regulation 30. Transaction expected to complete by February 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767860442464,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram-Clayton Acquires 11.63% Stake in Navia Two Power for Rs 1.16 Lakh",
            "Summary": "Sundaram-Clayton Limited acquired 11.63% equity stake in Navia Two Power Private Limited, a special-purpose vehicle for captive power plant operations, for Rs 1,16,280. The acquisition aims to comply with regulatory requirements for captive power consumption under electricity laws, with Navia being a renewable energy company incorporated in August 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1764311615601,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram-Clayton Director Rajesh Narasimhan Resigns Due to Personal Reasons",
            "Summary": "Mr. Rajesh Narasimhan (DIN: 07824276) resigned as Non-Executive Non-Independent Director of Sundaram-Clayton Limited effective November 28, 2025, citing personal reasons. His resignation also resulted in him ceasing to be the Chairperson of the company's Stakeholders Relationship Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1764311312650,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sundaram Clayton Reports 9% EBITDA Growth Despite Revenue Decline in Q2 FY2025-26",
            "Summary": "Sundaram Clayton Limited reported EBITDA of Rs. 79.1 crores for Q2 FY2025-26, marking a 9% improvement from Rs. 72.5 crores in Q2 FY2024-25. However, standalone revenue declined to Rs. 462.9 crores from Rs. 542.1 crores year-over-year, partly due to the sale of the 2W casting business in Hosur during Q4 FY2024-25. For the half-year ended September 2025, EBITDA increased to Rs. 149.7 crores from Rs. 133.7 crores, while revenue decreased to Rs. 906.9 crores from Rs. 1,095.7 crores. The company's India operations received customer appreciation for efficiency at its Chennai mega die-casting facility, and it won awards for cost management and ESG practices. The North American automotive market remains subdued due to tariff uncertainties affecting production schedules.",
            "Sentiment": "positive",
            "PublishDate": 1762416275714,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram-Clayton Limited Declares Interim Dividend of Rs. 4.75 Per Share",
            "Summary": "Sundaram-Clayton Limited's Board of Directors declared an interim dividend of Rs. 4.75 per share (95%) for the financial year ending March 31, 2025. The dividend applies to 2,20,46,162 equity shares of Rs. 5 each, absorbing Rs. 10.42 crores. The record date is set for March 27, 2025, and payment will be made within 30 days of declaration. Shareholders holding shares in physical or electronic form whose names appear in the Register of Members or Depositories as of the record date will be eligible for the dividend.",
            "Sentiment": "positive",
            "PublishDate": 1757135743290,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram-Clayton Appoints New CFO and Reports Strong Q1 EBITDA Growth of 16%",
            "Summary": "Sundaram-Clayton Limited appointed Hariharan V as Chief Financial Officer effective September 1, 2025. The company reported strong EBITDA growth of 16% in Q1 FY2025-26 at Rs. 70.6 crores compared to Rs. 61.1 crores in Q1 FY2024-25. Standalone revenue for Q1 was Rs. 444.1 crores versus Rs. 553.6 crores in the previous year quarter. The company's operations have ramped up smoothly at its new Thervoy Kandigai Plant following the commencement of full-scale operations. SCL is consolidating its 3 Indian plants into 2 plants, with the process in final stages. US operations achieved highest quarterly sales of Rs. 79.7 crores since inception, reflecting a 32% increase over Q1 FY2024-25. The company invested Rs. 77.31 crores in its overseas subsidiary Sundaram Holding USA Inc during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754465600553,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sundaram-Clayton Reports 16% EBITDA Growth Despite Revenue Decline in Q1 FY26",
            "Summary": "Sundaram-Clayton Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs. 442.12 crores compared to Rs. 549.04 crores in the same quarter last year. Despite the revenue decline, EBITDA improved by 16% to Rs. 70.6 crores versus Rs. 61.1 crores in Q1 2024-25. The revenue decrease is attributed to the transfer of the Hosur business unit in Q4 FY2024-25. Net profit for the quarter stood at Rs. 17.01 crores with earnings per share of Rs. 7.72. The company's operations have successfully ramped up at its new Thervoy Kandigai Plant without disruptions. US operations achieved their highest quarterly sales of Rs. 79.7 crores, marking a 32% increase over the previous year. The company is consolidating its three Indian plants into two facilities to improve operational efficiency. During the quarter, Sundaram-Clayton invested Rs. 77.31 crores in its overseas subsidiary, Sundaram Holding USA Inc.",
            "Sentiment": "positive",
            "PublishDate": 1754465096040,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram-Clayton Reports Wider Quarterly Net Loss of Rs 580 Million",
            "Summary": "Sundaram-Clayton posted a consolidated net loss of Rs 580 million in its latest quarterly results, compared to a net loss of Rs 560 million in the same period last year, representing a year-on-year increase in losses of Rs 20 million.",
            "Sentiment": "negative",
            "PublishDate": 1754464535375,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram-Clayton to Review Q1 Results on August 6",
            "Summary": "Sundaram-Clayton has announced that it will review its first quarter results on August 6. The company has scheduled a meeting to discuss and analyze the financial performance for the latest quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751977414000,
            "Source": "default"
        },
        {
            "Title": "Sundaram-Clayton Reports Strong Q4 Financial Performance",
            "Summary": "Sundaram-Clayton has reported significant improvements in its Q4 financial results. The company's EBITDA increased to 313 million rupees from 153 million rupees year-over-year, with the EBITDA margin rising to 5.33% from 2.76%. Revenue grew to 5.9 billion rupees from 5.5 billion rupees. Notably, the company swung to a consolidated net profit of 1.43 billion rupees, compared to a loss of 473 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746516710000,
            "Source": "result"
        },
        {
            "Title": "Sundaram-Clayton Declares Interim Dividend for FY25",
            "Summary": "Sundaram-Clayton Limited has announced an interim dividend of 4.75 rupees per share for the fiscal year 2025. This corporate action represents a distribution of profits to shareholders, reflecting the company's financial performance and commitment to shareholder returns.",
            "Sentiment": "positive",
            "PublishDate": 1742775379000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram-Clayton Limited: Declares Rs 4.75 Interim Dividend, Sets March 27 Record Date",
            "Summary": "Sundaram-Clayton Ltd. has declared an interim dividend of Rs 4.75 per share for FY 2024-25, with a record date of March 27. The total payout will be approximately Rs 10.42 crore for 2.2 crore shares. Payment will be made within 30 days of declaration.",
            "Sentiment": "positive",
            "PublishDate": 1742560609000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Clayton Approves Sale of Aluminium Die-casting Businesses at Hosur Plant",
            "Summary": "Sundaram Clayton Limited has approved the sale of its aluminium die-casting businesses located at its Hosur plant. This decision represents a significant corporate action that may impact the company's operations and financial structure.",
            "Sentiment": "neutral",
            "PublishDate": 1740010629000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram-Clayton Ltd: To Divest Aluminium Die-Casting Business at Hosur Plant",
            "Summary": "Sundaram-Clayton Ltd plans to sell its high-pressure and low-pressure aluminium die-casting operations at its Hosur facility. The decision was approved by the Board on February 19. Definitive agreements are pending, and the transaction is subject to regulatory approvals. Buyer identity and financial terms are yet to be determined.",
            "Sentiment": "neutral",
            "PublishDate": 1739965760000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram-Clayton: Raises ₹400 Crore via QIP, Attracts Major Investors",
            "Summary": "<p><span class='positive'>Sundaram-Clayton Ltd.</span> raised <span class='positive'>₹399.99 crore</span> through a <b>Qualified Institutional Placement (QIP)</b>, allotting <span class='neutral'>18.14 lakh equity shares</span> at <span class='neutral'>₹2,205 per share</span>. <span class='positive'>ICICI Prudential Flexicap Fund</span> secured the largest allocation with <span class='positive'>25%</span> of the issue. The company's paid-up equity share capital increased to <span class='positive'>₹11.02 crore</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728450905000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram-Clayton: QIP Launch with Rs 2,320.78 Floor Price",
            "Summary": "<p><span class=\"neutral\">Sundaram-Clayton</span> announced a <span class=\"neutral\">QIP issue</span> of equity shares with a <b>floor price</b> of <span class=\"neutral\">Rs 2,320.78</span> per share, a <span class=\"negative\">1.26% discount</span> to the previous closing price. The company may offer an <span class=\"negative\">additional discount</span> of up to <span class=\"negative\">5%</span> on the floor price. The stock <span class=\"positive\">gained 4.38%</span> to <span class=\"neutral\">Rs 2,453.35</span> following the announcement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728021480000,
            "Source": "corporate_action"
        }
    ]
}