{
    "Symbol": "SUNDROP",
    "ISIN": "INE209A01019",
    "News": [
        {
            "Title": "Sundrop Brands Board Meet Set for Feb 12, 2026",
            "Summary": "Sundrop Brands Limited has scheduled its board meeting for February 12, 2026, to approve Q3 FY26 unaudited financial results. An investor conference call will follow on February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770381809271,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundrop Brands Announces Senior Management Changes",
            "Summary": "Sundrop Brands Limited announces resignation of Ms. Hem Jadeja as Head – Strategy and Business Transformation, effective December 30, 2025, and appointment of Mr. Rupish Saldi to the same position from December 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767081596238,
            "Source": "stocks"
        },
        {
            "Title": "Sundrop Brands Promoter Expands Share Encumbrance",
            "Summary": "CAG-TECH(MAURITIUS)LIMITED creates additional encumbrance on 18.81 lakh shares acquired on December 23, 2025, bringing total encumbered shareholding to 100% of promoter holdings under SEBI SAST regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766730925485,
            "Source": "co_actions_results"
        },
        {
            "Title": "CAG-Tech Increases Sundrop Brands Stake to 38.91%",
            "Summary": "CAG-Tech (Mauritius) Limited acquired 1,881,073 additional shares (4.99%) in Sundrop Brands Limited through off-market acquisition, increasing total shareholding to 38.91% with voting rights of 37.45%.",
            "Sentiment": "neutral",
            "PublishDate": 1766579412909,
            "Source": "co_actions_results"
        },
        {
            "Title": "CAG-Tech Increases Stake in Sundrop Brands to 38.91%",
            "Summary": "CAG-Tech (Mauritius) Limited acquired 18.81 lakh additional equity shares in Sundrop Brands Limited on December 23, 2025, increasing its shareholding from 33.92% to 38.91% through off-market acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1766561792289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundrop Brands Appoints Kavita as Company Secretary from Material Subsidiary",
            "Summary": "Kavita resigned as Company Secretary from Del Monte Foods Private Limited, a material subsidiary of Sundrop Brands Limited, effective November 27, 2025. She has been appointed as Company Secretary, Compliance Officer and Nodal Officer at the holding company Sundrop Brands Limited effective November 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764310710960,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sundrop Brands Seeks Shareholder Approval for Three Director Appointments Through Postal Ballot",
            "Summary": "Sundrop Brands Limited has issued a postal ballot notice seeking shareholder approval for appointing three directors - Mr. Velloor Venkatakrishnan Ranganathan and Mr. Ramit Bharti Mittal as Non-Executive Directors, and Mr. Madhavan Karunakaran Menon as Independent Director for 5 years, all effective September 24, 2025. The remote e-voting period runs from November 22 to December 21, 2025, with results to be announced by December 23, 2025, affecting the company's board composition and governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763481023576,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sundrop Brands Reports 8% Revenue Growth in Q2 FY26 Despite GST Transition Impact",
            "Summary": "Sundrop Brands achieved 8% revenue growth in Q2 FY26 and 10% in H1, with EBITDA growing 29% driven by 250 basis points gross margin improvement and strong performance in B2B (23% growth) and e-commerce (41% growth) channels. The company faced temporary GST transition challenges in September affecting trade destocking, but expanded core category salience to 64% while maintaining zero debt and INR 1,450 crores net worth.",
            "Sentiment": "positive",
            "PublishDate": 1763383498948,
            "Source": "earnings"
        },
        {
            "Title": "Sundrop Brands Reports Strong Q2 FY26 Growth with 8% Revenue Rise and Margin Expansion",
            "Summary": "Sundrop Brands Limited reported consolidated revenue growth of 8% for Q2 FY26 and 10% for H1 FY26. The company achieved significant margin improvements with gross margin expansion of 250 basis points in Q2 and 190 basis points in H1. EBITDA grew by 29% in Q2 and 30% in H1 on a proforma basis. Key performance highlights include 41% growth in e-commerce for Q2, 42% for H1, and 23% growth in B2B revenue for Q2, 12% for H1. The company's core categories now contribute 64% of business compared to 47% in FY23. Popcorn category grew 16% in H1 with strong performance in both ready-to-cook and ready-to-eat formats. The company launched multiple new products across its portfolio and implemented sales force automation covering 113K outlets. Net worth stands at INR 1,449 crore with nil borrowings as of September 30, 2025. Marketing investments increased 34% in Q2 and 44% in H1, focusing on core categories and e-commerce growth.",
            "Sentiment": "positive",
            "PublishDate": 1763012641551,
            "Source": "earnings"
        },
        {
            "Title": "Sundrop Brands Reports Quarterly Results, Announces Leadership Changes and Stock Option Cancellations",
            "Summary": "Sundrop Brands Limited approved its unaudited financial results for the quarter and half-year ended September 30, 2025. The company announced the resignation of Ms. Jyoti Chawla as Company Secretary and Compliance Officer, effective November 27, 2025, and appointed Ms. Kavita as her replacement, effective November 28, 2025. Ms. Kavita brings over 14 years of experience across FMCG organizations including Del Monte Foods Group, Walmart India and Tata Consumer Products. The Nomination and Remuneration Committee also approved the cancellation of 11,500 employee stock options that were originally granted on June 7, 2025 under the AgroTech Foods Limited Employees Stock Option Plan, 2024. These cancelled options will be available for re-grant under the ESOP scheme. The Board meeting was held on November 12, 2025, commencing at 3:45 PM and concluding at 4:30 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762968344530,
            "Source": "earnings"
        },
        {
            "Title": "Sundrop Brands' Subsidiary Del Monte Foods Relocates Registered Office from Haryana to Telangana",
            "Summary": "Sundrop Brands Limited announced that its material subsidiary Del Monte Foods Private Limited has received approval from the Ministry of Corporate Affairs to shift its registered office from Haryana to Telangana. The new registered office is located at Ground Floor, 31, Sarojini Devi Road, Secunderabad, Hyderabad-500003, Telangana. The relocation was approved through a certificate dated October 31, 2025, issued by the Registrar of Companies (Telangana). The change was confirmed by a Regional Director order dated August 13, 2025, and involved altering the provisions of the company's Memorandum of Association regarding the registered office location.",
            "Sentiment": "neutral",
            "PublishDate": 1762191587634,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundrop Brands Limited Appoints Three Directors and Accepts One Resignation",
            "Summary": "Sundrop Brands Limited appointed three new directors to its Board effective September 24, 2025. The appointments include Mr. Velloor Venkatakrishnan Ranganathan and Mr. Ramit Bharti Mittal as Non-Executive Non-Independent Directors, and Mr. Madhavan Karunakaran Menon as Non-Executive Independent Director for a five-year term until September 23, 2030. Simultaneously, Mr. Harjeet Singh Kohli resigned from his position as Non-Executive Non-Independent Director citing personal reasons. The appointments were approved by the Board through Circular Resolutions based on recommendations from the Nomination and Remuneration Committee. All new appointees have been confirmed as not being debarred by SEBI or other authorities. The appointments are subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1758716169728,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sundrop Brands Faces Industrial Tribunal Order to Increase Worker Pay and Benefits",
            "Summary": "The Industrial Tribunal in Vadodara has directed Sundrop Brands Limited to increase basic pay, HRA, conveyance allowance, and education allowance for workers at its Jhagadia plant in Gujarat, along with providing additional benefits. The order was passed on August 7, 2025, following a dispute referred by the Labour Commissioner of Gujarat regarding pay raises and benefits demanded by worker unions Shramik Kamdar Kalyan Sangh and Bharuch Jilla Mazdoor Sangh. The company states it has been paying minimum wages as required under the Minimum Wages Act and plans to file an appeal against the order on legal and merit grounds. The company downloaded the order from the tribunal's website as it has not received an official copy.",
            "Sentiment": "negative",
            "PublishDate": 1755956248571,
            "Source": "stock"
        },
        {
            "Title": "Sundrop Brands Reports 12% Revenue Growth in Q1 FY26 Following Del Monte Acquisition",
            "Summary": "Sundrop Brands Limited reported 12% revenue growth to INR 372 crores in Q1 FY26, marking the first full quarter as a combined entity following the Del Monte Foods acquisition completed in February. The company achieved 9% EBITDA growth despite maintaining flat material margins amid commodity inflation. Sundrop increased marketing investments by 58% and expanded retail coverage by 11,000 outlets. Core categories now represent 61% of business, up from 53% in FY23. The popcorn business grew 21% in value and 12% in volume, while e-commerce sales surged 42%. The company operates across multiple food categories including snacking, culinary products, and premium staples, with a combined distribution network covering 500,000 outlets through 1,800 distributors. Management indicated plans to maintain separate operations this year while exploring integration opportunities for the following year to unlock synergies between the two businesses.",
            "Sentiment": "positive",
            "PublishDate": 1755520771977,
            "Source": "earnings"
        },
        {
            "Title": "Sundrop Brands Reports 12% Revenue Growth in Q1 FY26 Results",
            "Summary": "Sundrop Brands Limited released its Q1 FY26 investor presentation showing consolidated revenue growth of 12% to INR 372.1 crores. The company reported strong performance across key segments with popcorn and snacks achieving 21% value growth, culinary products growing 4% by value, and e-commerce sales increasing 42%. EBITDA grew 9% to INR 137 million with a margin of 3.7%. The company expanded direct coverage by 11,000 outlets and increased advertising investments by 58%. Core categories now represent 61% of revenue compared to 53% in FY23. Gross margins expanded by 110 basis points. The company operates through 9 manufacturing facilities across India with distribution through approximately 1,800 distributors covering 500,000+ retail outlets. Sundrop Brands contributed INR 208.5 crores while Del Monte contributed INR 163.6 crores to total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1755065061594,
            "Source": "earnings"
        },
        {
            "Title": "Sundrop Brands Reports Strong Q1 Growth with Revenue Doubling to 3.7B Rupees",
            "Summary": "Sundrop Brands delivered robust quarterly results with revenue reaching 3.7 billion rupees compared to 1.8 billion rupees in the same period last year. The company's consolidated net profit surged to 43 million rupees from 2 million rupees year-over-year. EBITDA increased significantly to 134 million rupees versus 57 million rupees, while EBITDA margin improved to 3.60% from 3.17% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755000681840,
            "Source": "earnings"
        },
        {
            "Title": "Sundrop Brands' Material Subsidiary Del Monte Foods Changes Statutory Auditors",
            "Summary": "Sundrop Brands Limited announced that BSR & Co. LLP resigned as statutory auditors of its material subsidiary Del Monte Foods Private Limited, effective August 05, 2025. The resignation was to align the subsidiary's auditors with those of the holding company following the recent acquisition. BSR & Co. LLP had completed their statutory audit till March 31, 2025, and issued their audit report on May 19, 2025. The Board of Directors of Del Monte Foods appointed BSR and Co as the new statutory auditors to fill the casual vacancy, subject to shareholder approval at a general meeting within three months. The appointment is valid until the conclusion of the next Annual General Meeting. Both auditing firms are members of the BSR & Affiliates network registered with ICAI.",
            "Sentiment": "neutral",
            "PublishDate": 1754413263167,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundrop Brands Reports Q4 EBITDA Loss",
            "Summary": "Sundrop Brands has reported a Q4 EBITDA loss of 4 million rupees, compared to a gain of 52 million rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747665972000,
            "Source": "result"
        },
        {
            "Title": "Sundrop Brands Reports Increased Q4 Loss and Revenue",
            "Summary": "Sundrop Brands has reported its Q4 financial results. The company's consolidated net loss widened to 1.1 billion rupees, compared to 15 million rupees in the same quarter last year and 39 million rupees in the previous quarter. However, Q4 revenue increased to 3 billion rupees from 1.8 billion rupees in the year-ago period.",
            "Sentiment": "negative",
            "PublishDate": 1747665883000,
            "Source": "result"
        },
        {
            "Title": "Agro Tech Foods Reports Significant Profit Growth in Q3",
            "Summary": "Agro Tech Foods has reported a substantial increase in profit before tax (PBT) for the third quarter. The company's PBT rose to 82 million rupees, compared to 30 million rupees in the same period last year, marking a year-over-year growth. Additionally, the company reported an exceptional item of 38 million rupees, which contributed to the improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738852374000,
            "Source": "earnings"
        },
        {
            "Title": "CCI Approves Combination Involving Agro Tech Foods and Other Companies",
            "Summary": "The Competition Commission of India (CCI) has granted approval for a proposed combination involving Agro Tech Foods Limited, Bharti Enterprises Limited, DMPL India Limited, and Del Monte Foods Private Limited. This approval suggests a significant corporate action, potentially involving mergers, acquisitions, or restructuring among these companies in the Indian food industry.",
            "Sentiment": "neutral",
            "PublishDate": 1737505246000,
            "Source": "corporate_action"
        },
        {
            "Title": "CCI Approves Combination Involving Agro Tech Foods and Other Companies",
            "Summary": "The Competition Commission of India (CCI) has approved a proposed combination involving Agro Tech Foods Limited, Bharti Enterprises Limited, DMPL India Limited, and Del Monte Foods Private Limited. This approval suggests a significant corporate action or restructuring among these companies, potentially involving mergers, acquisitions, or other forms of business combination.",
            "Sentiment": "neutral",
            "PublishDate": 1737465388000,
            "Source": "corporate_action"
        },
        {
            "Title": "Agro Tech Foods to Acquire Del Monte Foods India in Share Swap Deal",
            "Summary": "Agro Tech Foods is set to acquire Del Monte Foods India in a share swap deal valued at approximately ₹1,300 crore. This acquisition represents a significant corporate action that will likely impact both companies and their shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731567746000,
            "Source": "corporate_action"
        },
        {
            "Title": "Del Monte Acquires Large Stake in ATFL via Preferential Issue",
            "Summary": "Del Monte has acquired a significant ownership stake in ATFL (likely Agro Tech Foods Limited) through a preferential share issue. This represents a major investment and potential strategic move for Del Monte in the food industry.",
            "Sentiment": "positive",
            "PublishDate": 1731565172000,
            "Source": "corporate_action"
        },
        {
            "Title": "Agro Tech Foods Ltd Changes Name to Sundrop Brands Limited",
            "Summary": "Agro Tech Foods Ltd has officially changed its company name to 'Sundrop Brands Limited'. This change represents a significant corporate rebranding effort.",
            "Sentiment": "neutral",
            "PublishDate": 1731562696000,
            "Source": "corporate_action"
        }
    ]
}