{
    "Symbol": "SUNDRMFAST",
    "ISIN": "INE387A01021",
    "News": [
        {
            "Title": "Sundram Fasteners Q3 FY26 Results Show Strong Growth",
            "Summary": "Sundram Fasteners reports robust Q3 FY26 performance with 18% domestic growth and Rs. 1,359 crores revenue, though exports face tariff pressures impacting margins.",
            "Sentiment": "positive",
            "PublishDate": 1770221613061,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundram Fasteners Q3FY26 Results & Board Decisions",
            "Summary": "Sundram Fasteners reports Q3FY26 standalone revenue of ₹1,351.47 crores with net profit of ₹121.88 crores. Board approves key reappointments and senior management changes.",
            "Sentiment": "positive",
            "PublishDate": 1769614870801,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundram Fasteners Board Meet Set for Jan 28, 2026",
            "Summary": "Sundram Fasteners Limited has scheduled its Board meeting for January 28, 2026, to review and approve Q3FY26 unaudited financial results. Trading window remains closed until January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769009921111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundram Fasteners Gets CRISIL A1+ Rating Reaffirmed",
            "Summary": "CRISIL Ratings Limited has re-affirmed its A1+ rating for Sundram Fasteners' short-term debt and commercial paper instruments, maintaining the company's strong credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1768395454239,
            "Source": "stocks"
        },
        {
            "Title": "Sundram Fasteners Receives Rs 2.70 Crore GST Penalty Order",
            "Summary": "Sundram Fasteners Limited received a penalty order of Rs 2,70,34,224 from the Additional Commissioner of Central Tax for GST violations including non-payment on capital goods sent for job work and non-reversal of ineligible Input Tax Credit during financial years 2018-19 to 2022-23. The company states there is no material financial impact and plans to file an appeal against the penalty order.",
            "Sentiment": "negative",
            "PublishDate": 1763062978059,
            "Source": "stock"
        },
        {
            "Title": "Sundram Fasteners Reports Record Half-Year Profit of Rs 278 Crores with Strong Domestic Growth",
            "Summary": "Sundram Fasteners achieved its highest-ever half-year profit after tax of Rs 278 crores on revenue of Rs 2,723 crores. The company reported 12% growth in domestic segment during the quarter, while exports moderated to Rs 338 crores from Rs 389 crores in the corresponding quarter. The company benefited from rupee depreciation from Rs 85.4 to Rs 88.4 and softening raw material prices in boron steel and alloy steel, leading to gross margins exceeding 60%. EBITDA stood at 18% for the quarter with quarterly profit reaching a record Rs 140 crores. The domestic business mix comprises 58% OE, 12-13% aftermarket, and 26-27% exports. Wind energy segment showed 30-35% growth and now contributes 4% of domestic sales. The company expects recovery in export markets within 6 months, with customers indicating preparation for ramp-up in upcoming quarters. Management targets double-digit CAGR growth going forward.",
            "Sentiment": "positive",
            "PublishDate": 1762360558215,
            "Source": "earnings"
        },
        {
            "Title": "Sundram Fasteners Reports Strong Growth Outlook with New Global Engine Program and Export Recovery Expected",
            "Summary": "Sundram Fasteners announced a new global ice engine program scheduled to launch between 2029 and 2031, with improved order schedules expected for Q4 and the following Q1. The company anticipates a positive outlook over the next 6 months driven by strong domestic industry conditions and potential export recovery. Over 20% of current revenue comes from new products developed in the last three years. The wind energy business delivers margins comparable to the auto sector but with better return on capital employed due to domestic market focus. The company is concentrating on stainless steel and railway fasteners, expecting revenue growth in the coming year. Management targets double-digit annual growth and anticipates export recovery within 6 months, with customers planning increased orders for Q1 and Q2.",
            "Sentiment": "positive",
            "PublishDate": 1761881304199,
            "Source": "stock"
        },
        {
            "Title": "Sundram Fasteners Declares Interim Dividend of Rs 3.75 Per Share",
            "Summary": "Sundram Fasteners Limited's Board of Directors declared an interim dividend of Rs 3.75 per share (375% of face value of Re 1 each) for the financial year ending March 31, 2026. The dividend will be paid from November 20, 2025, to shareholders whose names appear on the register as of November 4, 2025. The company will deduct tax at source (TDS) from dividend payments exceeding Rs 10,000, with rates varying based on shareholder category and residential status. TDS rates include 10% for resident shareholders and 20% for non-resident shareholders, with exemptions available for certain categories like mutual funds, insurance companies, and government entities upon submission of required documentation by November 6, 2025. The company has also launched a 100-day campaign called 'Saksham Niveshak' to help shareholders update KYC details and claim unpaid dividends to prevent transfer to the Investor Education and Protection Fund Authority.",
            "Sentiment": "positive",
            "PublishDate": 1761843185997,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundram Fasteners Board Recommends Interim Dividend of Rs 3.75 Per Share",
            "Summary": "Sundram Fasteners' board has recommended an interim dividend of Rs 3.75 per share for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1761658718359,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundram Fasteners Reports Growth in Q2 Financial Performance",
            "Summary": "Sundram Fasteners reported Q2 consolidated net profit of 1.51 billion rupees compared to 1.42 billion rupees in the same period last year. Revenue increased to 15.21 billion rupees from 14.86 billion rupees year-over-year. EBITDA rose to 2.52 billion rupees versus 2.45 billion rupees, while EBITDA margin improved to 16.60% from 16.49% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761657775667,
            "Source": "earnings"
        },
        {
            "Title": "Sundram Fasteners Schedules Board Meeting for Q2 Results and Interim Dividend Consideration",
            "Summary": "Sundram Fasteners Limited has scheduled a Board of Directors meeting on October 28, 2025 to review and approve unaudited financial results for the second quarter and half-year ended September 30, 2025. The board will also consider declaring an interim dividend for the financial year ending March 31, 2026. The trading window for designated persons remains closed from September 30, 2025 to October 30, 2025, covering the period until 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1761054780578,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundram Fasteners Reports Record Quarterly Profit with 17.5% EBITDA Margin",
            "Summary": "Sundram Fasteners reported revenue of INR 1,367 crores compared to INR 1,021 crores in the corresponding quarter, driven by strong domestic performance across commercial vehicles, passenger vehicles, and tractors. The company achieved record quarterly profit before tax of INR 186 crores and profit after tax of INR 138 crores, with EBITDA margin improving to 17.5% from 17% in the same quarter last year. Domestic business outperformed industry growth due to higher participation in SUVs, higher tonnage commercial vehicles, and high horsepower tractors. Export markets remain uncertain with North America facing demand slump due to emission norm confusion and tariff issues, while Europe shows better performance. The company benefited from favorable foreign exchange movements in Euro and GBP, benign raw material prices, and increased renewable energy mix reaching 52%. Wind energy segment contributed over INR 350 crores annually, up from INR 200 crores previously. Management expects 8-9% growth for the full year if export conditions improve, with capital expenditure planned at INR 300 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754474795132,
            "Source": "earnings"
        },
        {
            "Title": "Sundram Fasteners Reports Record Quarterly Performance with Highest Ever Revenue and Profit",
            "Summary": "Sundram Fasteners Limited announced its quarterly results with consolidated revenue from operations reaching Rs. 1,533.39 crores, marking the highest ever performance. The company achieved record consolidated profit before tax of Rs. 199.13 crores and net profit of Rs. 147.94 crores. On standalone basis, revenue was Rs. 1,350.17 crores compared to Rs. 1,310.33 crores in the previous year. Domestic sales grew 8.78% to Rs. 930.91 crores while export sales declined to Rs. 379.14 crores from Rs. 422.65 crores. EBITDA reached Rs. 238.77 crores with margin of 17.5%. Gross margin improved from 57.5% to 59.9%. The company reported earnings per share of Rs. 6.58 for standalone and Rs. 7.06 for consolidated results. Capital expenditure was Rs. 71.48 crores. Managing Director Arathi Krishna cited robust domestic demand across key segments as the primary growth driver, while acknowledging challenges in export markets due to global economic headwinds and geopolitical uncertainties.",
            "Sentiment": "positive",
            "PublishDate": 1753964556353,
            "Source": "earnings"
        },
        {
            "Title": "Sundram Fasteners Reports Q4 FY23 Financial Results",
            "Summary": "Sundram Fasteners announced its Q4 FY23 consolidated net profit of 1.24 billion rupees, down from 1.34 billion rupees year-over-year but up from 1.3 billion rupees quarter-over-quarter. Q4 revenue increased to 15.3 billion rupees from 14.66 billion rupees year-over-year. The company has recommended a dividend of 4.20 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746144768000,
            "Source": "default"
        },
        {
            "Title": "Sundram Fasteners Announces Dividend of 4.20 Rupees per Share",
            "Summary": "Sundram Fasteners has recommended a dividend of 4.20 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746022187000,
            "Source": "result"
        },
        {
            "Title": "Sundram Fasteners Q4 Financial Results",
            "Summary": "Sundram Fasteners reported its Q4 financial results. The company's EBITDA was 2.25 billion rupees, slightly down from 2.28 billion rupees year-over-year. EBITDA margin decreased to 14.70% from 15.54% in the previous year. Consolidated net profit for Q4 was 1.24 billion rupees, down from 1.34 billion rupees year-over-year but slightly down from 1.3 billion rupees quarter-over-quarter. Revenue increased to 15.3 billion rupees from 14.66 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746021913000,
            "Source": "result"
        },
        {
            "Title": "Sundram Fasteners Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Sundram Fasteners Ltd. The trade involved approximately 1,002,407 shares at a price of Rs. 882.00 per share, totaling Rs. 88.41 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744702900000,
            "Source": "block_deals"
        },
        {
            "Title": "Sundram Fasteners Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Sundram Fasteners Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 345,001 shares were traded at a price of Rs. 950.00 per share, totaling Rs. 32.78 Crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1741600644000,
            "Source": "block_deals"
        },
        {
            "Title": "Sundram Fasteners Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Sundram Fasteners Ltd. on the National Stock Exchange (NSE). Approximately 1,000,105 shares were traded at a price of Rs. 950.80 per share, totaling Rs. 95.09 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741600631000,
            "Source": "block_deals"
        },
        {
            "Title": "Sundram Fasteners Reports Q3 Revenue Increase",
            "Summary": "Sundram Fasteners has reported a revenue of 14.4 billion rupees for the third quarter, compared to 13.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737966267000,
            "Source": "earnings"
        },
        {
            "Title": "Sundram Fasteners Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sundram Fasteners has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 2.27 billion rupees from 2 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 15.75% from 14.72% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737966235000,
            "Source": "earnings"
        },
        {
            "Title": "Sundram Fasteners Reports Slight Increase in Q3 Consolidated Net Profit",
            "Summary": "Sundram Fasteners Limited has announced its financial results for the third quarter. The company's consolidated net profit increased marginally to 1.3 billion rupees, compared to 1.29 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1737966219000,
            "Source": "earnings"
        },
        {
            "Title": "Sundram Fasteners to Consider Q3 Results on January 27",
            "Summary": "Sundram Fasteners Limited has announced that it will consider its third quarter (Q3) financial results on January 27. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737338398000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundram Fasteners Declares Interim Dividend",
            "Summary": "Sundram Fasteners has announced an interim dividend of ₹3 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730814516000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundram Fasteners Reports Q2 EBITDA Growth",
            "Summary": "Sundram Fasteners has announced its Q2 financial results. The company's EBITDA increased to 2.45 billion rupees from 2.31 billion rupees year-over-year. The EBITDA margin also improved slightly to 16.49% from 16.23% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730814442000,
            "Source": "result"
        },
        {
            "Title": "Sundram Fasteners Reports Q2 FY24 Financial Results",
            "Summary": "Sundram Fasteners has announced its Q2 FY24 financial results. The company's consolidated net profit increased to 1.42 billion rupees, up from 1.32 billion rupees year-over-year. Revenue for the quarter rose to 14.9 billion rupees from 14.22 billion rupees in the same period last year. The results show both quarter-on-quarter and year-on-year growth in net profit and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1730814377000,
            "Source": "result"
        }
    ]
}