{
    "Symbol": "SUNDARAM",
    "ISIN": "INE108E01023",
    "News": [
        {
            "Title": "Sundaram MultiPap Reports Net Loss and Announces Major Acquisition Deal",
            "Summary": "Sundaram MultiPap Limited reported a net loss of Rs 83.01 lacs for the quarter ended September 30, 2025, compared to a profit of Rs 83.01 lacs in the previous quarter. The company's shareholders approved issuance of 7.04 crore equity shares on preferential basis to acquire 52.38% stake in Sundaram Land and Assets Private Limited for Rs 27.5 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1763041080702,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram MultiPap Conducts EGM to Approve Preferential Share Issue Worth Rs 23.58 Crore",
            "Summary": "Sundaram MultiPap Limited held an Extraordinary General Meeting on November 12, 2025, via video conference to consider issuing up to 7.04 crore equity shares at Rs 3.35 per share, raising Rs 23.58 crore. The preferential issue is intended for non-promoter shareholders of Sundaram Land and Assets Private Limited as consideration for acquiring 2.75 crore equity shares representing 52.38% stake in the target company. The meeting was chaired by Chairman Managing Director Amrut P. Shah, with key directors and officials in attendance. Remote e-voting was conducted from November 9-11, 2025, with additional e-voting facility provided during the meeting. The business item was classified as special business requiring special resolution approval.",
            "Sentiment": "neutral",
            "PublishDate": 1762996069953,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram MultiPap Issues Corrigendum for Preferential Share Issue EGM",
            "Summary": "Sundaram MultiPap Limited issued a corrigendum to its Extraordinary General Meeting notice following clarifications requested by NSE and BSE for its proposed preferential issue. The company will issue 7.04 crore equity shares on preferential basis, with the relevant date for floor price determination being October 13, 2025. The EGM is scheduled for November 12, 2025 through video conference. Key corrections include removing 'rounded off' terminology from share numbers and updating shareholding patterns. The corrigendum lists 56 proposed allottees, all classified as non-promoter/public investors. Post-preferential issue, promoter shareholding will decrease from 31.11% to 27.09%, while public shareholding will increase from 68.89% to 72.91%. The company confirmed none of its current promoters, directors, or key managerial personnel will participate in the preferential allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1761903984218,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Multi Pap Approves Rs 23.58 Crore Share Swap to Acquire 52.38% Stake in Sundaram Land and Assets",
            "Summary": "Sundaram Multi Pap Limited's board approved issuing 7.04 crore equity shares at Rs 3.35 per share through preferential allotment, valued at Rs 23.58 crores. The share swap will acquire 52.38% shareholding in Sundaram Land and Assets Private Limited, a company incorporated in June 2024 that operates in logistics and assets with design-driven activities for urban infrastructure solutions and construction-linked innovation verticals. The target company reported turnover of Rs 283.51 lakhs for FY 2024-25 and Rs 329.44 lakhs for the quarter ended June 30, 2025. The acquisition involves 56 non-promoter allottees who are shareholders of the target company. An Extraordinary General Meeting is scheduled for November 12, 2025, to seek shareholder approval, with completion expected within 15 days post-approval.",
            "Sentiment": "positive",
            "PublishDate": 1760599006565,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Multi Pap Reschedules Board Meeting to August 25 for Acquisition Proposal and AGM Notice",
            "Summary": "Sundaram Multi Pap Limited has rescheduled its Board Meeting from August 20, 2025 to August 25, 2025 due to director availability concerns. The meeting will consider approval of a proposed acquisition of 53% equity stake in Sundaram Land and Assets Private Limited through a share swap arrangement, based on valuation reports from appointed valuers. The board will also approve the draft notice for the 31st Annual General Meeting, including resolutions for adopting audited financial statements for the year ended March 31, 2025, and the Directors' Report. If approved, the company will issue equity shares as consideration for the acquisition, subject to necessary approvals. The trading window remains closed for designated persons until 48 hours after the board meeting concludes.",
            "Sentiment": "neutral",
            "PublishDate": 1755153559086,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Multi Pap Reports Q1 Loss, Explores Acquisition of Land Assets Company",
            "Summary": "Sundaram Multi Pap Limited reported a net loss of Rs 44.38 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 25.18 lakhs in the same period last year. Revenue from operations declined to Rs 4,065.99 lakhs from Rs 4,241.91 lakhs year-over-year. The board approved appointment of M/s. GR Shah and Associates as secretarial auditor for five years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company authorized professional advisors for potential acquisition of up to 53% equity stake in Sundaram Land and Assets Private Limited, with final decision pending valuation reports and due diligence. The board will consider the acquisition proposal and AGM notice at its August 20, 2025 meeting. The auditor's review report contained qualified opinion regarding trade receivables requiring confirmations and inadequate provisions for long-outstanding receivables.",
            "Sentiment": "negative",
            "PublishDate": 1755012218914,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Multi Pap Schedules Board Meeting to Review Q1 Results and Consider Strategic Partnership",
            "Summary": "Sundaram Multi Pap Limited will hold a board meeting on August 12, 2025, to approve unaudited standalone financial results for the quarter ended June 30, 2025. The board will also consider a strategic association with Sundaram Land and Assets Private Limited, exploring potential synergies across seven business areas including centralized manufacturing, e-commerce fulfillment, and logistics operations. The proposal includes evaluating a potential 53% equity stake acquisition in Sundaram Land and Assets Private Limited, with authorization for professional advisors to conduct valuation and legal due diligence. The company's trading window for promoters, directors, and key personnel remains closed until 48 hours after the financial results declaration.",
            "Sentiment": "positive",
            "PublishDate": 1754463097465,
            "Source": "corporate_action"
        }
    ]
}