{
    "Symbol": "SUNDRMBRAK",
    "ISIN": "INE073D01013",
    "News": [
        {
            "Title": "Sundaram Brake Linings CFO V. Srinivasan Resigns",
            "Summary": "Sundaram Brake Linings announces resignation of Chief Financial Officer V. Srinivasan effective February 9, 2026, citing pursuit of alternate career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1770643420420,
            "Source": "stocks"
        },
        {
            "Title": "Sundaram Brake Linings Reports Q3 FY26 Loss",
            "Summary": "Sundaram Brake Linings posted a net loss of ₹124.32 lacs in Q3 FY26 compared to profit of ₹88.86 lacs in Q3 FY25, with revenue declining to ₹8,418.64 lacs from ₹8,830.29 lacs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770358605993,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram Brake Linings Reports Loss in Quarter Ended September 2025",
            "Summary": "Sundaram Brake Linings Limited reported a net loss of Rs 312.43 lacs for the quarter ended September 30, 2025, compared to a profit of Rs 146.80 lacs in the previous quarter. The company's revenue from operations decreased to Rs 8,915.56 lacs from Rs 9,324.54 lacs in the prior quarter. For the half-year period, the company posted a loss of Rs 68.66 lacs versus a profit of Rs 295.98 lacs in the corresponding period last year. Basic and diluted earnings per share stood at negative Rs 7.94 for the quarter. The company's total expenses increased to Rs 9,265.57 lacs from Rs 9,303.25 lacs in the previous quarter. The board of directors approved these unaudited financial results at their meeting held on November 11, 2025. The statutory auditors issued an unmodified opinion on the limited review report.",
            "Sentiment": "negative",
            "PublishDate": 1762868116139,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Brake Linings Seeks Shareholder Approval for Independent Director Appointment",
            "Summary": "Sundaram Brake Linings Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Rahul Rakesh Agrawal as a Non-Executive Independent Director for a five-year term from August 4, 2025 to August 3, 2030. The e-voting period runs from August 18 to September 16, 2025. Mr. Agrawal, 47, holds a Chemical Engineering degree from University of Michigan and MBA from Harvard Business School. He serves as Managing Director of Styrenix Performance Materials Limited and is Director and Promoter of Shiva Pharmachem Limited, bringing nearly 25 years of experience in chemical manufacturing. The Board appointed him as Additional Director on August 4, 2025, based on the Nomination and Remuneration Committee's recommendation. He holds no shares in the company and is not related to any existing directors or key managerial personnel. The appointment requires special resolution approval through remote e-voting facilitated by NSDL.",
            "Sentiment": "neutral",
            "PublishDate": 1754906859815,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Brake Linings Reports Reduced Net Loss in Q1",
            "Summary": "Sundaram Brake Linings reported a net loss of 5.3 million rupees in Q1, which represents an improvement from the 15 million rupees loss recorded in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754286466745,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Brake Experiences Significant Profit Decline in Q3",
            "Summary": "Sundaram Brake reported a substantial decrease in net profit for the third quarter, dropping to 8.9 million rupees from 32 million rupees in the same period last year. Despite the profit decline, the company's revenue showed a slight increase, rising to 883 million rupees from 848 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739260227000,
            "Source": "earnings"
        },
        {
            "Title": "Equity Intelligence India Acquires 1.02% Stake in Sundaram Brake Linings",
            "Summary": "Equity Intelligence India Private Limited, a firm associated with investor Porinju Veliyath, has acquired a 1.02% stake in Sundaram Brake Linings during the third quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1737418844000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equity Intelligence India Private Acquires 1.02% Stake in Sundaram Brake Linings",
            "Summary": "Equity Intelligence India Private, a firm associated with investor Porinju Veliyath, has acquired a 1.02% stake in Sundaram Brake Linings during the third quarter. This investment indicates a potential interest in the company by a notable investment firm.",
            "Sentiment": "neutral",
            "PublishDate": 1737373693000,
            "Source": "corporate_governance"
        }
    ]
}