{
    "Symbol": "SUNDARMFIN",
    "ISIN": "INE660A01013",
    "News": [
        {
            "Title": "Sundaram Finance Raises Fund Limit to ₹16,000 cr",
            "Summary": "Sundaram Finance board approves revision of fund raising limit from ₹13,000 cr to ₹16,000 cr through Non-Convertible Debentures for FY 2025-26, enhancing capital mobilization capacity.",
            "Sentiment": "positive",
            "PublishDate": 1770038467693,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram Finance Approves ₹16 Dividend Per Share",
            "Summary": "Sundaram Finance has approved a dividend payment of ₹16 per share for its shareholders, marking a significant return distribution by the non-banking financial company.",
            "Sentiment": "positive",
            "PublishDate": 1770022336169,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram Finance Q3 Net Profit Rises 17.4% YoY",
            "Summary": "Sundaram Finance reported consolidated net profit of ₹5.40 billion for Q3, marking a significant 17.4% increase from ₹4.60 billion in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770021556410,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram Home Finance Q3 Net Profit Rises 20%",
            "Summary": "Sundaram Home Finance reported 20% growth in Q3 net profit to Rs 75.14 crore, with disbursements reaching Rs 1,740.79 crore and assets under management growing 18% to Rs 18,880 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769179990127,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sundaram Finance Board Approves Acquisition of Capitalgate Investment Advisors by Subsidiary",
            "Summary": "Sundaram Finance Limited's Board of Directors granted in-principle approval for the acquisition of Capitalgate Investment Advisors Private Limited (CGIA) by its subsidiary Sundaram Alternate Assets Limited (SAAL). The acquisition involves a cash consideration of ₹35 crore for 100% shareholding. CGIA, incorporated in 2017, is a research services company specializing in credit research on listed fixed income securities. The company reported revenue of ₹21.87 lakh and profit before tax of ₹12.40 lakh in its latest results. Following the acquisition, CGIA is proposed to be amalgamated with SAAL, subject to regulatory approvals. The transaction is classified as a related party transaction and has received prior approval from the Audit Committee. CGIA is developing an AI engine for real-time research delivery, which could add value to SAAL's fund business.",
            "Sentiment": "positive",
            "PublishDate": 1762198772675,
            "Source": "order&deals"
        },
        {
            "Title": "Sundaram Finance Announces Senior Management Transfer to Subsidiary",
            "Summary": "Sundaram Finance Limited disclosed the transfer of Mr. Ajit Narasimhan, a senior management member, to Sundaram Alternate Assets Limited effective September 1, 2025. Sundaram Alternate Assets Limited is a wholly-owned subsidiary of Sundaram Asset Management Company Limited, which is itself a wholly-owned subsidiary of Sundaram Finance Limited. The transfer was formally recorded at a board meeting held on November 3, 2025, which ran from 10:00 A.M. to 1:05 P.M.",
            "Sentiment": "neutral",
            "PublishDate": 1762189711618,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sundaram Finance Reports Record Disbursements and Strong Quarterly Growth",
            "Summary": "Sundaram Finance achieved record disbursements of ₹15,423 crores with quarterly disbursements rising 18% to ₹8,113 crores. The company's profit after tax increased 27% to ₹823 crores while assets under management grew 15.3% to ₹55,419 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762157224388,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Finance Reports Revenue Growth to 23.9B Rupees in Q2",
            "Summary": "Sundaram Finance reported Q2 total revenue of 23.9 billion rupees, up from 20.8 billion rupees in the same period last year. The company's consolidated net profit increased to 4.9 billion rupees compared to 4.36 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762156770089,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Home Finance Expands to Karnataka, Targets Rs 60 Crore Disbursements",
            "Summary": "Sundaram Home Finance has entered the Karnataka market and aims to disburse Rs 60 crore in its first year of operations under the Emerging Business segment. The Chennai-based company plans to establish 8-10 emerging business branches in Tier II and III towns across Karnataka during the initial expansion phase. Sundaram Home Finance, a subsidiary of Sundaram Finance Ltd, currently operates over 50 branches in Tamil Nadu and Andhra Pradesh under the Emerging Business segment, having disbursed Rs 200 crore in this category last year. The Emerging Business vertical focuses on small business loans up to Rs 20 lakh and affordable housing finance with loans up to Rs 40 lakh. MD D Lakshminarayanan stated the company hopes to establish a strong presence in Karnataka's Tier II and III towns over the next 12-18 months, citing the state's potential for affordable housing finance driven by government support in this segment.",
            "Sentiment": "positive",
            "PublishDate": 1757399108167,
            "Source": "stock"
        },
        {
            "Title": "Sundaram Finance Reports Strong Q1FY26 Performance with 17% AUM Growth",
            "Summary": "Sundaram Finance delivered robust quarterly results with Assets Under Management (AUM) growing 17% year-over-year to ₹53,278 crores in Q1FY26. The company's disbursements increased 6% year-over-year to ₹7,310 crores during the quarter. Consolidated net profit rose to ₹4.7 billion compared to ₹4.35 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754296174516,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Finance: Q4 Profit Doubles, ₹21 Final Dividend Declared",
            "Summary": "Sundaram Finance's Q4 net profit doubled to ₹553 crore YoY. Revenue rose 4.8% to ₹2,259 crore. Final dividend of ₹21 per share recommended, bringing total FY25 dividend to ₹35. Board approved re-appointment of Ganesh Lakshminarayan as Independent Director for five years.",
            "Sentiment": "positive",
            "PublishDate": 1748252218000,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Finance Reports Q4 Results and Dividend Declaration",
            "Summary": "Sundaram Finance has reported its Q4 financial results. The company's revenue increased to 23 billion rupees from 22 billion rupees year-over-year. The consolidated net profit for Q4 rose to 5.5 billion rupees from 2.7 billion rupees in the same period last year. Additionally, Sundaram Finance has declared a dividend of 21 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748250143000,
            "Source": "result"
        },
        {
            "Title": "Sundaram Finance: Accepts ₹1,200 Crore Bond Bids at 7.1584% Yield",
            "Summary": "Sundaram Finance has accepted bids worth ₹1,200 crore ($140.17 million) for three-year bonds with a yield of 7.1584%. The company invited bids from bankers and investors earlier in the day.",
            "Sentiment": "neutral",
            "PublishDate": 1747316217000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Finance to Raise Funds Through Private Placement of NCDs",
            "Summary": "Sundaram Finance Limited has announced its intention to raise funds by issuing Non-Convertible Debentures (NCDs) through a private placement. This move indicates the company's strategy to secure additional capital, potentially for business expansion or refinancing existing debt.",
            "Sentiment": "neutral",
            "PublishDate": 1743060140000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Finance Approves Proposal to Raise Up to 130 Billion Rupees",
            "Summary": "Sundaram Finance has approved a proposal to raise funds up to 130 billion rupees. This decision indicates a significant financial move by the company, potentially aimed at expanding operations, refinancing existing debt, or funding new initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1743060072000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Finance Reports 7% Increase in Q3 Consolidated Net Profit",
            "Summary": "Sundaram Finance has announced its financial results for the third quarter. The company's consolidated net profit rose to 4.6 billion rupees, up from 4.3 billion rupees in the same period last year, representing a 7% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738572974000,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Finance Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Sundaram Finance Ltd shares occurred on the National Stock Exchange (NSE). The transaction involved approximately 92,666 shares, traded at a price of Rs. 4,369.60 per share. The total value of the block trade amounted to Rs. 40.49 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734936508000,
            "Source": "block_deals"
        },
        {
            "Title": "Sundaram Finance Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Sundaram Finance Ltd shares occurred on the National Stock Exchange (NSE). Approximately 52,475 shares were traded at a price of Rs. 4,335.90 per share, amounting to a total transaction value of Rs. 22.75 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734931445000,
            "Source": "block_deals"
        },
        {
            "Title": "Sundaram Finance Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Sundaram Finance Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 332,842 shares, valued at Rs. 138.67 crores. The shares were traded at a price of Rs. 4,166.25 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1733470430000,
            "Source": "block_deals"
        },
        {
            "Title": "Sundaram Finance: Q2 Earnings Miss Expectations",
            "Summary": "Sundaram Finance reported lower-than-expected Q2 earnings due to reduced other income. However, the company's asset quality remained stable.",
            "Sentiment": "neutral",
            "PublishDate": 1730774770000,
            "Source": "result"
        },
        {
            "Title": "Sundaram Finance Reports Slight Increase in Q2 Gross and Net Stage 3 Assets",
            "Summary": "Sundaram Finance has reported its Q2 financial results, showing a marginal increase in both gross and net stage 3 assets. The gross stage 3 assets rose to 1.62% from 1.56% quarter-on-quarter, while net stage 3 assets increased to 0.89% from 0.84% in the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1730715155000,
            "Source": "result"
        },
        {
            "Title": "Sundaram Finance Reports Q2 Revenue Growth",
            "Summary": "Sundaram Finance, an Indian financial services company, has reported a revenue of 20.8 billion rupees for the second quarter, compared to 17.08 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730715136000,
            "Source": "result"
        },
        {
            "Title": "Sundaram Finance Reports Q2 FY24 Results",
            "Summary": "Sundaram Finance announced its Q2 financial results. The company's consolidated net profit increased to 4.36 billion rupees, up from 3.65 billion rupees year-over-year. Sequentially, the net profit showed a slight increase from 4.35 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730715125000,
            "Source": "result"
        }
    ]
}