{
    "Symbol": "SUNFLAG",
    "ISIN": "INE947A01014",
    "News": [
        {
            "Title": "Sunflag Iron and Steel Receives CRISIL AA-/Stable Rating for Rs 1,850 Crore Bank Facilities",
            "Summary": "CRISIL Ratings assigned AA-/Stable long-term rating for Rs 1,176.35 crore and A1+ short-term rating for Rs 673.65 crore bank facilities to Sunflag Iron and Steel Company Limited. The ratings cover total bank loan facilities of Rs 1,850 crore across multiple banks including SBI, Bank of India, HDFC Bank, and others, with the rating letter valid until January 01, 2027.",
            "Sentiment": "positive",
            "PublishDate": 1763193860531,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunflag Iron and Steel Appoints Dev Dyuti Sen as Chief Executive Officer",
            "Summary": "Sunflag Iron and Steel Company Limited appointed Mr. Dev Dyuti Sen as Chief Executive Officer with effect from 14 November, 2025. Sen brings over 37 years of experience in the steel industry, having worked with organizations including JSW Steel, Usha Martin Limited, and SLR Metalliks Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1763193441740,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sunflag Iron and Steel Reports Q2 Net Profit of ₹45.57 Crore, Down 26.5% Year-on-Year",
            "Summary": "Sunflag Iron and Steel Company Limited reported net profit of ₹45.57 crore for the second quarter ended September 30, 2025, compared to ₹62.04 crore in the previous quarter and ₹40.95 crore in the same quarter last year. Revenue from operations stood at ₹972.99 crore versus ₹1,023.23 crore in the previous quarter and ₹865.74 crore year-on-year. For the half-year period, net profit reached ₹107.61 crore compared to ₹68.53 crore in the corresponding period last year. The company's earnings per share for the quarter was ₹2.53 compared to ₹3.44 in the previous quarter. Other comprehensive income showed a significant loss of ₹1,865.70 crore primarily due to mark-to-market losses on equity shares held in Lloyds Metal & Energy Limited. The Board of Directors approved these unaudited financial results at their meeting held on November 13, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763032192187,
            "Source": "earnings"
        },
        {
            "Title": "Sunflag Iron and Steel CEO Brijendra Kumar Tiwari Resigns Due to Personal Reasons",
            "Summary": "Sunflag Iron and Steel Company Limited announced the resignation of Chief Executive Officer Brijendra Kumar Tiwari due to personal reasons. Tiwari submitted his resignation on October 22, 2025, and was relieved from his duties effective close of business hours on October 31, 2025. The company disclosed this information to BSE and NSE as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761993826030,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sunflag Iron and Steel Reports Revenue Growth to ₹1,01,211 Lakhs in Q1 FY2026",
            "Summary": "Sunflag Iron and Steel Company Limited reported total revenue from operations of ₹1,01,211 lakhs for the quarter ended June 30, 2025, showing growth from ₹89,478 lakhs in the previous quarter. Net profit after tax increased to ₹4,274 lakhs from ₹4,214 lakhs in Q4 FY2025. The company achieved basic and diluted earnings per share of ₹2.37. Total comprehensive income rose significantly to ₹78,041 lakhs compared to ₹32,956 lakhs in the previous quarter. Key expenses included cost of materials consumed at ₹57,460 lakhs, employee benefits expense of ₹3,741 lakhs, finance costs of ₹2,051 lakhs, and depreciation of ₹2,699 lakhs. The Board of Directors approved the unaudited financial results, and an independent auditor confirmed compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1754920266495,
            "Source": "earnings"
        },
        {
            "Title": "Sunflag Iron & Steel Reports 31% Drop in Net Profit Despite Revenue Growth",
            "Summary": "Sunflag Iron & Steel Co. Ltd. reported mixed quarterly results with revenue growing 1.2% to Rs 1,013.39 crores while net profit declined 31.2% to Rs 42.39 crores. EBITDA fell 16.7% to Rs 82.14 crores with margins contracting to 8.1% from 9.8% in the previous year. The company faced cost pressures with material costs rising 3.7%, employee expenses up 9.1%, and finance costs increasing 34.8%. The board approved re-appointments of key directors including Managing Director Pranav Bhardwaj and appointed new statutory and secretarial auditors. Independent Director Sajiv Dhawan resigned due to other commitments. EPS decreased to Rs 2.35 from Rs 3.42 in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754918611900,
            "Source": "earnings"
        },
        {
            "Title": "Sunflag Iron & Steel Reports Strong Q1 Performance with 125% Jump in Net Profit",
            "Summary": "Sunflag Iron & Steel Co delivered robust quarterly results with net profit surging to 620 million rupees from 276 million rupees year-over-year, representing a 125% increase. Revenue grew to 10.12 billion rupees compared to 8.95 billion rupees in the same period last year, marking a 13% rise. The company's EBITDA improved to 1.1 billion rupees from 793 million rupees year-over-year, while EBITDA margin expanded to 10.80% from 8.86%, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754917376302,
            "Source": "earnings"
        },
        {
            "Title": "Sunflag Iron and Steel Appoints DM & Associates as New Secretarial Auditor for FY 2024-25",
            "Summary": "Sunflag Iron and Steel Company Limited's Board of Directors approved the appointment of M/s. DM & Associates, Company Secretaries LLP, Mumbai as the company's Secretarial Auditor for Financial Year 2024-25. The appointment fills a casual vacancy created by the resignation of M/s. Mukesh Parakh & Associates, Company Secretaries, Nagpur. The decision was made during the company's 202nd Board Meeting held on July 21, 2025. DM & Associates is a Limited Liability Partnership with five partners, led by Mr. Dinesh Deora who has over 30 years of experience in finance, legal, taxation and procedural matters. The firm specializes in corporate law advisory services, offering solutions in corporate, secretarial, and regulatory compliances under various legislations including the Companies Act, FEMA, SEBI Laws, and Stock Exchange listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753160835987,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunflag Iron & Steel Co. Reports Q4 Results and Dividend",
            "Summary": "Sunflag Iron & Steel Co. has announced its Q4 financial results and a dividend recommendation. The company's Q4 EBITDA increased to 1 billion rupees from 990 million rupees year-over-year, with EBITDA margin improving to 11.37% from 10.77%. Net profit for Q4 rose slightly to 428 million rupees from 421 million rupees year-over-year, but decreased from 504 million rupees quarter-over-quarter. Q4 revenue declined to 8.8 billion rupees from 9.2 billion rupees year-over-year. The company has recommended a dividend of 7.50 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748348570000,
            "Source": "result"
        },
        {
            "Title": "Sunflag Iron and Steel Signs Long-Term Power Purchase Agreement",
            "Summary": "Sunflag Iron and Steel Company has entered into a long-term Power Purchase Agreement (PPA) with Sunsure Solarpark Thirty Seven. The deal is valued at 57.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745413404000,
            "Source": "default"
        },
        {
            "Title": "Sunflag Iron & Steel Reports Increased Q3 Profit and Revenue",
            "Summary": "Sunflag Iron & Steel has announced its financial results for the third quarter. The company's net profit increased to 504 million rupees, up from 359 million rupees in the same period last year. Revenue also saw growth, rising to 8.9 billion rupees from 8.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739492320000,
            "Source": "earnings"
        },
        {
            "Title": "Sunflag Iron & Steel Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sunflag Iron & Steel has reported a year-over-year increase in its Q3 EBITDA, rising from 969 million rupees to 1.11 billion rupees. The company's EBITDA margin also improved, increasing from 11.35% to 12.41% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739442234000,
            "Source": "earnings"
        },
        {
            "Title": "Sunflag Iron & Steel Reports Increased Q3 Profit and Revenue",
            "Summary": "Sunflag Iron & Steel has announced its financial results for the third quarter. The company's net profit increased to 504 million rupees, up from 359 million rupees in the same period last year. Revenue also saw growth, rising to 8.9 billion rupees from 8.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739442229000,
            "Source": "earnings"
        }
    ]
}