{
    "Symbol": "SUNPHARMA",
    "ISIN": "INE044A01036",
    "News": [
        {
            "Title": "Sun Pharma Q3FY26: Strong Growth with ₹33,688M Profit",
            "Summary": "Sun Pharmaceutical Industries reported Q3FY26 consolidated revenue of ₹154,690.7 million (up 15.1% YoY) and net profit of ₹33,688.1 million (up 16.0% YoY). Board declared interim dividend of ₹11 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769850481569,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sun Pharma Block Trade Worth ₹278.87 Crores on NSE",
            "Summary": "Sun Pharmaceutical Industries executed a significant block trade on NSE involving 1,734,892 shares valued at ₹278.87 crores at ₹1607.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769588983791,
            "Source": "co_actions_results"
        },
        {
            "Title": "China Halts Sun Pharma Dementia Drug Sales",
            "Summary": "China has stopped sales of Sun Pharmaceutical's dementia drug following issues identified during a remote inspection by regulatory authorities.",
            "Sentiment": "negative",
            "PublishDate": 1769486546182,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma Gets Approval for Generic Semaglutide",
            "Summary": "Sun Pharmaceutical receives regulatory approval to manufacture and sell generic semaglutide injection in India for weight management under brand name NovelTreat with five dose options.",
            "Sentiment": "positive",
            "PublishDate": 1769139324765,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma Gets Buy Rating with 30% Upside Potential",
            "Summary": "Jefferies issues Buy call on Sun Pharma with ₹2,100 target price, citing potential benefits from proposed ₹1,30,000 crore Organon acquisition despite leverage concerns and execution risks.",
            "Sentiment": "positive",
            "PublishDate": 1768995814177,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jefferies Maintains Buy Rating on Sun Pharma at ₹2,100",
            "Summary": "Global brokerage firm Jefferies has maintained its 'Buy' recommendation on Sun Pharmaceutical Industries with a target price of ₹2,100, reflecting continued confidence in the pharmaceutical company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768967487279,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma Board Meet on Jan 31 for Q3 Results",
            "Summary": "Sun Pharmaceutical Industries schedules board meeting for January 31, 2026 to approve Q3FY26 financial results and consider interim dividend declaration with record date February 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768917463866,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sun Pharma Block Trade Worth ₹20.56 Crores on NSE",
            "Summary": "Sun Pharmaceutical Industries executed a significant block trade on NSE involving 125,250 shares at ₹1,641.20 per share, totaling ₹20.56 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768893305284,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sun Pharma Denies $10B Organon Acquisition Rumors",
            "Summary": "Sun Pharmaceutical Industries officially denies market rumors regarding a $10 billion acquisition of Organon, clarifying that the information is speculative and no material disclosure is required.",
            "Sentiment": "neutral",
            "PublishDate": 1768807794599,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma Denies $10B Organon Acquisition Reports",
            "Summary": "Sun Pharmaceutical officially denies speculation about USD 10 billion Organon acquisition, calling reports speculative with no material disclosure required under regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768795032429,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sun Pharma Launches Unloxcyt for Cancer Treatment",
            "Summary": "Sun Pharmaceutical releases Unloxcyt™ (Cosibelimab-IPDL), a new therapeutic option for patients with advanced cutaneous squamous cell carcinoma, expanding its oncology portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768532590430,
            "Source": "stocks"
        },
        {
            "Title": "LIC Increases Stake in Sun Pharma to 5.004%",
            "Summary": "Life Insurance Corporation of India has increased its shareholding in Sun Pharmaceutical Industries Limited to 5.004% through market purchase of 2.03 lakh shares on January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768382509969,
            "Source": "co_actions_results"
        },
        {
            "Title": "GLP-1 Drugs To Drive Pharma Growth: Sun Pharma MD",
            "Summary": "Sun Pharma MD Kirti Ganorkar highlights GLP-1 obesity and diabetes treatments as key growth drivers for Indian pharmaceutical industry. Icra projects 9-11% revenue growth for pharma companies in FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1766913342497,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma targets mid-high single digit growth in FY26",
            "Summary": "Sun Pharmaceutical Industries targets mid to high single-digit revenue growth for FY26, continuing R&D investments amid US pricing policy challenges. Q2 net profit rose to ₹31.18 billion.",
            "Sentiment": "positive",
            "PublishDate": 1766747409203,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma Unit Recalls 17k Antifungal Shampoo Units",
            "Summary": "Taro Pharmaceutical Industries, Sun Pharma's US subsidiary, recalls 17,664 units of Ciclopirox Shampoo due to failed impurity specifications in nationwide Class II recall.",
            "Sentiment": "negative",
            "PublishDate": 1766655213150,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma's Baska Facility Gets FDA OAI Status",
            "Summary": "US FDA inspects Sun Pharmaceutical's Baska facility from September 8-19, 2025, classifying it as Official Action Indicated status. Company continues production and supply to US market while working towards compliance.",
            "Sentiment": "negative",
            "PublishDate": 1766027180689,
            "Source": "stocks"
        },
        {
            "Title": "Sun Pharma Restricts Semaglutide Sales to Patent-Free Countries, Avoids India Market",
            "Summary": "Sun Pharma will export semaglutide only to countries where Novo Nordisk does not hold patents for the diabetes drug. The company will refrain from selling the product in India until it secures its own patent protection.",
            "Sentiment": "neutral",
            "PublishDate": 1765347462291,
            "Source": "stock"
        },
        {
            "Title": "Novo Nordisk Takes Legal Action Against Sun Pharma Over Semaglutide Production",
            "Summary": "Novo Nordisk has initiated legal proceedings against Sun Pharma to prevent the Indian pharmaceutical company from producing semaglutide. The legal action targets Sun Pharma's potential entry into the diabetes and weight management drug market dominated by Novo Nordisk's branded semaglutide products.",
            "Sentiment": "negative",
            "PublishDate": 1765258836483,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Unit Approves ₹3,000 Crore Investment for New Manufacturing Plant in Madhya Pradesh",
            "Summary": "Sun Pharmaceutical Industries' unit has approved a ₹3,000 crore investment to establish a new manufacturing plant in Madhya Pradesh. This significant capital expenditure represents the company's expansion into manufacturing operations in the state.",
            "Sentiment": "positive",
            "PublishDate": 1764730426722,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Launches Global Innovation Drug ILUMYA in India for Moderate-to-Severe Plaque Psoriasis Treatment",
            "Summary": "Sun Pharmaceutical Industries announced the launch of ILUMYA (Tildrakizumab), a novel biologic treatment for moderate-to-severe plaque psoriasis in India, already available in 35 countries worldwide. The drug demonstrated significant efficacy in Indian clinical studies with 115 patients, showing 75% skin clearance in 93.9% of patients at Week 28, expanding Sun Pharma's specialty portfolio in dermatology.",
            "Sentiment": "positive",
            "PublishDate": 1764560864895,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Sees Rs. 103.04 Crore Block Trade on NSE",
            "Summary": "Sun Pharmaceutical Industries executed a block trade worth Rs. 103.04 crores involving 569,649 shares at Rs. 1808.90 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764229451085,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharma Receives FDA Approval for Updated UNLOXCYT Label Based on Long-Term Clinical Data",
            "Summary": "Sun Pharmaceutical Industries received FDA approval for an updated label for UNLOXCYT (cosibelimab-ipdl), incorporating long-term follow-up data showing at least 50% of patients achieved objective response in treating advanced cutaneous squamous cell carcinoma. The company plans to commercially launch UNLOXCYT in early 2026, expanding its cutaneous oncology portfolio with this PD-L1 immune checkpoint inhibitor that demonstrated durable clinical responses and acceptable tolerability.",
            "Sentiment": "positive",
            "PublishDate": 1764133445392,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma's Composite Scheme of Arrangement Becomes Effective",
            "Summary": "Sun Pharmaceutical Industries Limited announced that its Composite Scheme of Arrangement has become effective from November 22, 2025, after filing the certified copy of the National Company Law Tribunal's sanctioning order with the Registrar of Companies. The company has complied with all directions given under the tribunal's order and informed stock exchanges BSE and NSE about the scheme's implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1763799819546,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca and Sun Pharma Partner to Expand Hyperkalemia Treatment Access in India",
            "Summary": "AstraZeneca Pharma India and Sun Pharmaceutical Industries announced a second brand partnership to market Sodium Zirconium Cyclosilicate (SZC) under different brand names - Lokelma by AstraZeneca and Gimli by Sun Pharma - for treating Hyperkalemia in India. The exclusive agreement aims to accelerate availability of the innovative treatment to more patients across India, with AstraZeneca retaining intellectual property rights and marketing authorization while both companies will promote and distribute the therapy.",
            "Sentiment": "positive",
            "PublishDate": 1763376185589,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharma Presents Positive Clinical Data for Obesity Drug Utreglutide at Medical Conferences",
            "Summary": "Sun Pharmaceutical Industries presented clinical trial results for its investigational obesity drug utreglutide (GLO034) at Obesity Week 2025 and American Heart Association 2025 Scientific Sessions. The Phase 1b/2a studies showed significant outcomes: 13 weeks of treatment in individuals with obesity and MASLD demonstrated 6.8% body weight reduction and 6.8% waist circumference reduction at week 14. A separate 10-week study in overweight and obese individuals showed 6.8% body weight loss with 10% reductions in total cholesterol and LDL. In post-menopausal females with obesity, the drug achieved 8% weight loss at week 14 along with reduced liver fat content and blood pressure improvements. The most common adverse events were gastrointestinal including nausea, diarrhea, and vomiting, consistent with the drug class. GLO034 is a novel once-weekly GLP-1 receptor agonist being developed for obesity and type 2 diabetes treatment. Further clinical studies are planned to assess safety and efficacy.",
            "Sentiment": "positive",
            "PublishDate": 1762944971124,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Partner Philogen Reports Mixed Results from Fibromun Cancer Drug Trial",
            "Summary": "Sun Pharma's partner Philogen announced results from the FIBROSARCOMA Phase III clinical trial testing fibromun combined with doxorubicin for advanced soft tissue sarcoma treatment. The trial did not meet its primary endpoint of progression-free survival, but showed promising trends favoring the combination therapy. Median progression-free survival was 7.9 months for the combination versus 4.6 months for doxorubicin alone. Overall survival was 28.3 months for the combination arm compared to 19.6 months for doxorubicin alone, though survival data remains immature. Philogen plans to discuss results with European and US authorities and initiate a new Phase III trial with overall survival as the primary endpoint, expected to start in 2026. The company is also advancing other trials including FLASH, FIBROSARCUS, and multiple glioblastoma programs.",
            "Sentiment": "neutral",
            "PublishDate": 1762918560178,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Reports Strong Specialty Growth Despite US Generics Headwinds",
            "Summary": "Sun Pharmaceutical Industries reported revenue growth of 8.6% to ₹14,405.2 crore and net profit growth of 2.6% to ₹3,118 crore for the September quarter. The company's global specialty business drove performance with 16% year-on-year growth to $333 million, led by flagship products Ilumya, Cequa, Winlevi and Odomzo. Domestic formulations business grew 11% to ₹4,734.8 crore, with market share increasing to 8.3% from 8%. The US generics segment faced challenges due to increased competition and declining Revlimid sales, with no significant recovery expected near-term. Operating profit grew 14.9% to ₹4,527.1 crore with margin improvement of 170 basis points to 31.3%. The company spent ₹782.7 crore on R&D during the quarter. Upcoming launches include Unloxcyt for skin cancer in second half of FY26 and Leqselvi for alopecia areata. The company is preparing to enter the GLP-1 segment with Semaglutide in India. Analysts maintain 'BUY' ratings with target prices ranging from ₹1,875 to ₹2,000, representing 11-18% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1762736530281,
            "Source": "earnings"
        },
        {
            "Title": "Sun Pharma Open to Expanding US Manufacturing Amid Tariff Concerns",
            "Summary": "Sun Pharmaceutical Industries stated it is open to enhancing its manufacturing footprint in the US following the Trump administration's imposition of 100% tariffs on branded and patented medicines. Richard Ascroft, CEO for North America business, noted the company already has US manufacturing presence and is constantly assessing expansion options. He described the tariff situation as 'very fluid and uncertain', making it difficult to determine potential impacts on the company's generics or innovative medicines portfolio. Executive Chairman Dilip Shanghvi confirmed Sun Pharma remains on track to launch UNLOXCYT, an FDA-approved advanced skin cancer treatment, in the US during the second half of fiscal 2026. The company also plans to file ILUMYA psoriatic arthritis SPLA during the same period and continues investing in research and development for its innovative medicines pipeline.",
            "Sentiment": "neutral",
            "PublishDate": 1762363881357,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Executive Shows Interest in Expanding U.S. Manufacturing Operations",
            "Summary": "Sun Pharma's executive has expressed willingness to explore expanding the company's manufacturing operations in the United States. This indicates the pharmaceutical company's potential strategic interest in growing its U.S. production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1762351397121,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Reports Higher Q2 Profit and Revenue Growth",
            "Summary": "Sun Pharma Industries reported Q2 consolidated net profit of 31.18 billion rupees compared to 30.4 billion rupees in the previous year. Revenue increased to 144.78 billion rupees from 133 billion rupees year-over-year. EBITDA rose to 45.27 billion rupees versus 39.4 billion rupees, while EBITDA margin improved to 31.27% from 29.6%.",
            "Sentiment": "positive",
            "PublishDate": 1762340153290,
            "Source": "earnings"
        },
        {
            "Title": "Sun Pharma Q2 Earnings Preview: Revenue Growth Expected Despite Margin Pressure from Leqselvi Launch",
            "Summary": "Sun Pharma is expected to report moderate growth in its September quarter earnings. Analysts project revenue to rise around 7% year-on-year while profit after tax may grow only about 2% due to higher marketing and R&D expenses. The company's US subsidiary Taro is expected to face a weak quarter due to pricing pressure and strong base effects from last year's Revlimid sales. The global specialty business is projected to be a growth driver, with estimates of 14-15% year-on-year growth to around USD 326-330 million, led by products like Ilumya, Cequa, Winlevi, and Odomzo. The domestic India business is expected to grow 9-12% year-on-year supported by new product launches and improved productivity. EBITDA margins are expected to face pressure due to spending on the US launch of newly approved specialty drug Leqselvi, with estimates ranging from compression to slight expansion depending on the brokerage. R&D spending could rise to 6.5% of sales from 5.5% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762244453386,
            "Source": "earnings"
        },
        {
            "Title": "Sun Pharmaceutical Industries Sees Rs. 21.42 Crore NSE Block Trade",
            "Summary": "Sun Pharmaceutical Industries Ltd. recorded a block trade on NSE worth Rs. 21.42 crores. The transaction involved approximately 125,307 shares at a price of Rs. 1,709.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761199747963,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharma Appoints Jeremy Allen as Vice President of Corporate Affairs for North America",
            "Summary": "Sun Pharma has appointed Jeremy Allen to the position of Vice President of Corporate Affairs for North America.",
            "Sentiment": "positive",
            "PublishDate": 1761146715799,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Approves Merger of Sun Pharmaceutical Medicare and Other Units with Sun Pharma",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the merger of Sun Pharmaceutical Medicare and other units with Sun Pharma. The approval allows these subsidiary entities to be consolidated into the main company structure.",
            "Sentiment": "positive",
            "PublishDate": 1759935768944,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun Pharma Faces 8-10% Profit Risk from 100% US Tariffs on Patented Drugs",
            "Summary": "The US government imposed a 100% tariff on imported patented drugs starting October 1, which could significantly impact Sun Pharmaceutical Industries. The tariff excludes companies with US manufacturing plants and does not apply to generic medicines. Sun Pharma has substantial exposure with patented drugs accounting for 17% of revenue in FY25, totaling $1,217 million in consolidated sales, with 85-90% coming from the US market. HSBC estimates the tariff could reduce Sun Pharma's earnings by 8-10% in FY26 and FY27 in a worst-case scenario. The company's patented portfolio is expected to grow from 17% of revenue in FY25 to 22% by FY28, with key products including Ilumya, Cequa, Winlevi, and Leqselvi. Sun Pharma currently uses global contract manufacturers, with Ilumya manufactured in South Korea and Europe. The company has over $3 billion in cash as of June 2025, providing flexibility to relocate production to US facilities, though this could take 6-24 months and involve substantial costs. HSBC maintains a 'Buy' rating with a target price of Rs 1,850. Sun Pharma shares closed at Rs 1,585, down 2.6%, and are down 16% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1759041967390,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Shares Under Watch as Trump Announces 100% Tariffs on Branded Drug Imports",
            "Summary": "US President Donald Trump announced 100% tariffs on branded and patented drugs imported into the US, effective October 1. The tariffs exempt companies with existing US plants, those building US facilities, or those who have broken ground for construction. Sun Pharma's specialty products including Illumya, Cequa, Odomozo, and Winlevi represent 19.3% of overall sales. The company's specialty sales reached $1.2 billion with 17% growth, while global Illumya sales grew 17% to $681 million. Sun Pharma does not disclose US plant sales figures but management indicated current capacity is sufficient for onshore manufacturing without additional investment. Investment analyst Aditya Khemka from InCred Asset Management noted potential impact on Sun Pharma and Wockhardt, with possible risks for Biocon if biosimilars are included. The Nifty Pharma index declined 2% over the past month, with some pharma stocks falling up to 6%. Sun Pharma shares closed unchanged at ₹1,625, gaining 1.5% over the month.",
            "Sentiment": "negative",
            "PublishDate": 1758855972919,
            "Source": "stock"
        },
        {
            "Title": "Suven Pharmaceuticals Sees Large Block Trades Worth Rs. 3,278 Crores on NSE",
            "Summary": "Suven Pharmaceuticals experienced significant block trading activity on NSE during pre-open session. Two separate block trades occurred at Rs. 966.35 per share - one involving 8,712,631 shares worth Rs. 841.95 crores and another involving 25,207,670 shares valued at Rs. 2,435.94 crores. The combined trading activity totaled approximately 33.92 million shares worth Rs. 3,277.89 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758166811592,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharmaceutical Industries Sees Rs. 48.79 Crore Block Trade on NSE",
            "Summary": "Sun Pharmaceutical Industries Ltd. witnessed a block trade worth Rs. 48.79 crores on the National Stock Exchange. The transaction involved approximately 303,092 shares at a price of Rs. 1,609.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757920028762,
            "Source": "order&deals"
        },
        {
            "Title": "Raksha Valia Releases 50,000 Pledged Sun Pharma Shares from Aditya Birla Finance",
            "Summary": "Raksha Valia released 50,000 pledged equity shares of Sun Pharmaceutical Industries Limited on September 4, 2025. The shares were previously pledged in favor of Aditya Birla Finance Limited as security for a loan availed by a third party. Following the release, Valia's encumbered shareholding in Sun Pharma decreased from 12,640,000 shares (0.527% of total share capital) to 12,590,000 shares (0.525% of total share capital). Valia maintains a total holding of 28,830,352 shares representing 1.20% of the company's total share capital. The disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757488325292,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun Pharma's Halol Facility Faces US FDA Import Alert After Inspection",
            "Summary": "The US FDA inspected Sun Pharma's Halol facility and classified it as 'Official Action Indicated'. The facility has been placed under an import alert, which has resulted in shipments from this facility being refused entry into the US market.",
            "Sentiment": "negative",
            "PublishDate": 1757430100857,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Discontinues Production of Vecuronium Bromide Injection",
            "Summary": "Sun Pharma has stopped manufacturing Vecuronium Bromide Injection 20 MG. The FDA has reported this discontinuation of the pharmaceutical product.",
            "Sentiment": "neutral",
            "PublishDate": 1757346212690,
            "Source": "stock"
        },
        {
            "Title": "Suven Pharmaceuticals Sees Rs. 76.37 Crore Block Trade on NSE",
            "Summary": "Suven Pharmaceuticals Ltd. executed a block trade worth Rs. 76.37 crores on the National Stock Exchange. The transaction involved approximately 819,263 shares at a price of Rs. 932.15 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757306006541,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharmaceutical Industries Sees Rs. 40.62 Crore Block Trade on NSE",
            "Summary": "Sun Pharmaceutical Industries Ltd. witnessed a block trade worth Rs. 40.62 crores on the National Stock Exchange. The transaction involved approximately 255,995 shares executed at a price of Rs. 1,586.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757051889391,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharmaceutical Sees Rs. 32.31 Crore Block Trade on NSE",
            "Summary": "Sun Pharmaceutical Industries Ltd. recorded a block trade worth Rs. 32.31 crores on the National Stock Exchange. The transaction involved approximately 203,417 shares at a price of Rs. 1,588.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757048425037,
            "Source": "order&deals"
        },
        {
            "Title": "Suven Pharmaceuticals Sees Rs. 102.71 Crore Block Trade on NSE",
            "Summary": "Suven Pharmaceuticals Ltd. recorded a block trade worth Rs. 102.71 crores on the National Stock Exchange. The transaction involved approximately 1,138,853 shares at a price of Rs. 901.85 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756968004476,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharmaceutical Industries Sees Rs. 980 Crore Block Trade on NSE",
            "Summary": "Sun Pharmaceutical Industries executed a block trade worth Rs. 980.02 crores on the National Stock Exchange. The transaction involved approximately 6,227,856 shares at a price of Rs. 1,573.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756707905143,
            "Source": "order&deals"
        },
        {
            "Title": "Sun Pharma Reports 10.1% Revenue Growth in Q1 FY26, Launches Leqselvi for Alopecia Treatment",
            "Summary": "Sun Pharmaceutical Industries reported quarterly sales of Rs. 1,37,861 million, marking a 10.1% growth over the previous year. EBITDA increased 19.2% to Rs. 43,017 million with a margin of 31.1%. The company faced exceptional items of Rs. 8,180 million primarily due to SCD-044 impairment and GXMDL settlement. Adjusted net profit grew 5.7% to Rs. 29,961 million. The India business recorded 13.9% growth in formulation sales to Rs. 47,211 million, maintaining the #1 position with 8.3% market share. US business grew 1.4% to $473 million, driven by innovative medicines including Ilumya, Cequa, Winlevi, and Odomzo, though offset by generic product competition. Sun Pharma launched Leqselvi in the US for severe alopecia areata treatment and completed acquisition of Checkpoint Therapeutics, adding UNLOXCYT to its portfolio. The company's Ilumya Phase-III trials for psoriatic arthritis met primary endpoints, supporting potential regulatory submission. R&D investments stood at 6.5% of sales, with the company maintaining a strong balance sheet and $3.1 billion net cash position.",
            "Sentiment": "positive",
            "PublishDate": 1754480833414,
            "Source": "earnings"
        },
        {
            "Title": "Sun Pharma Promoter Pledges 650,000 Shares to Citicorp Finance for Third-Party Loan",
            "Summary": "Raksha Sudhir Valia, a person acting in concert with Sun Pharmaceutical Industries Limited promoters, pledged 650,000 equity shares to Citicorp Finance (India) Limited on July 28, 2025. The pledge was created as security for a loan facility availed by a third party. Following this transaction, Valia's total encumbered shareholding increased to 12,640,000 shares, representing 0.527% of Sun Pharma's total share capital. Valia holds 28,830,352 shares in total, constituting 1.20% of the company's share capital. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1754283848196,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun Pharma Shares Drop 4% After Trump Demands Drug Price Cuts from Major Pharmaceutical Companies",
            "Summary": "Sun Pharma shares declined 4% after initially falling 6%, leading losses in the Nifty Pharma index following US President Donald Trump's letters to 17 major pharmaceutical companies demanding lower drug prices. Trump's letter required companies to charge the US similar rates to other countries for new medicines and lower Medicaid costs for existing drugs, with 60 days given for voluntary compliance. Sun Pharma derives around 20% of its revenues from innovative drugs sold in the US and had not received such communication as of their last quarterly conference call. The Trump administration is seeking most favoured nation treatment for Medicaid pricing to match rates charged in other wealthy developed nations. Other pharmaceutical stocks also declined, with Aurobindo Pharma, Gland and Granules India falling 2-3%. Most Indian generic companies face limited impact as they don't sell branded generics or innovator drugs.",
            "Sentiment": "negative",
            "PublishDate": 1754024811718,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Plans Unloxcyt Launch for Advanced Skin Cancer Treatment",
            "Summary": "Sun Pharma aims to release Unloxcyt, a treatment for advanced skin cancer, in the second half of FY '26. The launch is contingent upon receiving FDA approval for the drug.",
            "Sentiment": "positive",
            "PublishDate": 1754019047066,
            "Source": "stock"
        }
    ]
}