{
    "Symbol": "SUNTECK",
    "ISIN": "INE805D01034",
    "News": [
        {
            "Title": "Sunteck Realty seeks shareholder approval for director re-appointments",
            "Summary": "Sunteck Realty Limited has issued a postal ballot notice seeking member approval for re-appointment of two Independent Directors and subsidiary transaction approvals. E-voting period runs from 6 February to 7 March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770223391698,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Plans Multiple Project Launches",
            "Summary": "Sunteck Realty announces upcoming launches across Mumbai suburbs over next six months, including projects in Goregaon West, Andheri, Mira Road, Vasai, and Naigaon. No specific pre-sales targets set for FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1769660491328,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Awaits RERA Nod for Nepean Sea Project",
            "Summary": "Sunteck Realty expects RERA approval for its Nepean Sea Road project by end of Q4 FY26 or Q1 FY27. Dubai project launch anticipated soon with finalized designs.",
            "Sentiment": "positive",
            "PublishDate": 1769660465682,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Eyes ₹3,000 Cr FY26 Pre-Sales Target",
            "Summary": "Sunteck Realty confident of meeting FY26 pre-sales target of ₹3,000 crores with Q4 expected to contribute ₹900 crores. Company projects 25-30% QoQ growth driven by luxury segments.",
            "Sentiment": "positive",
            "PublishDate": 1769660441837,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Q3 FY26 Monitoring Report Filed",
            "Summary": "Sunteck Realty submitted monitoring agency report for Q3 FY26 showing INR 125.00 crores utilized from preferential warrant issue proceeds for land acquisition activities.",
            "Sentiment": "neutral",
            "PublishDate": 1769526435348,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Q3 Net Profit Jumps 37% to ₹582M",
            "Summary": "Sunteck Realty reported strong Q3 performance with consolidated net profit rising 37% to ₹582 million and revenue more than doubling to ₹3.44 billion year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769523903324,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sunteck Realty Completes Strategic Land Acquisition",
            "Summary": "Sunteck Realty's subsidiary completes acquisition of 100% stake in Shreejikrupa Hotels, securing 1.75 acres near Mumbai airport with ₹2,500 crores development potential.",
            "Sentiment": "positive",
            "PublishDate": 1768904255966,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sunteck Realty Q3 FY26 Earnings Call on Jan 28",
            "Summary": "Sunteck Realty has scheduled its Q3 & 9M FY2026 earnings conference call for January 28, 2026 at 4:00 PM IST, to be led by Chairman & MD Kamal Khetan with senior management team.",
            "Sentiment": "neutral",
            "PublishDate": 1768902553765,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sunteck Realty launches ₹3,000 cr Goregaon project",
            "Summary": "Sunteck Realty unveils ultra-luxury 42-storey residential tower in Goregaon West with ₹1,250 cr initial phase GDV. Project features 3-4 BHK homes with Aarey Forest views and 100,000+ sq ft amenities.",
            "Sentiment": "positive",
            "PublishDate": 1768813005418,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Wins GST Order, Demand Nullified",
            "Summary": "Sunteck Realty receives favorable GST order dated December 31, 2025, with all demands, interest, and penalties nullified after department accepts company's contentions.",
            "Sentiment": "positive",
            "PublishDate": 1767200839360,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Incorporates Wholly-Owned Subsidiary",
            "Summary": "Sunteck Realty Limited has incorporated Etashi Real Estates Private Limited as a wholly-owned subsidiary with ₹1.00 lakh capital for real estate activities.",
            "Sentiment": "positive",
            "PublishDate": 1766497012992,
            "Source": "stocks"
        },
        {
            "Title": "Sunteck Realty Promoter Group Acquires 78.23 Lakh Convertible Warrants Through Preferential Allotment",
            "Summary": "Three promoter group entities of Sunteck Realty - Samagra Wealthmax, Glint Infraprojects, and Bhuwalka Steel Industries - acquired 78,23,528 convertible warrants representing 4.93% of diluted share capital through preferential allotment. The acquisition maintains the promoter group's existing 63.30% voting rights while adding potential diluted shareholding through warrant conversion.",
            "Sentiment": "positive",
            "PublishDate": 1765014772751,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Unit Receives London Court Order Confirming Withdrawal of JV Claim",
            "Summary": "A unit of Sunteck Realty received an order from the London Court of Arbitration confirming the withdrawal of a claim involving joint venture partner Grand Valley General Trading. The arbitration resolution removes legal uncertainty for the real estate company and its joint venture operations.",
            "Sentiment": "positive",
            "PublishDate": 1764028989024,
            "Source": "stock"
        },
        {
            "Title": "Sunteck Realty Forms New Wholly-Owned Subsidiary Ishittra Lifespace",
            "Summary": "Sunteck Realty has established a new fully owned subsidiary named Ishittra Lifespace Pvt Ltd. This corporate restructuring move affects Sunteck Realty's organizational structure and potentially its business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763994284624,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Incorporates New Dubai Marketing Subsidiary",
            "Summary": "Sunteck Realty Limited has incorporated a new wholly owned step-down subsidiary called Sunteck Lifestyle Properties L.L.C in Dubai, United Arab Emirates on November 5, 2025. The new entity was incorporated through Sunteck Lifestyles Limited (SLL), which is already a wholly owned step-down Dubai subsidiary of Sunteck Realty. The Dubai Marketing Company will focus on sales and marketing for real estate projects in Dubai. SLL subscribed to 300 shares of AED 1000 each, totaling AED 3,00,000. Sunteck Realty holds 100% shares in the new Dubai Marketing Company through SLL.",
            "Sentiment": "neutral",
            "PublishDate": 1762431164834,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Establishes New Wholly-Owned Subsidiary Mantavya Real Estates",
            "Summary": "Sunteck Realty has created a new fully owned subsidiary called Mantavya Real Estates Private Limited. This represents a corporate restructuring move by the real estate company to establish a new entity under its ownership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1762268746922,
            "Source": "stock"
        },
        {
            "Title": "Sunteck Realty Acquires Full Ownership of Shreejikrupa Hotels And Properties",
            "Summary": "Sunteck Realty has acquired complete ownership of Shreejikrupa Hotels And Properties through its wholly owned subsidiary Apricum Buildwell. The acquisition gives Sunteck full control of the hotel and properties company through its subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1761839502878,
            "Source": "order&deals"
        },
        {
            "Title": "Sunteck Realty Incorporates New Wholly Owned Subsidiary Adyanta Constructions",
            "Summary": "Sunteck Realty has incorporated a wholly owned subsidiary called Adyanta Constructions Private Limited. Mithra Buildcon serves as the holding company, with 100% of the share capital held by Mithra.",
            "Sentiment": "neutral",
            "PublishDate": 1761825392227,
            "Source": "stock"
        },
        {
            "Title": "Sunteck Realty's Dubai Subsidiary Acquires Two Companies Through Joint Venture Agreements",
            "Summary": "Sunteck Realty's Dubai-based subsidiary Sunteck Lifestyles has acquired two subsidiaries - GGICO Sunteck and Sunteck Mas - through supplemental agreements with joint venture partners. The acquisitions were completed through project development agreements executed on October 28, giving Sunteck Lifestyles the right to appoint majority directors on GGICO Sunteck's board and majority members on Sunteck Mas's project execution committee. Sunteck Realty shares closed 1.2% higher at ₹445, with the stock gaining 7.2% over the past month despite declining 12.4% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1761794363444,
            "Source": "stock"
        },
        {
            "Title": "Sunteck Realty Reports 34% Growth in Q2 Pre-Sales, Launches Luxury Brand Emaance",
            "Summary": "Sunteck Realty achieved pre-sales of Rs. 7 billion in Q2 FY26, marking 34% year-on-year growth, with half-yearly pre-sales reaching Rs. 14 billion (32% growth). The company generated net operating cash flow surplus of Rs. 2.6 billion in the first half, maintaining net debt equity at 0.04x. Operating revenues for Q2 stood at Rs. 252 crores versus Rs. 169 crores previously, while EBITDA grew 108% to Rs. 78 crores with margins at 31%. Net profit increased 41% to Rs. 49 crores. The company invested Rs. 4.3 billion in business development during the first half, adding two projects in western Mumbai suburbs - an Andheri redevelopment project worth Rs. 11 billion GDV and a Mira Road joint development valued at Rs. 12 billion GDV. Sunteck launched its luxury brand 'Emaance' featuring a marquee Nepeansea Road project. The company received a five-star GRESB rating with 99/100 score. Management indicated multiple upcoming launches across various segments including ODC, 5th Avenue residential, and new redevelopment projects.",
            "Sentiment": "positive",
            "PublishDate": 1761659899031,
            "Source": "earnings"
        },
        {
            "Title": "Sunteck Realty Reports Strong Pre-Sales Growth But Collections Fall Short of Estimates",
            "Summary": "Sunteck Realty reported pre-sales of Rs 7 billion in Q2 FY26, representing a 34% year-on-year increase and 7% quarter-on-quarter growth, which was 19% above estimates. For the first half of FY26, pre-sales reached Rs 13.6 billion, up 32% year-on-year. However, collections of Rs 3.3 billion in Q2 FY26, while up 24% year-on-year, came in 28% below estimates. Half-year collections totaled Rs 6.8 billion, showing 12% year-on-year growth. Motilal Oswal maintains a 'Buy' rating on the stock, noting strong financials despite the collections miss.",
            "Sentiment": "neutral",
            "PublishDate": 1761193532858,
            "Source": "stock"
        },
        {
            "Title": "Sunteck Realty Reports Strong Q2 & H1 FY26 Results with 34% Pre-sales Growth",
            "Summary": "Sunteck Realty Limited submitted its investor presentation for Q2 and H1 FY26 financial results. For Q2 FY26, the company achieved pre-sales of Rs 702 crores (up 34% YoY), collections of Rs 331 crores (up 24% YoY), and revenue from operations of Rs 252 crores (up 49% YoY). EBITDA grew to Rs 78 crores (up 108% YoY) with margins expanding to 31%, while PAT reached Rs 49 crores (up 41% YoY). For H1 FY26, pre-sales stood at Rs 1,359 crores (up 32% YoY), collections at Rs 682 crores (up 12% YoY), and revenue from operations at Rs 441 crores. EBITDA increased to Rs 126 crores (up 83% YoY) with 28% margins, and PAT grew to Rs 82 crores (up 44% YoY). The company maintains a strong balance sheet with net debt-to-equity ratio of 0.04x and reported net operating cash flow surplus of Rs 258 crores (up 35% YoY). Sunteck has a total GDV of approximately Rs 39,100 crores from 11 large projects and recently formed a joint investment platform of up to Rs 750 crores with IFC-World Bank Group.",
            "Sentiment": "positive",
            "PublishDate": 1760805104355,
            "Source": "earnings"
        },
        {
            "Title": "Sunteck Realty Reports Q2 FY26 Financial Results with Revenue Growth",
            "Summary": "Sunteck Realty Ltd announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of ₹25,236.75 lakhs for Q2 FY26, up from ₹16,904.85 lakhs in the same quarter last year. Net profit after tax increased to ₹4,896.69 lakhs compared to ₹3,462.64 lakhs in Q2 FY25. For the half-year period, revenue reached ₹44,068.64 lakhs versus ₹48,532.84 lakhs in the previous year. The company's earnings per share for the quarter stood at ₹3.34. On a standalone basis, the company reported revenue of ₹6,046.27 lakhs for Q2 FY26 and net profit of ₹288.69 lakhs. The results were approved by the Board of Directors at their meeting held on October 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760624380684,
            "Source": "earnings"
        },
        {
            "Title": "Sunteck Realty Launches Ultra-Luxury Brand 'Emaance' with ₹20,000 Crore Project Pipeline",
            "Summary": "Sunteck Realty launched Emaance, an invitation-only ultra-luxury brand targeting global elite clients. The company plans to launch projects worth ₹20,000 crore over the next 12 months, including a South Mumbai development on Nepeansea Road and an international project in Dubai's Burj Khalifa community. The Mumbai project will feature residences priced from ₹2.5 lakh per square foot, positioning them among India's most expensive homes. The brand extends beyond real estate to offer personalized lifestyle services including private aviation, luxury yachts, and bespoke concierge services. Chairman Kamal Khetan described Emaance as redefining ultra-luxury living for ultra-high-net-worth individuals seeking exclusivity beyond traditional luxury offerings.",
            "Sentiment": "positive",
            "PublishDate": 1759108776363,
            "Source": "stock"
        },
        {
            "Title": "Sunteck Realty Allocates 17.6 Lakh Convertible Warrants to Mukul Agrawal at ₹425 Each",
            "Summary": "Sunteck Realty has allocated 17.6 lakh convertible warrants to investor Mukul Agrawal at a price of ₹425 per warrant. This allocation represents a capital raising initiative through the issuance of convertible securities to the investor.",
            "Sentiment": "neutral",
            "PublishDate": 1757301940861,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Approves Rs 500 Crore Warrant Issuance and Appoints New Whole-time Director",
            "Summary": "Sunteck Realty's Board approved the issuance of 1,17,64,705 convertible warrants at Rs 425 per warrant, raising Rs 499,99,99,625 through preferential allotment to promoters and non-promoters. The warrants are convertible into equity shares within 18 months, with 25% payment required at allotment. Seven investors will participate, including promoter group entities Samagra Wealthmax Private Limited, Glint Infraprojects Private Limited, and Bhuwalka Steel Industries Limited, along with non-promoter investors. The Board also appointed Mr. Ajeet Singh as Additional and Whole-time Director for five years. Singh, aged 52, is an architect with over 30 years of experience in Mumbai real estate development. Both decisions require shareholder approval at the Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1757089210174,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Schedules Board Meeting to Consider Preferential Securities Issue",
            "Summary": "Sunteck Realty will hold a board meeting on September 5 to consider a preferential issue of securities. The company has announced this upcoming board meeting to deliberate on the proposed securities issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1756830321206,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Incorporates Wholly-Owned Subsidiary Amenity Buildcon",
            "Summary": "Sunteck Realty has incorporated a wholly-owned subsidiary named Amenity Buildcon Pvt Ltd. The incorporation establishes a new entity under Sunteck Realty's complete ownership and control.",
            "Sentiment": "neutral",
            "PublishDate": 1755784095105,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Incorporates Wholly-Owned Subsidiary Magenta Buildcon Private Limited",
            "Summary": "Sunteck Realty Limited has incorporated a wholly-owned subsidiary named Magenta Buildcon Private Limited (MBPL) on August 13, 2025. The subsidiary operates in real estate activities, construction, and allied activities. Sunteck subscribed to 10,000 equity shares with a face value of ₹10 each, totaling ₹1,00,000 in cash consideration, giving it 100% shareholding control. The transaction does not qualify as a related party transaction, and no promoters or group companies have any interest in this incorporation.",
            "Sentiment": "neutral",
            "PublishDate": 1755100005569,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Reports Record Q1 Pre-Sales of Rs. 657 Crores, Up 31% Year-on-Year",
            "Summary": "Sunteck Realty achieved its highest ever first quarter pre-sales bookings of Rs. 657 crores in Q1 FY26, marking a 31% growth from Rs. 502 crores in the same period last year. The company reported operating revenues of Rs. 188 crores and EBITDA of Rs. 48 crores, representing 52% growth with margins at 25%. Net profit stood at Rs. 33 crores, showing 47% growth. Collections reached Rs. 351 crores compared to Rs. 342 crores in the previous year. The company added a 2.5-acre redevelopment project in Andheri, Mumbai with a gross development value of Rs. 11 billion, investing over Rs. 3 billion in business development during the quarter. Sunteck plans to launch new projects worth Rs. 110 billion GDV in the remaining three quarters of FY26, targeting to increase total GDV from Rs. 400 billion to over Rs. 500 billion. The company maintains a strong balance sheet with a negligible net debt-to-equity ratio of 0.02x and received an AA stable credit rating from Fitch India Ratings.",
            "Sentiment": "positive",
            "PublishDate": 1753358351023,
            "Source": "earnings"
        },
        {
            "Title": "Sunteck Realty Enters Joint Development Agreement for 3.5-Acre Mumbai Project",
            "Summary": "Sunteck Realty Limited has entered into a Joint Development Agreement for a project on approximately 3.5 acres of land located at Mira Road on Western Express Highway, Mumbai. The company expects to generate a sale component of approximately 550,000 square feet RERA carpet area from the development of this land parcel.",
            "Sentiment": "positive",
            "PublishDate": 1753269949959,
            "Source": "stock"
        },
        {
            "Title": "Sunteck Realty Reports Q1 Financial Results",
            "Summary": "Sunteck Realty has announced its Q1 consolidated financial results. The company's net profit increased to 334 million rupees from 228 million rupees in the same quarter last year. However, revenue decreased to 1.9 billion rupees from 3.2 billion rupees in the corresponding period.",
            "Sentiment": "neutral",
            "PublishDate": 1752801163000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty: Q1 Profit Surges 47%, Margin Expands Significantly",
            "Summary": "Sunteck Realty reported a 46.8% year-on-year increase in Q1 FY26 consolidated profit to Rs 33.4 crore. Revenue decreased 40.5% to Rs 188 crore, while EBITDA rose 52% to Rs 47.7 crore. The company's margin expanded substantially to 25.4% from 9.9% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752761668000,
            "Source": "earnings"
        },
        {
            "Title": "Sunteck Realty Reports Q1 Financial Results",
            "Summary": "Sunteck Realty announced its Q1 consolidated financial results. The company reported a net profit of 334 million rupees, up from 228 million rupees in the same quarter last year. However, revenue decreased to 1.9 billion rupees from 3.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752758419000,
            "Source": "result"
        },
        {
            "Title": "Sunteck Realty Schedules Q1 FY26 Earnings Call",
            "Summary": "Sunteck Realty has announced that it will hold its Q1 FY26 earnings call on July 18. The company will discuss its financial results for the first quarter of the fiscal year 2026 during this call.",
            "Sentiment": "neutral",
            "PublishDate": 1752310032000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty: Subsidiary to Develop 2.5-Acre Residential Project in Mumbai",
            "Summary": "Sunteck Realty's subsidiary will develop a residential project on a 2.5-acre land in Andheri East, Mumbai, expecting to generate 275,000 sq ft of free sale area. Q4 net profit rose 19% sequentially to ₹50 crore, with revenue up 27% to ₹206 crore. FY25 pre-sales hit a record ₹2,531 crore, up 32% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748520489000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Incorporates New Subsidiary for Real Estate Activities",
            "Summary": "Sunteck Realty has incorporated a wholly-owned subsidiary named 'Apricum Buildwell' for real estate activities. The company has not provided any additional details about the specific purpose or projects of this new subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1747668277000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty Confident in Growth and Acquisitions",
            "Summary": "Sunteck Realty has expressed confidence in achieving growth similar to last year, despite other companies providing more conservative guidance. The company is focusing on acquisitions with higher EBITDA margins and expects to announce new acquisitions soon.",
            "Sentiment": "positive",
            "PublishDate": 1746502268000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty Reports Q4 Financial Results and Dividend",
            "Summary": "Sunteck Realty announced its Q4 consolidated net profit of 504 million rupees, down from 1.01 billion rupees year-over-year and up from 425 million rupees quarter-over-quarter. Q4 revenue was 2.1 billion rupees, compared to 4.27 billion rupees in the previous year. The company recommended a final dividend of 1.5 rupees per equity share and plans to issue non-convertible debentures to PDL Realty for up to 310 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1746403604000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty: Q4 Profit Up 19%, Record Annual Pre-Sales",
            "Summary": "Sunteck Realty reported a 19% QoQ increase in Q4 FY25 net profit to ₹50 crore. Revenue rose 27% QoQ to ₹206 crore. Annual pre-sales hit a record ₹2,531 crore, up 32% YoY. The company recommended a final dividend of ₹1.50 per share. Net debt-to-equity ratio remains at zero with a net cash surplus of ₹125 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746198667000,
            "Source": "earnings"
        },
        {
            "Title": "Sunteck Realty to Issue Non-Convertible Debentures",
            "Summary": "Sunteck Realty has announced plans to issue non-convertible debentures (NCDs) to PDL Realty for up to 310 million rupees. This move represents a significant corporate financial decision, potentially aimed at raising capital or refinancing existing debt.",
            "Sentiment": "neutral",
            "PublishDate": 1746193994000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty Reports Q4 Results and Dividend Announcement",
            "Summary": "Sunteck Realty announced its Q4 financial results, showing a decline in performance compared to the previous year. The company reported a consolidated net profit of 504 million rupees, down from 1.01 billion rupees year-over-year. Q4 revenue decreased to 2.1 billion rupees from 4.27 billion rupees in the same period last year. EBITDA for Q4 was 687 million rupees, with an EBITDA margin of 33.33%. Despite the decline, the company recommended a final dividend of 1.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746189524000,
            "Source": "result"
        },
        {
            "Title": "Sunteck Realty Board Meeting: NCD Issuance and Fund Raising Options",
            "Summary": "Sunteck Realty has scheduled a board meeting on May 2 to discuss two key matters. First, the board will consider issuing ₹25 crore in listed non-convertible debentures (NCDs) to PDL Realty Pvt Ltd through private placement. This is linked to PDL's exit as a partner in Starlight Systems and its subsequent amalgamation with Sunteck Realty. Second, the board will evaluate an enabling resolution for raising funds through various instruments including debt, equity, QIP, FPO, rights or preferential issues, and convertible securities.",
            "Sentiment": "neutral",
            "PublishDate": 1745419364000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty to Consider Q4 Results on May 2",
            "Summary": "Sunteck Realty has announced that it will consider its fourth quarter financial results on May 2. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745417891000,
            "Source": "default"
        },
        {
            "Title": "Sunteck Realty to Invest $10-20 Million in International Subsidiary",
            "Summary": "Sunteck Realty, an Indian real estate company, has announced plans to invest between $10 million and $20 million in its international subsidiary, Sunteck Lifestyle International. This investment indicates the company's intention to expand its operations and presence in international markets.",
            "Sentiment": "positive",
            "PublishDate": 1743034348000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty to Invest $10-20 Million in International Subsidiary",
            "Summary": "Sunteck Realty has announced plans to invest between $10 million and $20 million in its subsidiary, Sunteck Lifestyle International. This investment indicates the company's intent to expand its international operations and potentially enter new markets.",
            "Sentiment": "positive",
            "PublishDate": 1743001270000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Incorporates New Subsidiary",
            "Summary": "Sunteck Realty has incorporated a new wholly owned subsidiary named Astrica Realtors. This move suggests potential expansion or restructuring of the company's real estate operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741565321000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Incorporates New Wholly Owned Subsidiary",
            "Summary": "Sunteck Realty has incorporated a new wholly owned subsidiary named Astrica Realtors. This move suggests potential expansion or restructuring of the company's real estate operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741358234000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty: Promoters Increase Stake as Stock Rebounds from 52-Week Low",
            "Summary": "Sunteck Realty's promoter group acquired 19,400 additional shares, increasing their stake from 63.24% to 63.25%. The stock rebounded 4.7% after hitting a 52-week low, but remains 44% below its July 2024 peak.",
            "Sentiment": "neutral",
            "PublishDate": 1740639309000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sunteck Realty Plans Multiple Project Launches, Including 5th Avenue in ODC",
            "Summary": "Sunteck Realty has announced plans to launch several projects, including the 5th Avenue commercial project in ODC, expected to be completed in FY '28. The company is confident about launching 3-4 projects in the current quarter, with a possibility of one project being delayed due to approval issues.",
            "Sentiment": "positive",
            "PublishDate": 1737516410000,
            "Source": "corporate_action"
        }
    ]
}