{
    "Symbol": "SUNTV",
    "ISIN": "INE424H01027",
    "News": [
        {
            "Title": "Sun TV Network Q3FY26 Results: Revenue Up 4.32%",
            "Summary": "Sun TV Network reported Q3FY26 revenue of ₹827.87 crores, up 4.32% YoY. Total income rose 3.31% to ₹958.39 crores. Company declared interim dividend of ₹2.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770378802658,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sun TV Network Board Meet on Feb 6 for Q3FY26 Results",
            "Summary": "Sun TV Network Limited has scheduled a board meeting for February 6, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769689533408,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sun TV Q2 PAT Falls 13.4% to Rs 354.7 Crore Despite Revenue Growth",
            "Summary": "Sun TV Networks reported a 13.37% decline in consolidated profit after tax to Rs 354.69 crore in the September quarter, while revenue from operations dropped 38.9% to Rs 1,299.87 crore. The company declared an interim dividend of 75% (Rs 3.75 per share) and its holding company acquired 100% stake in Sunrisers Leeds for GBP 100.5 million, with cricket franchise income contributing Rs 94.52 crore during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763137307131,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Network Sets Record Date for 24th Interim Dividend for FY2025-26",
            "Summary": "Sun TV Network Limited has announced November 20, 2025 as the record date for its 24th interim dividend for Financial Year 2025-26. The dividend declaration is subject to approval at the company's board meeting scheduled for November 14, 2025. If declared, the interim dividend payment will be made within 30 days from the declaration date as per Companies Act provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1762778922199,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network's UK Subsidiary Changes Name to Sunrisers Leeds Limited",
            "Summary": "Sun TV Network Limited announced that its wholly owned subsidiary company in London, United Kingdom has changed its name from Northern Superchargers Limited to Sunrisers Leeds Limited. The company disclosed this information to BSE Limited and National Stock Exchange of India Limited under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762180996621,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Shares Surge 18% on Potential IPL Team Revaluation Linked to RCB Sale Reports",
            "Summary": "Sun TV shares jumped 18% to Rs 617 following reports that Diageo may sell its stake in IPL team Royal Challengers Bangalore (RCB) for $2 billion. This potential sale could reset IPL team valuations and increase the worth of Sun TV's Sunrisers Hyderabad (SRH) team. Sun TV currently attributes Rs 87 billion of its market value to SRH, which represents about 45% of the company's market capitalization. Former IPL commissioner Lalit Modi commented that RCB's sale could set a new record valuation and establish a new floor price for all IPL teams. Sun TV shares closed at Rs 588, up 12% for the day, though they remain down 11% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1759315684359,
            "Source": "stock"
        },
        {
            "Title": "Sun TV Network Resolves Internal Legal Disputes as Promoter Family Member Withdraws All Notices",
            "Summary": "Sun TV Network has resolved internal legal issues after a promoter family member withdrew all legal notices. This development appears to settle disputes within the promoter group of the media and entertainment company.",
            "Sentiment": "positive",
            "PublishDate": 1754896377921,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sun TV Network Reports Q1 FY26 Results with Rs 528.66 Crores PAT and 100% Interim Dividend",
            "Summary": "Sun TV Network Limited reported quarterly results for the period ended June 30, 2025. The company posted revenue from operations of Rs 1,256.79 crores and profit after tax of Rs 528.66 crores. Key revenue segments included advertisement revenues of Rs 289.94 crores and domestic subscription revenues of Rs 470.12 crores. EBITDA stood at Rs 617.23 crores. The Board declared an interim dividend of Rs 5 per equity share (100% on face value of Rs 5). The company also appointed M/s. Lakshmmi Subramanian & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. Additionally, Sun TV entered into a Share Purchase Agreement to acquire 100% stake in Northern Superchargers Limited for GBP 100.5 million. The results included income from cricket franchises 'Sunrisers Hyderabad' and 'Sunrisers Eastern Cape' of Rs 473.03 crores with corresponding costs of Rs 256.09 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754565583509,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Acquires UK Cricket Franchise Northern Superchargers for ₹1,161 Crore",
            "Summary": "Sun TV Network's board approved the acquisition of 100% equity in Northern Superchargers Ltd., a London-based cricket franchise competing in The Hundred league run by the England and Wales Cricket Board. The deal is valued at GBP 100.5 million (₹1,161 crore) and expected to close by December 31, 2025. Northern Superchargers reported turnover of GBP 1.89 million (₹22 crore) in FY24 and is profitable. The acquisition values the franchise at 53 times revenue. This expands Sun TV's cricket portfolio, which includes Sunrisers Hyderabad in the IPL and Sunrisers Eastern Cape in SA20. Sun TV stated The Hundred has significant potential for future financial returns. Sun TV shares closed 0.56% lower at ₹573.20 and are down 17% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1753063736046,
            "Source": "order&deals"
        },
        {
            "Title": "Sun TV Network Limited: Stalin Brokers Peace Between Maran Brothers",
            "Summary": "Tamil Nadu CM MK Stalin intervened in the dispute between Dayanidhi and Kalanithi Maran over Sun TV ownership. Kalanithi agreed to give more shares to Dayanidhi as part of the compromise. The conflict arose from allegations of Kalanithi assuming control of Sun TV without proper permissions from other shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1752037687000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sun TV Network Addresses Media Speculations About Promoter's Personal Issues",
            "Summary": "Sun TV Network has issued a statement addressing media speculations regarding personal issues of its promoter. The company clarified that the allegations circulating in the media are misleading and not related to the company's operations. Sun TV Network emphasized that these personal matters do not affect the functioning of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1750401357000,
            "Source": "default"
        },
        {
            "Title": "Sun TV Network: Dayanidhi Maran Alleges 'Fraudulent Takeover' by Brother Kalanithi",
            "Summary": "DMK MP Dayanidhi Maran has sent a legal notice to Sun TV Network Chairman Kalanithi Maran and others, accusing them of fraudulently seizing control of the group after their father's death in 2003. The notice alleges mismanagement and breach of trust, threatening an investigation by the Serious Fraud Investigation Office.",
            "Sentiment": "negative",
            "PublishDate": 1750388924000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sun TV Network: Dayanidhi Maran Serves Legal Notice to Brother Kalanithi Maran",
            "Summary": "DMK MP Dayanidhi Maran has sent a legal notice to his brother Kalanithi Maran, chairman of Sun TV Network, alleging fraudulent practices and demanding restoration of original shareholding structure. The notice accuses Kalanithi Maran and seven others of cheating and money laundering, seeking a forensic audit of the company's finances.",
            "Sentiment": "negative",
            "PublishDate": 1750345979000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sun TV Network: Q4 Profit and Revenue Decline, Margins Narrow",
            "Summary": "Sun TV Network reported a 10.4% YoY decrease in Q4 net profit to ₹371.6 crore. Revenue fell 2.2% to ₹940.6 crore. EBITDA dropped 18% to ₹429 crore, with margin shrinking to 45.61%. For FY25, standalone revenue decreased to ₹3,878.86 crore, while net profit fell to ₹1,654.46 crore. The company declared four interim dividends totaling 300% or ₹15 per share.",
            "Sentiment": "negative",
            "PublishDate": 1748611061000,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Network Reports Q4 Financial Results",
            "Summary": "Sun TV Network has released its Q4 financial results. The company's EBITDA decreased to 4.3 billion rupees from 5.23 billion rupees year-over-year. The EBITDA margin fell to 45.70% from 54.4% compared to the same period last year. Consolidated net profit for Q4 was 3.7 billion rupees, down from 4.15 billion rupees year-over-year, but up from 3.6 billion rupees quarter-over-quarter. Q4 revenue was reported at 9.4 billion rupees, slightly lower than the 9.61 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748605829000,
            "Source": "result"
        },
        {
            "Title": "NCLT Approves Merger of Udaya FM with KAI Radio for Sun TV Network",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the amalgamation of Udaya FM with KAI Radio, both subsidiaries of Sun TV Network. This merger is a significant corporate action that will likely streamline operations and potentially create synergies within the Sun TV Network group.",
            "Sentiment": "positive",
            "PublishDate": 1743552771000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of Udaya FM with KAI Radio for Sun TV Network",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the amalgamation of Udaya FM with KAI Radio, both subsidiaries of Sun TV Network. This corporate action represents a consolidation of Sun TV Network's radio operations, potentially streamlining their business structure and operations in the broadcasting sector.",
            "Sentiment": "neutral",
            "PublishDate": 1743508305000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network Declares Interim Dividend of 2.50 Rupees Per Share",
            "Summary": "Sun TV Network has approved and declared an interim dividend of 2.50 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1741565411000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network Declares Interim Dividend",
            "Summary": "Sun TV Network has approved and declared an interim dividend of 2.50 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1741345553000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network Schedules Board Meeting to Consider Interim Dividend",
            "Summary": "Sun TV Network has announced a board meeting on March 7 to discuss and potentially declare an interim dividend for the financial year 2024-25. The meeting will also consider other unspecified matters.",
            "Sentiment": "neutral",
            "PublishDate": 1741134383000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network Board Meeting to Consider Interim Dividend",
            "Summary": "Sun TV Network has announced a board meeting scheduled for March 7 to consider, among other matters, the declaration and payment of an interim dividend for the financial year 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1741086986000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network: Shares Drop 7% on Q3 Margin Miss and Ad Revenue Decline",
            "Summary": "Sun TV Network's shares fell up to 7% following disappointing Q3 results. Net profit declined 20% YoY to ₹363 crore, while revenue dropped 10.4% to ₹827.6 crore. Ad revenue fell to ₹332.17 crore, impacting EBITDA margin which decreased to 53.7% from 63.8% YoY. CLSA maintains 'Hold' rating with reduced price target of ₹670. Nuvama suggests aggressive OTT push, revises price target to ₹955 while maintaining 'Buy' rating.",
            "Sentiment": "negative",
            "PublishDate": 1739164278000,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Network: Core Business Lags, IPL Success Not Enough for Growth",
            "Summary": "Sun TV's core business is underperforming despite IPL success. New initiatives in Marathi, Bengali, Hindi channels, and African franchise have yet to yield results. Dolat Capital has downgraded Sun TV to 'Sell' rating.",
            "Sentiment": "negative",
            "PublishDate": 1739157204000,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Network Reports Q3 Financial Results and Dividend Declaration",
            "Summary": "Sun TV Network has announced its Q3 consolidated financial results. The company reported a net profit of 3.63 billion rupees, down from 4.53 billion rupees in the same quarter last year. Revenue also decreased to 8.3 billion rupees from 9.23 billion rupees year-over-year. Additionally, the company has declared a dividend of 2.5 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1739146458000,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Network Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Sun TV Network has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 4.45 billion rupees from 5.89 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin fell to 53.74% from 63.80% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738931410000,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Network Reports Decline in Q3 Financial Performance",
            "Summary": "Sun TV Network has announced its Q3 financial results, showing a decrease in both net profit and revenue compared to the same period last year. The consolidated net profit for Q3 stood at 3.63 billion rupees, down from 4.53 billion rupees year-over-year. Similarly, revenue for the quarter decreased to 8.3 billion rupees from 9.23 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738931398000,
            "Source": "earnings"
        },
        {
            "Title": "Sun TV Network Acquires Northern Superchargers in UK Cricket League",
            "Summary": "Sun TV Network has successfully bid £100.5 million to acquire 100% equity of Northern Superchargers Ltd, one of the eight franchises in The Hundred cricket league in the United Kingdom. This acquisition marks Sun TV Network's entry into the UK cricket market.",
            "Sentiment": "positive",
            "PublishDate": 1738843648000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network Ltd.: Q3 Results and Interim Dividend Announcement",
            "Summary": "Sun TV Network Ltd. will announce Q3 FY25 results on February 7, 2025. The board will also consider an interim dividend, with a revised record date of February 13, 2025. The company's Q2 FY25 results showed a 12% YoY drop in net profit and a 10.9% YoY decrease in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1738822980000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of South Asia FM with Sun TV Network",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the scheme of amalgamation between Sun TV Network and its joint venture/associate companies, including South Asia FM. This corporate action represents a significant restructuring for Sun TV Network, potentially streamlining operations and consolidating assets within the company.",
            "Sentiment": "positive",
            "PublishDate": 1734482387000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of South Asia FM with Sun TV Network",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the scheme of amalgamation between South Asia FM, a subsidiary or associate company, and Sun TV Network. This corporate action represents a significant restructuring for Sun TV Network, potentially streamlining operations and consolidating assets within the company.",
            "Sentiment": "positive",
            "PublishDate": 1734437026000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network Declares Interim Dividend",
            "Summary": "Sun TV Network has announced an interim dividend of 5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731496563000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun TV Network Reports Q2 Financial Results",
            "Summary": "Sun TV Network has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 5.4 billion rupees, down from 7.3 billion rupees in the same quarter last year. The EBITDA margin has also decreased to 57.84% from 69.42% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731496533000,
            "Source": "result"
        },
        {
            "Title": "Sun TV Network Reports Q2 Revenue Decline",
            "Summary": "Sun TV Network's second quarter revenue for the current fiscal year was 9.3 billion rupees, down from 10.5 billion rupees in the same quarter of the previous year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731496507000,
            "Source": "result"
        },
        {
            "Title": "Sun TV Network Reports Q2 Financial Results",
            "Summary": "Sun TV Network announced its Q2 consolidated net profit of 4.1 billion rupees, showing a decrease from 4.64 billion rupees year-over-year and 5.6 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731496472000,
            "Source": "result"
        }
    ]
}