{
    "Symbol": "SUPERSPIN",
    "ISIN": "INE662A01027",
    "News": [
        {
            "Title": "Super Spinning Mills Q3FY26 Profit Jumps 946%",
            "Summary": "Super Spinning Mills reported exceptional Q3FY26 performance with net profit surging 946% to ₹112.63 lakhs driven by exceptional items worth ₹78.96 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770804362037,
            "Source": "co_actions_results"
        },
        {
            "Title": "Super Spinning Mills Board Approves Land Disposal Plan",
            "Summary": "Super Spinning Mills Limited board approved proposal to sell or develop land at SUPER B UNIT in Andhra Pradesh, subject to shareholder approval through postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1769882191822,
            "Source": "co_actions_results"
        },
        {
            "Title": "Super Spinning Mills Receives Credit Ratings from CARE for Bank Facilities Worth Rs. 14.51 Crore",
            "Summary": "CARE Ratings has assigned CARE BB+ Stable rating for Super Spinning Mills' long-term bank facilities of Rs. 14.12 crore and CARE A4+ rating for short-term facilities of Rs. 0.39 crore. The rating assignment was based on the company's operational and financial performance for FY25 and H1FY26, with the long-term facility rating being reaffirmed while short-term rating was newly assigned.",
            "Sentiment": "neutral",
            "PublishDate": 1764405701784,
            "Source": "stock"
        },
        {
            "Title": "Super Spinning Mills Completes Sale of Properties Worth Rs 7.52 Crores to Promoter and Group Company",
            "Summary": "Super Spinning Mills Limited has completed the sale of immovable properties comprising land and buildings located at Elgi Towers, Coimbatore. The company sold 17.14 cents of land and building to Mr. Sumanth Ramamurthi, Chairman and Managing Director, for Rs 6.00 crores. Additionally, 4.28 cents of land and building was sold to Elgi Electric and Industries Limited for Rs 1.52 crores. Both transactions were conducted at arm's length basis and received shareholder approval through postal ballot. Mr. Sumanth Ramamurthi holds 17.16% shares in the company and is also a promoter. Elgi Electric and Industries Limited holds 1.39% of the share capital and is part of the promoter group. The sale deeds were executed and transactions completed on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762897216435,
            "Source": "corporate_action"
        },
        {
            "Title": "Super Spinning Mills Reports Mixed Results with Continuing Operations Profit Offset by Discontinued Textile Losses",
            "Summary": "Super Spinning Mills Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported a profit of Rs 25.74 lakhs from continuing operations but faced losses of Rs 23.80 lakhs from discontinued textile operations, resulting in a net profit of Rs 25.74 lakhs for the period. Revenue from operations stood at Rs 150.40 lakhs compared to Rs 662.73 lakhs in the same quarter last year. The company's rental services segment generated Rs 103.10 lakhs in segment results while the discontinued textile operations recorded losses. The Board meeting was held on November 10, 2025, where these unaudited financial results were approved. The company had previously discontinued its textile operations and informed stock exchanges on August 31, 2023. Basic earnings per share for continuing and discontinued operations combined was Rs 0.05.",
            "Sentiment": "neutral",
            "PublishDate": 1762762859346,
            "Source": "earnings"
        },
        {
            "Title": "Super Spinning Mills Reports Quarterly Results with Continuing Operations Showing Profit While Discontinued Textile Operations Record Losses",
            "Summary": "Super Spinning Mills Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company's continuing operations, primarily rental services, generated revenue of Rs 150.40 lakhs compared to Rs 189.52 lakhs in the previous quarter and Rs 156.26 lakhs in the same quarter last year. The company reported a loss of Rs 5.19 lakhs for the quarter from continuing operations after tax. The discontinued textile operations recorded a loss of Rs 44.00 lakhs before tax for the quarter. The company's rental services segment showed profit before tax and finance costs of Rs 87.26 lakhs for continuing operations. Total income from continuing operations was Rs 159.80 lakhs for the quarter. The company had previously discontinued its textile operations and informed stock exchanges on August 31, 2023. Basic earnings per share for continuing operations was Rs (0.41) for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754552272873,
            "Source": "earnings"
        }
    ]
}