{
    "Symbol": "SUPERHOUSE",
    "ISIN": "INE712B01010",
    "News": [
        {
            "Title": "Superhouse Limited Reports Mixed Q2 Performance with Exceptional Gains from Property Sale",
            "Summary": "Superhouse Limited posted standalone net profit of Rs 470.86 lacs for Q2 ended September 30, 2025, boosted by exceptional gains of Rs 620.17 lacs from property disposal, while consolidated operations showed profit of Rs 428.44 lacs. The leather and textile manufacturer shifted operations from one unit to another location for operational efficiency, generating additional liquidity through the property sale.",
            "Sentiment": "positive",
            "PublishDate": 1763115437021,
            "Source": "earnings"
        },
        {
            "Title": "Superhouse Limited Appoints New Independent Director, Confirms Another Appointment",
            "Summary": "Superhouse Limited announced board changes at its Annual General Meeting held on September 30, 2025. The company appointed Mr. Girish Chandra Srivastava as Independent Director for a five-year term from September 30, 2025 to September 29, 2030. Srivastava is a practicing advocate with over 48 years of experience in international taxation and transfer pricing, and is a former member of the Indian Revenue Service who held senior roles in the Ministry of Finance. The company also confirmed Dr. Harmeet Singh's appointment as Independent Director for a five-year term from July 11, 2025 to July 10, 2030, following his earlier appointment as Additional Director. Additionally, Mr. Ajai Kumar Sengar's second consecutive term as Independent Director ended on September 29, 2025. The company stated that its board composition remains compliant with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1759233865427,
            "Source": "corporate_governance"
        },
        {
            "Title": "Superhouse Limited Announces Final Dividend of Rs. 0.80 Per Share for FY 2024-25",
            "Summary": "Superhouse Limited approved its audited standalone financial results for the quarter and year ended March 31, 2025. The board declared a final dividend of Rs. 0.80 per equity share for FY 2024-25, with record date set for September 15, 2025, and payment by October 6, 2025. The company reported revenue from operations of Rs. 14,123.57 lacs and net profit after tax of Rs. 163.66 lacs. Exceptional items of Rs. 620.17 lacs represent profit from sale of land and building. The company appointed Mr. Gautam Kumar Banthia as Secretarial Auditor for five years from April 1, 2025 to March 31, 2030, subject to shareholder approval. Consolidated financial results were not submitted due to non-receipt of audited results from some subsidiary companies. The company operates in leather & leather products and textile products segments, with leather segment contributing Rs. 11,950.92 lacs and textile segment Rs. 2,172.65 lacs to total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1757080051198,
            "Source": "corporate_action"
        },
        {
            "Title": "Superhouse Limited Publishes Q1 FY2026 Financial Results in Newspapers",
            "Summary": "Superhouse Limited, a Government of India recognized Export Trading House, has published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025 in English and Hindi newspapers. The filing was signed by Company Secretary Raj Kumar Agrawal and dated August 19, 2025, indicating compliance with regulatory disclosure requirements. The company is registered in Kanpur, India. No specific financial figures or performance details were disclosed in this regulatory announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1755597031720,
            "Source": "earnings"
        },
        {
            "Title": "Superhouse Limited Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Superhouse Limited approved its standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The Board of Directors meeting was held on August 14, 2025, and the results were reviewed by the Audit Committee. On standalone basis, the company reported total income of Rs. 13,201.56 lacs for the quarter compared to Rs. 11,201.43 lacs in the same quarter last year. On consolidated basis, total income was Rs. 16,679.85 lacs versus Rs. 14,527.56 lacs in the previous year quarter. The results include an exceptional item of Rs. 620.17 lacs representing profit on sale of land and building, as the company shifted operations of one unit to another location for better synergies and efficiency. The consolidated results include seven subsidiaries and three associates, with operations spanning across UK, UAE, Spain, and France.",
            "Sentiment": "positive",
            "PublishDate": 1755164807710,
            "Source": "earnings"
        },
        {
            "Title": "Superhouse Limited Appoints Dr. Harmeet Singh as Independent Director, Reconstitutes Board Committees",
            "Summary": "Superhouse Limited appointed Dr. Harmeet Singh as an Additional Non-Executive Independent Director for a 5-year term from July 11, 2025 to July 10, 2030. The appointment was made based on recommendations from the Nomination and Remuneration Committee and approved by the Board of Directors. Dr. Singh is an Indian Revenue Service officer with over 30 years of experience in taxation, public administration, and institutional leadership. He holds a gold medal in Medicine, joined the IRS in 1989, and retired voluntarily in 2018. He also holds an MBA in Public Policy from the University of Birmingham, U.K. Following this appointment, the company reconstituted its board committees including the Audit Committee, Stakeholders Relationship Committee, Nomination and Remuneration Committee, Corporate Social Responsibility Committee, and Risk Management Committee. The company confirmed that Dr. Singh meets independence criteria under the Companies Act, 2013 and SEBI Listing Regulations, and is not debarred from holding directorship by any authority.",
            "Sentiment": "positive",
            "PublishDate": 1753966289911,
            "Source": "corporate_governance"
        },
        {
            "Title": "Superhouse Limited Independent Director Chaudhary Usman Ahmad Passes Away",
            "Summary": "Superhouse Limited announced the passing of Mr. Chaudhary Usman Ahmad, an Independent Director, on July 20, 2025. Ahmad was appointed to the Board on September 30, 2024, and the company acknowledged his valuable contributions during his tenure. The Board of Directors and employees have extended condolences to his family. The company is taking steps to fill the board vacancy and will inform stock exchanges as per applicable regulations. Ahmad held DIN 10712019 and had no relationships with other directors.",
            "Sentiment": "negative",
            "PublishDate": 1753100700216,
            "Source": "corporate_governance"
        }
    ]
}