{
    "Symbol": "SUPREMEIND",
    "ISIN": "INE195A01028",
    "News": [
        {
            "Title": "Supreme Industries Redeems ₹45 Crore Commercial Paper",
            "Summary": "Supreme Industries Limited successfully completed the redemption of Commercial Paper worth ₹45 crore on the scheduled due date of February 12, 2026, as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770892035827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Industries Chairman Bajranglal Taparia Passes Away",
            "Summary": "Supreme Industries Limited announces the sad demise of Chairman Shri Bajranglal Surajmal Taparia on January 30th, 2026, describing it as an irreparable loss to the company.",
            "Sentiment": "negative",
            "PublishDate": 1769839105599,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Industries Redeems ₹50 Crore Commercial Paper",
            "Summary": "Supreme Industries Limited successfully completed redemption of commercial paper worth ₹50 crore on scheduled due date of January 27, 2026, in compliance with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1769515315289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Industries Q3 Net Profit Drops 19.5% YoY",
            "Summary": "Supreme Industries reported consolidated net profit of ₹153.00 crores in Q3, marking a decline from ₹190.00 crores in the same quarter last year, representing a 19.5% year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1768980389771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Industries Wins ₹54 Cr BPCL LPG Cylinder Order",
            "Summary": "Supreme Industries receives Letter of Acceptance from BPCL for supply of 2 lakh composite LPG cylinders worth approximately ₹54 crores, with 6-month execution timeline and market performance update.",
            "Sentiment": "positive",
            "PublishDate": 1766574416846,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Industries Faces GST Search and Inspection at Multiple Locations",
            "Summary": "Maharashtra GST officials conducted search and inspection proceedings at Supreme Industries' registered office, corporate office, and Khopoli unit under the Maharashtra GST Act. The company is cooperating with officials and does not expect any material impact on operations, with regular business activities continuing unaffected.",
            "Sentiment": "neutral",
            "PublishDate": 1763618725065,
            "Source": "stock"
        },
        {
            "Title": "Supreme Industries Appoints Two Independent Directors Through Postal Ballot",
            "Summary": "Supreme Industries Limited has appointed Rajiv Jalota and Sriram Hariharan as Non-Executive Independent Directors for a five-year term from September 13, 2025, to September 12, 2030. The appointments were approved through a postal ballot process conducted via remote e-voting from October 13 to November 11, 2025. Both resolutions were passed with requisite majority, with voting results showing over 99% approval from shareholders. The e-voting process was facilitated by National Securities Depository Limited, and V. Laxman served as the scrutinizer for the voting process. The record date for eligible shareholders was October 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762975949093,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Industries CHRO Saurov Ghosh Resigns Due to Personal Reasons",
            "Summary": "Supreme Industries announced the resignation of Saurov Ghosh, Chief Human Resources Officer (CHRO), effective from the closure of business hours on October 23, 2025. Ghosh cited personal reasons for his departure from the senior management position. The company disclosed this information to stock exchanges NSE and BSE under SEBI listing regulations regarding changes in senior management personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1762480701285,
            "Source": "corporate_governance"
        },
        {
            "Title": "Supreme Industries Reports Mixed Q2FY26 Results with 8% Volume Growth Despite Margin Pressures",
            "Summary": "Supreme Industries achieved 8% volume growth in plastic goods sales to 338,224 MT during the first half, with net product turnover rising 2% to Rs. 4,951 crores. However, consolidated operating profit declined 15% to Rs. 656 crores and profit after tax dropped 24% to Rs. 367 crores compared to the previous year. The company completed acquisition of Wavin's plastic pipe business for three manufacturing units with 71,000 MT annual capacity, effective August 1, 2025. Plastic piping segment showed strong performance with 17% volume growth and 11% value growth in Q2. The company experienced inventory losses of Rs. 50-60 crores in the first half due to falling polymer prices. Management maintains volume growth guidance of 12-14% for the full year and expects EBITDA margins between 14.5-15%. The board declared an interim dividend of 550% (Rs. 11 per share). Supreme Industries anticipates better performance in the second half driven by agricultural demand recovery and expects protective packaging division to reach Rs. 1,000 crores revenue milestone.",
            "Sentiment": "neutral",
            "PublishDate": 1761912422289,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Block Trade Worth Rs. 29.89 Crores Executed on NSE",
            "Summary": "Supreme Industries Ltd. executed a block trade on the National Stock Exchange worth Rs. 29.89 crores. The transaction involved approximately 78,415 shares at a price of Rs. 3,812.10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761804712842,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Industries Limited Receives Clean Auditor Review for Q1 Financial Results",
            "Summary": "Lodha & Co. LLP has completed its review of Supreme Industries Limited's unaudited standalone financial results for the quarter ended June 30, 2025. The independent auditors found no material misstatements and confirmed the results comply with Indian Accounting Standards and SEBI listing regulations. The review was conducted under Standard on Review Engagement 2410 and provides moderate assurance on the financial statements. The auditors noted that figures for the three months ended March 31, 2025 are balancing figures derived from audited full-year results and previously reviewed quarterly data.",
            "Sentiment": "neutral",
            "PublishDate": 1761795480834,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Cuts FY26 Growth Guidance Amid Monsoon Disruption and Infrastructure Slowdown",
            "Summary": "Supreme Industries, India's largest plastic products manufacturer, reduced its FY26 volume growth guidance to 12-14% from 14-15% after first-half volumes grew only 8% to 1.5 lakh metric tonnes. The company's plastic piping business faced headwinds from prolonged monsoon disrupting construction activities and slower government infrastructure spending. Shares declined 9% over the past month and 4% since October 27 following quarterly results. Revenue rose 5% year-on-year to ₹2,394 crore in the second quarter, with plastic piping segment growing 11% to ₹1,602 crore. The company expects annual turnover between ₹11,000-11,500 crore and operating margin of 14.5-15%. Management anticipates demand revival in plumbing and agriculture segments during the second half. Supreme incurred ₹869 crore capital expenditure in the first half, including ₹250 crore for acquiring Orbia Wavin's plastic pipe business. Total production capacity is projected to reach 1.2 million tonnes by March 2026. IDBI Capital maintains a 'hold' rating with target price of ₹4,146, while the stock closed at ₹3,848.5.",
            "Sentiment": "negative",
            "PublishDate": 1761785879477,
            "Source": "stock"
        },
        {
            "Title": "Supreme Industries Block Trade Worth Rs. 107.93 Crores Executed on NSE",
            "Summary": "Supreme Industries executed a block trade on the National Stock Exchange involving 281,364 shares at a price of Rs. 3,835.90 per share. The total transaction value amounted to Rs. 107.93 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761634688499,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Industries Shares Drop 4% as Brokerages Cut Price Targets on Weak Quarterly Performance",
            "Summary": "Supreme Industries shares fell over 4% following disappointing September quarter earnings that missed expectations. CLSA maintained a 'Hold' rating but reduced its price target to ₹4,275, citing weak performance with 7% year-on-year EBITDA decline. Despite 12% volume growth aided by the Wavin acquisition, organic growth was 10%. Nuvama Institutional Equities cut its price target to ₹4,356 from ₹4,614, attributing weakness to prolonged monsoon, weak agricultural and infrastructure pipe sales, and operating deleverage. Supreme Industries lowered its overall volume growth guidance to 12-14% from 14-15% while retaining pipe growth guidance of 15-17%. The company expects demand recovery in the second half driven by agriculture and infrastructure segments, with guidance for 12-14% volume growth and 14.5-15.5% EBITDA margin for FY26. Nuvama reduced EPS estimates by 14% for FY26, 8% for FY27, and 7% for FY28. The company declared an interim dividend of ₹11 per share for FY26 with record date of November 3, 2025. Shares closed 3.5% lower at ₹3,861.10 and have declined 18% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761631020799,
            "Source": "stock"
        },
        {
            "Title": "Supreme Industries Block Trade Worth Rs. 56.80 Crores Executed on NSE",
            "Summary": "Supreme Industries executed a block trade on the National Stock Exchange involving approximately 147,937 shares at a price of Rs. 3,839.70 per share. The total transaction value amounted to Rs. 56.80 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761630766461,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Industries Lowers Volume Growth Forecast to 12-14%",
            "Summary": "Supreme Industries has revised its volume growth expectations downward to 12% to 14% for this year, reducing from its previous forecast of 14% to 15%. The company has downgraded its growth projections amid current market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1761552585305,
            "Source": "stock"
        },
        {
            "Title": "Supreme Industries Reports Q2 Results and Declares 550% Interim Dividend",
            "Summary": "Supreme Industries announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company declared an interim dividend of 550% (Rs. 11 per share) on equity shares with a face value of Rs. 2 each. The record date for dividend eligibility is set for November 3, 2025. During the period, the company acquired Wavin Industries' plastic pipe business including three manufacturing units with 71,000 MT per annum capacity for Rs. 302 crores, effective August 1, 2025. Supreme Industries also entered into a Master Technology License Agreement with Wavin B.V. Netherlands for exclusive access to plastic piping technologies for India and SAARC countries for 7 years. The consolidated revenue from operations for the quarter was Rs. 2,393.87 crores compared to Rs. 2,272.95 crores in the same quarter last year. For the half-year period, revenue reached Rs. 5,003.08 crores versus Rs. 4,909.30 crores in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761551949621,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Reports 21% Decline in Q2 Net Profit to 1.65 Billion Rupees",
            "Summary": "Supreme Industries reported a net profit of 1.65 billion rupees for Q2, down from 2.1 billion rupees in the same period last year. The company's EBITDA decreased to 2.97 billion rupees from 3.19 billion rupees year-over-year. EBITDA margin compressed to 12.42% compared to 14.03% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761551449580,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Schedules Board Meeting for Q2/H1 FY2025 Results and Interim Dividend Consideration",
            "Summary": "Supreme Industries Limited has scheduled a Board of Directors meeting on October 27, 2025, to consider unaudited financial results for the second quarter and half year ended September 30, 2025. The board will also consider declaring an interim dividend on equity shares. The company's trading window for equity shares will reopen 48 hours after the financial results are declared on October 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760525494934,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Industries Seeks Shareholder Approval for Two Independent Director Appointments via Postal Ballot",
            "Summary": "Supreme Industries has issued a postal ballot notice seeking shareholder approval for the appointment of two Independent Directors - Rajiv Jalota and Sriram Hariharan. Both directors were initially appointed as Additional Directors on September 13, 2025, and are proposed for five-year terms ending September 12, 2030. E-voting will be conducted from October 13, 2025, to November 11, 2025, with the cut-off date set as October 7, 2025. Rajiv Jalota is a former IAS officer with over 35 years of service experience in governance and infrastructure, while Sriram Hariharan brings nearly 30 years of financial services experience, having served as Chairman of ICICI Bank's Canada and UK subsidiaries. Both appointments require special resolution approval from shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1760092740861,
            "Source": "corporate_governance"
        },
        {
            "Title": "Supreme Industries Commissions New 20,000 TPA ABS Compounding Lines at Amdoshi Facility",
            "Summary": "Supreme Industries has commissioned new 20,000 TPA (tonnes per annum) ABS compounding lines at its Amdoshi facility. Production at the new facility commenced on September 25.",
            "Sentiment": "positive",
            "PublishDate": 1758812377575,
            "Source": "stock"
        },
        {
            "Title": "Supreme Industries Appoints Two New Independent Directors, Two Others Retire",
            "Summary": "Supreme Industries' Board approved the appointment of Rajiv Jalota and Sriram Hariharan as Non-Executive Independent Directors for 5 years effective September 13, 2025, subject to member approval through postal ballot. Jalota is an IAS officer with over 35 years of service who served as Chairman of Mumbai Port Authority and Additional Chief Secretary (Finance) in Maharashtra. Hariharan brings nearly 30 years of financial services experience, including leadership roles at ICICI Bank's international operations as President & CEO of ICICI Bank Canada. Simultaneously, two Independent Directors - Rajeev Mahendra Pandia and Ramanathan Kannan - retired on September 15, 2025, upon completion of their tenure. The Board acknowledged their valuable contributions during their service.",
            "Sentiment": "neutral",
            "PublishDate": 1757751387621,
            "Source": "corporate_governance"
        },
        {
            "Title": "DGTR Recommends 5-Year Anti-Dumping Duty on PVC Resin Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has recommended imposing anti-dumping duties on imports of PVC resin for a period of 5 years. This recommendation relates to Supreme Industries, which operates in the PVC and plastic products sector.",
            "Sentiment": "positive",
            "PublishDate": 1755847565577,
            "Source": "stock"
        },
        {
            "Title": "Supreme Industries Anticipates PVC Resin Price Increase Following Anti-Dumping Duty Implementation",
            "Summary": "Supreme Industries expects PVC resin prices in India to rise by ₹8-10 per kg once the Anti-Dumping Duty (ADD) is implemented. This price increase will affect the company's raw material costs for its PVC-based products.",
            "Sentiment": "neutral",
            "PublishDate": 1755597265906,
            "Source": "stock"
        },
        {
            "Title": "Supreme Industries Completes ₹250 Crore Acquisition of Wavin India's Pipes Business",
            "Summary": "Supreme Industries has completed a ₹250 crore acquisition of Wavin India's pipes and fittings business. The deal includes establishing a long-term technology partnership with Orbia. This acquisition expands Supreme Industries' presence in the pipes and fittings sector through the purchase of Wavin India's operations.",
            "Sentiment": "positive",
            "PublishDate": 1754028547650,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Industries Reports 6% Volume Growth But 26% Profit Decline in Q1, Raises FY26 Volume Guidance to 15-17%",
            "Summary": "Supreme Industries reported mixed quarterly results with plastic goods sales volume growing 6% to 183,793 tons, while net product turnover declined 1% to Rs. 2,579 crores. Consolidated profit after tax dropped 26% to Rs. 202 crores due to inventory losses from falling polymer prices and early monsoon impact on agricultural piping business. The company completed acquisition of Wavin Industries for Rs. 310 crores and entered technology licensing agreement with Wavin B.V. Netherlands. Management revised volume growth guidance upward to 15-17% for plastic piping division and 14-15% overall, citing improved demand outlook and Wavin integration. The company expects EBITDA margins of 14.5-15.5% for the full year and plans Rs. 1,350 crores capital expenditure to expand plastic piping capacity to 1 million tons by March 2026. Value-added products contributed Rs. 933 crores in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1753879584185,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Reports 26% Decline in Net Profit for Quarter Ended June 2025",
            "Summary": "Supreme Industries Ltd reported consolidated net profit after tax of Rs. 202.30 crores for the quarter ended June 30, 2025, down from Rs. 273.37 crores in the same quarter last year. Total income decreased marginally to Rs. 2,626.13 crores compared to Rs. 2,657.79 crores in the previous year quarter. Earnings per share fell to Rs. 15.93 from Rs. 21.52. The company has entered into Business Transfer Agreements with Wavin Industries Limited and its subsidiaries for an aggregate consideration of approximately Rs. 310 crores, expected to complete by July 31, 2025. Supreme Industries also signed a Master Technology License Agreement with Wavin B.V. Netherlands for exclusive access to plastic piping technologies in India and SAARC countries for 7 years, effective from August 1, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753510770539,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Signs Technology License Deal with Wavin Netherlands for Plastic Piping Access",
            "Summary": "Supreme Industries has entered into a technology license agreement with Wavin Netherlands. The deal grants Supreme Industries exclusive access to plastic piping technology in India and SAARC countries. This partnership expands Supreme Industries' technological capabilities in the plastic piping segment across the specified regional markets.",
            "Sentiment": "positive",
            "PublishDate": 1753414630732,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Industries Shares Audio Recording Link for Q1 FY26 Analyst Conference Call",
            "Summary": "Supreme Industries Ltd. has provided an audio recording link for a conference call held with analysts and investors on July 24, 2025, at 4:00 p.m. The call discussed the company's unaudited financial results for the first quarter ended June 30, 2025. The audio recording is available on the company's website and was shared with stock exchanges NSE and BSE for their records.",
            "Sentiment": "neutral",
            "PublishDate": 1753362695658,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Reports Decline in Q1 Financial Performance",
            "Summary": "Supreme Industries reported quarterly consolidated net profit of 2.02 billion rupees, down from 2.73 billion rupees in the same period last year. Revenue decreased slightly to 26.1 billion rupees compared to 26.36 billion rupees year-over-year. EBITDA fell to 3.2 billion rupees from 3.87 billion rupees, while EBITDA margin compressed to 12.22% from 14.68% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753342586320,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Acquires Wavin India's Pipe And Fittings Business For ₹310 Crores",
            "Summary": "Supreme Industries has agreed to purchase Wavin India's pipe and fittings business for ₹310 crores. This acquisition will expand Supreme Industries' presence in the pipe and fittings sector.",
            "Sentiment": "positive",
            "PublishDate": 1753011609257,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Industries: Stock Rebounds After 30% Drop, Shows Bullish Technical Patterns",
            "Summary": "Supreme Industries stock has shown a breakout from a rounding bottom formation on daily charts and from the upper band of a Broadening Falling Wedge pattern. Short-term traders may consider buying with a target of Rs 4,980-5,535 in the coming weeks.",
            "Sentiment": "positive",
            "PublishDate": 1750635000000,
            "Source": "normal_news"
        },
        {
            "Title": "Supreme Industries Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 130,180 shares of Supreme Industries Ltd. was executed on the National Stock Exchange (NSE) for Rs. 60.84 crores. The trade was carried out at a price of Rs. 4673.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750139399000,
            "Source": "block_details"
        },
        {
            "Title": "Supreme Industries Block Trade on NSE",
            "Summary": "A block trade of approximately 303,190 shares of Supreme Industries Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 4673.50 per share. The total value of the transaction was Rs. 141.70 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1750139132000,
            "Source": "block_details"
        },
        {
            "Title": "Supreme Industries: Mixed Q4 Results Lead to Target Price Cut",
            "Summary": "Dolat Capital reduces target price for Supreme Industries following mixed Q4 earnings. The plastic pipe business faced challenges in FY25 due to subdued government infrastructure spending, erratic rainfall, and PVC resin price volatility. Despite industry headwinds, Supreme Industries achieved 6% volume growth in its Plastic Pipe business, outperforming the overall industry's 6% decline.",
            "Sentiment": "neutral",
            "PublishDate": 1745541900000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries: Strong FY26 Guidance Despite Muted Q4",
            "Summary": "Supreme Industries projects 15% revenue growth for FY26, targeting ₹12,000 crore. Margins expected to expand to 14.5-15%. Q4 FY25 saw 17% YoY decline in net profit. Final dividend of ₹24 per share declared. Company plans to expand product portfolio and launch PP Silent pipe system in June.",
            "Sentiment": "positive",
            "PublishDate": 1745483880000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Forecasts 9-10% Volume Growth for FY26",
            "Summary": "Supreme Industries has projected a volume growth of 9-10% for the fiscal year 2026. The company also noted that PVC prices have reached their lowest point, suggesting potential stability or increase in the future.",
            "Sentiment": "positive",
            "PublishDate": 1745482754000,
            "Source": "default"
        },
        {
            "Title": "Supreme Industries Reports Strong Growth in Plastic Piping System Business",
            "Summary": "Supreme Industries has achieved its FY25 margin target near the upper end of its guidance. The company's total installed capacities for its plastic piping system business grew by 16% and is projected to grow by another 16% in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1745481941000,
            "Source": "default"
        },
        {
            "Title": "Supreme Industries Plans Major Capital Expenditure",
            "Summary": "Supreme Industries has announced plans to commit a capital expenditure of approximately Rs. 1100 crores. This investment includes carry forward commitments and the acquisition of the Building & Infrastructure Business of Wavin in India.",
            "Sentiment": "positive",
            "PublishDate": 1745481729000,
            "Source": "default"
        },
        {
            "Title": "Supreme Industries Q4 Results and Dividend Announcement",
            "Summary": "Supreme Industries reported Q4 EBITDA of 4.15B rupees, down from 4.91B YoY. EBITDA margin decreased to 13.73% from 16.33% YoY. The company announced a dividend of 24 rupees per share. Q4 consolidated net profit was 2.94B rupees, down from 3.5B YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1745481365000,
            "Source": "result"
        },
        {
            "Title": "Supreme Industries to Consider Q4 Results on April 24",
            "Summary": "Supreme Industries has announced that it will consider its fourth quarter financial results on April 24. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744720411000,
            "Source": "default"
        },
        {
            "Title": "Supreme Industries to Acquire Wavin Industries' Indian Piping Business for $30 Million",
            "Summary": "Supreme Industries has signed a Memorandum of Understanding (MOU) with Wavin Industries Limited to acquire its Indian piping business. The acquisition is valued at USD 30 million, which is equivalent to 262 crore Indian Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1741663813000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Industries: Downgrade and Lowered Growth Expectations Impact Stock",
            "Summary": "Supreme Industries shares fell 4% after Prabhudas Lilladher downgraded the stock to 'accumulate' and cut its price target. The company expects single-digit growth for its P&F business, down from earlier 15-16% guidance. Q4 EBITDA margins likely to remain similar to Q3 due to PVC pricing pressures. Full-year expectations include double-digit agriculture volume growth, flat plumbing growth, and declining infrastructure volumes.",
            "Sentiment": "negative",
            "PublishDate": 1741082064000,
            "Source": "normal_news"
        },
        {
            "Title": "Supreme Industries: Q3 Profit Drops 27% Amid Modest Revenue Growth",
            "Summary": "Supreme Industries reported Q3 FY25 results with profit falling 27.01% YoY to ₹186.97 crore, while revenue increased 2.48% to ₹2509.88 crore. Operating income decreased by 27.87% YoY. EPS stood at ₹14.72, down 27.02% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737437849000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Revises FY25 Volume Growth Forecast",
            "Summary": "Supreme Industries has adjusted its volume growth forecast for the fiscal year 2025. The company now expects to achieve a 12% volume growth, down from its earlier guidance of 14%. This revised projection was reported by CNBC TV18.",
            "Sentiment": "neutral",
            "PublishDate": 1737361527000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Industries Lowers Growth Guidance",
            "Summary": "Supreme Industries has reduced its growth guidance from 14% to 12%, as reported by CNBC TV18. This adjustment in the company's projected growth rate suggests a slight moderation in their expectations for the near future.",
            "Sentiment": "negative",
            "PublishDate": 1737361460000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Supreme Industries has reported a decrease in its Q3 EBITDA, which fell to 3.08 billion rupees from 3.79 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 12.27% from 15.47% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737359109000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Reports Q3 Revenue Growth",
            "Summary": "Supreme Industries has announced its financial results for the third quarter, reporting revenue of 25.1 billion rupees. This represents a year-over-year increase from the previous year's Q3 revenue of 24.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737359108000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Supreme Industries, a leading Indian manufacturing company, has reported a consolidated net profit of 1.9 billion rupees for the third quarter, down from 2.56 billion rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1737358992000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Industries Ltd: Block Trade of Rs. 26.31 Crores on NSE",
            "Summary": "A significant block trade occurred for Supreme Industries Ltd on the National Stock Exchange (NSE). The transaction involved approximately 53,429 shares, valued at Rs. 26.31 Crores. The shares were traded at a price of Rs. 4,924.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1733908100000,
            "Source": "block_deals"
        }
    ]
}