{
    "Symbol": "SUPRAJIT",
    "ISIN": "INE399C01030",
    "News": [
        {
            "Title": "Suprajit Engineering Q3FY26 Results & Dividend",
            "Summary": "Suprajit Engineering reported Q3FY26 standalone revenue of ₹4,940.61 million with net profit of ₹710.26 million. Board declared interim dividend of ₹1.50 per share with record date February 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770645585232,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suprajit Engineering Q3FY26 Results Call on Feb 10",
            "Summary": "Suprajit Engineering Limited announces investor conference call scheduled for February 10, 2026 at 11:00 AM IST to discuss Q3FY26 financial results, hosted by Anand Rathi Research.",
            "Sentiment": "neutral",
            "PublishDate": 1769164297552,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suprajit Engineering Trust Acquires Additional Shares",
            "Summary": "Supriyajith Family Trust acquired 18,963 equity shares of Suprajit Engineering through open market purchase, increasing promoter group holding to 38.54% from 38.52%.",
            "Sentiment": "neutral",
            "PublishDate": 1766054006803,
            "Source": "stocks"
        },
        {
            "Title": "Suprajit Engineering Invests 1 Million Euros in Blubrake Through Investment Agreement",
            "Summary": "Suprajit Engineering has entered into an investment agreement with Blubrake, committing 1 million euros to the company. This strategic investment establishes a financial partnership between Suprajit Engineering and Blubrake.",
            "Sentiment": "positive",
            "PublishDate": 1763507301749,
            "Source": "order&deals"
        },
        {
            "Title": "Suprajit Engineering Reports 6.4% Revenue Growth in Q2 FY26 Despite Global Challenges",
            "Summary": "Suprajit Engineering achieved consolidated revenue of INR 1,605 crores for H1 FY26, up 6.4% year-on-year, with strong performance from its Controls Division posting 50% EBITDA growth and 11.6% margins. The company is progressing with SCS integration restructuring expected to complete by December 2025, while facing headwinds in Phoenix Lamps division due to reduced Middle East exports.",
            "Sentiment": "positive",
            "PublishDate": 1763445244624,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Targets EBITDA Breakeven for SCS by Q4, Maintains 14% Margin Guidance",
            "Summary": "Suprajit Engineering expects its SCS division to reach EBITDA breakeven by the fourth quarter of this fiscal year. The company anticipates stronger performance in the second half compared to the first half. Management has set EBITDA margin guidance at 12-14% and is currently operating at the upper limit of 14%. The company plans to grow 5-10% above the global automotive industry growth rate, which is expected to be in low single digits of 1-3%.",
            "Sentiment": "positive",
            "PublishDate": 1762918725381,
            "Source": "stock"
        },
        {
            "Title": "Suprajit Engineering Reports 6.4% Revenue Growth and 17% EBITDA Growth in H1 FY26",
            "Summary": "Suprajit Engineering Limited reported consolidated revenue growth of 6.4% and EBITDA growth of 17% for the half-year ended September 30, 2025, excluding recently acquired SCS assets. The Indian automotive industry grew 5.8% in the first half, with passenger vehicle and 2-wheeler segments growing 3.8% and 5.8% respectively. The company's performance was ahead of industry growth despite challenging global business environment due to geopolitical conflicts, US tariff issues, and shipping constraints. For the quarter, consolidated revenue grew 7.6% to ₹8,320 million with EBITDA growing 18.7%. The Suprajit Controls Division showed strong performance with 50% EBITDA growth, while the Domestic Cable Division achieved 10.2% revenue growth. Phoenix Lamps Division faced challenges with 5.1% revenue decline due to reduced Middle East exports. The company completed acquisition of Stahlschmidt Cable Systems assets and expects positive EBITDA turnaround by the last quarter. Management expects better second-half performance due to anticipated US trade agreements, improved Indian automotive market conditions, and ongoing restructuring benefits.",
            "Sentiment": "positive",
            "PublishDate": 1762772540264,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Reports Strong Q2 Performance with EBITDA Rising 58% Year-on-Year",
            "Summary": "Suprajit Engineering delivered robust quarterly results with EBITDA increasing to 994 million rupees from 630 million rupees year-on-year. The company's EBITDA margin improved to 10.6% compared to 7.56% in the same period last year. Revenue grew to 9.4 billion rupees from 8.3 billion rupees year-on-year. Consolidated net profit surged significantly to 509 million rupees from 4.8 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762763315726,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Anticipates Minimum $500K Impact from US Tariffs",
            "Summary": "Suprajit Engineering expects a minimum financial impact of $500,000 from US tariffs. The company has assessed the potential effects of these trade measures on its operations.",
            "Sentiment": "negative",
            "PublishDate": 1756356813485,
            "Source": "stock"
        },
        {
            "Title": "Suprajit Engineering Reports 5.2% Revenue Growth and Margin Expansion in Q1 Results",
            "Summary": "Suprajit Engineering Limited reported consolidated revenue of INR 7,733 million, up 5.2% year-over-year, with EBITDA growing 15% to INR 993 million and margins improving by 100 basis points to 12.8%. The Suprajit Controls Division delivered strong performance with EBITDA margins improving from 8% to 12%, while the Domestic Cable Division outpaced industry growth. However, Phoenix Lamps faced softness due to Middle East conflicts impacting exports, and the Electronics Division saw revenue decline due to struggles at a major EV customer. The company completed the second tranche of its Stahlschmidt Cables acquisition and expects it to turn EBITDA positive by Q4 FY26. Management is progressing on restructuring initiatives across global operations and advancing its 'Beyond Cables' strategy focusing on brake systems, electronics, and actuation systems. The company targets double-digit growth for its Controls division and has planned capex of INR 150-160 crores over FY26 and FY27.",
            "Sentiment": "positive",
            "PublishDate": 1755578022378,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Targets 5-10% Business Growth Above Global Industry Rate",
            "Summary": "Suprajit Engineering has set a target to grow its consolidated business by 5-10%, aiming to exceed global industry growth rates. The company plans to maintain strong double-digit profit margins while pursuing this expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754880138661,
            "Source": "stock"
        },
        {
            "Title": "Suprajit Engineering Reports Mixed Q1 Results with Revenue Growth and Margin Decline",
            "Summary": "Suprajit Engineering reported Q1 consolidated net profit of 481 million rupees, up from 381 million rupees year-over-year. Revenue increased to 8.63 billion rupees from 7.3 billion rupees in the same period last year. However, EBITDA declined to 818 million rupees from 863 million rupees year-over-year, while EBITDA margin compressed to 9.48% from 11.75% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754832760862,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Reports 17.4% Revenue Growth with Improved Margins in Q1 Results",
            "Summary": "Suprajit Engineering Limited reported consolidated revenue of Rs. 862.92 crores, marking a 17.4% year-over-year growth. Profit after tax increased 26.1% to Rs. 48.09 crores, while EBITDA margin improved to 14.0% from 13.1% in the previous year. The company completed its acquisition of Stahlschmidt Cable Systems business in two stages, with the final stage concluded in May 2025 for Rs. 30.4 crores. Employee benefits expense rose significantly by 31.6% to Rs. 216.07 crores, and other expenses increased 22.6% to Rs. 89.10 crores. The company has expanded its global footprint through new subsidiaries in Germany, Canada, Morocco, Poland, China and India. Suprajit also adopted hedge accounting for certain forecast sales transactions starting April 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754729431024,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Plans Facility Relocation and Operational Changes",
            "Summary": "Suprajit Engineering announces two major operational changes: 1) Plans to move to a 30,000 sq.ft. facility in Mississauga by September 2025. 2) Relocates operations to Matamoros and Wichita, expecting annual savings of $750,000 or ₹6.2 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752645095000,
            "Source": "default"
        },
        {
            "Title": "Suprajit Engineering: Targets 12-14% EBITDA Margin for FY24-25",
            "Summary": "Suprajit Engineering aims for 12-14% EBITDA margin in FY24 and FY25. The company is expanding its product portfolio, focusing on electronics, braking, and actuation divisions. It expects SCS entities to be EBITDA positive by Q4. The company's global positioning and recent acquisitions are seen as key advantages.",
            "Sentiment": "positive",
            "PublishDate": 1752628761000,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering: Global Leader in Automotive Cables and Halogen Bulbs",
            "Summary": "Suprajit Engineering claims to be India's largest manufacturer of automotive cables and halogen bulbs, with a global annual capacity of 400 million cables and 110 million halogen bulbs. The company asserts it might be the world's largest manufacturer of control cables by volume, producing over 300 million annually.",
            "Sentiment": "neutral",
            "PublishDate": 1750873597000,
            "Source": "normal_news"
        },
        {
            "Title": "Suprajit Engineering Anticipates New Production for ICE and EV OEMs",
            "Summary": "According to an investor presentation, Suprajit Engineering expects to start new production for several Internal Combustion Engine (ICE) and Electric Vehicle (EV) Original Equipment Manufacturers (OEMs) in FY26. The company did not provide specific details about the OEMs or the scale of production.",
            "Sentiment": "positive",
            "PublishDate": 1750864332000,
            "Source": "default"
        },
        {
            "Title": "Suprajit Engineering Provides Growth Outlook for Divisions",
            "Summary": "Suprajit Engineering expects double-digit growth for its Domestic Cable Division and Controls Division this year. The Phoenix Lamps division is anticipated to grow in single digits. The Electronics Division is projected to have double-digit growth, albeit from a small base. The company expects overall improvement from Q2 onwards, with the Controls Division showing margin improvements starting Q1. Suprajit Engineering forecasts a robust year with good double-digit growth and potentially better margins than last year. The company aims to turn EBITDA positive on the SCS package by the last quarter. Excluding SCS, double-digit revenue growth is expected in the coming year, with an EBITDA margin between 12% to 14%.",
            "Sentiment": "positive",
            "PublishDate": 1748575223000,
            "Source": "default"
        },
        {
            "Title": "Suprajit Engineering Reports Q4 Results and Declares Dividend",
            "Summary": "Suprajit Engineering has announced its Q4 financial results. The company reported revenue of 8.8 billion rupees, up from 7.83 billion rupees in the same quarter last year. However, EBITDA decreased to 641 million rupees from 801 million rupees year-over-year, with the EBITDA margin dropping to 7.30% from 10.23%. Consolidated net profit for Q4 fell to 272 million rupees from 592 million rupees in the previous year. Additionally, the company has declared a dividend of 1.75 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748420075000,
            "Source": "result"
        },
        {
            "Title": "Suprajit Engineering to Consider Q4 Results on May 28",
            "Summary": "Suprajit Engineering has announced that it will consider its fourth quarter (Q4) financial results on May 28. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746704633000,
            "Source": "default"
        },
        {
            "Title": "Suprajit Engineering Enters Licensing Agreement with Blubrake for Advanced ABS Technology",
            "Summary": "Suprajit Engineering has announced a licensing and technology transfer agreement with Blubrake for their next-generation Anti-Lock Braking System (ABS). This partnership aims to enhance Suprajit's capabilities in providing advanced braking solutions.",
            "Sentiment": "positive",
            "PublishDate": 1743996007000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suprajit Engineering Reports Q3 EBITDA Growth",
            "Summary": "Suprajit Engineering has reported its Q3 financial results. The company's EBITDA increased to 971 million rupees, up from 873 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 11.68% from 12.05% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739350065000,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Reports Decrease in Q3 Consolidated Net Profit",
            "Summary": "Suprajit Engineering, an Indian automotive components manufacturer, has reported a consolidated net profit of 334 million rupees for the third quarter, compared to 402 million rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1739349969000,
            "Source": "earnings"
        },
        {
            "Title": "Suprajit Engineering Incorporates New Subsidiary for Automotive Cable Manufacturing",
            "Summary": "Suprajit Engineering has announced the incorporation of a new subsidiary named 'Suprajit Chuhatsu Control Systems Private Limited' on December 27. This newly formed company will focus on manufacturing and trading control cables, transmission cables, and associated mechanisms for the automotive industry, serving both domestic and export markets in India.",
            "Sentiment": "positive",
            "PublishDate": 1735518030000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suprajit Engineering Incorporates New Subsidiary for Automotive Cable Manufacturing",
            "Summary": "Suprajit Engineering has announced the incorporation of a new subsidiary named 'Suprajit Chuhatsu Control Systems Private Limited' on December 27. This newly formed company will focus on manufacturing and trading control cables, transmission cables, and associated mechanisms for the automotive industry, catering to both domestic and export markets in India.",
            "Sentiment": "positive",
            "PublishDate": 1735449414000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suprajit Engineering Invests in Solar Power Companies",
            "Summary": "Suprajit Engineering and its subsidiary have entered into agreements to invest in Blupine and Solarcraft 26, acquiring a 26% equity stake in each. The investment aims to secure captive solar power supply for the company's operations in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1734574222000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suprajit Engineering: Joint Venture with Chuo Spring to Manufacture Transmission Cables in India",
            "Summary": "Suprajit Engineering has signed an MoU with Japan's Chuo Spring to form a 50:50 joint venture in India for designing, manufacturing, and supplying transmission cables. The venture is expected to be operational within 12 months, targeting Japanese OEMs in India initially, with potential for global expansion.",
            "Sentiment": "positive",
            "PublishDate": 1733110670000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suprajit Engineering Signs MOU with Chuo Spring for Japanese Transmission Cable Technology",
            "Summary": "Suprajit Engineering has announced the signing of a Memorandum of Understanding (MOU) with Chuo Spring Company Limited, a Japanese firm. This agreement grants their joint venture access to Chuo's unique Japanese transmission cable technology, potentially enhancing Suprajit's product offerings and technological capabilities in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1732684664000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suprajit Engineering Reports Q2 Financial Results",
            "Summary": "Suprajit Engineering has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 630 million rupees, compared to 698 million rupees in the same quarter last year, showing a year-over-year decrease. The EBITDA margin has also declined from 9.85% in the previous year to 7.56% in the current quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731338901000,
            "Source": "result"
        },
        {
            "Title": "Suprajit Engineering Reports Significant Drop in Q2 Net Profit",
            "Summary": "Suprajit Engineering has announced its Q2 financial results. The company's consolidated net profit fell to 4.8 million rupees, down from 347 million rupees year-over-year and 381 million rupees quarter-over-quarter. However, revenue increased to 8.3 billion rupees from 7.1 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731338847000,
            "Source": "result"
        },
        {
            "Title": "Suprajit Engineering Expands Operations to China",
            "Summary": "Suprajit Engineering's subsidiary, Suprajit USA Inc, has established a new unit named Suprajit (Jiaxing) Automotive Systems in China. This move is aimed at meeting the company's operational requirements in the region.",
            "Sentiment": "positive",
            "PublishDate": 1729131109000,
            "Source": "corporate_action"
        }
    ]
}