{
    "Symbol": "SUPRIYA",
    "ISIN": "INE07RO01027",
    "News": [
        {
            "Title": "Supriya Lifescience Q3 FY26 Results Show Growth",
            "Summary": "Supriya Lifescience reports 11% YoY revenue growth to INR 2,064 Mn in Q3 FY26, with EBITDA up 9% to INR 720.8 Mn and PAT rising 6% to INR 496.8 Mn despite margin compression.",
            "Sentiment": "positive",
            "PublishDate": 1770648138906,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supriya Lifescience Reports 20% Revenue Growth in Q2 FY26, Back on Track After Q1 Disruption",
            "Summary": "Supriya Lifescience achieved INR 200 crores revenue in Q2 FY26, marking 20% year-on-year and 38% sequential growth, with EBITDA at INR 73 crores and 36% margin. The company maintains its 20% annual revenue growth guidance and INR 1,000 crore revenue target by FY27, supported by new product launches, backward integration at 79%, and upcoming Ambernath facility commercialization from Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763443553657,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience Reports Quarterly Financial Results for September 2025",
            "Summary": "Supriya Lifescience Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported total revenue from operations of ₹2,794.40 million for the quarter, compared to ₹2,463.50 million in the previous quarter. Net profit for the quarter was ₹504.27 million, up from ₹461.49 million in the prior quarter. For the half year period, total revenue reached ₹5,257.90 million with net profit of ₹965.76 million. The company's cash and cash equivalents stood at ₹992.68 million as of September 30, 2025. The Board of Directors approved these results during their meeting held on November 12, 2025. The results were reviewed by the Audit Committee and received a clean review report from the statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1762984715426,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience Reports Strong Q2 Growth with Revenue Up 20% Year-on-Year",
            "Summary": "Supriya Lifescience delivered robust quarterly performance with revenue rising to 1.99 billion rupees from 1.66 billion rupees year-on-year. Net profit increased to 504 million rupees compared to 462 million rupees in the same period last year. EBITDA grew to 726 million rupees from 647 million rupees year-on-year, though EBITDA margin compressed to 36.34% from 39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762948351995,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience Receives WHO GMP Certificate for Ambernath Facility",
            "Summary": "Supriya Lifescience has received a Good Manufacturing Practices (GMP) certificate from the World Health Organization for its Ambernath facility. This certification enables the company to conduct global production and distribution operations from this facility.",
            "Sentiment": "positive",
            "PublishDate": 1759303241857,
            "Source": "stock"
        },
        {
            "Title": "Supriya Lifescience Targets 33-35% EBITDA Margins in FY26 with US Market Expansion",
            "Summary": "Supriya Lifescience aims to achieve EBITDA margins of 33-35% in FY26 with 20% year-on-year revenue growth, targeting Rs 1,000 crore by FY27. Executive Chairman Satish Waman Wagh outlined a strategy involving launching 3-4 new products annually, expanding into the US market, and challenging Chinese competitors. The company launched a new anaesthetic product targeting a $300 million market and is in discussions with multinational corporations for a product with $7 billion market potential. Capital expenditure is planned at Rs 65-70 crore for the current year, with Rs 200 crore allocated over three years for the new Patalganga site in Maharashtra. The company focuses on regulated markets with USFDA-compliant manufacturing and backwards integration to maintain cost efficiencies against Chinese competition.",
            "Sentiment": "positive",
            "PublishDate": 1756704961796,
            "Source": "stock"
        },
        {
            "Title": "Supriya Lifescience Makes Q1 Earnings Call Transcript Available Online",
            "Summary": "Supriya Lifescience Limited has published the transcript of its earnings call held on August 14, 2025, discussing unaudited financial results for the quarter ended June 30, 2025. The transcript is accessible on the company's website. The pharmaceutical company is listed on both NSE (Symbol: SUPRIYA) and BSE (Scrip Code: 543434), operates from Mumbai with manufacturing facilities in Maharashtra, and holds government-recognized export house status.",
            "Sentiment": "neutral",
            "PublishDate": 1755599134274,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience Plans Growth Through API Exports and Capacity Expansion",
            "Summary": "Supriya Lifescience is positioning itself to capitalize on API export demand through capacity expansion and backward integration strategies. The company is leveraging regulatory approvals and entering the CRAMS (Contract Research and Manufacturing Services) segment to diversify its revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1755102944802,
            "Source": "stock"
        },
        {
            "Title": "Supriya Lifescience Reports Decline in Q1 Financial Performance",
            "Summary": "Supriya Lifescience reported quarterly net profit of 348 million rupees, down from 446 million rupees in the same period last year. Revenue decreased to 1.45 billion rupees from 1.6 billion rupees year-over-year. EBITDA fell to 517 million rupees compared to 626 million rupees previously, while EBITDA margin compressed to 35.63% from 39% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755089156278,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience Receives Tax Demand Notice of 603.8 Million Rupees",
            "Summary": "Supriya Lifescience has received a notice from the Tax Department demanding a total of 603.8 million rupees. The news briefly mentions the company name and the amount of the tax demand without providing further details about the nature of the tax or the time period it covers.",
            "Sentiment": "negative",
            "PublishDate": 1751369762000,
            "Source": "default"
        },
        {
            "Title": "Supriya Lifescience Outlines Growth Plans and Financial Targets",
            "Summary": "Supriya Lifescience provided updates on its business outlook during a conference call. The company stated that its formulation facility has the potential to generate Rs. 450-500 crore in revenue, with capitalization expected by Q2 or early Q3. The company reaffirmed its guidance of 20% annual revenue growth and expects EBITDA margins to remain between 33% to 35%. Supriya Lifescience has set a mid-term goal to reach Rs. 1,000 crore in revenue by financial year 2027. The company anticipates better volume growth in the next two years, driven by full capacity utilization of Module E by FY27 and the launch of new products with large global volume potential.",
            "Sentiment": "positive",
            "PublishDate": 1748489154000,
            "Source": "default"
        },
        {
            "Title": "Supriya Lifescience Reports Q4 Results and Dividend Announcement",
            "Summary": "Supriya Lifescience has announced its Q4 financial results. The company's EBITDA increased to 676 million rupees from 555 million rupees year-over-year, with an EBITDA margin of 36.72% compared to 35.09% in the previous year. Net profit rose to 504 million rupees from 369 million rupees year-over-year and 468 million rupees quarter-on-quarter. Revenue for Q4 was 1.84 billion rupees, up from 1.58 billion rupees in the same period last year. Additionally, the company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748350286000,
            "Source": "result"
        },
        {
            "Title": "Supriya Lifescience Reports Strong Q3 Financial Results",
            "Summary": "Supriya Lifescience has announced its financial results for the third quarter. The company's net profit increased to 468 million rupees, up from 298 million rupees in the same period last year. Revenue also saw growth, reaching 1.86 billion rupees compared to 1.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737936843000,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience Reports Strong Q3 EBITDA Growth",
            "Summary": "Supriya Lifescience has reported a significant increase in its Q3 EBITDA, rising to 660 million rupees from 415 million rupees year-over-year. The company's EBITDA margin also improved, reaching 35.56% compared to 29.62% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737723439000,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience Reports Strong Q3 Financial Results",
            "Summary": "Supriya Lifescience has announced its financial results for the third quarter. The company's net profit increased to 468 million rupees, up from 298 million rupees in the same period last year. Revenue also saw significant growth, reaching 1.86 billion rupees compared to 1.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737723433000,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifescience: Confident of Exceeding FY25 Margin Guidance",
            "Summary": "Supriya Lifescience expects to surpass its FY25 margin guidance of 28-32%, projecting margins around 34%. The company aims to exceed Rs 1,000-crore revenue target for FY27, driven by expansion into regulated markets and business scale-up. CMO and CDMO segments are expected to contribute 20% of total revenue by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1734696370000,
            "Source": "earnings"
        },
        {
            "Title": "Supriya Lifesciences Expands Lote Parshuram Facility Capacity",
            "Summary": "Supriya Lifesciences has announced a significant expansion of its Lote Parshuram facility. The company reports that this expansion has increased the facility's capacity by over 55%, from 597 KLPD (Kilo Liters Per Day) to 932 KLPD.",
            "Sentiment": "positive",
            "PublishDate": 1734429491000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supriya Lifescience Invests ₹125 Crore in Development Project",
            "Summary": "Supriya Lifescience has announced a significant investment of approximately ₹125 crore for a development project. The details of the specific development were not provided in the given news snippet, but this represents a substantial financial commitment from the company.",
            "Sentiment": "positive",
            "PublishDate": 1734429457000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supriya Lifescience Inaugurates New Production Block in Maharashtra",
            "Summary": "Supriya Lifescience has inaugurated a new state-of-the-art production block called Module E at their facility in Lote Parshuram, Maharashtra. This expansion is likely aimed at increasing the company's manufacturing capabilities and production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1734429426000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supriya Lifescience: Brazil Approves Mental Illness Drug, Files Atorvastatin Patent",
            "Summary": "Supriya Lifescience received approval from Brazil's health authority for Esketamine Hydrochloride, a mental illness drug. The company also filed a patent application for an improved, cost-effective method of atorvastatin synthesis.",
            "Sentiment": "positive",
            "PublishDate": 1733743677000,
            "Source": "normal_news"
        },
        {
            "Title": "Supriya Lifescience Receives Regulatory Approval in Brazil",
            "Summary": "Supriya Lifescience has become the first company to receive regulatory permission in Brazil for a highly specialized pharmaceutical product. This achievement marks a significant milestone for the company in expanding its presence in the Brazilian pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1733735861000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supriya Lifescience Expands Global Presence with Drug Approval and Patent Filing",
            "Summary": "Supriya Lifescience has expanded its global footprint through two significant developments. The company has received approval for Esketamine Hydrochloride, a drug used in anesthesia and depression treatment. Additionally, Supriya Lifescience has filed a patent for Atorvastatin, a widely prescribed cholesterol-lowering medication. These actions demonstrate the company's efforts to broaden its product portfolio and strengthen its position in the international pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1733735740000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supriya Lifescience Reports Strong Q2 EBITDA Growth",
            "Summary": "Supriya Lifescience has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased from 318 million rupees to 647 million rupees. Additionally, the EBITDA margin expanded from 22.70% to 38.95%.",
            "Sentiment": "positive",
            "PublishDate": 1730103416000,
            "Source": "result"
        },
        {
            "Title": "Supriya Lifescience Reports Q2 Revenue Growth",
            "Summary": "Supriya Lifescience, a pharmaceutical company, has announced its second quarter revenue for the current fiscal year. The company reported revenue of 1.66 billion rupees, compared to 1.4 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730103370000,
            "Source": "result"
        },
        {
            "Title": "Supriya Lifescience Reports Significant Profit Increase in Q2",
            "Summary": "Supriya Lifescience has reported a net profit of 462 million rupees for the second quarter, compared to 239 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730103349000,
            "Source": "result"
        }
    ]
}