{
    "Symbol": "SUPREMEPWR",
    "ISIN": "INE0QHG01026",
    "News": [
        {
            "Title": "3 Microcap Stocks Secure Major Orders Worth ₹18 Cr",
            "Summary": "Supreme Power Equipment, United Drilling Tools, and Shipwaves Online bag significant domestic and international orders across power, energy, and SaaS sectors, showcasing strong growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768840064526,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Power Equipment Wins ₹257 Crore Order",
            "Summary": "Supreme Power Equipment Limited has secured a significant order worth ₹257 crores, marking a major business development for the electrical equipment manufacturer in the capital goods sector.",
            "Sentiment": "positive",
            "PublishDate": 1767613997240,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Power Equipment Secures ₹4.86 Crore Order",
            "Summary": "Supreme Power Equipment has secured an order valued at ₹4.86 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761721978134,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Power Equipment Wins ₹19.82 Crore Transformer Order in Telangana",
            "Summary": "Supreme Power Equipment has secured an order worth ₹19.82 crore for supplying three 20MVA power transformers in Telangana. The project is scheduled to be completed within six months.",
            "Sentiment": "positive",
            "PublishDate": 1758526165243,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Power Equipment Secures Order Worth ₹61 Crore",
            "Summary": "Supreme Power Equipment has received an order valued at ₹61 crore. The company's market capitalization is reported to be ₹360 crore. The news appears to be related to a small and medium enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1748324038000,
            "Source": "default"
        },
        {
            "Title": "Supreme Power Equipment Secures 213 Million Rupees Order",
            "Summary": "Supreme Power Equipment has announced that it has secured a new order worth 213 million rupees. This order represents a significant business development for the company, potentially boosting its revenue and market position in the power equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1737505306000,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Power Equipment Secures 213 Million Rupee Order",
            "Summary": "Supreme Power Equipment has announced that it has secured an order worth 213 million rupees. This significant order is likely to boost the company's revenue and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1737455784000,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Power Equipment Secures 21.30 Crore Rupee Order",
            "Summary": "Supreme Power Equipment, a company with a market capitalization of 535 crore rupees, has won an order worth 21.30 crore rupees. This development is significant for the small and medium enterprise (SME) sector company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1737357729000,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Power Equipment: Secures Rs 3.6 Crore Order from TRANTRANSCO",
            "Summary": "Supreme Power Equipment has received a new order worth Rs 3.63 crore from TRANTRANSCO for manufacturing, supply, and erection of power transformers. The order is to be executed within three months.",
            "Sentiment": "positive",
            "PublishDate": 1735789174000,
            "Source": "order&deals"
        }
    ]
}