{
    "Symbol": "SUPREMEINF",
    "ISIN": "INE550H01011",
    "News": [
        {
            "Title": "Supreme Infrastructure Gets Listing Approval",
            "Summary": "Supreme Infrastructure India Limited receives in-principle approval from BSE and NSE for listing 71,037,388 equity shares of Rs. 10 each issued on preferential basis at premium of Rs. 76.94.",
            "Sentiment": "positive",
            "PublishDate": 1770363992040,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Infrastructure Board Meet on Feb 13, 2026",
            "Summary": "Supreme Infrastructure India Limited schedules board meeting for February 13, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770203008580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Infrastructure Open Offer at ₹97.60/Share",
            "Summary": "Supreme Infrastructure India Limited faces mandatory open offer for 66.81 lakh equity shares at ₹97.60 per share by Vikram Sharma and associates, triggered by preferential allotment under SEBI SAST regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765954601213,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Infrastructure Allots ₹25 Cr Debentures",
            "Summary": "Supreme Infrastructure India Limited's board approved allotment of 250 secured non-convertible debentures worth ₹25 crores to InRe Fund II on private placement basis with 20% annual interest rate.",
            "Sentiment": "positive",
            "PublishDate": 1765541668639,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Infrastructure Wins ₹71.30 Cr Contract",
            "Summary": "Supreme Infrastructure secures major excavation and shore piling contract for One Forest Avenue project in Powai from Brookfield-backed BSS Property Ventures and Rajeshwar Property Ventures.",
            "Sentiment": "positive",
            "PublishDate": 1765431986778,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Infrastructure India Secures INR 71.31 Crore Contract for Excavation and Shore Piling Works in Powai",
            "Summary": "Supreme Infrastructure India Limited has been awarded a INR 71.31 crore contract by BSS Property Ventures Private Limited and Rajeshwar Property Ventures Private Limited for major excavation and shore piling works at One Forest Avenue, Powai. The 12-month project involves excavation of 4,50,000 cubic meters of soil and rock plus 300mm diameter shore piling work, representing the first phase of a larger development.",
            "Sentiment": "positive",
            "PublishDate": 1765345647591,
            "Source": "stock"
        },
        {
            "Title": "Supreme Infrastructure Reports ₹6,306 Crore Profit After Debt Settlement, Appoints New Director",
            "Summary": "Supreme Infrastructure India Limited posted a profit of ₹6,306 crore for the quarter ended September 30, 2025, driven by exceptional gains of ₹6,466 crore from debt settlement under its approved scheme of arrangement. The company appointed Mr. Chander Parkash Sharma as Additional Non-Executive Director and approved issuance of ₹45 crore Non-Convertible Debentures on private placement basis.",
            "Sentiment": "positive",
            "PublishDate": 1764410714730,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Infrastructure Reports ₹39,989 lakhs Net Loss for Quarter Ended June 30, 2025",
            "Summary": "Supreme Infrastructure India Limited reported a net loss of ₹39,989.13 lakhs for the quarter ended June 30, 2025. The company's accumulated losses reached ₹7,19,053.25 lakhs, with full erosion of net worth. The auditors issued a modified review conclusion citing concerns over trade receivables of ₹75,814.87 lakhs outstanding for substantial periods without expected credit loss adjustments. Two subsidiary companies - Supreme Infrastructure BOT Private Limited and Supreme Panvel Indapur Tollways Private Limited - have been admitted to Corporate Insolvency Resolution Process, with investments and receivables totaling ₹142,556.84 lakhs and ₹15,677.22 lakhs respectively. The company has defaulted on borrowing repayments and provided corporate guarantees of ₹1,53,315.69 lakhs for subsidiary borrowings. Despite material uncertainty about going concern, management believes the business can continue based on a partial implementation of a Scheme of Arrangement and other mitigating factors.",
            "Sentiment": "negative",
            "PublishDate": 1755188532969,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Infra Secures 4.50 Billion Rupees Contract in Mumbai",
            "Summary": "Supreme Infra has been awarded a turnkey contract worth 4.50 billion rupees in Mumbai. The company reports that this new contract has increased their order book to 17.25 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750810073000,
            "Source": "default"
        },
        {
            "Title": "Supreme Infra Secures 4.50 Billion Rupees Contract in Mumbai",
            "Summary": "Supreme Infra has won a contract worth 4.50 billion rupees in Mumbai. This new contract has increased the company's order book to 17.25 billion rupees. The news indicates a significant business development for Supreme Infra, potentially improving its financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1750768974000,
            "Source": "default"
        },
        {
            "Title": "NCLT Approves Amalgamation Scheme for Supreme Infrastructure India",
            "Summary": "The National Company Law Tribunal (NCLT) has approved a scheme of amalgamation between Supreme Infrastructure India and its creditors. This corporate action is a significant development for the company, potentially impacting its financial structure and operations.",
            "Sentiment": "positive",
            "PublishDate": 1743758752000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Infrastructure India: NCLT Approves ₹2,200 Crore Debt Settlement Plan",
            "Summary": "NCLT has approved Supreme Infrastructure India's settlement plan for ₹2,200 crore debt. The plan includes ₹464 crore payable to financial creditors, with ₹183.29 crore from asset monetization, ₹147.23 crore from equity raising, and ₹133.48 crore from pledged asset monetization.",
            "Sentiment": "positive",
            "PublishDate": 1743622316000,
            "Source": "corporate_action"
        }
    ]
}