{
    "Symbol": "SUPREME",
    "ISIN": "INE822E01011",
    "News": [
        {
            "Title": "Supreme Holdings & Hospitality Updates Progress on Real Estate Projects Worth ₹2,590 Crore",
            "Summary": "Supreme Holdings & Hospitality announced updates on two active real estate projects with a combined Gross Development Value of ₹2,590 crore, with the first project (₹290 crore) expected to achieve revenue recognition over six quarters starting Q3 FY2025-26. The second project (₹2,500 crore) is at approvals stage with operations anticipated between Q2-Q3 FY2026-27 and revenue recognition likely in Q3-Q4 FY2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1763147032173,
            "Source": "stock"
        },
        {
            "Title": "Supreme Holdings Hospitality Reports Q2 FY2026 Financial Results",
            "Summary": "Supreme Holdings Hospitality (India) Limited announced unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, with Board approval on November 14, 2025. The company reported standalone revenue from operations of Rs 9.61 lakhs for Q2 and Rs 25.62 lakhs for the half-year, with consolidated revenue of Rs 23.18 lakhs for Q2 and Rs 48.47 lakhs for the half-year.",
            "Sentiment": "neutral",
            "PublishDate": 1763142546290,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Holdings Hospitality Receives Height Clearance Approval for Belmac Project",
            "Summary": "Supreme Holdings Hospitality (India) Limited has received height clearance approval of 159.10 meters from the Airports Authority of India (AAI) for its land parcel related to the Belmac Project. The company has already submitted an Intimation of Disapproval (IOD) application to the municipal authority for this land parcel. The height clearance represents a regulatory milestone that will enable the company to utilize the full permissible development potential of the site. The approved elevation is expected to enhance the project's buildable area, positively influencing its development parameters, feasibility, and potential valuation. The company stated this marks continued progress in advancing the Belmac Project towards subsequent stages of regulatory and development approvals.",
            "Sentiment": "positive",
            "PublishDate": 1762148594519,
            "Source": "stock"
        },
        {
            "Title": "Supreme Holdings & Hospitality Applies for Development Permissions for Panvel Land Parcels Worth Over ₹2,500 Crore",
            "Summary": "Supreme Holdings & Hospitality Limited has applied for IOD and building permissions for land parcels in Panvel. The planned phased development has potential saleable area of approximately 31.17 lacs square feet. The estimated Gross Development Value for the proposed projects is expected to exceed ₹2,500 crore. The projections are subject to regulatory and statutory approvals, prevailing market conditions, and future economic and infrastructural developments in the Panvel region. All project timelines and financial projections remain contingent on timely receipt of approvals and other business conditions.",
            "Sentiment": "positive",
            "PublishDate": 1758176778224,
            "Source": "stock"
        },
        {
            "Title": "Atishay Jatia Disposes Entire 2,943 Share Stake in Supreme Holdings & Hospitality",
            "Summary": "Atishay Jatia, a member of the promoter group, disposed of his entire holding of 2,943 equity shares (0.01% stake) in Supreme Holdings & Hospitality (India) Limited through open market transactions. The disposal occurred across multiple dates: 858 shares on September 4, 2025, 1,346 shares on September 8, 2025, 350 shares on September 9, 2025, and 389 shares on September 11, 2025. Following the disposal, Jatia's shareholding in the company reduced to nil. The company's total paid-up equity share capital remains Rs. 38.65 crore comprising 3.86 crore equity shares of Rs. 10 each. The shares are listed on BSE and NSE under scrip code 530677 and symbol SUPREME respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1757932169438,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Holdings & Hospitality Reports Q1 FY2026 Financial Results",
            "Summary": "Supreme Holdings & Hospitality (India) Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 16.01 lakhs, down from Rs 2,320.73 lakhs in the same quarter last year. Total income was Rs 142.79 lakhs compared to Rs 2,389.30 lakhs in Q1 FY2025. The company posted a profit of Rs 10.75 lakhs versus Rs 370.32 lakhs in the corresponding quarter of the previous year. Earnings per share stood at Rs 0.03 compared to Rs 1.00 in Q1 FY2025. On a consolidated basis, total income was Rs 147.49 lakhs against Rs 2,401.64 lakhs in the same quarter last year, with profit after tax of Rs 5.92 lakhs compared to Rs 377.56 lakhs in Q1 FY2025. The consolidated results include figures from subsidiaries Helmet Traderz Limited, Belmaac City Developers Private Limited, and Visana Infrastructure Private Limited.",
            "Sentiment": "negative",
            "PublishDate": 1755184614195,
            "Source": "earnings"
        }
    ]
}