{
    "Symbol": "SURANAT&P",
    "ISIN": "INE130B01031",
    "News": [
        {
            "Title": "Surana Telecom Q3FY26 Revenue Jumps 955% YoY",
            "Summary": "Surana Telecom and Power Limited reported exceptional Q3FY26 performance with revenue from operations surging 955% YoY to ₹2,167.90 lakhs. Net profit increased 351% YoY to ₹430.72 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770476950292,
            "Source": "co_actions_results"
        },
        {
            "Title": "Surana Telecom Sells Industrial Land for ₹24.04 Cr",
            "Summary": "Surana Telecom and Power Limited announced the sale of 9,364.50 sq. yards of industrial land in Telangana for INR 24.04 crores to multiple sole proprietorship and partnership firms.",
            "Sentiment": "positive",
            "PublishDate": 1769595131827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Surana Telecom Awarded ₹175 Cr Solar Project",
            "Summary": "Surana Telecom and Power awarded 51.3 MW solar power project requiring investment of approximately ₹175 crores, marking significant expansion in renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1766492830668,
            "Source": "stocks"
        },
        {
            "Title": "Surana Telecom Wins ₹175 Cr Solar Power Projects",
            "Summary": "Surana Telecom and Power Limited secured eight Letters of Award for 51.3MW solar power projects worth ₹175 crores under PM KUSUM-C scheme in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1766492362609,
            "Source": "co_actions_results"
        },
        {
            "Title": "Surana Telecom and Power Limited Acquires 100% Stake in Topsun Solar Private Limited",
            "Summary": "Surana Telecom and Power Limited has acquired 100% equity stake in Topsun Solar Private Limited for Rs. 1,00,000, making it a wholly owned subsidiary. The acquisition enables the company to enter the solar energy business including trading, distributing, supplying, generating, transmitting and manufacturing of solar energy related products.",
            "Sentiment": "positive",
            "PublishDate": 1764581571503,
            "Source": "corporate_action"
        },
        {
            "Title": "Surana Telecom and Power Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "Surana Telecom and Power Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results at their meeting held on November 10, 2025. The company operates in renewable energy (solar) and infrastructure segments. The results include both standalone and consolidated financial statements covering the company and its four subsidiaries: Tejas India Solar Energy Private Limited, Surana Solar Systems Private Limited, Aryavaan Renewable Energy Private Limited, and Bhagyanagarr Green Energy Private Limited, along with associate company Surana Solar Limited. The financial statements were prepared in accordance with Indian Accounting Standards and reviewed by statutory auditors Luharuka & Associates.",
            "Sentiment": "neutral",
            "PublishDate": 1762757775454,
            "Source": "earnings"
        },
        {
            "Title": "Surana Telecom and Power Limited Publishes Q1 FY2026 Financial Results",
            "Summary": "Surana Telecom and Power Limited announced the publication of its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The Board of Directors approved the results at their meeting held on August 7, 2025. The company published extracts of the financial results in Business Standard (English Edition) and Nava Telangana (Telugu Edition) newspapers on August 8, 2025, and uploaded them to the company website. The results were filed with stock exchanges BSE and NSE in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754635094866,
            "Source": "earnings"
        },
        {
            "Title": "Surana Telecom Divests 7% Stake in Material Subsidiary Aryavaan Renewable Energy",
            "Summary": "Surana Telecom and Power Limited's board approved the divestment of its 7% equity stake in Aryavaan Renewable Energy Private Limited, a material subsidiary. The transaction requires shareholder approval through a general meeting before execution. Upon completion, Aryavaan Renewable Energy will cease to be a subsidiary of Surana Telecom. The buyers are Arun Kumar Kedia and Navkar Solar Power Systems LLP, who belong to the promoter/promoter group. The consideration will be determined at fair value by an independent chartered accountant as per Income Tax Act provisions. Aryavaan Renewable Energy contributed 6.27% to Surana Telecom's net worth and 22.92% to its turnover in FY 24-25. The transaction qualifies as a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1754567760302,
            "Source": "corporate_action"
        },
        {
            "Title": "Surana Telecom and Power Limited Re-appoints Narender Surana as Managing Director for Three Years",
            "Summary": "Surana Telecom and Power Limited has re-appointed Shri Narender Surana as Managing Director for a three-year term from May 23, 2025 to May 22, 2028, subject to shareholder approval. The board confirmed that Surana is not debarred from holding directorship by SEBI or any other authority. Surana brings over 37 years of experience in the telecom cable, metals and solar industry, and serves as Managing Director of Surana Telecom and Power Limited and Director of Surana Solar Limited. He has previously held leadership positions including President of Federation of Andhra Pradesh Chambers of Commerce and Industry and Founder President of Young Entrepreneurs Organization Hyderabad Chapter. Surana is the uncle of Shri Advait Surana, who is also a Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1754555137308,
            "Source": "corporate_governance"
        },
        {
            "Title": "Surana Telecom Reappoints Managing Director, Reports Strong Q1 Results",
            "Summary": "Surana Telecom and Power Limited's board reappointed Narender Surana as Managing Director for three years until May 22, 2028, subject to shareholder approval. The company reported quarterly results showing standalone profit of ₹271.84 lakhs compared to ₹157.53 lakhs in the same quarter last year. Total income reached ₹530.02 lakhs versus ₹469.95 lakhs previously. The board also approved the divestment of 7% equity shares in subsidiary Aryavaan Renewable Energy Private Limited and proposed appointing Sanjana Jain as Independent Director on the subsidiary's board. The company operates in renewable energy (solar) and infrastructure segments, with consolidated revenue from operations at ₹414.36 lakhs for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754553184007,
            "Source": "corporate_action"
        },
        {
            "Title": "Surana Telecom Secures 54 MW Solar Power Project Contract",
            "Summary": "Surana Telecom has been awarded a Letter of Acceptance (LOA) for the development of a 54 MW (AC) solar power project. The contract is valued at 190 crore rupees. The company's current market capitalization stands at 340 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737090820000,
            "Source": "order&deals"
        },
        {
            "Title": "Surana Telecom and Power to Sell Land and Solar Project for 33.3 Crore Rupees",
            "Summary": "Surana Telecom and Power Limited has announced plans to sell a land parcel along with a 5 MW solar power project for 33.3 crore rupees. The company, which has a market capitalization of 330 crore rupees, is likely divesting these assets as part of a strategic move.",
            "Sentiment": "positive",
            "PublishDate": 1735895386000,
            "Source": "corporate_action"
        }
    ]
}