{
    "Symbol": "SURAKSHA",
    "ISIN": "INE877V01027",
    "News": [
        {
            "Title": "Suraksha Diagnostic Q3FY26 Results: 30% Revenue Growth",
            "Summary": "Suraksha Diagnostic reported 30.3% YoY growth in total income to ₹783.09 million for Q3FY26, driven by higher test volumes and network expansion across East India.",
            "Sentiment": "positive",
            "PublishDate": 1770293395101,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suraksha Diagnostic Q3 FY26 Earnings Call on Feb 6",
            "Summary": "Suraksha Diagnostic Limited announces earnings call scheduled for February 06, 2026 at 2:30 PM IST to discuss Q3 & 9M FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769687287448,
            "Source": "stocks"
        },
        {
            "Title": "Suraksha Diagnostic Auditor Converts to LLP Structure",
            "Summary": "Suraksha Diagnostic's statutory auditor M S K A & Associates has converted to M S K A & Associates LLP effective January 13, 2026, maintaining audit continuity and scope unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1768564406897,
            "Source": "stocks"
        },
        {
            "Title": "Suraksha Group Delivers 6K Jaypee Wish Town Units",
            "Summary": "Suraksha Group completes 5,989 residential units across 63 towers at Jaypee Wish Town, receiving occupancy certificates for 31 towers with 3,135 units, bringing relief to over 20,000 homebuyers after decade-long delays.",
            "Sentiment": "positive",
            "PublishDate": 1768211490775,
            "Source": "stocks"
        },
        {
            "Title": "Suraksha Diagnostic Q2 FY26 Results: Revenue Growth Continues Despite Weather Challenges",
            "Summary": "Suraksha Diagnostic reported 16.9% revenue growth to INR 795.8 million in Q2 FY26, though EBITDA margin dropped to 31.7% from weather-related disruptions and new center investments. The company launched Suraksha Genomics for advanced genetic testing and maintains guidance of 15% revenue growth for FY26 with EBITDA margins of 33-34%, while expanding its network to 63 centers.",
            "Sentiment": "neutral",
            "PublishDate": 1763116583424,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Reports Strong Q2 Performance with 936% Profit Growth",
            "Summary": "Suraksha Diagnostic Limited announced its quarterly results for the quarter and six months ended September 30, 2025. The company reported consolidated revenue from operations of Rs 7,258.63 lakhs for the quarter compared to Rs 6,675.35 lakhs in the previous quarter. Profit after tax surged to Rs 892.37 lakhs from Rs 95.48 lakhs in the prior quarter. For the six-month period, consolidated revenue reached Rs 12,748.50 lakhs with profit after tax of Rs 1,828.28 lakhs. The company completed acquisition of Fetomat Wellness Private Limited on April 8, 2025, acquiring 63% equity stake for Rs 3,73,423 equity shares, making it a subsidiary. Basic earnings per share improved to Rs 1.72 for the quarter from Rs 0.18 in the previous quarter. The Board meeting was held on November 10, 2025, where these unaudited financial results were approved.",
            "Sentiment": "positive",
            "PublishDate": 1762805700918,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostics Reports 17% Revenue Growth, Launches Genomics Division",
            "Summary": "Suraksha Diagnostics achieved 17% year-over-year revenue growth with 63 operational centers. The company launched 'Suraksha Genomics' to enter the molecular testing market. Management expects margin improvement as 21 new centers reach maturity. The company is focusing on an asset-light business model and scale efficiency for sustainable profit growth in India's diagnostics sector.",
            "Sentiment": "positive",
            "PublishDate": 1762786491645,
            "Source": "stock"
        },
        {
            "Title": "Suraksha Diagnostic Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Suraksha Diagnostic announced its Q2 consolidated results showing net profit of 90 million rupees compared to 103.4 million rupees in the same period last year. Revenue increased to 787.3 million rupees from 667.5 million rupees year-over-year. EBITDA rose to 241.1 million rupees from 231.9 million rupees, while EBITDA margin decreased to 30.63% from 34.75% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762773472826,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Somnath Chatterjee Acquires Additional 7,800 Shares in Suraksha Diagnostic",
            "Summary": "Dr. Somnath Chatterjee, Promoter, Chairman & Joint Managing Director of Suraksha Diagnostic Limited, purchased 7,800 equity shares through open market purchase on August 18, 2025. The acquisition increased his shareholding from 26,46,968 shares (5.082%) to 26,54,768 shares (5.097%), representing a 0.015% increase in his stake. The company has a paid-up capital of ₹10,41,61,516 consisting of 5,20,80,758 equity shares of ₹2 each. Suraksha Diagnostic is listed on BSE and NSE with scrip code 544293 and symbol SURAKSHA.",
            "Sentiment": "positive",
            "PublishDate": 1755514214394,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Promoter Dr. Somnath Chatterjee Acquires 8,200 Shares",
            "Summary": "Dr. Somnath Chatterjee, Promoter, Chairman & Joint Managing Director of Suraksha Diagnostic Limited, acquired 8,200 equity shares through open market purchase on August 14, 2025. The acquisition increased his shareholding from 26,38,768 shares (5.067%) to 26,46,968 shares (5.082%) of the company's total equity. Suraksha Diagnostic has a paid-up capital of ₹10.42 crore consisting of 5.21 crore equity shares of ₹2 each. The company's shares are listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755494524612,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Reports 18.83% Revenue Growth in Q1 FY26, Expands Genomics Capabilities",
            "Summary": "Suraksha Diagnostic Limited reported total income of INR 734.92 million for Q1 FY26, marking an 18.83% year-on-year increase. EBITDA grew 13.51% to INR 246.56 million with a margin of 33.97%, while PAT rose 19.67% to INR 91.75 million. The company expanded its network by adding eight new centers during the quarter, bringing the total to 58 centers. Key developments include acquiring a 63% stake in Fetomat Wellness Private Limited for INR 22 crores in April 2025, marking entry into genomic medicine and pregnancy care services. The company launched Suraksha Genomics, positioning itself as the first complete genomic laboratory facility in Eastern India. Volume growth reached 26% year-on-year, driven by increased B2B partnerships and new center additions. The company closed three underperforming centers and expects to add 15-18 centers in the current fiscal year. Management projects revenue growth guidance of 15% and EBITDA margin of 34-35% for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1755172753598,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Somnath Chatterjee Increases Stake in Suraksha Diagnostic Through Open Market Purchases",
            "Summary": "Dr. Somnath Chatterjee, Promoter, Chairman & Joint Managing Director of Suraksha Diagnostic Limited, acquired equity shares through two separate open market purchases. On August 12, 2025, he purchased 8,190 equity shares, increasing his shareholding from 5.034% to 5.051%. The following day, on August 13, 2025, he acquired an additional 8,235 equity shares, further raising his stake to 5.067%. Both transactions were conducted through open market purchases and disclosed under SEBI regulations. The company has a paid-up capital of ₹10,41,61,516 consisting of 5,20,80,758 equity shares of ₹2 each. The shares are listed on BSE and NSE under the scrip symbol SURAKSHA.",
            "Sentiment": "positive",
            "PublishDate": 1755082368831,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Promoter Dr. Somnath Chatterjee Acquires 8,190 Shares Through Open Market Purchase",
            "Summary": "Dr. Somnath Chatterjee, Promoter, Chairman & Joint Managing Director of Suraksha Diagnostic Limited, acquired 8,190 equity shares through open market purchase on August 12, 2025. The acquisition increased his shareholding from 26,22,343 shares (5.034%) to 26,30,533 shares (5.051%) of the company's total voting capital. The transaction resulted in a change in the total shareholding of the Promoter and Promoter Group. Suraksha Diagnostic has a paid-up capital of ₹10,41,61,516 consisting of 5,20,80,758 equity shares of ₹2 each. The company is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754997585987,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Makes Earnings Call Audio Recording Available for Q1 FY2026 Results",
            "Summary": "Suraksha Diagnostic Limited conducted an earnings call on August 11, 2025, at 11:00 AM to discuss its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has made the audio recording of this analyst and institutional investor interaction available on its website. The diagnostic healthcare company, listed on BSE (scrip code: 544293) and NSE (symbol: SURAKSHA), is headquartered in Kolkata, West Bengal.",
            "Sentiment": "neutral",
            "PublishDate": 1754901663679,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Reports 18.83% Revenue Growth in Q1 FY26, Launches Genomics Vertical",
            "Summary": "Suraksha Diagnostic Limited, the largest integrated diagnostic chain in East India, reported strong quarterly results with total income rising 18.83% year-on-year to ₹734.92 million. EBITDA grew 13.51% to ₹246.56 million with a margin of 33.97%, while profit after tax increased 19.67% to ₹91.75 million. The company launched Suraksha Genomics, a new vertical offering genetic and molecular testing services including prenatal diagnostics, inherited disorder identification, and oncology panels. Suraksha acquired a 63% stake in Fetomat Wellness Private Limited, a pregnancy care and prenatal diagnostics provider, and expanded its network with three new centers. Joint Managing Director & CEO Ritu Mittal highlighted the company's focus on precision medicine and plans for AI-assisted diagnostics and population-scale genomic screening programs.",
            "Sentiment": "positive",
            "PublishDate": 1754665619209,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Reports 30.6% Revenue Growth in Q1 FY26",
            "Summary": "Suraksha Diagnostic Limited reported quarterly results for the period ended June 30, 2025. Revenue from operations increased to ₹7,027.90 lakhs from ₹6,414.51 lakhs in the previous quarter. Profit for the period rose to ₹984.87 lakhs compared to ₹800.67 lakhs in the preceding quarter. Basic earnings per share stood at ₹1.89 versus ₹1.54 in the previous quarter. On a consolidated basis, revenue from operations reached ₹7,258.63 lakhs with profit of ₹917.51 lakhs. The company operates diagnostic centres providing pathology and radiology services. During the period, Fetomat Wellness Private Limited became a subsidiary of the company through share acquisition agreements.",
            "Sentiment": "positive",
            "PublishDate": 1754663747784,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Schedules Board Meeting on August 8 to Approve Quarterly Financial Results",
            "Summary": "Suraksha Diagnostic Limited has scheduled a Board of Directors meeting on August 8, 2025, to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company's trading window for securities has been closed since July 1, 2025, for directors, key managerial personnel, designated persons, employees, connected persons and their immediate relatives. The trading window will reopen 48 hours after the financial results are declared. The meeting will be held at the company's registered office.",
            "Sentiment": "neutral",
            "PublishDate": 1753780666471,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Acquires Majority Stake in Fetomat Wellness",
            "Summary": "Suraksha Diagnostic has completed the acquisition of a 63% equity stake in Fetomat Wellness. This acquisition makes Fetomat Wellness a subsidiary of Suraksha Diagnostic.",
            "Sentiment": "positive",
            "PublishDate": 1744330018000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Acquires Majority Stake in Fetomat Wellness",
            "Summary": "Suraksha Diagnostic has completed the acquisition of a 63% equity stake in Fetomat Wellness. This acquisition makes Fetomat Wellness a subsidiary of Suraksha Diagnostic.",
            "Sentiment": "positive",
            "PublishDate": 1744211416000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Approves Strategic Investment in Fetomat",
            "Summary": "Suraksha Diagnostic has approved a strategic investment of 51.9 million rupees in Fetomat. Following this acquisition, Suraksha Diagnostic will hold a 63% equity stake in Fetomat.",
            "Sentiment": "positive",
            "PublishDate": 1743120651000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Approves Strategic Investment in Fetomat",
            "Summary": "Suraksha Diagnostic has approved a strategic investment of 51.9 million rupees in Fetomat. Following this acquisition, Suraksha Diagnostic will hold a 63% equity stake in Fetomat.",
            "Sentiment": "positive",
            "PublishDate": 1743084795000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic CFO Amit Saraf Resigns",
            "Summary": "Suraksha Diagnostic has announced the resignation of Amit Saraf from his position as Chief Financial Officer (CFO) of the company. No further details about the reason for his departure or a potential successor were provided in the brief statement.",
            "Sentiment": "neutral",
            "PublishDate": 1739791443000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suraksha Diagnostic Reports Improved Q3 EBITDA and Margin",
            "Summary": "Suraksha Diagnostic has reported an increase in its Q3 EBITDA to 183 million rupees, up from 153 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 30.68% from 29.54% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739020551000,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Reports Q3 Financial Results",
            "Summary": "Suraksha Diagnostic has announced its Q3 consolidated financial results. The company's net profit increased to 62 million rupees, up from 46 million rupees in the same quarter last year. Revenue also saw growth, rising to 595 million rupees from 518 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739020548000,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Incorporates New Subsidiary",
            "Summary": "Suraksha Diagnostic has incorporated a new subsidiary named Suraksha Advanced Radiology. This move suggests an expansion of the company's diagnostic services, particularly in the field of advanced radiology.",
            "Sentiment": "positive",
            "PublishDate": 1737591116000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Incorporates New Subsidiary",
            "Summary": "Suraksha Diagnostic has announced the incorporation of a new subsidiary named Suraksha Advanced Radiology. This move suggests an expansion of the company's diagnostic services, particularly in the field of advanced radiological imaging.",
            "Sentiment": "positive",
            "PublishDate": 1737547937000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Provides FY25 Financial Guidance",
            "Summary": "Suraksha Diagnostic has announced its financial guidance for the fiscal year 2025. The company expects to achieve a revenue of 270 crore rupees, with a margin of 38%. The profit after tax (PAT) margin is projected to be 27%.",
            "Sentiment": "positive",
            "PublishDate": 1734942102000,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Reports Q2 Results and Announces New SPV",
            "Summary": "Suraksha Diagnostic reported a consolidated net profit of 103 million rupees for Q2, up from 84 million rupees year-over-year and 74 million rupees quarter-over-quarter. Q2 revenue increased to 668 million rupees from 600 million rupees year-over-year. The company also approved the formation of a Special Purpose Vehicle (SPV) with Suraksha Diagnostic & Eye Centre to establish a 1.5 Tesla MRI Centre at Kolkata Medical College.",
            "Sentiment": "positive",
            "PublishDate": 1734912677000,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Approves Formation of SPV for MRI Centre",
            "Summary": "Suraksha Diagnostic has approved the formation of a Special Purpose Vehicle (SPV) in partnership with Suraksha Diagnostic & Eye Centre. The SPV's purpose is to establish a 1.5 Tesla MRI Centre at Kolkata Medical College.",
            "Sentiment": "positive",
            "PublishDate": 1734700589000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraksha Diagnostic Reports Q2 EBITDA Growth",
            "Summary": "Suraksha Diagnostic has reported its Q2 financial results. The company's EBITDA increased to 232 million rupees, up from 208 million rupees in the same quarter last year. The EBITDA margin also saw a slight improvement, rising to 34.76% from 34.70% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1734700153000,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic Reports Q2 Financial Results",
            "Summary": "Suraksha Diagnostic has announced its Q2 consolidated financial results. The company reported a net profit of 103 million rupees, up from 84 million rupees year-over-year and 74 million rupees quarter-over-quarter. Revenue for Q2 stood at 668 million rupees, compared to 600 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1734700038000,
            "Source": "earnings"
        },
        {
            "Title": "Suraksha Diagnostic: Flat Debut on Stock Market",
            "Summary": "Suraksha Diagnostic shares listed at ₹438 on NSE, slightly below the IPO price of ₹441. The stock recovered post-listing, gaining 2.5% intraday to ₹449. The IPO raised ₹846.25 crore and was subscribed 1.27 times overall, with strong institutional interest but subdued retail participation.",
            "Sentiment": "neutral",
            "PublishDate": 1733459595000,
            "Source": "normal_news"
        },
        {
            "Title": "Suraksha Diagnostic Ltd: Shares Debut at Discount in Weak IPO Listing",
            "Summary": "Suraksha Diagnostic Ltd shares listed at a discount of nearly 1% on BSE and NSE compared to its IPO price of ₹441. The IPO raised ₹846 crore through an offer for sale. The company plans to invest ₹70 crore annually for the next 3-4 years to expand its diagnostic centers.",
            "Sentiment": "negative",
            "PublishDate": 1733459401000,
            "Source": "corporate_action"
        }
    ]
}