{
    "Symbol": "SURAJLTD",
    "ISIN": "INE713C01016",
    "News": [
        {
            "Title": "Suraj Limited Q3FY26 Results & Interim Dividend",
            "Summary": "Suraj Limited reported Q3FY26 net profit of ₹136.26 lakhs and declared 15% interim dividend (₹1.50 per share) with record date January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767771604076,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suraj Estate Developers Acquires Land in Bandra West",
            "Summary": "Suraj Estate Developers has acquired two land parcels measuring 2,666.37 square meters in Bandra (West), Mumbai for upcoming residential project developments in the premium location.",
            "Sentiment": "positive",
            "PublishDate": 1766136873782,
            "Source": "stocks"
        },
        {
            "Title": "Suraj Estate Developers Launches One Business Bay Project Worth Rs 12 Billion",
            "Summary": "Suraj Estate Developers has launched a new project called One Business Bay with a gross development value of Rs 12 billion. The launch represents a significant development initiative for the real estate company, expanding its project portfolio in the commercial segment.",
            "Sentiment": "positive",
            "PublishDate": 1763074543908,
            "Source": "stock"
        },
        {
            "Title": "Suraj Limited Reports Mixed Performance in Q2 FY2025 Results",
            "Summary": "Suraj Limited, a manufacturer and exporter of stainless steel, alloy steel, and carbon steel seamless pipes, tubes, fittings and flanges, announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs. 5,018.67 lakhs for Q2 compared to Rs. 5,654.42 lakhs in the same quarter previous year. Net profit after tax stood at Rs. 154.84 lakhs for the quarter versus Rs. 209.77 lakhs in Q2 FY2024. For the half year period, revenue was Rs. 10,053.20 lakhs compared to Rs. 11,138.56 lakhs in the previous year, while net profit was Rs. 364.61 lakhs versus Rs. 874.39 lakhs. On a consolidated basis, the company reported Q2 net profit of Rs. 83.09 lakhs compared to Rs. 274.38 lakhs in the previous year. The results were reviewed by the Audit Committee and approved by the Board of Directors in their meeting held on November 10, 2025. The company operates in a single reportable segment of manufacturing stainless and various steel products.",
            "Sentiment": "negative",
            "PublishDate": 1762765279379,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Launches ₹250 Crore Residential Tower in Mumbai's Dadar",
            "Summary": "Suraj Estate Developers Limited launched Suraj Park View 1, a 29-storey residential tower in Shivaji Park, Dadar (West), Mumbai. The project has an estimated gross development value of ₹250 crore with approximately 0.53 lakh square feet of saleable carpet area. The tower offers 1, 2, and 3BHK units ranging from 469 to 872 square feet, featuring views of the Arabian Sea and Shivaji Park. The project is located 100 metres from Dadar Metro Station and includes amenities such as jogging tracks, gym, yoga deck, and children's play zones. Whole-Time Director Rahul Thomas stated the project reflects Dadar's cultural essence while meeting modern homebuyer aspirations. Suraj Estate Developers shares closed at ₹296.80, down 0.55% on the day of the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1758547720350,
            "Source": "stock"
        },
        {
            "Title": "Suraj Limited Approves Q1 FY26 Financial Results, Addresses Exchange Non-Compliance Issues",
            "Summary": "Suraj Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, during a meeting held on July 24, 2025. The company addressed two non-compliance notices from stock exchanges dated June 27, 2025. NSE issued a notice regarding the non-submission of cash flow statement, which the company attributed to human error in scanning the document despite submitting other required information on time. BSE issued a notice for non-compliance with secretarial compliance report submission requirements, specifically for not submitting the PDF file, though the company had submitted the report in XBRL format within the prescribed time. The company has paid the fines levied by both exchanges and committed to ensuring proper compliance in the future.",
            "Sentiment": "neutral",
            "PublishDate": 1753360690951,
            "Source": "earnings"
        },
        {
            "Title": "SURAJ Reports Q4 Financial Results",
            "Summary": "SURAJ has reported its Q4 financial results. The company experienced an EBITDA loss of 22 million rupees, compared to a gain of 112 million rupees in the same quarter last year. Revenue decreased to 587 million rupees from 762 million rupees year-over-year. The company also reported a net loss of 39 million rupees for Q4, in contrast to a profit of 60 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748244825000,
            "Source": "result"
        },
        {
            "Title": "SURAJ Reports Improved Q3 EBITDA and Margin",
            "Summary": "SURAJ has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 115 million rupees to 131 million rupees. Additionally, SURAJ's EBITDA margin expanded from 12.35% to 20.59%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738568528000,
            "Source": "earnings"
        },
        {
            "Title": "SURAJ Reports Mixed Q3 Financial Results",
            "Summary": "SURAJ has announced its Q3 financial results. The company's consolidated net profit increased to 71 million rupees, up from 67 million rupees in the same quarter last year. However, revenue decreased to 636 million rupees from 931 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738568431000,
            "Source": "earnings"
        }
    ]
}