{
    "Symbol": "SURAJEST",
    "ISIN": "INE843S01025",
    "News": [
        {
            "Title": "Suraj Estate Q3FY26 Monitoring Agency Report Filed",
            "Summary": "Suraj Estate Developers submits CARE Ratings monitoring report for Q3FY26 showing no utilization of preferential issue proceeds during quarter, with stock price concerns affecting warrant viability.",
            "Sentiment": "neutral",
            "PublishDate": 1769770583334,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suraj Estate Q3FY26 Profit Drops 25.9% to ₹251.66 Cr",
            "Summary": "Suraj Estate Developers reported Q3FY26 consolidated net profit of ₹251.66 crores, down 25.9% YoY. Revenue grew 6.01% to ₹1,800.52 crores despite higher operating expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1769613397448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suraj Estate Board Meet Set for Jan 28 Q3 Results",
            "Summary": "Suraj Estate Developers schedules board meeting on January 28, 2026, to approve Q3FY26 unaudited financial results. Trading window closed from January 1 until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768901919955,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suraj Estate Records ₹200 Cr Commercial Bookings",
            "Summary": "Suraj Estate Developers achieves ₹200 crore gross bookings from flagship commercial project One Business Bay within 45 days of launch, selling 40,000 sq ft area.",
            "Sentiment": "positive",
            "PublishDate": 1767614461419,
            "Source": "stocks"
        },
        {
            "Title": "Suraj Estate Explains Delay in CGST Notice Filing",
            "Summary": "Suraj Estate Developers provides revised intimation explaining delay in reporting ₹18.61 crore CGST adjudication order due to internal communication gap.",
            "Sentiment": "neutral",
            "PublishDate": 1766417477941,
            "Source": "stocks"
        },
        {
            "Title": "Suraj Estate Wins India's Best Residential Developer",
            "Summary": "Suraj Estate Developers Limited receives prestigious EuroMoney Real Estate Award 2025 for India's Best Residential Developer, recognizing four decades of luxury development in South Central Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1765380987220,
            "Source": "stocks"
        },
        {
            "Title": "Suraj Estate Developers Appoints Dr. Ananta Singh Raghuvanshi as Woman Independent Director",
            "Summary": "Suraj Estate Developers Limited shareholders approved the appointment of Dr. Ananta Singh Raghuvanshi as Woman Independent Director for five consecutive years through December 3, 2025 postal ballot with 99.9995% votes in favor. The resolution affects the company's board composition with 3.32 crore shares participating in the e-voting process, strengthening corporate governance structure.",
            "Sentiment": "positive",
            "PublishDate": 1764854648286,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraj Estate Developers VP Sales Resigns, Company Faces Compliance Delay",
            "Summary": "Mr. Anand Dinesh Vyas, Vice President Sales and Senior Managerial Personnel at Suraj Estate Developers Limited, resigned effective November 21, 2025, citing better opportunities. The company faced regulatory scrutiny from BSE for delayed disclosure beyond the mandatory 24-hour timeline, attributing the delay to internal communication gaps during information verification.",
            "Sentiment": "neutral",
            "PublishDate": 1764057167763,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suraj Estate launches ₹1,200-crore commercial project One Business Bay in Mumbai's Mahim",
            "Summary": "Suraj Estate Developers launched One Business Bay, a premium commercial project in Mumbai's Mahim with gross development value of ₹1,200 crore, featuring 182 business office units across 2.09 lakh square feet carpet area. The company has initiated projects worth nearly ₹1,600 crore in FY26, while shares declined 2.09% to ₹279.20 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1763044532379,
            "Source": "stock"
        },
        {
            "Title": "Suraj Estate Developers Reports No Fund Utilization in Q2 FY26, Share Price Declines 63% from Offer Price",
            "Summary": "Suraj Estate Developers Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no utilization of issue proceeds during the reporting period. The company's preferential issue, originally planned for Rs. 500 crores, was reduced to Rs. 343.39 crores due to undersubscription. CARE Ratings Limited, serving as the monitoring agency, reported that the company's share price closed at Rs. 278.05 on September 30, 2025, representing a 63% decline from the offer price and 62% decline from its 52-week high. The current share price is below the warrant exercise price of Rs. 750 and balance call value of Rs. 375 per share. The company had passed a Board Resolution on June 27, 2025, for revision in the cost of objects due to undersubscription. All Rs. 293.51 crores received by June 30, 2025, had been fully utilized within the stipulated timeline of 12-18 months. The monitoring agency noted that the share price decline and undersubscription might affect the viability of the stated objects.",
            "Sentiment": "negative",
            "PublishDate": 1762810555345,
            "Source": "stock"
        },
        {
            "Title": "Suraj Estate Developers Reports No Deviation in Rs 343.39 Crore Preferential Issue Fund Utilization",
            "Summary": "Suraj Estate Developers Limited confirmed no deviation in the utilization of funds raised through its preferential issue for the quarter ended September 30, 2025. The company raised Rs 343.39 crore on October 15 and 18, 2024, against an original target of Rs 500 crore. The funds are being used for three main purposes: payment towards acquisition of land/land development rights, working capital requirements, and general corporate purposes. The company issued 13,30,000 convertible warrants at Rs 750 each, raising Rs 99.75 crore, with only 50% received upfront and the balance to be collected upon conversion. Care Rating Limited is serving as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1762761097438,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraj Estate Reports 32.6% Revenue Growth in Q2, Plans Rs 600 Crore Pre-Sales Target for FY26",
            "Summary": "Suraj Estate Developers reported strong quarterly results with total income growing 32.6% year-on-year to Rs 145.4 crores in Q2 FY26. EBITDA increased to Rs 65.6 crores while PAT rose to Rs 33.1 crores. Pre-sales grew 88.8% quarter-on-quarter to Rs 152.9 crores, driven by successful launches of Suraj Aureva at Prabhadevi (Rs 120 crores GDV, 39% sold at launch) and Suraj Park View at Dadar West (Rs 250 crores GDV, 42% sold at launch). The company acquired a 644 square metre land parcel at Lower Parel for Rs 6.44 crores. Gross debt increased to Rs 545.8 crores from Rs 456.3 crores in March 2025, primarily due to construction and approval costs for new projects. The company expects to launch its Mahim Commercial project with Rs 1,200 crores GDV in November 2025 after RERA registration. Management targets Rs 600 crores in pre-sales for FY26 and plans five new launches in H2 FY26. The company maintains a project pipeline of 13.66 lakh square feet across 17 projects with combined visibility of Rs 1,166 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762205023324,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Seeks Shareholder Approval for Woman Independent Director Appointment",
            "Summary": "Suraj Estate Developers Limited has initiated a postal ballot process to appoint Dr. Ananta Singh Raghuvanshi as Woman Independent Director. The company falls under the top 1000 listed companies based on average market capitalization as of December 31, 2024, making the appointment of a woman independent director mandatory under SEBI regulations. Dr. Raghuvanshi, who holds a PhD in Management and MRICS qualification, brings 34 years of real estate industry experience including leadership roles at DLF, Emaar MGF, and Damac. She currently serves as Chairperson and Founder of NAREDCO Mahi and as Independent Director at Share India Securities Limited. The remote e-voting period runs from November 4, 2025, to December 3, 2025, with results to be declared by December 5, 2025. The Board has appointed Mr. Himanshu S. Kamdar as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1762178897791,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraj Estate Developers Forms New Subsidiary 'Avle Estates Private Limited'",
            "Summary": "Suraj Estate Developers has established a new subsidiary called 'Avle Estates Private Limited' as part of its real estate growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762178529785,
            "Source": "stock"
        },
        {
            "Title": "Suraj Estate Developers Reports 89% QoQ Growth in Pre-sales to ₹153 Crore for Q2FY26",
            "Summary": "Suraj Estate Developers delivered strong quarterly results with pre-sales value rising 89% quarter-on-quarter to ₹153 crore and sales area increasing 111% QoQ to 34,875 sq. ft. The growth was driven by successful launches of two new projects - Suraj Aureva at Prabhadevi and Suraj Parkview 1 at Dadar (W), both achieving approximately 40% inventory sales within the launch phase. Total income increased 9.2% QoQ to ₹145 crore while EBITDA grew 30.4% QoQ to ₹65.6 crore. EBITDA margin improved from 37.7% to 45%, leading to PAT margin enhancement from 16% to 23%. The company strengthened its Lower Parel footprint by acquiring an adjoining parcel for the 'Ambavat Bhavan & RK Mansion' project, expanding saleable area to 0.32 lakh sq. ft. with combined GDV of ₹130 crore. Management remains on track to achieve FY26 launch target of ₹2,000 crore GDV, including ₹1,200 crore from an upcoming commercial project planned for November 2025 launch.",
            "Sentiment": "positive",
            "PublishDate": 1761638645778,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Sets Ambitious Growth Targets with ₹2,000 Crore Launch Pipeline by FY26",
            "Summary": "Suraj Estate has announced strategic expansion plans targeting a ₹2,000 crore launch pipeline and over 30% return on equity by FY26. The company's growth strategy includes new projects in South Mumbai, entry into commercial real estate in Mahim, land acquisition in Lower Parel, and expanding gross development value beyond ₹5,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761583483133,
            "Source": "stock"
        },
        {
            "Title": "Suraj Estate Developers Reports Strong Q2 Performance with 32.5% Revenue Growth",
            "Summary": "Suraj Estate Developers Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported consolidated revenue from operations of Rs 1,445.63 million compared to Rs 1,090.91 million in the same quarter last year, representing a 32.5% increase. Profit after tax increased to Rs 323.36 million from Rs 237.64 million year-over-year. For the half-year period, consolidated revenue reached Rs 2,770.32 million versus Rs 2,427.64 million in the previous year. The Board also approved a notice for postal ballot to regularize the appointment of Dr. Ananta Singh Raghuvanshi as an Independent Director and appointed Mr. Himanshu Kamdar as the conducting officer for the postal ballot process. The company operates exclusively in real estate and allied activities, with all operations based in India.",
            "Sentiment": "positive",
            "PublishDate": 1761569700534,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Launches ₹250 Crore Residential Project in Dadar West",
            "Summary": "Suraj Estate Developers has launched 'Suraj Park View 1', a new residential project located at Shivaji Park in Dadar (West). The project carries a total value of ₹250 crores.",
            "Sentiment": "positive",
            "PublishDate": 1758542098288,
            "Source": "stock"
        },
        {
            "Title": "Suraj Estate Developers Plans to Raise Up to 5 Billion Rupees",
            "Summary": "Suraj Estate Developers has announced plans to secure up to 5 billion rupees in funding.",
            "Sentiment": "positive",
            "PublishDate": 1756908348625,
            "Source": "stock"
        },
        {
            "Title": "Suraj Estate Developers Acquires Adjacent Land Parcel for Lower Parel Project, Boosting GDV to ₹130 Crores",
            "Summary": "Suraj Estate Developers Limited acquired a 644 sq. meters land parcel at N.M. Joshi Marg, Lower Parel, Mumbai for ₹6.44 crores including stamp duty and registration charges. The acquisition will be merged with the adjacent Ambavat Bhavan project, creating a consolidated 1,310 sq. meters land parcel with an estimated saleable carpet area of 0.32 lakh sq. ft. and projected GDV of ₹130 crores. The development will feature premium 1 and 2 BHK residential apartments in the value-luxury segment under regulation 33(7) of DPCR 2034. The project offers strategic connectivity via Western and Central railway lines, Monorail, Eastern Freeway and Mumbai Coastal Road, with proximity to healthcare, retail and entertainment facilities in Lower Parel, Worli and Prabhadevi areas.",
            "Sentiment": "positive",
            "PublishDate": 1756141345583,
            "Source": "stock"
        },
        {
            "Title": "Suraj Estate Developers Reports Q1 FY26 Results with Revenue of INR 133 Crores, Plans INR 1,600 Crores Launch Pipeline",
            "Summary": "Suraj Estate Developers Limited reported Q1 FY26 revenue of INR 133 crores and profit after tax of INR 21.3 crores. Presales stood at INR 81 crores, impacted by limited inventory, while collections grew 60% year-on-year to INR 115 crores. The company launched Suraj Aureva in Prabhadevi and received planning approvals for Suraj Park View 1. Management remains committed to launching projects with cumulative GDV of INR 1,600 crores in H1 FY26, including a commercial project (INR 1,200 crores GDV) and Parkview 1 (INR 250 crores GDV). The Marinagar project in Mahim secured additional 2 lakh square feet carpet area under Metro FSI, expected to generate incremental GDV of approximately INR 800 crores. EBITDA for the quarter was INR 50.3 crores versus INR 64.2 crores in the previous year. The company's upcoming project pipeline comprises 19 projects with estimated saleable carpet area of 12.2 lakh square feet, while 10 ongoing projects represent 4.69 lakh square feet under development.",
            "Sentiment": "neutral",
            "PublishDate": 1754029276357,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Reports Decline in Q1 Profitability and Margins",
            "Summary": "Suraj Estate Developers reported Q1 EBITDA of 496 million rupees, down from 632 million rupees in the same period last year. The company's EBITDA margin contracted to 37.43% from 47.35% year-over-year. Consolidated net profit fell to 213 million rupees compared to 301 million rupees in the previous year's corresponding quarter. Revenue declined marginally to 1.3 billion rupees from 1.34 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753456275094,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Suraj Estate Developers Limited's Board of Directors approved the company's unaudited financial results for the quarter ended June 30, 2025. The results include both standalone and consolidated financials, accompanied by a limited review report with unmodified opinion from statutory auditors M/s SKLR & Co. LLP. The Audit Committee reviewed and recommended these results. The Board meeting was held on July 25, 2025, lasting from 4:15 p.m. to 7:30 p.m. IST. The financial results and review report are being submitted to stock exchanges NSE and BSE, and will be uploaded on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753456248221,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Launches Luxury Residential Tower in Mumbai",
            "Summary": "Suraj Estate Developers has announced the launch of 'Suraj Aureva,' a high-end residential tower located in Prabhadevi, Mumbai. The project is expected to have a Gross Development Value of ₹120 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752457617000,
            "Source": "default"
        },
        {
            "Title": "Suraj Estate Developers: Profit Surges 48.5% in FY25",
            "Summary": "Suraj Estate Developers reported a 48.5% increase in profit after tax to ₹100.2 crore for FY25. Total income grew 33.1% to ₹553.2 crore. Profit margin improved to 18.3%. The company plans to launch projects worth ₹2,000 crore in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748417176000,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Reports Q4 Financial Results",
            "Summary": "Suraj Estate Developers has announced its Q4 financial results. The company's EBITDA for Q4 was 301 million rupees, down from 535 million rupees year-over-year. The EBITDA margin decreased to 22.05% from 53.29% in the same period last year. Revenue for Q4 increased to 1.36 billion rupees from 1 billion rupees year-over-year. The consolidated net profit for Q4 was 182.9 million rupees, compared to 193 million rupees year-over-year and 199 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748366184000,
            "Source": "result"
        },
        {
            "Title": "Suraj Estate Developers: Anand Rathi Initiates 'Buy' Rating",
            "Summary": "Anand Rathi initiates 'Buy' rating on Suraj Estate Developers, citing the company's strategic focus on south-central Mumbai, value-luxury category, and select luxury developments. The firm's 38-year track record and cost-effective redevelopment model are highlighted as key strengths.",
            "Sentiment": "positive",
            "PublishDate": 1745396861000,
            "Source": "normal_news"
        },
        {
            "Title": "Suraj Estate Developers Acquires Land for Residential Redevelopment in Mumbai",
            "Summary": "Suraj Estate Developers has acquired a land parcel at Shivaji Park, Dadar (West), Mumbai. The company plans to redevelop this land into a residential building. The expected Gross Development Value (GDV) of this project is estimated at 80 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742438243000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraj Estate Developers Reports Increased Q3 Profit and Revenue",
            "Summary": "Suraj Estate Developers has announced its Q3 consolidated financial results. The company's net profit rose to 200 million rupees, up from 166 million rupees in the same quarter last year. This represents a year-over-year increase. Compared to the previous quarter, net profit decreased from 318 million rupees. Revenue for Q3 reached 1.7 billion rupees, a significant increase from 1.06 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739233238000,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Reports Q3 EBITDA Decline",
            "Summary": "Suraj Estate Developers experienced a significant decrease in Q3 EBITDA, dropping from 695 million rupees to 458 million rupees year-over-year. The company's EBITDA margin also contracted sharply, falling from 65.63% to 26.96% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739200805000,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers Reports Q3 Financial Results",
            "Summary": "Suraj Estate Developers announced its Q3 consolidated net profit of 200 million rupees, showing an increase from 166 million rupees year-over-year. However, it decreased from 318 million rupees quarter-over-quarter. The company's Q3 revenue rose to 1.7 billion rupees from 1.06 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739200712000,
            "Source": "earnings"
        },
        {
            "Title": "Suraj Estate Developers' Unit Acquires Mumbai Land Parcel for 1.01 Billion Rupees",
            "Summary": "A unit of Suraj Estate Developers has purchased a land parcel in Mumbai for 1.01 billion rupees. The company anticipates a gross development value of approximately 5.25 billion rupees for the project to be developed on this land.",
            "Sentiment": "positive",
            "PublishDate": 1733357041000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraj Estate Developers' Unit Acquires Mumbai Land Parcel for 1.01 Billion Rupees",
            "Summary": "A unit of Suraj Estate Developers has purchased a land parcel in Mumbai for 1.01 billion rupees. The company anticipates a gross development value of approximately 5.25 billion rupees for the project to be developed on this land.",
            "Sentiment": "positive",
            "PublishDate": 1733317895000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suraj Estate Developers: Stock Dips 29%, Analysts Remain Bullish",
            "Summary": "Suraj Estate Developers' stock has fallen 29% to ₹603 in less than three months. Despite this, analysts maintain positive outlooks due to strong Q2FY25 performance and robust project pipeline. Nuvama raised its target price to ₹992, while Arihant Capital Markets projects ₹1,134. Q2 results show 5% YoY revenue growth and 88% YoY PAT increase, with bookings up 26% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1732272568000,
            "Source": "normal_news"
        },
        {
            "Title": "Suraj Estate Developers Reports Q2 EBITDA and Margin",
            "Summary": "Suraj Estate Developers announced its Q2 financial results. The company's EBITDA for the quarter was 634 million rupees, compared to 631 million rupees in the same quarter last year. The EBITDA margin decreased to 58.16% from 61.02% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731586873000,
            "Source": "result"
        },
        {
            "Title": "Suraj Estate Developers Reports Q2 Revenue Growth",
            "Summary": "Suraj Estate Developers has announced its Q2 revenue of 1.1 billion rupees, compared to 1 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731586655000,
            "Source": "result"
        },
        {
            "Title": "Suraj Estate Developers Reports Strong Q2 Profit Growth",
            "Summary": "Suraj Estate Developers has announced its Q2 consolidated net profit, showing significant year-over-year and quarter-over-quarter growth. The company reported a net profit of 318 million rupees, compared to 170 million rupees in the same quarter last year and 301 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731586557000,
            "Source": "result"
        },
        {
            "Title": "Suraj Estate Developers: Raises ₹343 Crore for Land Acquisitions",
            "Summary": "Suraj Estate Developers has successfully raised ₹343 crore to fund land acquisitions for future development projects.",
            "Sentiment": "positive",
            "PublishDate": 1729738688000,
            "Source": "normal_news"
        },
        {
            "Title": "Suraj Estate Developers Raises ₹343 Crore Through Preferential Issue",
            "Summary": "Suraj Estate Developers has successfully raised funds totaling ₹343 crore through a preferential issue of equity shares and convertible share warrants. This capital raising initiative demonstrates the company's efforts to strengthen its financial position and potentially fund future growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1729345741000,
            "Source": "corporate_action"
        }
    ]
}