{
    "Symbol": "SURANASOL",
    "ISIN": "INE272L01022",
    "News": [
        {
            "Title": "Surana Solar Board Meet Set for Jan 29 to Review Q3 Results",
            "Summary": "Surana Solar Limited has scheduled a board meeting on January 29, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769173021657,
            "Source": "co_actions_results"
        },
        {
            "Title": "Surana Solar Clarifies Company Secretary Resignation Due to Professional Goals and Personal Circumstances",
            "Summary": "Surana Solar Limited issued additional clarification regarding the resignation of Company Secretary Vempati VNDR Ramya, who stepped down from her position effective October 10, 2025. The company confirmed the resignation was solely due to the individual's professional goals and personal circumstances, with no other material reasons involved. The clarification was provided to stock exchanges BSE and NSE on October 17, 2025, following an earlier intimation dated October 10, 2025. Director Narender Surana signed the disclosure to ensure transparent compliance with applicable regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760695434360,
            "Source": "corporate_governance"
        },
        {
            "Title": "Surana Solar Gets ALMM Inclusion and BIS Certification for Solar PV Modules",
            "Summary": "Surana Solar Limited has been included in the Approved List of Models and Manufacturers (ALMM) by the Ministry of New and Renewable Energy. The company also obtained Bureau of Indian Standards (BIS) certification for its TOPCON 630 Wp and PERC 590 Wp solar PV modules. These approvals make the company's products eligible for participation in Government EPC power projects, tenders, and PSU-related initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760422747841,
            "Source": "stock"
        },
        {
            "Title": "Surana Solar Limited Company Secretary Resigns",
            "Summary": "Surana Solar Limited announced the resignation of Ms. Vempati Venkata Nagasri Durga Raja Sriramya from her position as Company Secretary and Compliance Officer, effective October 10, 2025, after close of business hours. The company has accepted her resignation. In her resignation letter, she stated the decision was made after careful consideration of her professional goals and personal circumstances, and expressed appreciation for the opportunities and support provided during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1760361220127,
            "Source": "corporate_governance"
        },
        {
            "Title": "Surana Solar Limited Company Secretary Resigns",
            "Summary": "Surana Solar Limited announced the resignation of Ms. Vempati Venkata Nagasri Durga Raja Sriramya from her position as Company Secretary and Compliance Officer, effective October 10, 2025, after the close of business hours. The company has accepted her resignation. The resignation was communicated to stock exchanges NSE and BSE as required under regulatory obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1760100365828,
            "Source": "corporate_governance"
        },
        {
            "Title": "Surana Solar Secures Court Order to Release ₹10.05 Crore from Paradip Port Trust Dispute",
            "Summary": "Surana Solar obtained a court order to release ₹8.71 crore from a dispute with Paradip Port Trust. Including interest, the total amount comes to ₹10.05 crore. The company indicates this resolution will boost its financial health.",
            "Sentiment": "positive",
            "PublishDate": 1758264375721,
            "Source": "stock"
        },
        {
            "Title": "Surana Solar Begins Commercial Production at 180 MW Hyderabad Plant",
            "Summary": "Surana Solar has commenced commercial production at its new 180 MW Fabcity manufacturing plant located in Hyderabad. The facility represents an expansion of the company's solar manufacturing capacity.",
            "Sentiment": "positive",
            "PublishDate": 1753430841193,
            "Source": "stock"
        },
        {
            "Title": "Surana Solar's Unit Signs Agreement with Maharashtra State Electricity Distribution Co",
            "Summary": "Surana Solar Limited has announced that one of its units has entered into an agreement with Maharashtra State Electricity Distribution Co. This partnership likely involves the supply or distribution of solar energy in Maharashtra, though specific details of the agreement are not provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1734330971000,
            "Source": "corporate_action"
        },
        {
            "Title": "Surana Solar: Profit Turnaround and Expansion Plans",
            "Summary": "Surana Solar reported a profit of Rs 32.69 lakh in Q2, reversing previous losses. Total income rose to Rs 1,454.01 crore. The board approved plans to raise up to Rs 200 crore through various financial instruments and to make Surana Technologies Private Limited a wholly owned subsidiary. Vempati Venkata Nagasri Durga Raja Sriramya appointed as Company Secretary from Oct. 21, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1729531019000,
            "Source": "result"
        },
        {
            "Title": "Surana Solar Reports Significant Revenue Growth in Q2",
            "Summary": "Surana Solar has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 143 million rupees, compared to 28 million rupees in the same quarter of the previous year, representing a year-over-year growth of approximately 411%.",
            "Sentiment": "positive",
            "PublishDate": 1729492596000,
            "Source": "result"
        },
        {
            "Title": "Surana Solar Reports Profit in Q2 FY2024",
            "Summary": "Surana Solar Limited has reported a net profit of 3.3 million rupees in the second quarter, marking a significant turnaround from a loss of 15 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729492450000,
            "Source": "result"
        },
        {
            "Title": "Surana Solar: Stock Surges 51% in Ten Days, Hits All-Time High",
            "Summary": "<p>Surana Solar's stock price has <span class=\"positive\">increased</span> by <span class=\"positive\">51.16%</span> over the last ten trading sessions, reaching an <b>all-time high</b> of Rs 65.39. The company has <span class=\"positive\">outperformed</span> the market in the past month, three months, and one year. Q1 FY25 saw a <span class=\"positive\">16.7% increase</span> in net profit and a <span class=\"positive\">72.1% jump</span> in net sales compared to Q1 FY24.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727949240000,
            "Source": "normal_news"
        }
    ]
}