{
    "Symbol": "SURYODAY",
    "ISIN": "INE428Q01011",
    "News": [
        {
            "Title": "Suryoday Small Finance Bank Board Approves Key Appointments",
            "Summary": "Board re-appoints Yogesh Dixit as Chief Risk Officer for April 2026-March 2027 term and appoints Sudheer Kamble as Chief of Internal Vigilance effective March 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770904128032,
            "Source": "stocks"
        },
        {
            "Title": "Suryoday Bank Seeks ₹1,000 Cr Fund Raise via Postal Ballot",
            "Summary": "Suryoday Small Finance Bank announces postal ballot for ₹1,000 crore fund raising through various modes and re-appointment of independent director Krishna Prasad Nair for second term.",
            "Sentiment": "positive",
            "PublishDate": 1769700271649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suryoday Small Finance Bank Q3 FY26 Results",
            "Summary": "Suryoday Small Finance Bank reports 24.3% YoY growth in advances to Rs. 11,885 crores for Q3 FY26, with improving asset quality trends and strong digital momentum.",
            "Sentiment": "positive",
            "PublishDate": 1769695759596,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suryoday Small Finance Bank Q3 FY26 Results",
            "Summary": "Suryoday Small Finance Bank reported Q3 FY26 net profit of ₹36.56 crores, up 9.8% YoY. Interest earned rose to ₹543.87 crores while NPA ratios increased to 6.69%. Board approved fundraising up to ₹1,000 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769088331203,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suryoday Bank Launches Gold Loan Business in Maharashtra",
            "Summary": "Suryoday Small Finance Bank enters gold loan segment with ₹30 lakh limit, starting Maharashtra rollout before national expansion to diversify secured lending portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768975267539,
            "Source": "stocks"
        },
        {
            "Title": "Suryoday Bank Q3FY26: 23% YoY Growth in Advances",
            "Summary": "Suryoday Small Finance Bank reports strong Q3FY26 performance with gross advances at ₹11,810 crore (23% YoY growth), disbursements up 84% YoY to ₹2,698 crore, and deposits growing 33% YoY to ₹12,865 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767439645010,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI Approves 1729 Capital's 7.14% Stake Acquisition in Suryoday Small Finance Bank",
            "Summary": "The Reserve Bank of India has granted approval to 1729 Capital and its partners to acquire a 7.14% stake in Suryoday Small Finance Bank. This regulatory approval enables the investment firm to proceed with its equity investment in the small finance bank.",
            "Sentiment": "positive",
            "PublishDate": 1763984116884,
            "Source": "corporate_action"
        },
        {
            "Title": "RBI Grants Post-Facto Approval to 1729 Capital for 7.14% Stake in Suryoday Small Finance Bank",
            "Summary": "Suryoday Small Finance Bank received RBI's post-facto approval for 1729 Capital and its associates' aggregate holding of 7.14% in the bank. The approval comes with conditions requiring prior RBI consent for future shareholding changes above or below certain thresholds, affecting the investment firm's future stake adjustments.",
            "Sentiment": "positive",
            "PublishDate": 1763060556926,
            "Source": "corporate_action"
        },
        {
            "Title": "Suryoday Small Finance Bank MD-CEO Plans to Purchase 50,000 Shares",
            "Summary": "Baskar Babu Ramachandran, Managing Director CEO and Promoter of Suryoday Small Finance Bank, has received approval for a trading plan to purchase 50,000 equity shares during March 16-20, 2026. The trading plan was approved under SEBI insider trading regulations with a 120-day cool-off period restriction for him and immediate relatives.",
            "Sentiment": "positive",
            "PublishDate": 1763058551666,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Mixed Q2 Results with 18.9% Loan Growth Amid Asset Quality Challenges",
            "Summary": "Suryoday Small Finance Bank reported gross advances of ₹11,124 crore as of September 30, 2025, reflecting 18.9% year-on-year growth. The bank's disbursements excluding SCF during the half-year were ₹3,973 crore, up 18.1% from ₹3,366 crore in the same period last year. However, financial performance showed mixed results with total income decreasing 2.7% to ₹338 crore and net interest income declining 13.9% to ₹258 crore. The bank's GNPA ratio increased to 5.9% from 2.9% in the previous year, while profit after tax decreased 33% to ₹30 crore. The bank successfully claimed ₹313 crore under the CGFMU scheme in September 2025. Vikas loan disbursements showed strong growth of 111% year-on-year to ₹905 crore in Q2. The commercial vehicle book grew 49% to ₹1,564 crore, while the mortgage book expanded 39% to ₹2,555 crore. Deposit base increased 35.5% to ₹11,991 crore with CASA ratio improving to 20.7%. The bank maintains a strong capital adequacy ratio of 23.4% and targets ROA of 1.2% for the current financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1763002278038,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank's Chief Information Security Officer Resigns",
            "Summary": "Anshuman Pund has resigned from his position as Chief Information Security Officer at Suryoday Small Finance Bank. His resignation letter was dated August 11, 2025, stating his intention to pursue opportunities outside the bank. His last working day was November 10, 2025. The bank had previously informed stock exchanges about this resignation on October 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762772611029,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suryoday Small Finance Bank Focuses on MSME Lending and Digital Growth Strategy",
            "Summary": "Suryoday Small Finance Bank aims to boost MSME lending and expand its secured portfolio. The Vikas loan franchise now comprises 70% of the bank's loan book. The bank plans to drive digital growth through secured credit cards and UPI credit offerings. It will promote CASA and fixed deposit mobilization through digital channels. The bank is strengthening risk coverage under the CGFMU scheme as part of its sustainable and customer-centric growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762444095529,
            "Source": "stock"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q2 Results, Approves Rs 1,000 Crore Fundraising Plan",
            "Summary": "Suryoday Small Finance Bank's Board approved unaudited financial results for Q2 and half-year ended September 30, 2025. The bank reported net profit of Rs 30.41 crore for Q2 compared to Rs 45.39 crore in the same quarter last year. Half-year net profit stood at Rs 65.69 crore versus Rs 115.45 crore in the previous year. Gross NPA ratio increased to 5.93% from 3.03% year-on-year, while net NPA ratio rose to 3.80% from 0.80%. The Board also approved fundraising of up to Rs 1,000 crore through various modes including preferential allotment, QIP, private placement, or rights issue, subject to shareholder and regulatory approvals. Capital adequacy ratio stood at 23.41%. The bank benefited from Credit Guarantee Fund for Micro Units scheme, which reduced provisions by Rs 37.49 crore for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762438319446,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Appoints Pankaj Gulati as Chief People Officer & Head - CSR",
            "Summary": "Suryoday Small Finance Bank Limited has appointed Mr. Pankaj Gulati as Chief People Officer & Head - CSR, effective from October 23, 2025. Gulati brings over two decades of expertise in Banking, Finance, and Insurance sectors, with experience in managing employee lifecycle, performance and rewards, benefits administration, HR technology, analytics, and governance. He has previously worked with leading institutions including AU Small Finance Bank, Fincare Small Finance Bank, MetLife India Insurance, Pivot Training Pvt. Ltd., ING Vysya Life Insurance Co. Ltd., and HSBC. He joins as a full-time employee of the Bank.",
            "Sentiment": "positive",
            "PublishDate": 1761225183510,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suryoday Small Finance Bank Board to Meet on November 6 for Q2 Results and Fund-Raising Plans",
            "Summary": "Suryoday Small Finance Bank will hold a Board of Directors meeting on November 6, 2025, to consider and approve the unaudited financial results for the quarter and half-year ended September 30, 2025. The board will also discuss raising funds through various modes including Preferential Allotment, Qualified Institutions Placement, or Private Placement by issuing equity shares, equity linked securities, warrants, or other eligible securities. Additionally, the board will consider issuing debt instruments such as bonds and non-convertible debentures. Both fund-raising and debt issuance proposals are subject to shareholder approval and regulatory approvals. The trading window for designated persons and connected individuals remains closed until 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1761203180851,
            "Source": "corporate_action"
        },
        {
            "Title": "Suryoday Small Finance Bank Receives RBI Approval for Executive Director's Revised Remuneration",
            "Summary": "Suryoday Small Finance Bank received RBI approval for revised remuneration of its Executive Director. The approval covers fixed remuneration for FY 2025-26 and variable pay for FY 2024-25, staying within limits approved by shareholders at the 17th Annual General Meeting held on September 11, 2025. The RBI granted approval through its letter dated October 20, 2025, in accordance with Regulation 35B of the Banking Regulation Act, 1949.",
            "Sentiment": "positive",
            "PublishDate": 1761027287510,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBI Approves Baskar Babu Ramachandran's Re-appointment as Suryoday Small Finance Bank MD & CEO for Three Years",
            "Summary": "The Reserve Bank of India has approved the re-appointment of Baskar Babu Ramachandran as Managing Director & CEO of Suryoday Small Finance Bank Limited for a three-year term from January 23, 2026 to January 22, 2029. The 56-year-old executive has been serving as MD & CEO since January 23, 2017, after promoting Suryoday Micro Finance Private Limited in 2008, which later converted into the bank in January 2017. Ramachandran holds a Bachelor's degree in Mechanical Engineering from the University of Madras and an MBA from Pondicherry University. He has extensive experience in the banking and finance sector, having previously worked with GE Capital Transportation Financial Services, HDFC Bank, and Cholamandalam. The bank confirmed that Ramachandran is not related to any other Director or Key Managerial Personnel and is not debarred from holding directorial positions by any regulatory authorities.",
            "Sentiment": "positive",
            "PublishDate": 1760638004496,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports 23% Growth in Advances, Receives ₹314 Crore CGFMU Claim",
            "Summary": "Suryoday Small Finance Bank reported gross advances of ₹11,544 crore, marking 23% year-on-year growth, while disbursements increased 49% to ₹2,430 crore. Total deposits grew 35% to ₹11,991 crore, with retail deposits rising 45% and CASA deposits surging 57%. The bank's CASA ratio improved to 20.7% from 17.9% in the previous year. However, the GNPA ratio increased to 9.3% from 2.9% in the prior year period. The bank received ₹314 crore from CGFMU, representing 100% of its claim, which is expected to improve the Provision Coverage Ratio to approximately 62% and reduce Net NPA to around 3.8%. Over 90% of the bank's Net NPA is covered under CGFMU, with 98% of the Inclusive Finance portfolio protected under the Credit Guarantee Scheme.",
            "Sentiment": "positive",
            "PublishDate": 1759501314480,
            "Source": "earnings"
        },
        {
            "Title": "Suryaoday Small Finance Bank Receives Full Claim of 3.14 Billion Rupees from NCGTC",
            "Summary": "Suryaoday Small Finance Bank has received its full claim amount of 3.14 billion rupees from NCGTC. The bank successfully recovered the complete claimed amount from the organization.",
            "Sentiment": "positive",
            "PublishDate": 1759245038963,
            "Source": "stock"
        },
        {
            "Title": "Suryoday Small Finance Bank Partners with Paytm to Launch Credit Line on UPI",
            "Summary": "Suryoday Small Finance Bank has partnered with Paytm to launch 'Postpaid', a credit line on UPI that allows customers to spend now and pay the following month. The service provides up to 30 days of interest-free credit and enables consumers to make instant payments across any merchant UPI QR code or online platform. Users can pay for recharges, bill payments, bookings, and shopping through this facility. The service is currently being rolled out to selected customers based on their spending behavior and will be expanded to more consumers. The partnership leverages Paytm's technology for secure, real-time payments while providing merchants with universal acceptance and instant settlement through UPI payment flow.",
            "Sentiment": "positive",
            "PublishDate": 1758097625350,
            "Source": "order&deals"
        },
        {
            "Title": "Suryoday Small Finance Bank Shareholders Approve All Resolutions at 17th AGM",
            "Summary": "Suryoday Small Finance Bank held its 17th Annual General Meeting on September 11, 2025, where shareholders approved all seven resolutions through e-voting. The approved resolutions included adoption of audited financial statements for the year ended March 31, 2025, re-appointment of Mr. Ranjit Jayant Shah as Director, and appointment of M/s. Gokhale & Sathe as Joint Statutory Auditors alongside existing auditors M/s. Mukund M. Chitale & Co. Shareholders also approved the re-appointment of Mr. Baskar Babu Ramachandran as Managing Director & CEO for three years from January 23, 2026 to January 22, 2029, and his remuneration for Financial Year 2025-26. Additionally, remuneration for Whole-time Director Mr. Hemant Premchand Shah for 2025-26 and appointment of M/s. Tushar Shridharani & Associates LLP as Secretarial Auditors were approved. The meeting was attended by 44 shareholders through video conferencing, with 105,464 total shareholders on record date.",
            "Sentiment": "positive",
            "PublishDate": 1757697046356,
            "Source": "corporate_action"
        },
        {
            "Title": "Suryoday Small Finance Bank Launches FD-Backed Credit Cards with RuPay Integration",
            "Summary": "Suryoday Small Finance Bank introduced secured credit cards backed by fixed deposits, offering two variants - RuPay Select and RuPay Platinum. The cards provide 0.5% cashback on all transactions up to ₹3,000 per billing cycle with no annual fees. Customers need minimum FDs of ₹1,000 for Platinum and ₹1,11,500 for Select variants. The product targets first-time users, homemakers, and retirees to access formal credit. The bank offers FD interest rates up to 8.40%, higher than typical 6.5%-7.5% rates from other small finance banks. Cards feature instant virtual issuance, UPI integration, and RuPay lifestyle offers.",
            "Sentiment": "positive",
            "PublishDate": 1756817053393,
            "Source": "stock"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports 20% Loan Growth, 39% Deposit Growth in Q1 FY26",
            "Summary": "Suryoday Small Finance Bank reported gross advances of ₹10,846 crore with 20% year-on-year growth and deposits of ₹11,312 crore with 39% year-on-year growth for Q1 FY26. The bank's GNPA stood at 8.5% and NNPA at 5.6%, with ₹584 crore receivable under the CGFMU scheme covering almost 100% of GNPA along with existing provisions. Digital deposits reached ₹1,000 crore with a daily run rate of ₹3 crore. The bank experienced slippages of ₹278 crore compared to ₹308 crore in the previous quarter. Current bucket collection efficiency improved from 97.5% in April to 98.4% in June 2025. Management expects credit costs of around 1.2% for the year and anticipates slippages to reduce by ₹50-70 crore in the next quarter. The bank maintains a 55-45 mix between secured and unsecured assets, with retail deposits comprising 82% of the deposit base.",
            "Sentiment": "positive",
            "PublishDate": 1753856505267,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Gets RBI Approval for Statutory Auditor Appointments for FY 2025-26",
            "Summary": "Suryoday Small Finance Bank Limited received RBI approval for the re-appointment of M/s. Mukund M. Chitale & Co. as Statutory Auditors for FY 2025-26 and the appointment of M/s. Gokhale & Sathe as Joint Statutory Auditors for the same period. The Board of Directors had recommended the re-appointment of Mukund M. Chitale & Co. for their second year at a meeting held on May 8, 2025. The Board also recommended names for Joint Statutory Auditor appointment at a meeting on June 19, 2025, as required by RBI circular. The RBI granted approval through a letter dated July 28, 2025. Both auditors will be termed as Joint Statutory Auditors. The bank will obtain necessary approvals from the Board of Directors and shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1753711467197,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suryoday Small Finance Bank Publishes Q1 Financial Results in Newspapers",
            "Summary": "Suryoday Small Finance Bank Limited has published its unaudited financial results for the quarter ended June 30, 2025 in national and regional newspapers. The results were published in Business Standard newspaper in English and Mumbai Lakshdeep newspaper in Marathi on July 26, 2025. The bank submitted copies of these newspaper advertisements to NSE and BSE exchanges, with the information also made available on the bank's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753516318891,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Mixed Q1 Results with Revenue Growth but Profit Decline and Rising NPAs",
            "Summary": "Suryoday Small Finance Bank reported Q1 results showing revenue of 4.95 billion rupees, up from 4.9 billion rupees year-over-year, representing modest growth. However, net profit declined significantly to 353 million rupees from 701 million rupees in the same period last year. The bank's asset quality deteriorated with gross non-performing assets rising to 8.46% from 7.16% quarter-over-quarter, while net non-performing assets increased to 5.64% from 4.58% in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753361771444,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Mixed Q1 FY2026 Results",
            "Summary": "Suryoday Small Finance Bank experienced growth in key areas during Q1 FY2026, with gross advances increasing 20% year-over-year to ₹10,846 crore and total deposits rising 39% to ₹11,312 crore. Loan disbursements saw a 30% increase to ₹2,261 crore, while CASA deposits grew 39% to ₹2,003 crore. However, the bank faced challenges with asset quality as gross NPAs rose to 8.5% from 2.7% year-over-year. The bank received ₹56 crore under the CGFMU scheme for claim settlements.",
            "Sentiment": "neutral",
            "PublishDate": 1751554136000,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q1 Deposit and Advance Growth",
            "Summary": "Suryoday Small Finance Bank has reported significant growth in its first quarter results. Total deposits increased by 39% year-over-year to 113.12 billion rupees. Gross advances also grew by 20% year-over-year, reaching 108.46 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1751545712000,
            "Source": "default"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q4 Financial Results",
            "Summary": "Suryoday Small Finance Bank has reported its Q4 financial results. The bank's net loss narrowed to 338 million rupees, compared to 608 million rupees year-over-year and 333 million rupees quarter-over-quarter. Revenue increased to 4.7 billion rupees from 4.45 billion rupees year-over-year. However, the bank's asset quality deteriorated, with Gross Non-Performing Assets (GNPA) rising to 7.16% from 5.53% quarter-over-quarter, and Net Non-Performing Assets (NNPA) increasing to 4.58% from 3.13% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746749077000,
            "Source": "default"
        },
        {
            "Title": "Suryoday Small Finance Bank: Q4 Loss of Rs 34 Crore, Asset Quality Deteriorates",
            "Summary": "Suryoday Small Finance Bank reported a net loss of Rs 34 crore in Q4 FY23, compared to a profit of Rs 61 crore in Q4 FY22. Gross NPAs rose to 7.16% from 2.94% year-on-year. Pre-provision operating profit fell 63% to Rs 47 crore. Total provisions increased to Rs 93 crore.",
            "Sentiment": "negative",
            "PublishDate": 1746719704000,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q4 FY23 Results",
            "Summary": "Suryoday Small Finance Bank has released its Q4 FY23 financial results. The bank reported a net loss of 338 million rupees, an improvement from the 608 million rupee loss in the same quarter last year. Revenue increased to 4.7 billion rupees from 4.45 billion rupees year-over-year. However, asset quality deteriorated, with Gross Non-Performing Assets (GNPA) rising to 7.16% from 5.53% in the previous quarter, and Net Non-Performing Assets (NNPA) increasing to 4.58% from 3.13% quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746715781000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank to Consider Q4 Results on May 8",
            "Summary": "Suryoday Small Finance Bank has announced that it will consider its fourth quarter (Q4) financial results on May 8. This indicates that the bank is preparing to disclose its performance for the last quarter of the fiscal year, which is typically an important event for investors and stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1745507034000,
            "Source": "default"
        },
        {
            "Title": "Suryoday Small Finance Bank Projects 10% Decrease in Disbursements by March 2025",
            "Summary": "Suryoday Small Finance Bank has forecasted a 10% year-over-year decrease in disbursements for the fiscal year ending March 31, 2025. This projection indicates a potential slowdown in the bank's lending activities or a more conservative approach to credit disbursement.",
            "Sentiment": "negative",
            "PublishDate": 1743672544000,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Projects Strong Growth in Advances and Deposits",
            "Summary": "Suryoday Small Finance Bank anticipates significant growth in its financial metrics by March 31, 2025. The bank projects a 19% year-over-year increase in gross advances and a 36% year-over-year growth in total deposits.",
            "Sentiment": "positive",
            "PublishDate": 1743672479000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank: CEO's Share Purchase Boosts Stock Price",
            "Summary": "Suryoday Small Finance Bank's stock surged nearly 7% after CEO Baskar Babu Ramachandran bought shares worth ₹50 lakh from the open market. The purchase increased promoter group holding to 22.44% and Ramachandran's individual holding to 5.18%. Despite a 41.8% decline in Q3 net profit, the bank saw a 9.2% increase in net interest income.",
            "Sentiment": "positive",
            "PublishDate": 1742277549000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suryoday Small Finance Bank: CEO Increases Stake, Promoter Holding Rises",
            "Summary": "Suryoday SFB's CEO Baskar Babu Ramachandran purchased 1.5 lakh shares from the open market, increasing promoter group holding to 22.44% from 22.30%. Ramachandran's individual stake rose to 5.18% from 5.04%. The bank's Q3 FY25 results showed a 41.8% decline in net profit, but 9.2% growth in net interest income. Gross NPAs increased to 5.53%.",
            "Sentiment": "neutral",
            "PublishDate": 1742218319000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suryoday Small Finance Bank Discloses Exposure to Aviom India Housing",
            "Summary": "Suryoday Small Finance Bank has reported an outstanding exposure of 116.6 million rupees to Aviom India Housing. This disclosure provides insight into the bank's lending portfolio and potential risk exposure.",
            "Sentiment": "neutral",
            "PublishDate": 1738159947000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suryoday Small Finance Bank: Asset Quality Deterioration and Lowered FY25 Guidance",
            "Summary": "Suryoday Small Finance Bank has revised its FY25 guidance downward, projecting higher Gross NPA at <6% (from <2.5%), slower loan growth at 22-25% (from 30-35%), and reduced ROE at 10-11% (from 14-16%). Q3 results show increased deposits but lower disbursals-to-AUM ratio.",
            "Sentiment": "negative",
            "PublishDate": 1737687355000,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q3 Financial Results",
            "Summary": "Suryoday Small Finance Bank has released its Q3 financial results. The bank's net profit decreased to 333 million rupees from 572 million rupees year-over-year. Interest earned increased to 4.88 billion rupees from 4.1 billion rupees year-over-year. The bank's Gross Non-Performing Assets (GNPA) rose to 5.53% from 3.03% quarter-over-quarter, while Net Non-Performing Assets (NNPA) increased to 3.13% from 0.80% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737678250000,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q3 FY24 Financial Results",
            "Summary": "Suryoday Small Finance Bank has announced its Q3 financial results. The bank's net profit decreased to 333 million rupees from 572 million rupees year-over-year. Interest earned increased to 4.88 billion rupees from 4.1 billion rupees year-over-year. The bank's asset quality deteriorated, with GNPA rising to 5.53% from 3.03% quarter-over-quarter, and NNPA increasing to 3.13% from 0.80% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737641819000,
            "Source": "earnings"
        },
        {
            "Title": "Suryoday Small Finance Bank to Consider Q3 Results on January 23",
            "Summary": "Suryoday Small Finance Bank has announced that it will consider its financial results for the third quarter (Q3) of the current fiscal year on January 23.",
            "Sentiment": "neutral",
            "PublishDate": 1736165836000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q3 FY25 Business Update",
            "Summary": "Suryoday Small Finance Bank has released its Q3 FY25 business update. The bank's gross advances have grown to ₹9,563 crore, marking a 26% year-on-year increase and a 2% quarter-on-quarter growth. Additionally, the bank's CASA (Current Account Savings Account) ratio has improved to 19.5%, up from 18.5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1736131575000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Increased Q2 Provisions",
            "Summary": "Suryoday Small Finance Bank has reported a significant increase in its provisions for the second quarter. The bank's provisions rose to 667 million rupees, up from 267 million rupees in the previous quarter, marking a substantial quarter-over-quarter increase.",
            "Sentiment": "negative",
            "PublishDate": 1729777520000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q2 Asset Quality Metrics",
            "Summary": "Suryoday Small Finance Bank has released its Q2 asset quality figures. The Gross Non-Performing Assets (GNPA) ratio increased to 3.03% from 2.84% in the previous quarter. The Net Non-Performing Assets (NNPA) ratio also rose to 0.80% from 0.47% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729777509000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q2 Interest Earned Growth",
            "Summary": "Suryoday Small Finance Bank has reported its second quarter interest earned at 5.07 billion rupees, compared to 3.75 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729777495000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Q2 Net Profit",
            "Summary": "Suryoday Small Finance Bank has reported a net profit of 454 million rupees for the second quarter. This represents a year-over-year decrease from 503 million rupees in the same quarter last year, but an increase from 701 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729777486000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank Schedules Q2 Results Review",
            "Summary": "<p><span class=\"neutral\">Suryoday Small Finance Bank</span> has announced a <b>board meeting</b> on <span class=\"neutral\">October 24</span> to <span class=\"neutral\">consider and review</span> the <b>financial results</b> for the <span class=\"neutral\">second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728549777000,
            "Source": "result"
        },
        {
            "Title": "Suryoday Small Finance Bank Reports Strong Q2 FY25 Growth",
            "Summary": "<p>Suryoday Small Finance Bank has announced its Q2 FY25 performance, showing <span class='positive'>significant growth</span> in both gross advances and total deposits. Gross advances reached <b>₹9,360 crore</b>, with a <span class='positive'>4% quarter-on-quarter (QoQ) growth</span> and a <span class='positive'>35% year-on-year (YoY) growth</span>. Total deposits amounted to <b>₹8,851 crore</b>, demonstrating a <span class='positive'>9% QoQ growth</span> and a <span class='positive'>39% YoY growth</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728026079000,
            "Source": "result"
        },
        {
            "Title": "Suryoday SFB: Asset Quality Worsens in Q2, Stock Slips",
            "Summary": "<p>Suryoday Small Finance Bank's shares <span class='negative'>fell 3.43%</span> after Q2FY25 results showed <span class='negative'>deteriorating asset quality</span>. <b>GNPA</b> <span class='negative'>increased to 2.92%</span> from 2.67% in Q1FY25. Disbursements <span class='negative'>dropped 7% Q-o-Q</span> to Rs 1,626 crore. However, gross advances <span class='positive'>grew 4% Q-o-Q</span> to Rs 9,360 crore, and deposits <span class='positive'>increased 9%</span> to Rs 8,851 crore. <b>CASA</b> <span class='positive'>improved by 10% Q-o-Q</span> to Rs 1,581 crore.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728019690000,
            "Source": "result"
        }
    ]
}