{
    "Symbol": "SURYAROSNI",
    "ISIN": "INE335A01020",
    "News": [
        {
            "Title": "Surya Roshni Q3FY26 Results: Revenue Up 3.19%",
            "Summary": "Surya Roshni Limited reported Q3FY26 revenue of ₹1,92,733 lakhs, up 3.19% YoY. Net profit declined to ₹7,964 lakhs from ₹8,987 lakhs in Q3FY25. Steel Pipe & Strips segment contributed ₹1,45,100 lakhs to revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1770802273117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Surya Roshni Board Meet on Feb 11 for Q3FY26 Results",
            "Summary": "Surya Roshni Limited has scheduled a board meeting on February 11, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26. Trading window remains closed until February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770127089061,
            "Source": "stocks"
        },
        {
            "Title": "Surya Roshni Secures ₹168.71 Cr Pipe Supply Order",
            "Summary": "Surya Roshni Ltd has secured a significant ₹168.71 crores order for supplying submerged arc welded M.S pipes in Gujarat, with completion scheduled by June 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765376855915,
            "Source": "co_actions_results"
        },
        {
            "Title": "Surya Roshni Secures ₹168.71 Crore Order for Steel Pipes Supply",
            "Summary": "Surya Roshni Limited received a domestic order worth ₹168.71 crore (including GST) for supply of submerged arc welded mild steel pipes in Gujarat territory. The order is to be executed by June 2026, representing a significant business win for the steel pipes manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1765358119646,
            "Source": "order&deals"
        },
        {
            "Title": "Surya Roshni Pays Rs 2.8 Lakh Fine Each to BSE and NSE for Delayed Independent Director Appointment",
            "Summary": "Surya Roshni Limited paid fines of Rs 2,80,000 each to BSE and NSE for non-compliance with Regulation 17(1) of Listing Regulations for 56 days due to delayed appointment of independent director. The company appointed Mr. Ravi Kant Gupta as Additional Independent Director on July 17, 2025, and has applied for waiver of the penalty citing genuine challenges in identifying suitable candidates.",
            "Sentiment": "neutral",
            "PublishDate": 1764655786921,
            "Source": "corporate_governance"
        },
        {
            "Title": "Surya Roshni Fined ₹1.6 Lakh by BSE and NSE for Delayed Independent Director Appointment",
            "Summary": "Surya Roshni Limited received fines totaling ₹1.6 lakh from BSE and NSE for 16-day delayed compliance with regulation 17(1) regarding independent director appointment during the quarter ended September 30, 2025. The company appointed Ravi Kant Gupta as Additional Independent Director on July 17, 2025, and has applied for waiver of the imposed fine citing unintentional delay in identifying suitable candidates.",
            "Sentiment": "negative",
            "PublishDate": 1764409384992,
            "Source": "corporate_governance"
        },
        {
            "Title": "Surya Roshni Secures Major Order Worth ₹1.05 Billion",
            "Summary": "Surya Roshni has secured a significant order valued at ₹1.05 billion. This substantial contract win represents a major business development for the company and its stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1764028962350,
            "Source": "order&deals"
        },
        {
            "Title": "Surya Roshni Reports Strong Q2 Performance with 21% Revenue Growth and 117% PAT Jump",
            "Summary": "Surya Roshni Limited delivered consolidated revenue growth of 21% year-on-year to INR 1,845 crores in Q2FY26, with PAT more than doubling by 117% to INR 74 crores driven by better realization and product mix. The company maintains zero-debt status with net cash surplus of INR 246 crores and declared interim dividend of INR 2.5 per share, while revising full-year steel volume guidance to 10 lakh tons.",
            "Sentiment": "positive",
            "PublishDate": 1763455463093,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Sets Steel Production Target at 1 Million Tons, Projects Revenue of INR 1,900 Crores",
            "Summary": "Surya Roshni has updated its steel production target to around 1 million tons for the year. The company anticipates full-year revenue of approximately INR 1,900 crores and EBITDA around INR 180 crores. The company reports strong order book visibility with INR 150 crores for the lighting segment and INR 750 crores for the steel segment.",
            "Sentiment": "positive",
            "PublishDate": 1762918661018,
            "Source": "stock"
        },
        {
            "Title": "Surya Roshni Reports Strong Q2 Performance with 23% Revenue Growth and Approves Dividend",
            "Summary": "Surya Roshni delivered robust quarterly results with revenue rising to 18.4 billion rupees from 15 billion rupees year-over-year. The company's consolidated net profit more than doubled to 742 million rupees compared to 342 million rupees in the same period last year. EBITDA increased significantly to 1.18 billion rupees from 762 million rupees, while EBITDA margin improved to 6.4% from 5.0%. The company's board approved a dividend of 2.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1762853046397,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Targets Growth Through Infrastructure Demand and Premium Product Focus",
            "Summary": "Surya Roshni expects sustained demand from government infrastructure spending, housing initiatives, and industrial capital expenditure. The company is focusing on premium pipes, energy-efficient lighting products, and exports as key strategies to enhance profitability.",
            "Sentiment": "positive",
            "PublishDate": 1755102868962,
            "Source": "stock"
        },
        {
            "Title": "Surya Roshni Limited Releases Audio Recording of Earnings Call for Quarter Ended June 30, 2025",
            "Summary": "Surya Roshni Limited has made available an audio recording of their earnings call held on August 13, 2025, at 4:30 PM IST. The call discussed the company's unaudited financial results and operational performance for the quarter ended June 30, 2025. The audio recording can be accessed through a link provided on the company's website. The earnings call was previously scheduled and communicated to stock exchanges on August 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755097747112,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Reports Q1 Results, Announces Leadership Changes and Dividend Payment",
            "Summary": "Surya Roshni Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 1,60,441 lakhs compared to Rs. 1,89,308 lakhs in the same quarter last year, with profit for the period at Rs. 3,360 lakhs versus Rs. 9,241 lakhs previously. The Board set September 5, 2025 as the record date for final dividend payment of Rs. 3.00 per share for FY 2024-25 and scheduled the 52nd Annual General Meeting for September 18, 2025. Key leadership changes include the resignation of CEO for Lighting and Consumer Durables Jitendra J Agrawal, and appointments of Kumar Gaurav Jain as CEO-Steel Division and Vasu Mitra Pandey as CEO-Lighting Division. The company also appointed Anjali Yadav & Associates as Secretarial Auditor for five years from 2025-26 to 2029-30, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755081492867,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Schedules Earnings Conference Call for Quarter Ended June 30, 2025",
            "Summary": "Surya Roshni Limited has announced an earnings conference call scheduled for August 13, 2025, at 4:30 PM IST to discuss financial and operational performance for the quarter ended June 30, 2025. The company will also present an investor presentation on unaudited financial results on the same day following a board meeting. Key participants include Managing Director Raju Bista, Executive Directors Naresh Singhal and Kumar Gaurav Jain, CFO & Company Secretary B.B. Singal, and COO Vasumitra Pandey. The call will be accessible through multiple international dial-in numbers and includes toll-free options for various countries.",
            "Sentiment": "neutral",
            "PublishDate": 1754643674084,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Schedules Board Meeting for August 13 to Approve Quarterly Results and Dividend Record Date",
            "Summary": "Surya Roshni Limited has scheduled a Board of Directors meeting on August 13, 2025, with three key agenda items. The board will consider and approve standalone and consolidated unaudited quarterly results for the first quarter ended June 30, 2025. Directors will also fix the record date for final dividend distribution for financial year 2024-25 and determine the date, time, and venue for the company's 52nd Annual General Meeting. The trading window for company shares has been closed since July 1, 2025, and will remain closed until August 15, 2025, which is 48 hours after the board meeting concludes.",
            "Sentiment": "neutral",
            "PublishDate": 1754295657253,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Reaffirms A1+ Rating for Surya Roshni's Rs 100 Crore Bank Facilities",
            "Summary": "ICRA Limited has reaffirmed its short-term rating of [ICRA]A1+ for Surya Roshni Limited's bank facilities worth Rs 100 crores, covering non-fund based facilities including bank guarantees and letters of credit. The rating reaffirmation reflects the company's strong operational profile with established market position in the electric resistance welded pipes industry, healthy financial risk profile, and comfortable liquidity position. In FY2025, Surya Roshni reported turnover of Rs 7,435 crores with operating margin of 7.8%, while revenue from lighting business grew 8% to Rs 1,690 crores with 9% operating margin. The company maintains a conservative capital structure with nil term debt and minimal working capital borrowings of Rs 3.1 crores as of March 31, 2025. ICRA noted the company's strong liquidity position, healthy debt coverage metrics with interest cover of 27.9 times, and robust free cash flow generation that enabled debt prepayment.",
            "Sentiment": "positive",
            "PublishDate": 1753507009504,
            "Source": "stock"
        },
        {
            "Title": "Surya Roshni Secures ₹175 Crore Contract",
            "Summary": "Surya Roshni has secured a contract worth ₹175 crores. The company announced this contract win, though specific details about the nature of the contract, timeline, or client were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1753258164220,
            "Source": "order&deals"
        },
        {
            "Title": "Surya Roshni: Wins ₹75.4 Crore Order from Gujarat Gas",
            "Summary": "Surya Roshni secured orders worth ₹75.4 crore from Gujarat Gas Ltd to supply 3LPE coated ERW steel pipes for multiple locations. The order is to be executed in 34 weeks. The company's shares gained 7.4% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750828941000,
            "Source": "order&deals"
        },
        {
            "Title": "Surya Roshni Secures 75.40 Crore Rupee Order from Gujarat Gas",
            "Summary": "Surya Roshni has received an order worth 75.40 crore rupees from Gujarat Gas. The nature of the order and its specific details are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750823140000,
            "Source": "default"
        },
        {
            "Title": "Surya Roshni to Consider Q4 Results on May 14",
            "Summary": "Surya Roshni has announced that it will consider its fourth quarter (Q4) financial results on May 14. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746704394000,
            "Source": "default"
        },
        {
            "Title": "Surya Roshni Secures 1.16 Billion Rupee Order from GAIL",
            "Summary": "Surya Roshni has received an order worth 1.16 billion rupees (approximately $14 million USD) from GAIL (Gas Authority of India Limited). This significant order is likely for the supply of steel pipes or related products, as Surya Roshni is known for manufacturing steel pipes and lighting products.",
            "Sentiment": "positive",
            "PublishDate": 1743684465000,
            "Source": "order&deals"
        },
        {
            "Title": "Surya Roshni Achieves Record Monthly Sales Volume in Steel Pipes Segment",
            "Summary": "Surya Roshni has announced its highest-ever monthly sales volume of 100,239 metric tonnes. Additionally, the company's Steel Pipes and Strips segment recorded a volume of 259,000 metric tonnes in Q4 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1743497344000,
            "Source": "result"
        },
        {
            "Title": "Surya Roshni Reports Q3 EBITDA and Margin",
            "Summary": "Surya Roshni has reported its Q3 financial results. The company's EBITDA for the quarter stood at 1.49 billion rupees, compared to 1.54 billion rupees in the same quarter last year. Despite a slight decrease in EBITDA, the EBITDA margin improved marginally to 8.01% from 7.98% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738835036000,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Reports Decrease in Q3 Revenue",
            "Summary": "Surya Roshni, an Indian company, has reported its third-quarter revenue figures. The company's revenue for Q3 stood at 18.7 billion rupees, showing a decrease compared to the same period last year when it reported 19.4 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1738834979000,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Reports Stable Q3 Net Profit",
            "Summary": "Surya Roshni, an Indian company, has reported a consolidated net profit of 900 million rupees for the third quarter, compared to 901 million rupees in the same period last year. This indicates a marginal year-over-year decrease of 1 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738834957000,
            "Source": "earnings"
        },
        {
            "Title": "Surya Roshni Secures ₹81.47 Crore Order from BPCL for CGD Project",
            "Summary": "Surya Roshni has been awarded a significant order worth ₹81.47 crore from Bharat Petroleum Corporation Limited (BPCL) for a City Gas Distribution (CGD) project. The project is set to be implemented on a pan-India basis, indicating a wide-ranging scope for the company's services in the gas distribution sector.",
            "Sentiment": "positive",
            "PublishDate": 1736440528000,
            "Source": "order&deals"
        },
        {
            "Title": "Surya Roshni: Ex-Bonus Trading and Record Date for 1:1 Bonus Share Issue",
            "Summary": "Surya Roshni begins trading ex-bonus today, with January 1, 2025, set as the record date for a 1:1 bonus share issue. The company will allot 10,88,17,948 new equity shares by January 2, with listing scheduled for January 3. This marks Surya Roshni's first-ever bonus share issuance.",
            "Sentiment": "positive",
            "PublishDate": 1735700229000,
            "Source": "corporate_action"
        },
        {
            "Title": "Surya Roshni: 1:1 Bonus Share Record Date Set for January 1, 2025",
            "Summary": "Surya Roshni has set January 1, 2025, as the record date for its 1:1 bonus share issue. The company will allot 10,88,17,948 new equity shares, doubling the total number of shares. This is Surya Roshni's first-ever bonus share issuance. The bonus shares will be allotted by January 2 and listed on January 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1735610707000,
            "Source": "corporate_action"
        },
        {
            "Title": "Surya Roshni Secures 215 Crore Rupee Order",
            "Summary": "Surya Roshni has announced winning a significant order valued at 215 crore rupees. This order represents a substantial business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1732700217000,
            "Source": "order&deals"
        },
        {
            "Title": "Surya Roshni: First-Ever Bonus Share Issue Amid Q2 Decline",
            "Summary": "Surya Roshni announced a 1:1 bonus share issue and a ₹2.5 per share dividend. Q2 results show revenue down 20%, EBITDA down 40%, and net profit down 55% year-on-year. The company cites declining HR Steel prices and dampened demand for the performance drop.",
            "Sentiment": "neutral",
            "PublishDate": 1731578947000,
            "Source": "corporate_action"
        },
        {
            "Title": "Surya Roshni Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Surya Roshni, an Indian company, has reported its financial results for the second quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 762 million rupees from 1.4 billion rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 5% from 7.17% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731576976000,
            "Source": "result"
        },
        {
            "Title": "Surya Roshni Reports Q2 Revenue Decline",
            "Summary": "Surya Roshni, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 15 billion rupees, down from 19.1 billion rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731576848000,
            "Source": "result"
        },
        {
            "Title": "Surya Roshni Reports Significant Drop in Q2 Net Profit",
            "Summary": "Surya Roshni, an Indian company, has reported a consolidated net profit of 342 million rupees for the second quarter, marking a substantial decrease from 760 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731576739000,
            "Source": "result"
        },
        {
            "Title": "Surya Roshni to Consider Bonus Share Issue",
            "Summary": "Surya Roshni Limited has announced that its board of directors will meet on November 14 to consider a proposal for issuing bonus shares to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730965692000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukul Mahavir Agrawal Reduces Stake in Surya Roshni",
            "Summary": "<p>Investor <span class='neutral'>Mukul Mahavir Agrawal</span> has <span class='negative'>decreased</span> his stake in <span class='neutral'>Surya Roshni</span> from <b>1.38%</b> to <b>1.01%</b> during the second quarter of the financial year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728891323000,
            "Source": "normal_news"
        }
    ]
}