{
    "Symbol": "SURYALAXMI",
    "ISIN": "INE713B01026",
    "News": [
        {
            "Title": "Suryalakshmi Cotton Mills Q3FY26 Results",
            "Summary": "Suryalakshmi Cotton Mills reported Q3FY26 net profit of ₹52.12 lacs vs ₹91.72 lacs in Q3FY25. Revenue declined to ₹18,359.52 lacs from ₹19,351.78 lacs YoY.",
            "Sentiment": "negative",
            "PublishDate": 1770826034350,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suryalakshmi Cotton Mills Board Meet on Feb 11, 2026",
            "Summary": "Suryalakshmi Cotton Mills has scheduled a board meeting for February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1-13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769594276253,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedant Agarwal Transfers 1,194,000 Suryalakshmi Cotton Mills Shares to L.N. Agarwal Family Trust",
            "Summary": "Vedant Agarwal gifted 1,194,000 equity shares (6.35% of total share capital) of Suryalakshmi Cotton Mills Limited to L.N. Agarwal Family Trust through inter-se transfer on November 25, 2025. The transaction reduces Vedant Agarwal's holding from 12.35% to 6.00% while keeping the shares within the promoter group structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764161914502,
            "Source": "corporate_action"
        },
        {
            "Title": "L.N. Agarwal Family Trust Acquires 11.94 Lakh Shares in Suryalakshmi Cotton Mills Through Gift Transfer",
            "Summary": "L.N. Agarwal Family Trust acquired 11,94,000 equity shares (6.35% stake) in Suryalakshmi Cotton Mills Limited from Mr. Vedant Agarwal through a gift deed transaction. This inter-se transfer among promoters falls under SEBI exemption regulations, with the aggregate promoter group holding remaining unchanged at 60.93%.",
            "Sentiment": "neutral",
            "PublishDate": 1763527589762,
            "Source": "corporate_action"
        },
        {
            "Title": "Suryalakshmi Cotton Mills Reports Q2 Profit of Rs 30.89 Lakhs",
            "Summary": "Suryalakshmi Cotton Mills Limited reported a profit of Rs 30.89 lakhs for the second quarter ended September 30, 2025, with total income of Rs 19,448.85 lakhs. The company's Board approved the unaudited financial results along with an unqualified limited review report from statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1763115719772,
            "Source": "earnings"
        },
        {
            "Title": "Suryalakshmi Cotton Mills Shareholders Approve Re-appointment of Paritosh Agarwal as Managing Director",
            "Summary": "Suryalakshmi Cotton Mills Limited shareholders approved the re-appointment of Sri. Paritosh Agarwal as Managing Director for a five-year term from June 21, 2025 to June 20, 2030 at the 62nd Annual General Meeting held on September 30, 2025. The Board of Directors had previously approved the re-appointment based on the recommendation of the Nomination and Remuneration Committee. Paritosh Agarwal has extensive experience in the textile industry with expertise in marketing, exports and production. He played a major role in setting up the company's Denim Division and developing export business. He was involved in establishing the 10 million meters Denim plant at Ramtek, Maharashtra in 1997, which now has a capacity of 40 million meters. Agarwal is the son of Sri. L.N. Agarwal, Chairman and Managing Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1759239111047,
            "Source": "corporate_governance"
        },
        {
            "Title": "Multiple Companies Report Mixed Quarterly Results and Regulatory Filings",
            "Summary": "Several companies released quarterly financial results. Suryalakshmi Cotton Mills reported total income of Rs 718.88 lakhs and net profit of Rs 27.02 lakhs after tax. Phaarmasia Limited posted total income of Rs 17,910.13 lakhs with net profit of Rs 146.03 lakhs after tax. Regency Ceramics Limited showed total income of Rs 672.04 lakhs but reported a net loss of Rs 196.01 lakhs after tax. Sheshadri Industries Limited recorded total income of Rs 785.94 lakhs with net loss of Rs 127.21 lakhs after tax. Lakshmi Finance & Industrial Corporation Limited achieved total income of Rs 546.55 lakhs and net profit of Rs 374.46 lakhs after tax. Additionally, Canara Bank and Muthoot Housing Finance Company Limited issued demand notices under SARFAESI Act for loan recoveries from various borrowers.",
            "Sentiment": "neutral",
            "PublishDate": 1755169737959,
            "Source": "earnings"
        },
        {
            "Title": "Suryalaxmi Cotton Mills Reports 243% Jump in Quarterly Profit, Schedules 62nd AGM",
            "Summary": "Suryalaxmi Cotton Mills Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported a profit of Rs 146.03 lacs compared to Rs 42.54 lacs in the same quarter last year, marking a significant increase. Revenue from operations rose to Rs 17,834.56 lacs from Rs 15,870.30 lacs year-over-year. Total income increased to Rs 17,910.13 lacs from Rs 16,020.55 lacs. Earnings per share improved to Rs 0.78 from Rs 0.23 in the corresponding quarter. The company scheduled its 62nd Annual General Meeting for September 30, 2025, to be conducted through video conferencing. Book closure dates are set from September 23 to September 30, 2025. The results were reviewed by the Audit Committee and received an unqualified limited review report from statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1754906076597,
            "Source": "earnings"
        }
    ]
}