{
    "Symbol": "SUTLEJTEX",
    "ISIN": "INE645H01027",
    "News": [
        {
            "Title": "Sutlej Textiles Reports Q3FY26 Loss of ₹10.96 Crores",
            "Summary": "Sutlej Textiles posted a standalone net loss of ₹10.96 crores in Q3FY26, improving from ₹23.70 crores loss in Q3FY25. Revenue declined to ₹635.51 crores from ₹648.61 crores year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770881827936,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sutlej Textiles Q3 FY26 Earnings Call on Feb 13",
            "Summary": "Sutlej Textiles and Industries Limited has scheduled its Q3 & 9M FY26 earnings conference call for February 13, 2026 at 11:00 AM IST to discuss quarterly financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1770231401979,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sutlej Textiles Reports Q2 FY26 Results with 86% Capacity Utilization and Improved Gross Margins",
            "Summary": "Sutlej Textiles and Industries Limited reported quarterly results with spinning capacity utilization at 86% compared to 91% in the previous year. Stand-alone income decreased 6% year-on-year to INR 642 crores. However, gross margins improved significantly to 46%, up 350 basis points year-on-year. EBITDA stood at Rs. 17.48 crores with margins at 2.7%, while the company reported a loss of Rs. 18 crores. The yarn segment operated at optimal capacity with stable demand, particularly in polyester viscose category. The fiber division maintained healthy performance through cost control and efficiency gains. Home textiles emerged as a highlight showing strong turnaround aided by value-added products and new geographies. The company maintains a debt-to-equity ratio of 0.97x and is focusing on cost optimization, capacity utilization, and enhancing sustainable product offerings. Management noted challenges from volatile raw material prices, geopolitical uncertainties, and shipping disruptions affecting exports to Bangladesh and U.S. tariff uncertainties.",
            "Sentiment": "neutral",
            "PublishDate": 1762845698454,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles Plans Capacity Modernization and Export Recovery Strategy",
            "Summary": "Sutlej Textiles is planning capacity modernization and efficiency upgrades alongside ongoing investments in renewable energy and technical textiles. The company is targeting export recovery through the India-EU FTA and diversifying into value-added yarns. These initiatives are aimed at driving margin expansion and achieving resilient growth amid global market volatility.",
            "Sentiment": "positive",
            "PublishDate": 1762439379986,
            "Source": "stock"
        },
        {
            "Title": "Sutlej Textiles Reports Rs 642 Cr Revenue with Rs 17 Cr EBITDA for Q2FY26",
            "Summary": "Sutlej Textiles and Industries Limited reported standalone total income of Rs 642 crore and EBITDA of Rs 17 crore for Q2FY26, with EBITDA margin at 2.7%. The company posted a net loss of Rs 18 crore with PAT margin at -2.9%. Executive Chairman C.S. Nopany noted that the textile industry continues facing challenges from geopolitical tensions, tariff uncertainties, and weak demand across key markets, along with volatile raw material prices and trade disruptions slowing supply chain recovery. However, he mentioned gradual improvement in market sentiment compared to the previous quarter. The company expects policy support from the government, recently signed FTA with the UK, ongoing discussions with the EU, and push toward value-added manufacturing to strengthen the sector's position. Sutlej Textiles is a leading manufacturer and exporter of value-added dyed yarns with presence in home textiles, having total spinning capacity of 4,15,440 spindles and exports to more than 60 countries.",
            "Sentiment": "negative",
            "PublishDate": 1762434083178,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles Reports Wider Q2 Loss and Revenue Decline",
            "Summary": "Sutlej Textiles & Industries reported a consolidated net loss of 219 million rupees in Q2, compared to a loss of 187.5 million rupees in the same period last year. The company's Q2 revenue declined to 6.4 billion rupees from 6.8 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762414961557,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles Credit Rating Downgraded to IND A- with Negative Outlook",
            "Summary": "India Ratings and Research downgraded Sutlej Textiles and Industries Limited's Long-Term Issuer Rating to IND A- with a Negative Outlook from IND A-. The downgrade reflects expectations of lower-than-expected EBITDA improvement over FY26-FY28, leading to continued elevated net adjusted leverage above 5.0x and low interest coverage of 1.0x-1.75x. This is attributed to planned capex towards modernization, upgradation and value-added products, which would increase debt and leverage over FY26-FY28. The company's bank loan facilities totaling Rs. 13,465.1 million were also downgraded while short-term ratings were affirmed. Despite EBITDA improvement in FY25, it remained volatile over FY22-1QFY26. The capex of around Rs. 6,500 million over FY26-FY30 is discretionary and depends on cash generation, internal accruals, fund infusion and debt tie-ups. The company reported revenue of Rs. 26,832 million in FY25 with EBITDA of Rs. 493 million and EBITDA margins of 1.84%.",
            "Sentiment": "negative",
            "PublishDate": 1761919540353,
            "Source": "stock"
        },
        {
            "Title": "Sutlej Textiles Announces Senior Management Changes with Executive Resignation and Re-designations",
            "Summary": "Sutlej Textiles and Industries Limited announced changes in its senior management personnel. Dinesh Rajpurohit resigned as Executive President of Rajasthan Textile Mills effective October 31, 2025, citing unavoidable personal reasons. To fill the gap, the company re-designated two existing executives: Rohit Arora will oversee Rajasthan Textile Mills and Birla Textile Mills Unit II, while Upendra Kumar Pattnaik will manage Chenab Textile Mills and Birla Textile Mills Unit I, both effective November 1, 2025. Arora brings 26 years of experience in operational excellence and project management with a B.Tech from NIT Jalandhar. Pattnaik is a textile technologist with over 34 years of spinning industry experience. The terms of appointment for both re-designated executives remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1761652418059,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sutlej Textiles Reports Loss of INR 30 Crores in Q1 FY26 Due to Geopolitical Disruptions",
            "Summary": "Sutlej Textiles and Industries reported consolidated total income of INR 610 crores for Q1 FY26, down 8% year-on-year. The company posted an EBITDA of INR 1 crore with 0.2% margin and a loss of INR 30 crores. Operations were significantly impacted by the India-Pakistan conflict, which disrupted the company's largest manufacturing facility in Jammu & Kashmir for over a month, leading to temporary workforce evacuation. The yarn segment contributed INR 562 crores to revenue while home textiles added INR 43 crores. Gross margin declined to 42.4%, down 165 basis points year-on-year, due to elevated input costs for raw cotton and energy, combined with lower yarn selling prices. The company resumed full-scale production at its Kathua unit by July. Domestic sales account for 65% of total sales, with exports at 35%, primarily to Bangladesh. The company is exploring expansion in UK and EU markets for home textiles and evaluating diversification into technical textiles and industrial yarns.",
            "Sentiment": "negative",
            "PublishDate": 1755009085812,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles Reports Rs 610 Cr Revenue in Q1FY26, Operations Disrupted by India-Pakistan Conflict",
            "Summary": "Sutlej Textiles and Industries Limited reported consolidated total income of Rs 610 crores for the quarter ended June 30, 2025, down 11% from Rs 686 crores in the previous quarter. EBITDA declined significantly to Rs 1 crore from Rs 16 crores in Q4FY25, with EBITDA margin falling to 0.2%. The company posted a net loss of Rs 30 crores compared to Rs 13 crores loss in the previous quarter. Operations at the Kathua facility in J&K, contributing 50-55% of overall capacity, were severely impacted due to the India-Pakistan conflict given its proximity to the border. A significant portion of the workforce was temporarily evacuated for safety, though full-scale operations resumed by July. The yarn business segment saw revenue decline to Rs 562 crores from Rs 627 crores, while home textiles revenue dropped to Rs 43 crores from Rs 46 crores. Executive Chairman C.S. Nopany stated the company remained resilient despite exceptional external challenges and expressed cautious optimism for FY26, expecting more stable and growth-oriented performance.",
            "Sentiment": "negative",
            "PublishDate": 1754555169896,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles Reports Widened Q1 Net Loss and Revenue Decline",
            "Summary": "Sutlej Textiles and Industries reported a consolidated net loss of 301 million rupees in Q1, significantly higher than the 114 million rupees loss in the same period last year. The company's revenue declined to 6 billion rupees from 7 billion rupees year-over-year. EBITDA turned negative with a loss of 37 million rupees compared to a gain of 184 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754551738874,
            "Source": "earnings"
        },
        {
            "Title": "C.S. Nopany Appointed Managing Director and Executive Chairman of Sutlej Textiles for Three Years",
            "Summary": "Sutlej Textiles and Industries Limited announced that C.S. Nopany has been appointed as Managing Director and Executive Chairman for a three-year term effective August 1, 2025. The appointment was approved by shareholders at the Annual General Meeting held on July 29, 2025. Nopany relinquished his position as Wholetime Director on July 31, 2025, to take on the new role. He is a Chartered Accountant with a Masters Degree in Science of Industrial Administration from Carnegie Mellon University and has over 34 years of industrial experience across finance, sugar, tea, shipping, textiles, fertilizers, and chemicals. He previously served as president of the Indian Chamber of Commerce. Nopany is related to director Arhant Vikram Nopany, who is his son.",
            "Sentiment": "positive",
            "PublishDate": 1753968352437,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sutlej Textiles & Industries Q4 Results: Revenue Up, Net Loss Narrows",
            "Summary": "Sutlej Textiles & Industries reported Q4 results with improved performance. EBITDA increased to 102M rupees from 87M year-over-year, with EBITDA margin rising to 1.53% from 1.34%. Revenue grew to 6.66B rupees from 6.5B. The company's net loss narrowed to 278M rupees from 309M in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746775869000,
            "Source": "result"
        },
        {
            "Title": "Sutlej Textiles & Industries Reports Q3 Revenue Growth",
            "Summary": "Sutlej Textiles & Industries has reported a revenue of 6.5 billion rupees for the third quarter, compared to 6.1 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738912127000,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles & Industries Reports Q3 EBITDA Improvement",
            "Summary": "Sutlej Textiles & Industries has reported a significant improvement in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company recorded an EBITDA gain of 40 million rupees, compared to a loss of 60 million rupees in the same quarter of the previous year. This represents a positive turnaround in the company's operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1738912115000,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles & Industries Reports Reduced Q3 Net Loss",
            "Summary": "Sutlej Textiles & Industries has reported a consolidated net loss of 257 million rupees for the third quarter, showing an improvement from the 300 million rupees loss in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738912032000,
            "Source": "earnings"
        },
        {
            "Title": "Sutlej Textiles & Industries Reports Q2 EBITDA Improvement",
            "Summary": "Sutlej Textiles & Industries has reported a significant improvement in its Q2 EBITDA, moving from a loss of 354 million rupees in the previous year to a gain of 120 million rupees. The company's Q2 EBITDA margin stands at 1.75%.",
            "Sentiment": "positive",
            "PublishDate": 1731050147000,
            "Source": "result"
        },
        {
            "Title": "Sutlej Textiles Reports Q2 Financial Results",
            "Summary": "Sutlej Textiles & Industries has reported its Q2 consolidated financial results. The company posted a net loss of 188 million rupees, which is an improvement from the 494 million rupees loss in the same quarter last year. However, revenue decreased to 6.8 billion rupees from 7.35 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731050035000,
            "Source": "result"
        }
    ]
}