{
    "Symbol": "SUVEN",
    "ISIN": "INE495B01038",
    "News": [
        {
            "Title": "Suven Life Sciences clarifies price movement",
            "Summary": "Suven Life Sciences Limited issued clarification to BSE stating no material events pending disclosure under SEBI regulations, attributing recent price movements to market speculation.",
            "Sentiment": "neutral",
            "PublishDate": 1770374212708,
            "Source": "stocks"
        },
        {
            "Title": "Suven Life Sciences Allots Shares, Changes Leadership",
            "Summary": "Suven Life Sciences allots 44.77 lakh equity shares worth Rs 60 crore through warrant conversion and appoints new Company Secretary following resignation of incumbent officer.",
            "Sentiment": "neutral",
            "PublishDate": 1769673891512,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suven Life Sciences Q3 Net Loss Widens to ₹1.02B",
            "Summary": "Suven Life Sciences reported a consolidated net loss of ₹1.02 billion in Q3, significantly higher than the ₹391.2 million loss recorded in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1769672335126,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suven Life Sciences Board Meet Set for Jan 29",
            "Summary": "Suven Life Sciences has scheduled its board meeting for January 29, 2026, to review and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769074488737,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suven Life Sciences Completes Phase-2B Enrollment",
            "Summary": "Suven Life Sciences achieves 100% patient enrollment for Phase-2B Ropanicant trial in Major Depressive Disorder, more than two months ahead of schedule, with 195 patients enrolled across 35 US sites.",
            "Sentiment": "positive",
            "PublishDate": 1765428492581,
            "Source": "stocks"
        },
        {
            "Title": "Suven Life Sciences Reports No Deviations in Preferential Issue Proceeds Utilization",
            "Summary": "Suven Life Sciences Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding utilization of proceeds from its preferential issue of convertible warrants worth Rs 85,764.02 lakh. CRISIL Ratings Limited, the monitoring agency, reported no deviations from stated objects and confirmed all utilization was as per disclosure requirements. The company received 25% of the issue amount (Rs 21,441 lakh) during the quarter, with the remaining 75% to be received when warrant holders exercise conversion options by December 2026. Proceeds were utilized across four categories: Rs 2,616.27 lakh for clinical development through overseas subsidiary, Rs 1,172.80 lakh for drug discovery research, Rs 92.98 lakh for new R&D center infrastructure, and Rs 1,542.08 lakh for general corporate purposes. Unutilized proceeds of Rs 25,298.59 lakh were deployed in various mutual funds and money market instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1762948134646,
            "Source": "corporate_action"
        },
        {
            "Title": "Suven Life Sciences Reports Wider Quarterly Loss of Rs 773 Million",
            "Summary": "Suven Life Sciences reported a consolidated net loss of Rs 773 million in its quarterly results, compared to a loss of Rs 496 million in the same period last year. The loss increased by approximately 56% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762843821855,
            "Source": "earnings"
        },
        {
            "Title": "Sunil Singhania's Abakkus Diversified Alpha Fund Holds 1.32% Stake in Suven Life Science",
            "Summary": "Abakkus Diversified Alpha Fund, managed by Sunil Singhania, holds a 1.32% stake in Suven Life Science as disclosed in quarterly results. This represents the fund's investment position in the pharmaceutical company.",
            "Sentiment": "neutral",
            "PublishDate": 1760541478342,
            "Source": "stock"
        },
        {
            "Title": "Suven Life Sciences Awaits 2027 Results for Alzheimer's Drug SUVN-502",
            "Summary": "Suven Life Sciences is conducting a phase 3 clinical trial for SUVN-502 (Masupirdine), a drug targeting agitation and aggression in Alzheimer's patients, with results expected in 2027. Chairman Venkateswarlu Jasti emphasized the binary nature of drug discovery, noting the 10-15 year development timeline and uncertain outcomes. The company completed a Rs 857 crore fundraising round, split equally between Jasti's family and external investors. Jasti acknowledged limited investor interest in pure drug discovery in India and stated no profitability is expected until a molecule succeeds, as the company currently has no revenue. The market opportunity for successful treatment could reach multibillion-dollar potential. Other pipeline molecules SUVN-G3031 and SUVN-911 are also expected to produce results around 2027. Suven shares closed at Rs 236.25, up 2.18%.",
            "Sentiment": "neutral",
            "PublishDate": 1755662260845,
            "Source": "stock"
        },
        {
            "Title": "Suven Life Sciences Reports Wider Net Loss Despite Revenue Growth in Q1",
            "Summary": "Suven Life Sciences reported a net loss of 148 million rupees in Q1, compared to a loss of 77 million rupees in the same period last year. The company's revenue increased to 19 million rupees from 10 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755069966548,
            "Source": "earnings"
        },
        {
            "Title": "Abakkus Diversified Alpha Fund Becomes Shareholder in Suven Life Sciences",
            "Summary": "Abakkus Diversified Alpha Fund has been listed as a shareholder in Suven Life Sciences. The announcement indicates a new shareholding position by the fund in the pharmaceutical company.",
            "Sentiment": "neutral",
            "PublishDate": 1753199120823,
            "Source": "stock"
        },
        {
            "Title": "Suven Life Sciences Begins Phase 2B Trial for Depression Treatment",
            "Summary": "Suven Life Sciences has announced the enrollment of the first patient in a Phase 2B clinical trial for Ropanicant, a new treatment approach for Major Depressive Disorder. This marks a significant step in the development of a potential new therapy for depression.",
            "Sentiment": "positive",
            "PublishDate": 1752650511000,
            "Source": "default"
        },
        {
            "Title": "Suven Life Sciences Allocates Convertible Warrants to Abakkus Fund",
            "Summary": "Suven Life Sciences has allocated 29.85 lakh convertible warrants to Abakkus Diversified Alpha Fund, which is run by Sunil Singhania. This allocation of convertible warrants represents a significant corporate action that could potentially impact the company's shareholding structure and capital.",
            "Sentiment": "positive",
            "PublishDate": 1751550174000,
            "Source": "default"
        },
        {
            "Title": "Suven Life Sciences: Market Veterans Invest in ₹857 Crore Preferential Issue",
            "Summary": "Suven Life Sciences approved a preferential issue of 6.4 crore convertible warrants, raising up to ₹857 crore. Notable investors include funds managed by Sunil Singhania and Prashant Jain. The warrants were issued at ₹134 each, a 12.4% discount to the previous closing price. The stock jumped 11.8% following the news.",
            "Sentiment": "positive",
            "PublishDate": 1747123206000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suven Life Sciences Issues Convertible Warrants to Investment Funds",
            "Summary": "Suven Life Sciences has issued convertible warrants to two investment funds. The company issued 33 lakh warrants to 3P India Equity Fund and 29 lakh warrants to Abakkus Diversified Alpha Fund. The warrants were priced at Rs. 134 per warrant.",
            "Sentiment": "positive",
            "PublishDate": 1747120526000,
            "Source": "result"
        },
        {
            "Title": "Suven Life Sciences Issues Warrants and Reports Q4 Financial Results",
            "Summary": "Suven Life Sciences has issued 64 lakh equity convertible warrants, with 33 lakh warrants allocated to 3P India Equity Fund and 29 lakh warrants to Abakkus Diversified Alpha Fund. Additionally, the company reported its Q4 consolidated financial results, showing a net loss of 439 million rupees compared to a loss of 265 million rupees in the same period last year. Total revenue for Q4 decreased to 27 million rupees from 67 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747120269000,
            "Source": "default"
        },
        {
            "Title": "Suven Life Sciences to Consider Q4 Results on May 13",
            "Summary": "Suven Life Sciences has announced that it will consider its fourth quarter financial results on May 13. This is a routine corporate announcement regarding the company's upcoming financial disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1746532882000,
            "Source": "default"
        },
        {
            "Title": "Suven Life Sciences Reports Increased Q3 Net Loss",
            "Summary": "Suven Life Sciences has reported a significant increase in net loss for the third quarter, rising to 133 million rupees from 47 million rupees in the same period last year. The company's revenue, however, showed substantial growth, reaching 16.1 billion rupees compared to 24.5 million rupees in the previous year's Q3.",
            "Sentiment": "negative",
            "PublishDate": 1737936846000,
            "Source": "earnings"
        },
        {
            "Title": "Suven Life Sciences Reports Increased Q3 Net Loss",
            "Summary": "Suven Life Sciences reported a net loss of 133 million rupees in Q3, compared to a loss of 47 million rupees in the same period last year. The company's revenue decreased to 16.1 billion rupees from 24.5 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737723421000,
            "Source": "earnings"
        },
        {
            "Title": "Suven Life Sciences to Consider Q3 Results",
            "Summary": "Suven Life Sciences has announced that it will consider its third quarter (Q3) financial results on January 24. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737031285000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suven Life Sciences: Shares Surge 10% on Phase-1 Trial Commencement",
            "Summary": "Suven Life Sciences announced the dosing of first subjects in a Phase-1 clinical trial of SUVN-I6107, a modulator for cognitive disorders treatment. The FDA-approved study in the US will assess safety, tolerability, pharmacokinetics, and pharmacodynamics in healthy subjects. The trial consists of single and multiple ascending dose studies.",
            "Sentiment": "positive",
            "PublishDate": 1736331125000,
            "Source": "normal_news"
        },
        {
            "Title": "Suven Life Sciences Initiates Phase-1 Clinical Trial for Cognitive Disorder Treatment",
            "Summary": "Suven Life Sciences has announced the commencement of a Phase-1 clinical trial for SUVN-I6107, a muscarinic M1 positive allosteric modulator (M1 PAM) designed to treat cognitive disorders. The company has successfully dosed the first subjects in this trial, marking a significant step in the drug's development process.",
            "Sentiment": "positive",
            "PublishDate": 1736322779000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suven Life Sciences Reports Q2 Financial Results",
            "Summary": "Suven Life Sciences has reported a net loss of 110 million rupees in Q2, compared to a profit of 27 million rupees in the same quarter last year. The company's revenue decreased to 26 million rupees from 31 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730186593000,
            "Source": "result"
        },
        {
            "Title": "Suven Life Sciences to Present Phase-2a Study Results at Neuroscience 2024",
            "Summary": "<p><span class=\"positive\">Suven Life Sciences</span> will present <span class=\"positive\">positive results</span> from their <b>Phase-2a proof-of-concept study</b> of <span class=\"neutral\">Ropanicant (SUVN-911)</span> at the <b>Neuroscience 2024</b> conference in Chicago, USA. <br/> The company will also provide updates on their <span class=\"positive\">innovation pipeline assets</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727957738000,
            "Source": "result"
        }
    ]
}