{
    "Symbol": "SUVIDHAA",
    "ISIN": "INE018401013",
    "News": [
        {
            "Title": "Suvidhaa Infoserve Q3FY26 Results & Board Changes",
            "Summary": "Suvidhaa Infoserve reports Q3FY26 financial results with standalone loss of ₹14.0 million. CFO Prashant Thakar resigns, transitions to Non-Executive Director. Board approves reappointment of two Independent Directors.",
            "Sentiment": "negative",
            "PublishDate": 1770690761141,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suvidhaa Infoserve Reports 38.6% Revenue Growth But 70.9% Profit Decline in Q1 FY2026",
            "Summary": "Suvidhaa Infoserve Limited reported mixed quarterly results with total income from operations rising 38.6% year-over-year to Rs. 1157.39 lakhs from Rs. 835.01 lakhs. However, net profit declined sharply by 70.9% to Rs. 33.76 lakhs compared to Rs. 116.13 lakhs in the same quarter last year. Operating profit before depreciation, tax and exceptional items also fell to Rs. 40.54 lakhs from Rs. 43.96 lakhs. Basic and diluted earnings per share dropped to Rs. 0.62 from Rs. 0.97. On a sequential basis, revenue grew 8.8% quarter-over-quarter while the company returned to profitability after posting a loss of Rs. 165.87 lakhs in the previous quarter. The paid-up equity share capital remained unchanged at Rs. 209.81 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1755253305883,
            "Source": "earnings"
        },
        {
            "Title": "Suvidhaa Infoserve Reports Q1 FY2026 Loss, Appoints New Auditors",
            "Summary": "Suvidhaa Infoserve Limited reported consolidated net loss of Rs. 43.0 million for Q1 FY2026, compared to Rs. 39.5 million loss in the same quarter last year. Consolidated revenue from operations declined to Rs. 10.2 million from Rs. 42.2 million year-over-year. On standalone basis, the company posted net loss of Rs. 4.3 million with operational revenue of Rs. 3.8 million. The Board appointed M/s. Patel and Mehta as internal auditors for FY 2025-26 and recommended M/s. Jain Kedia and Sharma as new statutory auditors following the resignation of M/s. GS Mathur & Co. The company operates in e-commerce, payment services, trading of e-vouchers, financial services, and website development.",
            "Sentiment": "negative",
            "PublishDate": 1755102621578,
            "Source": "earnings"
        },
        {
            "Title": "Suvidhaa Infoserve's Statutory Auditors Resign Over Fee Dispute Related to Increased Reporting Requirements",
            "Summary": "Suvidhaa Infoserve Limited announced that M/s. GS Mathur & Co., Chartered Accountants resigned as the company's statutory auditors effective August 13, 2025. The auditors cited recent changes in financial reporting and disclosure requirements that resulted in additional audit procedures and increased scope. They had proposed an increase in audit fees to accommodate the additional efforts and time involved. The auditors confirmed they had no disputes or concerns regarding information availability or accuracy provided by management. The company stated no material reason exists for the resignation and no concerns were raised by the auditors about company management. The Audit Committee and Board will consider appointing new statutory auditors to fill the casual vacancy. The resignation became effective after submission of the Limited Review Report for the quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755066850325,
            "Source": "corporate_action"
        }
    ]
}