{
    "Symbol": "SUYOG",
    "ISIN": "INE442P01014",
    "News": [
        {
            "Title": "Suyog Telematics Wins BSNL 4G Site Sharing Order",
            "Summary": "Suyog Telematics Limited secured service order from BSNL for sharing 173 new 4G eNode-B sites in Delhi Circle, to be executed within 3 months as disclosed under Regulation 30.",
            "Sentiment": "positive",
            "PublishDate": 1770811325732,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suyog Telematics Q3 Revenue Up 7.8% Despite Profit Dip",
            "Summary": "Suyog Telematics reported mixed Q3 results with revenue rising to 526M rupees from 488M rupees year-on-year, while net profit declined to 145M rupees from 172M rupees in the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1770129304209,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suyog Telematics Independent Director Resigns",
            "Summary": "Suyog Telematics Limited announces resignation of Independent Director Mr. Ajay Kumar Thakur effective January 13, 2026, citing increased workload and overlapping professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1768392895838,
            "Source": "stocks"
        },
        {
            "Title": "Suyog Telematics Independent Director Resigns",
            "Summary": "Suyog Telematics Limited announces resignation of Independent Director Mr. Ajay Kumar Thakur effective January 13, 2026, citing increased workload and professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1768392530123,
            "Source": "stocks"
        },
        {
            "Title": "Suyog Telematics Appoints New Independent Director",
            "Summary": "Suyog Telematics Limited has appointed Mr. Sanjeev Sunder Thakker as Additional Independent Director for a 5-year term from January 12, 2026 to January 11, 2031, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768229382059,
            "Source": "stocks"
        },
        {
            "Title": "Suyog Telematics Faces Tax Authority Search",
            "Summary": "Tax authorities conducted search operations at Suyog Telematics premises. The company clarified that no adverse orders have been passed against it following the search proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1767924841424,
            "Source": "stocks"
        },
        {
            "Title": "Suyog Telematics GST Inspection Completed",
            "Summary": "Suyog Telematics disclosed GST inspection by Maharashtra authorities from January 2-7, 2026, with no adverse findings against the company. Only procedural delay in vendor GST deposit identified and addressed.",
            "Sentiment": "neutral",
            "PublishDate": 1767872821880,
            "Source": "stocks"
        },
        {
            "Title": "Suyog Telematics: Suchitra Lature Acquires 4.55% Stake Through Preferential Allotment",
            "Summary": "Suchitra Lature acquired 5,27,500 equity shares representing 4.55% of Suyog Telematics' diluted share capital through preferential allotment on October 10, 2025. The acquisition increases the combined holding of Suchitra Lature and persons acting in concert to 52.03% of the company's total diluted share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763704183705,
            "Source": "corporate_action"
        },
        {
            "Title": "Suyog Telematics Reports 16% Revenue Growth in Q2 FY26, Eyes Major BSNL and Vodafone Rollouts",
            "Summary": "Suyog Telematics achieved INR 554 million revenue in Q2 FY26 with 16% year-on-year growth, maintaining 75% EBITDA and 30% PAT margins while operating 5,861 towers with 7,163 tenancies. The company expects 6,000 BSNL sites allocation within 30-45 days and has started deploying 500+ Vodafone sites, targeting INR 250 crores annual revenue with significant 5G upgrade opportunities from Airtel providing INR 3,000-4,000 monthly upside per site.",
            "Sentiment": "positive",
            "PublishDate": 1763379115716,
            "Source": "earnings"
        },
        {
            "Title": "Suyog Telematics Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Suyog Telematics reported quarterly net profit of 166 million rupees compared to 202.6 million rupees in the same period last year, representing a decline. The company's quarterly revenue increased to 522 million rupees from 477 million rupees year-over-year, showing growth in the top line despite the profit decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1762877425989,
            "Source": "earnings"
        },
        {
            "Title": "Suyog Telematics Announces Death of Promoter and Whole-Time Director Vivek Lature",
            "Summary": "Suyog Telematics Limited announced the death of Mr. Vivek Lature, who served as Promoter and Whole-Time Director of the company. He passed away on September 11, 2025. The company described his death as an irreparable loss to his family, the company, and all associated with him. Suyog Telematics stated that the team remains committed to honoring his vision and continuing the pursuit of excellence in all endeavors.",
            "Sentiment": "negative",
            "PublishDate": 1757596300440,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suyog Telematics Approves Q1 FY2026 Results, Recommends Rs. 1.80 Final Dividend",
            "Summary": "Suyog Telematics Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company recommended a final dividend of Rs. 1.80 per equity share (18% on face value of Rs. 10) for financial year 2024-25, with record date set for August 29, 2025. The Board appointed Ms. Aarati Savur as Additional Independent Director for up to five years effective August 12, 2025. The company reappointed M/s. Amruta Giradkar & Associates as Secretarial Auditor for five years from FY 2025-26 to 2029-30. The 30th Annual General Meeting is scheduled for September 16, 2025 at 11:30 a.m. via video conferencing. All appointments and dividend payment are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1755015815520,
            "Source": "corporate_action"
        },
        {
            "Title": "Suyog Telematics Reports Growth in Q1 Revenue and EBITDA Margin",
            "Summary": "Suyog Telematics reported Q1 net profit of 170 million rupees compared to 169 million rupees in the same period last year. Revenue increased to 516 million rupees from 460 million rupees year-over-year. EBITDA rose to 392 million rupees from 328 million rupees, while EBITDA margin improved to 76.02% from 71.41% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755013671821,
            "Source": "earnings"
        },
        {
            "Title": "Suyog Telematics Reports Q4 Financial Results",
            "Summary": "Suyog Telematics has released its Q4 financial results. The company's EBITDA decreased to 82.2 million rupees from 285 million rupees year-over-year. EBITDA margin fell to 16.43% from 62.84% in the same period. Revenue increased to 500.6 million rupees from 453.6 million rupees year-over-year. The company reported a net loss of 137.8 million rupees compared to a profit of 157.2 million rupees in the previous year and a profit of 171.8 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747757602000,
            "Source": "result"
        },
        {
            "Title": "Suyog Telematics Reports Mixed Q3 Results",
            "Summary": "Suyog Telematics has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 341 million rupees, compared to 337 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased from 80.94% to 69.93% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739262962000,
            "Source": "earnings"
        },
        {
            "Title": "Suyog Telematics Reports Q3 Financial Results",
            "Summary": "Suyog Telematics has announced its financial results for the third quarter. The company reported a net profit of 172 million rupees, down from 191 million rupees in the same quarter last year. However, revenue increased to 489 million rupees from 417 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739262910000,
            "Source": "earnings"
        },
        {
            "Title": "Suyog Telematics: Acquiring Delhi-NCR Tower Company for ₹13.5 Crore",
            "Summary": "Suyog Telematics signs MOU to acquire Lotus Tele Infra for ₹13.5 crore, adding 120 telecom sites in Delhi-NCR. Acquisition to be completed by March 31, 2025. Company also plans to raise ₹270.75 crore through equity warrants and shares for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1735637530000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suyog Telematics to Consider Fundraising in Upcoming Board Meeting",
            "Summary": "Suyog Telematics has announced a board meeting scheduled for December 21 to discuss and potentially approve plans for raising funds. This indicates the company may be looking to secure additional capital for future operations or expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1734443323000,
            "Source": "corporate_action"
        }
    ]
}