{
    "Symbol": "SUZLON",
    "ISIN": "INE040H01021",
    "News": [
        {
            "Title": "Suzlon Energy Reports Record Q3 FY26 Performance",
            "Summary": "Suzlon Energy delivered highest-ever quarterly deliveries of 617 MW in Q3 FY26, with revenue of INR4,228 crores and EBITDA of INR739 crores, maintaining strong order book of 6.4 GW.",
            "Sentiment": "positive",
            "PublishDate": 1770888987479,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suzlon Energy Q3 Net Profit Rises 15% to ₹4.45B",
            "Summary": "Suzlon Energy reported consolidated net profit of ₹4.45 billion in Q3, marking 15% YoY growth from ₹3.87 billion, though falling short of analyst estimates of ₹4.80 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770278407069,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suzlon Energy Board Meet Set for Feb 5, 2026",
            "Summary": "Suzlon Energy schedules board meeting on February 5, 2026 to approve Q3FY26 unaudited financial results. Trading window closed from January 1 till February 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769593376346,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suzlon Wins 248.5 MW Wind Order from ArcelorMittal",
            "Summary": "Suzlon Energy secures first wind turbine order from ArcelorMittal for 248.5 MW capacity as part of 550 MW hybrid project in Gujarat, supporting green steel production.",
            "Sentiment": "positive",
            "PublishDate": 1769571810891,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suzlon Energy Shares Drop 2.04% Despite Strong Growth",
            "Summary": "Suzlon Energy shares declined 2.04% to ₹46.03 despite reporting strong revenue growth to ₹10,889.74 crores in 2025 and improved profitability metrics across key financial ratios.",
            "Sentiment": "neutral",
            "PublishDate": 1769164935279,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suzlon Energy Gets 54% Upside Target from Motilal Oswal",
            "Summary": "Motilal Oswal maintains buy rating on Suzlon Energy with ₹74 price target, citing favorable risk-reward despite recent pressure from wind sector concerns and competitive intensity.",
            "Sentiment": "positive",
            "PublishDate": 1768877918697,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon Energy Shares Decline 27% in Six Months",
            "Summary": "Suzlon Energy stock has fallen 27% over six months and 17% year-over-year, with the renewable energy solutions provider facing mounting losses and weak technical indicators.",
            "Sentiment": "negative",
            "PublishDate": 1768841380634,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon targets 10 GW wind capacity in 2 years",
            "Summary": "Suzlon Executive Vice Chairman Girish Tanti projects India's wind installations to reach 10 GW within two years and 13-15 GW by 2030, supported by 20 GW annual manufacturing capacity and export opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1768835563354,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon appoints Paulo Soares as President for Europe",
            "Summary": "Suzlon Energy strengthens leadership with Paulo Soares appointment as President-Europe, bringing 40 years wind industry experience to drive international expansion and market growth.",
            "Sentiment": "positive",
            "PublishDate": 1768813067473,
            "Source": "stocks"
        },
        {
            "Title": "FIIs Raise Suzlon Energy Stake to 23.73% in Q3",
            "Summary": "Foreign institutional investors increased their stake in Suzlon Energy to 23.73% in December quarter, the highest in four quarters, while domestic mutual funds reduced holdings to 4.82%.",
            "Sentiment": "positive",
            "PublishDate": 1768551261114,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon Energy CEO Vivek Srivastava Resigns",
            "Summary": "Suzlon Energy announces resignation of Mr. Vivek Srivastava as CEO of WTG Division, effective December 26, 2025, to pursue opportunities outside the Suzlon Group.",
            "Sentiment": "neutral",
            "PublishDate": 1766759264859,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon Energy Gains 0.87% Despite Market Decline",
            "Summary": "Suzlon Energy shares rose 0.87% to ₹53.76 while Sensex fell 185.93 points. The stock traded at 23.22 times trailing EPS with high volatility indicated by Beta of 2.25.",
            "Sentiment": "positive",
            "PublishDate": 1766727518593,
            "Source": "stocks"
        },
        {
            "Title": "Wind Power Revival: Centre Targets 100 GW Capacity",
            "Summary": "Union Government draws up comprehensive revival plan for India's wind power industry, targeting significant capacity expansion. Initiative aims to revitalize the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1766548993983,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon Signs Two 153 MW Wind Contracts with Yanara",
            "Summary": "Suzlon Energy expands partnership with Yanara by securing two new wind energy contracts of 153 MW each in Barmer, Rajasthan, strengthening its position in India's renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1765942744327,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on Suzlon at ₹78",
            "Summary": "Morgan Stanley continues its positive outlook on Suzlon Energy, maintaining an 'Overweight' rating with a price target of ₹78, reflecting confidence in the renewable energy company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765510647200,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon Energy Wins Tax Dispute, Saves ₹101.92 Cr",
            "Summary": "Suzlon Energy successfully contested a service tax dispute, with CESTAT reducing penalty from ₹21.92 crores to nil, eliminating contingent liability of ₹101.92 crores including tax, penalty and interest.",
            "Sentiment": "positive",
            "PublishDate": 1765457408818,
            "Source": "stocks"
        },
        {
            "Title": "Suzlon Energy Gets GST Penalty Reduced from Rs 19.54 Lakh to Rs 50,000",
            "Summary": "The Deputy Commissioner of State Tax in Gujarat reduced Suzlon Energy's GST penalty from Rs 19,54,890 to Rs 50,000 for e-waybill provision contraventions by its merged subsidiary Suzlon Global Services Limited. The company will receive a refund of Rs 19,04,890 and states there is no material impact on its financial or operational activities.",
            "Sentiment": "positive",
            "PublishDate": 1764931172439,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Allots 5.9 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Suzlon Energy's Securities Issue Committee approved allotment of 5,90,000 equity shares worth Rs. 1.42 crore to employees and subsidiary staff under ESOP 2022, with exercise prices ranging from Rs. 5 to Rs. 30 per share. The allotment increases the company's paid-up capital to Rs. 2,742.47 crore divided into 137.12 crore equity shares of Rs. 2 face value each.",
            "Sentiment": "neutral",
            "PublishDate": 1764927500133,
            "Source": "corporate_action"
        },
        {
            "Title": "Suzlon Energy Allots 19.25 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Suzlon Energy Limited has allotted 19,25,750 equity shares with a face value of Rs. 2 each to employees under its Employee Stock Option Plan 2022. The Securities Issue Committee approved the allotment through a circular resolution on November 12, 2025. The company realized Rs. 2,97,53,750 from the exercise of these stock options by eligible employees of Suzlon and its subsidiaries. Following this allotment, the company's paid-up capital stands at Rs. 2,742,34,81,018 divided into 1,371,17,40,509 fully paid-up equity shares of Rs. 2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762954543973,
            "Source": "corporate_action"
        },
        {
            "Title": "Suzlon Energy Stock Falls 30% From Peak Despite Record Quarterly Profits",
            "Summary": "Suzlon Energy shares have declined 30% from their lifetime high of Rs 83, with market capitalization dropping below Rs 80,000 crore. The stock underperformed benchmarks over the past year, falling 7% compared to Nifty's 6% gain. Despite this decline, the company reported record quarterly performance with consolidated profit surging 538% year-on-year to Rs 1,279 crore and revenue rising 85% to Rs 3,866 crore. The P/E ratio has moderated from 191 to 26.15. Foreign institutional investors reduced holdings from 23.04% to 22.71%, while mutual funds cut stakes from 5.24% to 4.91%. Analysts cite full valuation as a concern, with WealthMills Securities suggesting limited upside potential of 10-15%. Anand Rathi maintains a buy rating with Rs 82 target price, while Nuvama holds a target of Rs 66. The company maintains a 30%+ market share and has a 6.2 GW order book.",
            "Sentiment": "neutral",
            "PublishDate": 1762841163234,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Convenes Shareholder and Creditor Meetings for Reserve Reorganization Scheme",
            "Summary": "Suzlon Energy Limited has scheduled meetings for December 12, 2025, to seek approval for a scheme of arrangement involving reorganization and reclassification of reserves. The National Company Law Tribunal has directed separate meetings for equity shareholders (10:30 AM) and unsecured creditors (12:30 PM) through video conferencing. The scheme proposes to adjust the company's negative retained earnings against various reserves including Capital Reserve, Capital Contribution, Capital Redemption Reserve, Securities Premium, and General Reserve. Post adjustment, remaining General Reserve balance will be transferred to Retained Earnings. The company reported profits in recent years but carries accumulated losses affecting its financial statements. Remote e-voting will be available from December 9-11, 2025. The scheme requires no changes to share capital structure or shareholding pattern and involves no fund outflow from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762827576112,
            "Source": "corporate_action"
        },
        {
            "Title": "Suzlon Maintains 60% Growth Target Despite Strong Demand Visibility",
            "Summary": "Suzlon Group CEO JP Chalasani confirmed the company is maintaining its full-year growth guidance at 60%, despite achieving a 70% revenue increase in the first half of FY26. The CEO stated that recent government measures including amended Listed Models and Manufacturers norms and the Renewable Energy Equipment Import Monitoring System will strengthen domestic manufacturing and create a level playing field against cheaper imports. Suzlon sources over 90% of its components domestically and plans to use policy benefits to sustain affordable tariffs rather than increase margins. The company's 6.2 GW order book remains secure despite recent tender cancellations by the Ministry of Power, with contracts signed only after power purchase agreements are finalized. Suzlon has a market capitalization of ₹82,190 crore, though shares have declined over 13% in the past year.",
            "Sentiment": "positive",
            "PublishDate": 1762420725953,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Shares Fall Despite Strong Q2 Results as Analysts Flag Long-term Growth Concerns",
            "Summary": "Suzlon Energy shares declined 0.55% to ₹59.66 despite reporting strong quarterly results, with heavy selling pressure as sell quantity exceeded buy quantity by nearly three times. The company posted Q2 revenue of ₹3,870 crore, up 84% year-on-year, with EBITDA surging 145% to ₹720 crore. Record deliveries of 565 MW marked the highest quarterly volume in India's 30-year wind industry history. The order book stands at 6.2 GW with management maintaining 60% growth guidance. However, JM Financial maintained a 'Buy' rating with ₹70 target but warned of growth sustainability concerns beyond FY28, citing execution bottlenecks including connectivity issues and land acquisition constraints that will likely cap annual wind installations at 7-8 GW. The brokerage projected EBITDA growth to moderate sharply to 17% in FY28 from 61% in FY26. Motilal Oswal retained its 'Buy' rating with revised target of ₹74, though it lowered the valuation multiple to 30x from 35x and raised estimates by 8% due to lower tax rates following deferred tax asset creation of ₹720 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1762411062389,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Targets 122 GW Wind Capacity by FY32",
            "Summary": "Suzlon Energy has set a target to achieve 122 GW wind capacity by FY32. The company plans to focus on wind projects in hybrid, round-the-clock (RTC), and firm and dispatchable renewable energy (FDRE) segments.",
            "Sentiment": "positive",
            "PublishDate": 1762234550879,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Reports Strong Q2 Performance with 87% Revenue Growth and 6.2 GW Order Book",
            "Summary": "Suzlon Energy delivered robust quarterly results with revenue rising to 39 billion rupees from 20.9 billion rupees year-over-year. Net profit surged to 12.8 billion rupees compared to 2 billion rupees in the same period last year. EBITDA increased to 7.2 billion rupees from 2.94 billion rupees, with margins improving to 18.62% from 14.05%. The company recorded a deferred tax gain of 7 billion rupees during the quarter. The order book expanded significantly, surpassing 6 GW and reaching 6.2 GW after adding over 2 GW in H1 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762234051984,
            "Source": "earnings"
        },
        {
            "Title": "Suzlon Energy to Announce Q2FY26 Results on November 4",
            "Summary": "Suzlon Energy will announce its second quarter results for FY26 on November 4, with a board meeting scheduled to approve unaudited financial results for the quarter and half-year ended September 30, 2025. The company has scheduled an earnings call at 5:30 p.m. on the same day. The trading window for designated persons has been closed from October 1 to November 6. In the previous quarter, Suzlon reported a 7.3% year-on-year increase in consolidated net profit to Rs 324.32 crore and total income jumped 54.8% to Rs 3,165.19 crore. The company operates with an installed capacity of over 21.1 GW of wind energy across 17 countries and over 15,200 MW in India. Suzlon shares have risen nearly 10% in the past five trading sessions and closed 1.44% higher at Rs 59.35 on Friday.",
            "Sentiment": "neutral",
            "PublishDate": 1762060228820,
            "Source": "earnings"
        },
        {
            "Title": "Suzlon Energy Appoints Rahul Jain as New CFO",
            "Summary": "Suzlon Energy has appointed Rahul Jain as its new Chief Financial Officer. Jain brings experience from his tenure at SRF Limited, where he worked for almost 17 years.",
            "Sentiment": "positive",
            "PublishDate": 1761711839187,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suzlon Shifts International Focus from US to Europe, Australia and South Africa Due to Tariff Concerns",
            "Summary": "Suzlon Ltd. is redirectioning its international expansion strategy away from the United States following tariff increases on India by President Donald Trump. CEO JP Chalasani announced the company will instead target the European Union, South Africa, and Australia for geographical expansion. Despite having 2.1 GW operating globally with the US as its biggest market, Suzlon currently derives 100% of its order book and revenue from India according to quarterly disclosures. The company has not secured international orders in 18 months, with its entire 4.7 gigawatt backlog coming from Indian projects in Maharashtra, Gujarat, and Rajasthan. Chalasani expects overseas order announcements to begin in FY27, with supplies potentially starting in early FY27 and FY28. The company reported revenue of Rs 10,890 crore in FY25, up 105% year-on-year, though almost entirely from domestic business. Suzlon shares have declined over 30% in the past year, while eight of nine analysts maintain 'buy' ratings with an average 12-month price target suggesting 30% upside potential.",
            "Sentiment": "neutral",
            "PublishDate": 1758695091481,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Secures 838 MW Wind Energy Order from Tata Power Renewable Energy",
            "Summary": "Suzlon Energy Limited has secured an 838 MW wind energy order from Tata Power Renewable Energy Limited, marking Suzlon's largest order for FY26 and second-largest order ever. The project involves supplying 266 S144 wind turbines with 3.15 MW capacity each, to be deployed across Karnataka (302 MW), Maharashtra (271 MW), and Tamil Nadu (265 MW). This represents the third order between the two companies and is part of Tata Power's Firm and Dispatchable Renewable Energy project, supporting their goal to achieve 100% clean power by 2045. The project is part of FDRE bids awarded to SJVN and NTPC.",
            "Sentiment": "positive",
            "PublishDate": 1757994756311,
            "Source": "order&deals"
        },
        {
            "Title": "India Considers GST Relief For Solar And Wind Sectors, Possible Extension Of Grid Fee Waiver",
            "Summary": "India is considering providing GST relief for the solar and wind energy sectors. The government is also exploring the possibility of extending grid fee waivers for these renewable energy segments.",
            "Sentiment": "positive",
            "PublishDate": 1756370527367,
            "Source": "sectoral"
        },
        {
            "Title": "GST Rate for Renewable Energy Reduced from 12% to 5%",
            "Summary": "The GST rate for renewable energy has been reduced from 12% to 5%. This tax reduction applies to the renewable energy sector, which includes companies like Suzlon.",
            "Sentiment": "positive",
            "PublishDate": 1755854931492,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Shares Fall 4.07% to Rs 57.62 Amid Market Decline",
            "Summary": "Suzlon Energy shares declined 4.07% to Rs 57.62 during trading on August 18, 2025. The stock opened at Rs 61.5 with an intraday high of Rs 61.64 and low of Rs 56.62. Trading volume reached 127,993,633 shares by 1:11 PM IST. The company reported quarterly net sales of Rs 3,179.58 crore, down 17.23% from the previous quarter but up 55.53% year-over-year. Net profit increased 7.0% year-over-year to Rs 324.32 crore. The stock trades at a P/E ratio of 39.45 and P/B ratio of 13.52, with an RSI of 31.2 indicating oversold conditions. Foreign institutional investors hold 23.02% stake, domestic institutional investors own 8.63%, and promoters hold 11.74%. The stock has declined across multiple timeframes, showing negative returns of 8.5% over the past week, 10.94% over the past month, and 27.53% over the past year.",
            "Sentiment": "negative",
            "PublishDate": 1755503416292,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Targets 60% Growth Across All Segments for FY'26",
            "Summary": "Suzlon Energy anticipates 60% yearly growth across all main business areas for FY'26. The company maintains its 23% contribution margin guidance for the financial year, noting that higher Q1 margins were an exception. The company projects annual net interest costs of Rs 200 crores with tax rates stabilizing around 25%. Suzlon plans to maintain its historical delivery pattern of 40-60 split between the first and second half of the year.",
            "Sentiment": "positive",
            "PublishDate": 1755055232969,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Reports 62% EBITDA Growth to ₹599 Crores in Q1 FY26, Approves Leadership Reappointments",
            "Summary": "Suzlon Energy's Board approved unaudited financial results for Q1 FY26 ending June 30, 2025, showing consolidated revenue of ₹3,117 crores (55% YoY growth) and EBITDA of ₹599 crores (62% YoY growth). The company achieved highest-ever Q1 deliveries of 444 MW and maintains a 5.7 GW order book. The Board approved reappointment of Vinod R. Tanti as Chairman and Managing Director and Girish R. Tanti as Executive Director for five years from October 7, 2025 to October 6, 2030, subject to shareholder approval. Group CFO Himanshu Mody resigned effective August 31, 2025, citing successful completion of the company's turnaround from ₹10,000 crores to ₹1,00,000 crores market capitalization. The company appointed M/s. Chirag Shah and Associates as Secretarial Auditors for five years and scheduled its 30th Annual General Meeting for September 25, 2025. Fifteen new subsidiaries became wholly owned subsidiaries for project pipeline development.",
            "Sentiment": "positive",
            "PublishDate": 1754994154006,
            "Source": "earnings"
        },
        {
            "Title": "Suzlon Energy Reports Strong Q1 Growth with 55% Revenue Jump",
            "Summary": "Suzlon Energy reported quarterly consolidated net profit of 3.24 billion rupees compared to 3.02 billion rupees in the same period last year. Revenue increased significantly to 31.2 billion rupees from 20.15 billion rupees year-over-year. The company's EBITDA rose to 5.99 billion rupees from 3.72 billion rupees, while EBITDA margin improved to 19.22% from 18.4% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754993669150,
            "Source": "earnings"
        },
        {
            "Title": "Suzlon CFO May Leave to Join Samman Capital",
            "Summary": "Suzlon's Chief Financial Officer may be departing the renewable energy company to join Samman Capital. The potential executive move was reported by CNBC.",
            "Sentiment": "neutral",
            "PublishDate": 1754976454239,
            "Source": "corporate_governance"
        },
        {
            "Title": "Suzlon Energy Shares Rise Ahead of Quarterly Results Following Strong Previous Quarter Performance",
            "Summary": "Suzlon Energy shares traded higher ahead of its quarterly results announcement. The company previously reported a 365% surge in consolidated net profit to Rs 1,182 crore in the January-March quarter, driven by a Rs 600 crore deferred tax credit and strong operational performance. Revenue from operations jumped 73% while EBITDA more than doubled. The company's order book stands at 5.6 GW, with deliveries reaching a record 573 MW in the fourth quarter, representing a 110% year-on-year increase. Suzlon stock rose as much as 1.86% to Rs 64.2 on NSE, trading 0.32% higher at Rs 63.5. The stock has declined 20.98% over the last 12 months but gained 2.14% year-to-date. Eight of nine analysts have a 'buy' rating with a consensus target price of Rs 76.7, implying 19.6% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1754972454073,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy to Release Q1 FY26 Results on August 12",
            "Summary": "Suzlon Energy will announce its Q1 FY26 financial results on August 12, 2025, for the quarter ended June 30, 2025. The company will host an earnings call at 5 p.m. IST with Group CEO JP Chalasani and Group CFO Himanshu Mody participating. The trading window has been closed since July 1 and will remain shut until August 14. In Q4 FY25, the renewable energy company reported strong performance with consolidated revenue rising 73% to Rs 3,790 crore, EBITDA increasing 104% to Rs 724 crore with margins of 19.1%, and net profit surging 365% to Rs 1,182 crore. Suzlon Energy operates across 17 countries with 20.9 GW of installed wind energy capacity. The stock has declined 4.42% in the past five trading sessions and is down 21.35% over the last year, currently trading at Rs 63.20.",
            "Sentiment": "neutral",
            "PublishDate": 1754822642612,
            "Source": "earnings"
        },
        {
            "Title": "Suzlon Energy Shares Rise 19% in 3 Months Despite Recent Pullback, Analysts See Upside Potential to Rs 86",
            "Summary": "Suzlon Energy shares have gained nearly 19% over three months driven by steady order wins and improving financials, though the stock has declined 4.7% in the past month and 4% in the last week. Technical analysts view the current pullback as healthy consolidation rather than a breakdown, with the stock maintaining support above key moving averages. Analysts project potential upside targets of Rs 74-80, with some seeing Rs 86.50 as achievable if the stock breaks above Rs 68-70 resistance levels. Key support levels are identified at Rs 60-62, with a break below Rs 58-60 potentially invalidating the bullish outlook. The company reported strong quarterly results with net profit of Rs 1,182 crore (up 377% year-on-year) and revenue of Rs 2,207 crore (up 73%), while margins expanded to 20.9%. Suzlon continues securing new orders, including a 381 MW wind project in August and maintains an order book of 5.5 GW. Trading volumes have been below average recently, and the stock currently trades at a P/E ratio of 36-38x.",
            "Sentiment": "neutral",
            "PublishDate": 1754821409011,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy Enters F&O Trading, Wins 381 MW Order Amid New Government Wind Turbine Requirements",
            "Summary": "Suzlon Energy shares are in focus due to three key developments. The stock will begin trading in the futures and options segment starting Friday, August 1. The government has increased domestic content requirements for wind turbines, mandating that blades, towers, gearboxes, generators and bearings must be sourced from the Approved List of Models & Manufacturers (ALMM), with R&D, data centers and servers required to be located in India. Suzlon secured a 381 MW order from Zelestra India and its affiliates for its first Firm and Dispatch Renewable Energy (FDRE) project, involving supply of 127 S144 turbines across Maharashtra (180 MW), Madhya Pradesh (180 MW) and Tamil Nadu (21 MW). The project is part of SJVN's FDRE bid for Maharashtra and Madhya Pradesh, while the Tamil Nadu portion will serve Commercial & Industrial customers. Suzlon shares closed 0.4% higher at ₹61.47, though the stock has declined 8.5% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1754019882679,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Secures 381 MW Wind Energy Contract from Zelestra India",
            "Summary": "Suzlon has secured a 381 MW contract from Zelestra India. This contract represents a significant milestone in Zelestra's clean energy initiative and marks their initial FDRE project. The deal positions Suzlon to supply wind energy solutions as part of Zelestra's renewable energy expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1754019839375,
            "Source": "order&deals"
        },
        {
            "Title": "Motilal Oswal MF Takes New Stake in Suzlon Energy as Promoters Reduce Holdings",
            "Summary": "Motilal Oswal Midcap Fund acquired a 1.03% stake in Suzlon Energy during the June quarter, having held no position in March. Overall mutual fund ownership in the wind energy company increased to 5.24% from 4.17% in the previous quarter. Suzlon's promoters reduced their stake to 11.74% from 13.25% through a block deal during the quarter. Life Insurance Corporation of India maintained its stake slightly above 1%. The number of retail shareholders decreased to 55.4 lakh from 56.12 lakh, though their percentage holding remained steady at around 25%. Suzlon Energy shares closed 1.8% lower at ₹65.09 and have remained flat for the year.",
            "Sentiment": "neutral",
            "PublishDate": 1752909061122,
            "Source": "stock"
        },
        {
            "Title": "Suzlon Energy: Consolidation Hits After 1,300% Rally, Analysts Eye Potential Triggers",
            "Summary": "Suzlon Energy's stock has entered a consolidation phase after a 1,300% surge over three years. Currently trading 23% below its September peak, analysts identify six potential triggers for the next rally, including strong technicals, successful debt restructuring, a robust order book, positive energy sector outlook, new product rollout, and improved earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1752217301000,
            "Source": "normal_news"
        },
        {
            "Title": "Suzlon Energy vs Inox Wind: Suzlon Outperforms in India's Wind Energy Sector",
            "Summary": "Suzlon Energy outpaces Inox Wind in project execution, order book, balance sheet strength, profitability, and ESG positioning in 2025. Suzlon executed 2,500 MW projects vs Inox's 705 MW, holds a 5.6 GW order book, and has a net cash position of Rs 1,943 crore. Suzlon's FY25 PAT was Rs 2,072 crore with EBITDA of Rs 1,857 crore. Suzlon trades at a P/E of 47.2, while Inox Wind at 55.9. Suzlon targets net-zero Scope 1 and 2 emissions by 2035.",
            "Sentiment": "positive",
            "PublishDate": 1752043929000,
            "Source": "normal_news"
        },
        {
            "Title": "Suzlon Energy: NSE and BSE Clear Merger with Subsidiary",
            "Summary": "Suzlon Energy received 'no adverse observations' from NSE and BSE for its proposed merger with Suzlon Global Services Limited. The company plans to adjust accumulated losses by reducing and reorganizing reserves, aiming for a cleaner balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1751860011000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suzlon Energy Receives Positive Observation Letters for Scheme Approval",
            "Summary": "Suzlon Energy has received positive observation letters for scheme approval. The company is now moving forward with filing at the National Company Law Tribunal (NCLT).",
            "Sentiment": "positive",
            "PublishDate": 1751635486000,
            "Source": "default"
        },
        {
            "Title": "Suzlon Energy: NSE and BSE Approve Merger Scheme",
            "Summary": "Suzlon Energy received 'no adverse observations' from NSE and BSE for its proposed merger with Suzlon Global Services Ltd. The merger scheme, approved by shareholders in August 2024, awaits NCLT approval. The company must comply with SBI regulations, disclose ongoing proceedings, and maintain the draft scheme as filed with SEBI.",
            "Sentiment": "positive",
            "PublishDate": 1751627082000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sebi Disposes Adjudication Proceedings Against Suzlon Energy",
            "Summary": "The Securities and Exchange Board of India (Sebi) has announced that the adjudication proceedings against Suzlon Energy have been disposed of. No further details about the nature of the proceedings or the reasons for their disposal were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751241500000,
            "Source": "default"
        },
        {
            "Title": "SEBI Closes Adjudication Process Against Suzlon Energy",
            "Summary": "The Securities and Exchange Board of India (SEBI) has declared that the adjudication process against Suzlon Energy is now closed.",
            "Sentiment": "positive",
            "PublishDate": 1751027068000,
            "Source": "default"
        },
        {
            "Title": "Suzlon Energy: Secures Third 170 MW Order from AMPIN Energy Transition",
            "Summary": "Suzlon Energy has won a 170.1 MW order from AMPIN Energy Transition for a project in Kurnool, Andhra Pradesh. This is their third consecutive order from AMPIN, bringing the total to 303 MW. The contract includes supply of 54 S144 wind turbine generators and full project execution services.",
            "Sentiment": "positive",
            "PublishDate": 1750391951000,
            "Source": "order&deals"
        }
    ]
}