{
    "Symbol": "SVPGLOB",
    "ISIN": "INE308E01029",
    "News": [
        {
            "Title": "SVP Global Textiles Reports Losses Amid Subsidiary Insolvency Proceedings",
            "Summary": "SVP Global Textiles Limited reported standalone net loss of Rs 138.29 lakhs for the quarter ended September 30, 2025, while consolidated net loss reached Rs 5,071.70 lakhs. The company faces challenges with key subsidiaries Shri Vallabh Pittie South West Industries Limited and Shri Vallabh Pittie Industries Limited under Corporate Insolvency Resolution Process, and Indian Bank has filed a petition alleging default of Rs 35.63 crores.",
            "Sentiment": "negative",
            "PublishDate": 1763173345691,
            "Source": "earnings"
        },
        {
            "Title": "SVP Global Textiles Reports Fire Incident at Rajasthan Facility, Physical Records Damaged",
            "Summary": "SVP Global Textiles Limited experienced a fire incident at its plant office/warehouse/records storage facility in Jhalawar, Rajasthan on August 25, 2025 at midnight. The fire damaged several physical records and documents that are no longer retrievable. The company is assessing the extent of losses and working to recover and reconstruct lost data where possible. A First Information Report has been filed with local authorities. The company stated that the damage is not covered by insurance and is currently evaluating the full extent of the impact. The assessment is ongoing and the company will provide updates to stock exchanges once the evaluation is completed.",
            "Sentiment": "negative",
            "PublishDate": 1758787116454,
            "Source": "stock"
        },
        {
            "Title": "SVP Global Textiles Reports Fire Incident at Rajasthan Plant, Physical Records Lost",
            "Summary": "SVP Global Textiles Limited experienced a fire incident at its plant office/warehouse/records storage facility in Dhanodi, Jhalawar, Rajasthan on August 25, 2025 at midnight. The fire damaged and destroyed several physical records and documents that are no longer retrievable. The company is assessing the extent of losses and taking steps to recover and reconstruct lost data where possible. An FIR has been filed with local authorities regarding the incident.",
            "Sentiment": "negative",
            "PublishDate": 1758112374413,
            "Source": "stock"
        },
        {
            "Title": "SVP Global Textiles Dissolves CSR and Risk Management Committees, Reports Rs 5,051 Lakh Consolidated Loss",
            "Summary": "SVP Global Textiles Limited dissolved its Corporate Social Responsibility and Risk Management committees while reconstituting its Audit and Stakeholders Relationship committees during a board meeting on August 14, 2025. The dissolution was approved based on the company's compliance requirements and financial thresholds under Companies Act 2013 and SEBI regulations. The company reported consolidated net loss of Rs 5,051 lakh for the quarter ended June 30, 2025, compared to Rs 10,696 lakh loss in the same quarter last year. Consolidated revenue declined to Rs 503.13 lakh from Rs 5,019.12 lakh year-on-year. On standalone basis, the company posted net loss of Rs 202.04 lakh versus Rs 396.32 lakh loss in the previous year quarter. The company operates in textiles business and faces ongoing challenges including Corporate Insolvency Resolution Process against key subsidiaries Shri Vallabh Pittie South West Industries Limited and Shri Vallabh Pittie Industries Limited. Indian Bank has filed a petition alleging default on dues of Rs 35.63 crores, which remains pending before NCLT.",
            "Sentiment": "negative",
            "PublishDate": 1755180902070,
            "Source": "corporate_action"
        }
    ]
}