{
    "Symbol": "SWANCORP",
    "ISIN": "INE665A01038",
    "News": [
        {
            "Title": "Swan Corp Reports Mixed Q3FY26 Results",
            "Summary": "Swan Corp Limited posted consolidated net loss of ₹118.02 lakhs in Q3FY26 versus profit of ₹56,194.87 lakhs in Q3FY25, despite revenue from operations at ₹1,15,001.56 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770389822433,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swan Corp Board Approves ₹3,500 Cr Related Party Deal",
            "Summary": "Swan Corp's board approved a material related party transaction worth ₹3,500 crores with subsidiary SDHI, subject to shareholder approval via postal ballot. Independent director resigned in December.",
            "Sentiment": "neutral",
            "PublishDate": 1769518868618,
            "Source": "stocks"
        },
        {
            "Title": "Swan Corp schedules investor meet with Poddar Diamond",
            "Summary": "Swan Corp Limited has scheduled an investor meeting with Poddar Diamond Family Office on January 12, 2026, in Mumbai as per regulatory compliance under SEBI Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1767618956488,
            "Source": "stocks"
        },
        {
            "Title": "Swan Corp Independent Director Resigns Due to Preoccupation",
            "Summary": "Ms. Shanaya Munot resigned from her position as Independent Director of Swan Corp Limited with immediate effect from December 15, 2025, citing preoccupation. The company confirmed she holds no directorships in other listed entities.",
            "Sentiment": "neutral",
            "PublishDate": 1765803265135,
            "Source": "stocks"
        },
        {
            "Title": "Swan Corp Limited Appoints New Company Secretary as Bhushan Kishore Joshi Resigns",
            "Summary": "Swan Corp Limited appointed Mr. Saptarshi Ganguly as Company Secretary and Compliance Officer with effect from November 14, 2025, following the resignation of Mr. Bhushan Kishore Joshi from the same position. The board meeting approved Ganguly's appointment based on the Nomination Remuneration Committee's recommendation, with Ganguly bringing around 20 years of experience in secretarial and legal functions in listed entities.",
            "Sentiment": "neutral",
            "PublishDate": 1763173112583,
            "Source": "corporate_governance"
        },
        {
            "Title": "Swan Corp Limited Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "Swan Corp Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, following Audit Committee review. The company operates across seven segments including Textile, Energy, Construction/others, Distribution & Development, Warehousing, Manufacturing and Shipyard with results reviewed by statutory auditors.",
            "Sentiment": "negative",
            "PublishDate": 1763145005925,
            "Source": "earnings"
        },
        {
            "Title": "SEBI Penalizes Swan Corp CEO ₹2 Lakh for Insider Trading Violations",
            "Summary": "SEBI imposed a ₹2 lakh monetary penalty on Rahul Sharma, CEO of Swan LNG and designated person of Swan Corp, for insider trading violations. Sharma executed trades and contra-trades in company shares between September 1 and November 30, 2023, generating unlawful gains of ₹30.25 lakh. The transactions violated Swan Corp's insider trading code requiring pre-clearance for trades exceeding ₹10 lakh per quarter. Sharma also failed to make mandatory disclosures under SEBI's Prohibition of Insider Trading Regulations, 2015. The executive had already remitted the ₹30.25 lakh unlawful gains to SEBI's Investor Protection and Education Fund in January and February 2025. SEBI levied penalties of ₹1 lakh each under two sections of the SEBI Act, totaling ₹2 lakh, while emphasizing the importance of strict compliance with insider trading rules for senior executives in listed companies.",
            "Sentiment": "negative",
            "PublishDate": 1759233261504,
            "Source": "corporate_governance"
        },
        {
            "Title": "Swan Corp Limited Appoints Independent Women Director and Company Secretary",
            "Summary": "Swan Corp Limited appointed Ms. Shanaya Manish Munot as Additional Director in the category of Independent Women Director for a 5-year term from September 16, 2025 to September 15, 2030, subject to shareholder approval. The company also appointed Mr. Bhushan Kishor Joshi as Company Secretary and Compliance Officer, effective September 16, 2025. Ms. Munot holds a Bachelor of Science in Foreign Service from Georgetown University and brings over six years of experience in corporate governance and strategic leadership. She is the Founder & CEO of BhoomiSure, an Insurtech company focused on agriculture and climate resilience. Mr. Joshi is a Commerce Graduate and Associate Member of the Institute of Company Secretaries of India with over 10 years of corporate experience in corporate laws and compliances. Both appointments were recommended by the Nomination & Remuneration Committee and approved by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1758033738936,
            "Source": "corporate_governance"
        },
        {
            "Title": "Swan Energy Limited Rebrands as Swan Corp, Shifts Strategic Focus to High-Growth Sectors",
            "Summary": "Swan Energy Limited has officially rebranded as Swan Corp Limited, marking a strategic pivot into manufacturing, defence, energy, and real estate sectors. The company unveiled a new corporate identity with a redesigned logo featuring a stylized swan in upward motion. Swan Corp operates across oil & gas, commercial and defence shipbuilding and repair, heavy engineering, offshore fabrication, and real estate development. Managing Director Nikhil Merchant stated the rebrand reflects the company's long-term strategic direction and commitment to innovation. The company, founded over a century ago with origins in textiles, is listed on BSE and NSE with updated ticker symbols to be announced.",
            "Sentiment": "positive",
            "PublishDate": 1756103560078,
            "Source": "stock"
        },
        {
            "Title": "Swan Energy Reports 86% Drop in Net Profit Despite Revenue Growth",
            "Summary": "Swan Energy reported quarterly consolidated net profit of 191 million rupees, down from 1.38 billion rupees in the same period last year. Revenue increased to 12 billion rupees from 11.4 billion rupees year-over-year. EBITDA declined significantly to 268 million rupees from 3.86 billion rupees, while EBITDA margin compressed to 2.21% from 33.85% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755469621931,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy Announces Book Closure for Dividend and 117th Annual General Meeting",
            "Summary": "Swan Energy Limited's Board of Directors decided to close the Register of Members and Share Transfer Books from September 23rd to 29th, 2025 for the proposed dividend and 117th Annual General Meeting scheduled for September 29th, 2025. The dividend, subject to approval at the AGM, will be paid to shareholders whose names appear on the company's Register of Members as of September 22nd, 2025. For shares held electronically, dividend payments will be made to beneficial owners as per details provided by the Depositories.",
            "Sentiment": "neutral",
            "PublishDate": 1755184713808,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy Reports Sharp Decline in Q1 Profitability Despite Revenue Growth",
            "Summary": "Swan Energy reported quarterly results showing mixed performance. Revenue increased to 12 billion rupees from 11.4 billion rupees year-over-year. However, EBITDA dropped significantly to 268 million rupees from 3.86 billion rupees, with EBITDA margin falling to 2.21% from 33.85%. Consolidated net profit declined to 191 million rupees compared to 1.38 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1755181623925,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy Establishes SPV and Acquires Majority Stake in Swan Balu Heavy Industries",
            "Summary": "Swan Energy has set up a Special Purpose Vehicle (SPV) and purchased a 60% share in Swan Balu Heavy Industries Pvt Ltd. This acquisition is aimed at a project in the defence and aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1750688700000,
            "Source": "default"
        },
        {
            "Title": "Swan Energy Reports Q4 Net Loss of 177m Rupees, Revenue Decline",
            "Summary": "Swan Energy reported a consolidated net loss of 177 million rupees in the fourth quarter, an improvement from the 266 million rupee loss in the same quarter last year. However, the company saw a significant profit of 5.8 billion rupees compared to the previous quarter. Q4 revenue decreased to 8.6 billion rupees from 13.98 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748823144000,
            "Source": "default"
        },
        {
            "Title": "Swan Energy Reports Significant Drop in Q4 EBITDA",
            "Summary": "Swan Energy's Q4 EBITDA decreased to 139 million rupees from 1.18 billion rupees year-over-year. The company's Q4 EBITDA margin also declined to 1.62% from 8.41% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748618924000,
            "Source": "result"
        },
        {
            "Title": "Swan Energy Reports Q4 Financial Results",
            "Summary": "Swan Energy has reported its Q4 consolidated financial results. The company recorded a net loss of 177 million rupees, compared to a loss of 266 million rupees in the same quarter last year. However, it showed a significant improvement from the previous quarter, with a profit of 5.8 billion rupees. The Q4 revenue stood at 8.6 billion rupees, down from 13.98 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748618863000,
            "Source": "result"
        },
        {
            "Title": "Swan Energy Reports Significant Profit Growth in Q3",
            "Summary": "Swan Energy has announced its Q3 financial results, showing a substantial increase in consolidated net profit to 5.8 billion rupees, up from 1.15 billion rupees year-over-year and 513 million rupees quarter-over-quarter. The company's revenue for Q3 rose to 19 billion rupees from 15.92 billion rupees in the previous year. Notably, Swan Energy reported a significant other income of 18.6 billion rupees, which contributed to the impressive profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1739751530000,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy: Q3 Profit Soars 406% YoY, Revenue Up 20%",
            "Summary": "Swan Energy reported Q3 FY25 results with profit rising 406.31% YoY to ₹582.81 crore and revenue increasing 19.89% YoY to ₹1908.19 crore. QoQ growth was significant with revenue up 84.87% and profit up 1036.52%. EPS reached ₹18.72, up 123.39% YoY. However, operating income declined 881.37% QoQ and 413.46% YoY, while SG&A expenses increased substantially.",
            "Sentiment": "positive",
            "PublishDate": 1739598943000,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy: Q3 Profit Soars 406% to Rs 583 Crore",
            "Summary": "Swan Energy reported a 406% increase in Q3FY25 consolidated net profit to Rs 583 crore. Revenue rose 20% to Rs 1,908 crore. Other income jumped to Rs 1,868 crore, boosting total income to Rs 3,777 crore. Distribution & Development segment revenue stood at Rs 1,833 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739546221000,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy Reports Significant Other Income of 18.6 Billion Rupees",
            "Summary": "Swan Energy has reported other income amounting to 18.6 billion rupees. This substantial figure suggests significant non-core revenue generation for the company, which could impact its overall financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1739534444000,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy Reports Q3 EBITDA Loss of 12 Billion Rupees",
            "Summary": "Swan Energy has reported a significant financial setback in its third quarter results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a loss of 12 billion rupees. This represents a stark contrast to the same period in the previous year when the company had reported a gain of 2.56 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739534322000,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy Reports Significant Profit Growth in Q3",
            "Summary": "Swan Energy has announced its Q3 financial results, showing a substantial increase in consolidated net profit. The company reported a net profit of 5.8 billion rupees, up from 1.15 billion rupees year-over-year and 513 million rupees quarter-over-quarter. Revenue for Q3 also saw growth, reaching 19 billion rupees compared to 15.92 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739534206000,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy Ltd: Q3 Results Anticipated Today",
            "Summary": "Swan Energy Ltd is set to announce its Q3 results later today. The company's Q2 saw net profit more than double to Rs 1.2 crore, while revenues declined to Rs 25.54 crore. Swan Energy operates in energy, textiles, and real estate sectors, with a focus on LNG and infrastructure development.",
            "Sentiment": "neutral",
            "PublishDate": 1739500294000,
            "Source": "earnings"
        },
        {
            "Title": "Swan Energy Secures 111 Crore Rupee Order",
            "Summary": "Swan Energy has won a significant order worth 111 crore rupees. This development indicates a positive business outcome for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1738566739000,
            "Source": "order&deals"
        },
        {
            "Title": "Reliance Naval and Engineering Renamed to Swan Defence and Heavy Industries",
            "Summary": "Reliance Naval and Engineering Ltd has been officially renamed to 'Swan Defence and Heavy Industries Limited' as of January 2, 2025. This change follows the company's acquisition by Swan Energy through its subsidiary Hazel Infra Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1735818913000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy Signs Heads of Agreement with AG&P Terminals & Logistics",
            "Summary": "Swan Energy has entered into a Heads of Agreement (HOA) with AG&P Terminals & Logistics, a Singapore-based company. This agreement likely outlines the preliminary terms and conditions for a potential business collaboration or transaction between the two entities.",
            "Sentiment": "positive",
            "PublishDate": 1734675334000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy's Subsidiary RNEL Pays Rs. 196 Crore to Lenders",
            "Summary": "Swan Energy has announced that its subsidiary, RNEL (likely Reliance Naval and Engineering Limited), has fulfilled its financial obligation by paying Rs. 196 crore to its lenders. This payment indicates a significant financial transaction and potentially improved financial health for the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1734615637000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Swan Energy's Shipyard Resumes Operations, Repairs Indian Coast Guard Vessel",
            "Summary": "Swan Energy's shipyard has resumed operations and successfully completed repairs on an Indian Coast Guard vessel. This development indicates the shipyard's return to functionality and its capability to service important maritime assets.",
            "Sentiment": "positive",
            "PublishDate": 1733119967000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy Ltd.: Subsidiaries Approve Merger Scheme",
            "Summary": "Swan Energy's subsidiaries, Triumph Offshore Pvt. Ltd. and Reliance Naval and Engineering Ltd., have approved a scheme of arrangement and amalgamation. The merger is subject to NCLT and stock exchange approvals. Swan Energy's share price rose to a nearly two-month high following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1732514980000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy Announces Capital Reorganization Scheme",
            "Summary": "Swan Energy has disclosed a scheme for the reorganization of the company's capital structure. While specific details are not provided in the given news snippet, capital reorganization typically involves changes to a company's share structure, debt-to-equity ratio, or other financial arrangements to optimize its capital efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1732256681000,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Naval and Engineering Approves Amalgamation with TOPL",
            "Summary": "Reliance Naval and Engineering has approved a scheme of amalgamation between TOPL (likely Tebma Offshore Projects Limited) and the company. This corporate action suggests a merger or consolidation of the two entities, which could potentially impact the company's structure and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1732256150000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy and Balu Forge Industries to Form Special Purpose Vehicle",
            "Summary": "Swan Energy has approved a Memorandum of Understanding (MOU) to be entered into with Balu Forge Industries. The agreement involves the formation of a Special Purpose Vehicle (SPV) between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1731595052000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Swan Energy's Q2 EBITDA decreased to 1.2 billion rupees from 2.6 billion rupees year-over-year. The company's EBITDA margin also fell to 11.64% from 21% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731589614000,
            "Source": "result"
        },
        {
            "Title": "Swan Energy Reports Q2 Financial Results",
            "Summary": "Swan Energy has announced its Q2 financial results. The company's consolidated net profit for the quarter is 513 million rupees, down from 846 million rupees year-over-year and 1.4 billion rupees quarter-over-quarter. Revenue for Q2 stands at 10.3 billion rupees, a decrease from 12.2 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731589559000,
            "Source": "result"
        },
        {
            "Title": "Swan Energy Approves Investment in Hazel Infra Through Rights Issue",
            "Summary": "Swan Energy has approved an investment in Hazel Infra by subscribing to 4.8 million shares at 17.6 rupees per share through a rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1730814076000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swan Energy Forms Special Purpose Vehicles with Agneyastra Technion and Navyuga Engineering",
            "Summary": "Swan Energy has approved the formation of two separate Special Purpose Vehicles (SPVs) in partnership with Agneyastra Technion and Navyuga Engineering. This strategic move suggests potential joint ventures or collaborative projects between Swan Energy and these two companies.",
            "Sentiment": "positive",
            "PublishDate": 1730814067000,
            "Source": "corporate_action"
        }
    ]
}