{
    "Symbol": "SWARAJENG",
    "ISIN": "INE277A01016",
    "News": [
        {
            "Title": "Swaraj Engines Q3 Profit Surges 32%, Margins Improve",
            "Summary": "Swaraj Engines Q3 profit jumped 32% YoY to ₹42.10 crores with EBITDA rising 40.2% to ₹61.95 crores. Revenue grew 37% to ₹473.20 crores while EBITDA margin expanded 30 bps to 13.1%.",
            "Sentiment": "positive",
            "PublishDate": 1768464885338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swaraj Engines Q3FY26: Record Sales & 31.8% PAT Growth",
            "Summary": "Swaraj Engines reported highest-ever Q3 engine sales of 47,563 units with revenue at ₹473.20 cr (up 37%) and PAT of ₹42.10 cr (up 31.8%). Nine-month PAT reached ₹141.75 cr, up 17.6%.",
            "Sentiment": "positive",
            "PublishDate": 1767268539656,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swaraj Engines Receives GST Penalty of ₹9.55 Lakh",
            "Summary": "Swaraj Engines Limited received a GST demand order with penalty of ₹9,55,300 from Punjab tax authorities for alleged ITC violations during FY 2021-22. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767180021079,
            "Source": "stocks"
        },
        {
            "Title": "Swaraj Engines Allots 2,399 Shares Under ESOP-2015",
            "Summary": "Swaraj Engines Limited allotted 2,399 equity shares of ₹10 each to eligible employees under its Employee Stock Option Scheme-2015 on December 19, 2025, following approval by the Nomination and Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1766137257694,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swaraj Engines Appoints Gaganjot Singh as Director",
            "Summary": "Swaraj Engines Limited shareholders approve appointment of Mr. Gaganjot Singh as Non-Executive Director through postal ballot with 99.53% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1765539614031,
            "Source": "stocks"
        },
        {
            "Title": "Swaraj Engines Reports Record Q2 Results and Leadership Changes",
            "Summary": "Swaraj Engines Limited announced record-breaking quarterly results for Q2 and H1 FY2026, with engine sales reaching 51,164 units in Q2 (up from 46,962 units) and 1,00,204 units in H1 (up 12.8% from 88,811 units). Revenue from operations increased to Rs. 504.04 crores in Q2 compared to Rs. 464.24 crores in the previous year. Profit after tax grew 9.4% to Rs. 49.68 crores in Q2, while H1 PAT reached Rs. 99.65 crores, up from Rs. 88.61 crores. The company also announced significant leadership changes: Rajesh Jejurikar resigned as Director and Chairman effective October 16, 2025, with Rajya Vardhan Kanoria appointed as the new Chairman from October 17, 2025. Additionally, Gaganjot Singh was appointed as Additional Director (Non-Executive Non-Independent) from October 17, 2025. The company primarily supplies engines to Mahindra & Mahindra's Swaraj Division.",
            "Sentiment": "positive",
            "PublishDate": 1760601097558,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines Reports Revenue Growth to 5.04 Billion Rupees in Q2",
            "Summary": "Swaraj Engines reported Q2 revenue of 5.04 billion rupees compared to 4.6 billion rupees in the same period last year. Net profit increased to 497 million rupees from 454 million rupees year-over-year. EBITDA rose to 680 million rupees from 628 million rupees, while EBITDA margin remained relatively stable at 13.50% versus 13.54% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760600647330,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines: Q1 Revenue Up 16%, Margins Flat",
            "Summary": "Swaraj Engines reported Q1 FY2024 results with net profit rising 15.7% to ₹50 crore and revenue growing 16% to ₹484 crore. EBITDA increased 15% to ₹67 crore, while EBITDA margins remained flat at 13.84%. The stock is currently trading 3.6% higher at ₹4,322.1.",
            "Sentiment": "positive",
            "PublishDate": 1752560831000,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines Reports Q1 Financial Results",
            "Summary": "Swaraj Engines has reported its Q1 financial results. The company's EBITDA increased to 671 million rupees from 582 million rupees year-over-year. The EBITDA margin remained stable at 13.9%. Revenue grew to 4.8 billion rupees from 4.2 billion rupees in the same period last year. Net profit rose to 500 million rupees from 432 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752558061000,
            "Source": "result"
        },
        {
            "Title": "Swaraj Engines: Record Dividend of Rs 104.50 Per Share Announced",
            "Summary": "Swaraj Engines, a Mahindra Group-backed company, has declared its highest-ever dividend of Rs 104.50 per share. The record date is set for June 27, 2025, with the dividend to be credited to eligible shareholders by July 15, 2025. This represents a dividend yield of 2.27% at the current share price.",
            "Sentiment": "positive",
            "PublishDate": 1750994457000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swaraj Engines: Record Date Set for ₹104.50/Share Dividend",
            "Summary": "Swaraj Engines has fixed June 27, 2025, as the record date for a ₹104.50 per share dividend for FY25, subject to shareholder approval at the July 15, 2025 AGM. The company reported record Q4FY25 results with a 29% YoY increase in net profit to ₹45.4 crore and 29.4% growth in revenue to ₹454.2 crore. Engine sales reached an all-time high of 45,594 units in Q4.",
            "Sentiment": "positive",
            "PublishDate": 1744882651000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swaraj Engines: Q4 Profit Jumps 29%, Declares ₹104.50 Dividend",
            "Summary": "Swaraj Engines reported a 29% increase in Q4 net profit to ₹45 crore. Revenue rose 29.4% to ₹454 crore. EBITDA grew 29% to ₹62 crore. The company declared a dividend of ₹104.50 per share. Shares surged up to 12% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1744795842000,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines Approves Engine Capacity Expansion Plan",
            "Summary": "Swaraj Engines has approved a plan to expand its engine production capacity from the current 195,000 units to 240,000 units per annum. This expansion is aimed at meeting the anticipated future demand for engines in the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1744795791000,
            "Source": "default"
        },
        {
            "Title": "Swaraj Engines Reports Strong Q4 FY23 Results and Declares Dividend",
            "Summary": "Swaraj Engines has reported impressive Q4 FY23 results with revenue increasing to 4.54 billion rupees from 3.5 billion rupees year-over-year. The company's EBITDA rose to 619 million rupees from 481 million rupees, while net profit increased to 454 million rupees from 352 million rupees compared to the same period last year. The EBITDA margin remained relatively stable at 13.64% compared to 13.71% in the previous year. Additionally, Swaraj Engines has declared a dividend of 104.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1744794074000,
            "Source": "result"
        },
        {
            "Title": "Swaraj Engines to Consider Q4 Results on April 16",
            "Summary": "Swaraj Engines Limited has announced that it will consider its fourth quarter financial results on April 16. This indicates the company is preparing to release its earnings report for the final quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1743508013000,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines: Q3 Profit Surges 32.57% YoY to ₹31.95 Crore",
            "Summary": "Swaraj Engines reported Q3 FY25 results with revenue up 23.59% YoY to ₹345.5 crore and profit rising 32.57% YoY to ₹31.95 crore. EPS increased 32.63% YoY to ₹26.3. Despite QoQ declines, annual growth remains strong. Analysts maintain Buy ratings.",
            "Sentiment": "positive",
            "PublishDate": 1737178525000,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines Reports Improved Q3 EBITDA and Margin",
            "Summary": "Swaraj Engines has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 328 million rupees to 443 million rupees. Additionally, the EBITDA margin expanded from 12% to 12.82% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737098582000,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines Reports Q3 Revenue Growth",
            "Summary": "Swaraj Engines has announced its third-quarter revenue results. The company reported revenue of 3.46 billion rupees, compared to 2.8 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737098581000,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines Reports 32% Increase in Q3 Net Profit",
            "Summary": "Swaraj Engines has reported a net profit of 319 million rupees for the third quarter, compared to 241 million rupees in the same period last year, representing a year-over-year increase of approximately 32%.",
            "Sentiment": "positive",
            "PublishDate": 1737098519000,
            "Source": "earnings"
        },
        {
            "Title": "Swaraj Engines Reports Improved Q2 EBITDA and Margin",
            "Summary": "Swaraj Engines has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 628 million rupees, up from 521 million rupees in the same quarter last year. The EBITDA margin also improved slightly to 13.54% from 13.41% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729496266000,
            "Source": "result"
        },
        {
            "Title": "Swaraj Engines Reports Q2 Revenue Growth",
            "Summary": "Swaraj Engines has announced its second quarter revenue of 4.6 billion rupees, showing an increase from 3.9 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1729496230000,
            "Source": "result"
        },
        {
            "Title": "Swaraj Engines Reports 20.4% Increase in Q2 Net Profit",
            "Summary": "Swaraj Engines has reported a net profit of 454 million rupees for the second quarter, compared to 377 million rupees in the same period last year, representing a year-over-year increase of 20.4%.",
            "Sentiment": "positive",
            "PublishDate": 1729496201000,
            "Source": "result"
        }
    ]
}