{
    "Symbol": "SWELECTES",
    "ISIN": "INE409B01013",
    "News": [
        {
            "Title": "SWELECT Opens Special Window for Physical Share Transfer",
            "Summary": "SWELECT Energy Systems announces one-year special window from February 05, 2026 to February 04, 2027 for transfer and dematerialization of physical shares with transfer deeds executed prior to April 01, 2019.",
            "Sentiment": "neutral",
            "PublishDate": 1770301493348,
            "Source": "stocks"
        },
        {
            "Title": "SWELECT Unveils New Logo and Launches NUMERGY Product Range",
            "Summary": "SWELECT Energy Systems adopts new brand identity with tagline 'Powering the world responsibly' and launches NUMERGY range of hybrid and battery energy storage systems for residential and commercial applications.",
            "Sentiment": "positive",
            "PublishDate": 1768989479868,
            "Source": "stocks"
        },
        {
            "Title": "SWELECT Grants 2.84L ESOPs to Employees at ₹600 Each",
            "Summary": "SWELECT Energy Systems grants 2,84,700 employee stock options at ₹600 exercise price under its ESOP Scheme 2025, with 5-year vesting schedule approved by Compensation Committee.",
            "Sentiment": "positive",
            "PublishDate": 1765548760241,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swelect Energy Systems Approves Key Leadership Changes and Rs 350 Crore Related Party Transactions",
            "Summary": "Swelect Energy Systems shareholders approved postal ballot resolutions appointing Dr. Arulkumar Pudur Shanmugasundaram as CEO and Managing Director, R Chellappan as Vice Chairman, and A. Balan as Whole-time Director for 5-year terms with specified remuneration packages. The company also approved material related party transactions worth up to Rs 350 crore with subsidiary ESG Green Energy Private Limited for sale/purchase of solar panels, investments, loans and guarantees during 2025-2027.",
            "Sentiment": "positive",
            "PublishDate": 1765360095059,
            "Source": "corporate_action"
        },
        {
            "Title": "Swelect Energy Systems Shareholders Approve Key Leadership Appointments and Related Party Transactions",
            "Summary": "Swelect Energy Systems Limited shareholders passed five resolutions through postal ballot with overwhelming majorities ranging from 99.8567% to 99.9827%, including appointments of R. Chellappan as Whole-time Director and Vice Chairman, Dr. Arulkumar as CEO and Managing Director, and A. Balan as Whole-time Director for 5-year terms. The company also secured approval for material related party transactions with subsidiary ESG Green Energy Private Limited, strengthening its leadership structure and operational framework.",
            "Sentiment": "positive",
            "PublishDate": 1763462900475,
            "Source": "corporate_action"
        },
        {
            "Title": "Swelect Energy Systems Reports Mixed Q2 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Swelect Energy Systems posted Q2 consolidated net profit of 151.7 million rupees, up 84% year-over-year from 82.3 million rupees, while revenue declined to 1.39 billion rupees from 1.98 billion rupees. The company's EBITDA surged to 407.6 million rupees from 288 million rupees, with EBITDA margin expanding significantly to 29.35% from 14.59% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1763074669905,
            "Source": "earnings"
        },
        {
            "Title": "SWELECT Energy Systems Appoints Srinivasu Mullapudi as Vice President for Supply Chain Management",
            "Summary": "SWELECT Energy Systems Limited announced the appointment of Srinivasu Mullapudi as Vice President - Supply Chain Management, EPC and Manufacturing, effective November 5, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Mullapudi brings over 15 years of experience in the solar industry, specializing in procurement and supply chain management. He has managed annual procurement budgets exceeding ₹3000 crore and led strategic sourcing initiatives for multi-gigawatt solar projects. His previous experience includes working with TATA Power Solar Systems Limited, Maithon Power Limited, Abhijeet Projects Limited, and Jindal Power Limited. He holds certifications as an Emerging Leader from XLRI and is an IMS-certified internal auditor.",
            "Sentiment": "positive",
            "PublishDate": 1762357420019,
            "Source": "corporate_governance"
        },
        {
            "Title": "SWELECT Energy Systems Issues Postal Ballot for Leadership Changes and Related Party Transactions",
            "Summary": "SWELECT Energy Systems Limited has issued a postal ballot notice for five key resolutions. The company proposes to change R Chellappan's designation from Managing Director to Whole-time Director and Vice-Chairman for 5 years with annual remuneration of Rs 20.10 lakhs plus 0.25% commission on net profits. Dr. Arulkumar Pudur Shanmugasundaram will be appointed as Chief Executive Officer and Managing Director for 5 years with Rs 3.50 crores annual remuneration. A Balan's designation will change from Joint Managing Director to Whole-time Director for 5 years with Rs 39.60 lakhs annual remuneration plus 0.25% commission capped at Rs 10 lakhs. Gnanasekar Sukumar Samuel will be appointed as Non-Executive, Non-Independent Director. The company seeks approval for material related party transactions worth up to Rs 350 crores with subsidiary ESG Green Energy Private Limited for sale of solar panels, loans, investments, guarantees, and management fees during 2025-2027. Remote e-voting runs from October 17 to November 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760630297055,
            "Source": "corporate_governance"
        },
        {
            "Title": "Swelect Energy Systems Launches 2 MW Solar Power Plant",
            "Summary": "Swelect Energy Systems has started operations of a new 2 MW solar power plant. The company has expanded its renewable energy capacity with this solar facility.",
            "Sentiment": "positive",
            "PublishDate": 1759326391911,
            "Source": "stock"
        },
        {
            "Title": "SWELECT Energy Systems Board Approves Postal Ballot for Director Appointments and Material Related Party Transaction",
            "Summary": "SWELECT Energy Systems Limited's Board of Directors approved a Postal Ballot Notice seeking shareholder approval for director appointments and designation changes, as well as a material related party transaction with its wholly owned subsidiary ESG Green Energy Private Limited (EGEPL). EGEPL, incorporated in June 2024, is setting up a Solar Power Plant under the Group Captive Generation Scheme. The proposed transactions include sale and purchase of goods/materials and services, investments, inter-corporate loans, corporate guarantees, property leasing, and management fees. The aggregate value of these transactions is considered material under SEBI LODR Regulations and exceeds limits under the Companies Act 2013, requiring shareholder approval through postal ballot with remote e-voting facility.",
            "Sentiment": "neutral",
            "PublishDate": 1758975530225,
            "Source": "corporate_action"
        },
        {
            "Title": "SWELECT Energy Systems Completes Disinvestment of Gem Sugars Limited Shares",
            "Summary": "SWELECT Energy Systems Limited has completed the disinvestment of 300,000 equity shares in Gem Sugars Limited at Rs 20 per share to Ms. D.K. Manjula from Bengaluru. The company originally invested in these shares at face value of Rs 10 per share in 2000. The Board of Directors approved the transfer on June 5, 2025, and the disinvestment was completed on September 6, 2025. The transaction represents a complete exit from the company's investment in Gem Sugars Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757142145458,
            "Source": "corporate_action"
        },
        {
            "Title": "SWELECT Energy Systems Announces Major Leadership Restructuring with New CEO Appointment",
            "Summary": "SWELECT Energy Systems Limited announced significant leadership changes during its board meeting on September 4, 2025. The company re-designated Mr. R Chellappan from Managing Director to Whole Time Director and Vice-Chairman for a 5-year term. Dr. Arulkumar Pudur Shanmugasundaram was appointed as CEO & Managing Director for 5 years, bringing 30 years of technology industry experience including roles at Applied Materials, TATA Group companies, and Ayana Renewable Power. Mr. A Balan was re-designated from Whole Time Director (Joint Managing Director) to Whole Time Director. Additionally, Mr. G S Samuel was appointed as Non-Executive Non-Independent Director. Dr. Shanmugasundaram will join multiple board committees including Borrowing, Investment, CSR, and Risk Management committees. All appointments are effective from September 4, 2025, with remuneration approved through September 2028, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1756979976357,
            "Source": "corporate_governance"
        },
        {
            "Title": "SWELECT Energy Systems Reports Q1 Results and Approves Additional Investment in Solar Subsidiary",
            "Summary": "SWELECT Energy Systems Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 6,563.90 lakhs compared to Rs. 6,638.46 lakhs in the same quarter last year, with net profit of Rs. 403.81 lakhs versus Rs. 742.53 lakhs in the previous year quarter. On a consolidated basis, revenue from operations reached Rs. 17,722.48 lakhs compared to Rs. 11,383.73 lakhs in the corresponding quarter, with profit after tax of Rs. 1,397.80 lakhs versus Rs. 898.18 lakhs. The Board also approved an additional investment of up to Rs. 9 crores in wholly owned subsidiary ESG Green Energy Private Limited to expand its solar power plant capacity from 16 MW to 25 MW under the Group Captive Scheme. The total investment in the subsidiary will be up to Rs. 30 crores, including the previously approved Rs. 21 crores. Post-investment, SWELECT's shareholding in the subsidiary will reduce from 100% to 73.98%. The Board also noted the cost audit report for the year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755091929311,
            "Source": "earnings"
        },
        {
            "Title": "Swelect Energy Systems Reports Strong Q1 Growth with EBITDA Doubling Year-over-Year",
            "Summary": "Swelect Energy Systems delivered robust Q1 performance with EBITDA rising to 417 million rupees from 210 million rupees year-over-year. The company's EBITDA margin improved to 23.54% compared to 18.44% in the same period last year. Consolidated net profit surged to 205 million rupees from 62.8 million rupees year-over-year, while revenue grew to 1.8 billion rupees from 1.1 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755089174842,
            "Source": "earnings"
        },
        {
            "Title": "SWELECT ENERGY SYSTEMS Announces Q4 Results and Dividend",
            "Summary": "SWELECT ENERGY SYSTEMS has declared a dividend of 3 rupees per share. For Q4, the company reported an EBITDA of 286 million rupees, up from 236.6 million rupees year-over-year. However, the EBITDA margin decreased to 13.08% from 31.33% in the same period last year. The consolidated net profit for Q4 was 89 million rupees, down from 363.4 million rupees year-over-year, and a loss of 108 million rupees quarter-over-quarter. Q4 revenue increased to 2.2 billion rupees from 755 million rupees in the previous year.",
            "Sentiment": "mixed",
            "PublishDate": 1748620773000,
            "Source": "result"
        },
        {
            "Title": "SWELECT Energy Systems Expands Renewable Energy Capacity",
            "Summary": "SWELECT Energy Systems has announced two significant developments in its renewable energy portfolio. The company has added capacity to its wind energy generation and has commissioned a new 3 MW solar power plant in Tamil Nadu.",
            "Sentiment": "positive",
            "PublishDate": 1743552699000,
            "Source": "corporate_action"
        },
        {
            "Title": "SWELECT Energy Systems Expands Renewable Energy Capacity",
            "Summary": "SWELECT Energy Systems has announced two significant developments in its renewable energy portfolio. The company has added capacity to its wind energy generation and has commissioned a new 3 MW solar power plant in Tamil Nadu.",
            "Sentiment": "positive",
            "PublishDate": 1743513457000,
            "Source": "corporate_action"
        },
        {
            "Title": "SWELECT Energy Systems Invests in Subsidiary NOEL Media",
            "Summary": "SWELECT Energy Systems has approved an investment of Rs 2.5 crore in its subsidiary NOEL Media. The investment will be made through preference shares to meet the subsidiary's funding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1742647304000,
            "Source": "corporate_action"
        },
        {
            "Title": "Swelect Energy Systems Secures 150 MW Solar Module Order and Raises 2.9 Billion Rupees for Expansion",
            "Summary": "Swelect Energy Systems has received orders for over 150 MW of solar modules and successfully raised 2.9 billion rupees to fund its expansion plans. This development indicates significant growth potential for the company in the solar energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741824309000,
            "Source": "order&deals"
        },
        {
            "Title": "SWELECT Energy Systems: Secures 150 MW Module Orders, Raises ₹290 Crore for Expansion",
            "Summary": "SWELECT Energy Systems has secured orders exceeding 150 MW for its TOPCon Bi-facial solar PV modules. The company raised ₹290 crore through NCDs with India Infradebt Limited, unlocking ₹260 crore in cash collaterals for expansion. SWELECT aims to grow its IPP portfolio to 1 GW by 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1741791597000,
            "Source": "order&deals"
        },
        {
            "Title": "SWELECT Energy Systems Secures 150 MW Solar Module Order and Raises 2.9 Billion Rupees for Expansion",
            "Summary": "SWELECT Energy Systems has received orders for over 150 MW of solar modules and successfully raised 2.9 billion rupees to fund its expansion plans. This development indicates significant growth in the company's solar energy business and its ability to secure substantial funding for future projects.",
            "Sentiment": "positive",
            "PublishDate": 1741788970000,
            "Source": "corporate_action"
        },
        {
            "Title": "SWELECT Energy Systems Reports Increased Q3 Loss and Revenue",
            "Summary": "SWELECT Energy Systems reported a consolidated net loss of 108 million rupees in Q3, compared to a loss of 79 million rupees year-over-year and 82 million rupees quarter-over-quarter. However, the company's revenue increased to 914 million rupees, up from 635 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739373206000,
            "Source": "earnings"
        },
        {
            "Title": "SWELECT Energy Systems Approves Issuance of Non-Convertible Debentures",
            "Summary": "SWELECT Energy Systems has approved the issuance of Non-Convertible Debentures (NCDs) worth 1.39 billion rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital for business operations or expansion.",
            "Sentiment": "positive",
            "PublishDate": 1738668153000,
            "Source": "corporate_action"
        },
        {
            "Title": "SWELECT Energy Systems to Raise Funds and Convert Loan to Preference Shares",
            "Summary": "SWELECT Energy Systems has announced two significant financial decisions. Firstly, the company plans to raise 1.39 billion rupees through Non-Convertible Debentures (NCDs). Secondly, they have approved the conversion of a loan given to one of their subsidiaries into preference shares.",
            "Sentiment": "positive",
            "PublishDate": 1734521985000,
            "Source": "corporate_action"
        },
        {
            "Title": "SWELECT Energy Systems Reports Q2 EBITDA Growth",
            "Summary": "SWELECT Energy Systems announced its Q2 financial results. The company's EBITDA increased to 288 million rupees from 168 million rupees in the same quarter last year. However, the EBITDA margin decreased to 14.59% from 34.71% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731339866000,
            "Source": "result"
        },
        {
            "Title": "SWELECT Energy Systems Reports Significant Q2 Profit and Revenue Growth",
            "Summary": "SWELECT Energy Systems has reported a substantial increase in its Q2 consolidated net profit after tax expense, rising to 90 million rupees from 25 million rupees year-over-year and 66 million rupees quarter-over-quarter. The company's Q2 revenue also saw a remarkable surge, reaching 1.97 billion rupees compared to 483 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731339784000,
            "Source": "result"
        },
        {
            "Title": "Swelect Energy Systems: Subsidiary Commissions 7MW Solar Plant",
            "Summary": "<p><span class='neutral'>Swelect Energy Systems'</span> subsidiary, <span class='neutral'>Swelect Clean Energy Private</span>, has <span class='positive'>commissioned</span> a new <b>7MW solar power plant</b> in <span class='neutral'>Tamil Nadu</span> on October 1, 2024. The company's stock initially <span class='positive'>surged 5.19%</span> but later <span class='negative'>traded down 1.78%</span> on the <span class='neutral'>BSE</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728367382000,
            "Source": "normal_news"
        },
        {
            "Title": "SWELECT Energy Systems Commissions 7MW Solar Power Plant in Tamil Nadu",
            "Summary": "<p><span class='positive'>SWELECT Energy Systems'</span> subsidiary has <span class='positive'>successfully commissioned</span> an <span class='positive'>additional 7MW solar power plant</span> in <b>Pisanathur Village</b> and <b>Pudunagar Village</b>, <b>Pudukottai District</b>, <b>Tamil Nadu</b>. The plant became <span class='positive'>operational</span> on <b>October 1, 2024</b>.<br/></p>",
            "Sentiment": "positive",
            "PublishDate": 1728302082000,
            "Source": "corporate_action"
        }
    ]
}