{
    "Symbol": "SWIGGY",
    "ISIN": "INE00H001014",
    "News": [
        {
            "Title": "Swiggy to Cut Quick Commerce Marketing Spend",
            "Summary": "Swiggy plans to reduce high marketing spending for quick commerce operations to lower overall losses. The company focuses on structural changes and cutting unnecessary investments rather than buying growth.",
            "Sentiment": "positive",
            "PublishDate": 1769744207611,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Targets Zero Contribution Margin by Q1 2024",
            "Summary": "Swiggy expects to achieve zero contribution margin by Q1 2024 amid competitive pressures while working towards IOCC structure as shareholder base nears majority threshold.",
            "Sentiment": "neutral",
            "PublishDate": 1769744180525,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Submits Q3FY26 IPO & QIP Monitoring Reports",
            "Summary": "Swiggy Limited filed monitoring agency reports for Q3FY26 showing IPO proceeds utilization of Rs 4,909.05 million during the quarter and QIP proceeds utilization of Rs 1,195.38 million, with no deviations from disclosed objects.",
            "Sentiment": "neutral",
            "PublishDate": 1769691905743,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy Relocates Registered Office Within Bengaluru",
            "Summary": "Swiggy Limited's board approved relocation of registered office from Embassy Tech Village to Sumadhura Capitol Towers in Bengaluru, effective April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769683996612,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Reports Q3FY26 Results with Strong Revenue Growth",
            "Summary": "Swiggy Limited announced Q3FY26 financial results with consolidated revenue reaching ₹6,148 crore, marking 54.0% YoY growth, though losses widened to ₹1,065 crore amid business expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1769683008837,
            "Source": "co_actions_results"
        },
        {
            "Title": "Food delivery firms drop 10-minute promise amid safety concerns",
            "Summary": "Swiggy and Zomato remove 10-minute delivery messaging from marketing after labour minister raises rider safety concerns, forcing shift to execution-focused strategies over speed promises.",
            "Sentiment": "neutral",
            "PublishDate": 1769151342486,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Block Trade: 5M Shares at ₹332 Each",
            "Summary": "Swiggy witnessed a significant block trade involving 5 million shares executed at ₹332 per share, indicating substantial institutional or bulk investor activity in the food delivery platform's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768983943782,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy CEO outlines AI transformation in food delivery",
            "Summary": "At World Economic Forum 2026, Swiggy's Food Marketplace CEO Rohit Kapoor discusses how artificial intelligence is revolutionizing India's food delivery landscape through enhanced customer service and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1768901427345,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy CEO Calls Delivery Work 'Flexible Employment'",
            "Summary": "Swiggy's Food Marketplace CEO Rohit Kapoor advocates treating delivery jobs as flexible employment rather than gig work, highlighting 2.5 million people worked on platform last year at WEF meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1768890908791,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy schedules Q3FY26 earnings call for Jan 29",
            "Summary": "Swiggy Limited announces earnings conference call on January 29, 2026 at 17:00 IST to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768802226390,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy Board Meet on Jan 29 for Q3FY26 Results",
            "Summary": "Swiggy Limited has scheduled its Board of Directors meeting for January 29, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768802083515,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy to Announce Q3 FY25 Results on January 29",
            "Summary": "Food delivery giant Swiggy has scheduled the announcement of its third quarter financial results for January 29, 2025, marking a key milestone for investor updates.",
            "Sentiment": "neutral",
            "PublishDate": 1768801468855,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy, Eternal Benefit From 10-Min Delivery Ban",
            "Summary": "Elara Capital views government's directive to halt 10-minute delivery guarantees as neutral to positive for Swiggy and Eternal, citing minimal business impact as delivery promises were largely optics-driven.",
            "Sentiment": "positive",
            "PublishDate": 1768358434480,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy, Zomato Shares React to 10-Min Delivery Ban",
            "Summary": "Labour Ministry directs quick-commerce platforms to drop 10-minute delivery promises, prioritizing delivery partner safety. Swiggy shares decline 1% while Zomato gains 2.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1768296761598,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Shares Drop as Blinkit Removes 10-Min Delivery",
            "Summary": "Swiggy and Eternal shares declined from day's highs following reports that Blinkit removed its 10-minute delivery deadline after Union Labour Minister's intervention over delivery partner safety concerns.",
            "Sentiment": "negative",
            "PublishDate": 1768294703128,
            "Source": "stocks"
        },
        {
            "Title": "Delivery Apps Drop 10-Minute Delivery Deadline",
            "Summary": "Delivery platforms including Swiggy reportedly discontinue their 10-minute delivery service commitments, marking a shift in quick commerce strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1768292763083,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy draws FII, MF buying for third straight quarter",
            "Summary": "Foreign institutional investors and mutual funds continue increasing stakes in Swiggy for the third consecutive quarter, with FII holdings rising to 16.07% and MF stakes reaching 17.23% despite stock trading 30% below peaks.",
            "Sentiment": "neutral",
            "PublishDate": 1768208239100,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy expands Noice private label beyond staples",
            "Summary": "Swiggy's Noice private label grows from 200 to 350 SKUs in under a year, expanding beyond staples into beverages, ready-to-cook items, and fresh products as the company tests limits of private labels in quick commerce.",
            "Sentiment": "neutral",
            "PublishDate": 1768178230066,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Sees 1.25M Share Block Trade at ₹355 on BSE",
            "Summary": "Swiggy Limited recorded a significant block trade of 1.25 million shares at ₹355 per share on the Bombay Stock Exchange, indicating substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767852854381,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy shares fall below IPO price amid analyst optimism",
            "Summary": "Swiggy shares declined 4.4% to ₹361.95, falling below IPO price of ₹390 for third consecutive day. Despite correction, 23 of 28 analysts maintain buy rating with global funds remaining bullish on recovery prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1767675910342,
            "Source": "stocks"
        },
        {
            "Title": "Cyrus Poonawalla Buys Swiggy Shares Worth ₹42.35 Cr",
            "Summary": "Billionaire Cyrus Soli Poonawalla acquired 11.235 lakh Swiggy shares for ₹42.35 crore at ₹377 per share through open market transaction from Serum Institute of India.",
            "Sentiment": "neutral",
            "PublishDate": 1767618226030,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy Launches EatRight Category in 50+ Cities",
            "Summary": "Swiggy introduces EatRight umbrella category featuring 1.8 million healthy dishes from 200,000+ restaurants across India. The initiative consolidates High Protein, Low Cal, and No Added Sugar options.",
            "Sentiment": "positive",
            "PublishDate": 1767610549657,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Reports 2.18 Lakh Biryani Orders on New Year's Eve",
            "Summary": "Swiggy data reveals diverse New Year's Eve food trends with biryani maintaining its top position for the 10th consecutive year, while comfort foods like chai and khichdi also saw significant demand.",
            "Sentiment": "positive",
            "PublishDate": 1767250459369,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Records 1.05M Share Block Deal Transaction",
            "Summary": "Swiggy witnessed a block deal involving 1.05 million shares, indicating institutional trading activity in the food delivery platform's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767241587461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delhi Leads Zomato Orders, IIT Kharagpur Tops Campus",
            "Summary": "Delhi placed 4.22 crore orders on Zomato by Dec 28, 2025, outpacing Mumbai. IIT Kharagpur led university orders at 2.4 lakh, while UAE accounted for 2.3 lakh international orders.",
            "Sentiment": "positive",
            "PublishDate": 1767177884149,
            "Source": "stocks"
        },
        {
            "Title": "Food Delivery Growth Driven by Experience, Value",
            "Summary": "Swiggy and Magicpin CEOs highlight customer experience, speed, and value consciousness as key drivers for India's food delivery growth in 2026, with focus on merchant inclusion and accessibility.",
            "Sentiment": "positive",
            "PublishDate": 1766915892502,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Gets 14 BPS Index Weight Boost Post-QIP",
            "Summary": "Swiggy's stock is set to receive a 14 basis points boost in index weight following its Qualified Institutional Placement, with an expected buying flow of USD 144 million anticipated.",
            "Sentiment": "positive",
            "PublishDate": 1766050719154,
            "Source": "co_actions_results"
        },
        {
            "Title": "Swiggy Completes ₹10,000 Cr QIP with Strong Investor Response",
            "Summary": "Swiggy successfully completed its QIP raising ₹10,000 crores at ₹375 per share with participation from 61 investors including top mutual funds and global institutions.",
            "Sentiment": "positive",
            "PublishDate": 1765557833162,
            "Source": "co_actions_results"
        },
        {
            "Title": "Macquarie Maintains Underperform Rating on Swiggy",
            "Summary": "Macquarie continues its 'Underperform' rating on Swiggy with a price target of ₹290.00, reflecting cautious outlook on the food delivery platform's stock performance.",
            "Sentiment": "negative",
            "PublishDate": 1765424883438,
            "Source": "stocks"
        },
        {
            "Title": "Swiggy Reports ₹1,092 Crore Loss in Q2 FY26 Despite 54% Revenue Growth",
            "Summary": "Swiggy posted a quarterly loss of ₹1,092 crore for September 2025 quarter despite revenue rising 54% to ₹5,561 crore, with the company's Board approving financial statements for a proposed ₹10,000 crore qualified institutional placement. The food delivery platform's losses widened from ₹626 crore in the same quarter last year, though it recorded a comprehensive income gain of ₹1,350 crore from its planned Rapido investment sale.",
            "Sentiment": "neutral",
            "PublishDate": 1765282226972,
            "Source": "earnings"
        },
        {
            "Title": "Swiggy Launches Qualified Institutional Placement with Floor Price of ₹390.51 Per Share",
            "Summary": "Swiggy Limited opened a qualified institutional placement on December 09, 2025, with a floor price of ₹390.51 per equity share, following board approval and shareholder authorization through a special resolution. The company may offer up to 5% discount on the floor price, with the final issue price to be determined in consultation with book running lead managers.",
            "Sentiment": "positive",
            "PublishDate": 1765276728830,
            "Source": "corporate_action"
        },
        {
            "Title": "Swiggy Denies Media Report on Instamart Market Position, Calls Data Baseless",
            "Summary": "Swiggy issued a clarification denying a MoneyControl article about Instamart's market position, stating the data attributed to RedSeer and competitors is factually erroneous and misleading. RedSeer confirmed they did not share any data with HSBC or MoneyControl for the article and that the market share data mentioned does not match their internal research.",
            "Sentiment": "negative",
            "PublishDate": 1764220720957,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Introduces New Fee for Partner Restaurants on SwiggyOne Orders",
            "Summary": "Swiggy will charge select partner restaurants a new per-order fee based on their percentage of SwiggyOne orders starting November 25, adding to existing commissions of 17-25% and other charges. This follows previous fee introductions including a 2% collection fee in February and removal of surge fee waivers for loyalty program users in May.",
            "Sentiment": "negative",
            "PublishDate": 1763362837756,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Seeks Shareholder Approval for ₹10,000 Crore QIP Capital Raise",
            "Summary": "Swiggy Limited has scheduled an Extraordinary General Meeting on December 8, 2025, to seek shareholder approval for raising up to ₹10,000 crores through a Qualified Institutional Placement of equity shares. The funds will be utilized for quick-commerce expansion, technology investments, brand marketing, debt repayment, and inorganic growth opportunities including acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1763112541763,
            "Source": "corporate_action"
        },
        {
            "Title": "Swiggy Expands Concierge Service 'Crew' to Mumbai, Bengaluru and NCR",
            "Summary": "Swiggy has expanded its travel and lifestyle concierge service 'Crew' to Bengaluru, Mumbai and the National Capital Region after an initial pilot. The service assists users with restaurant reservations, travel itineraries, birthday party planning, gifting, Aadhaar updates and airport transfers. Swiggy CEO of Food Delivery Rohit Kapoor noted that users are utilizing Crew for both everyday errands and premium experiences. Co-founder Phani Kishan Addepalli described Crew as the company's boldest step toward becoming an operating system for modern living, with early users accessing exclusive hotel rates, planning getaways, and organizing various services. The app currently serves a few thousand users and represents Swiggy's continued diversification beyond its core food and grocery delivery businesses.",
            "Sentiment": "positive",
            "PublishDate": 1762862865955,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Board Approves Rs 10,000 Crore QIP Fundraise, Draws Investor Criticism",
            "Summary": "Swiggy's board has approved raising up to Rs 10,000 crore through a Qualified Institutional Placement (QIP), citing a competitive and dynamic environment. The move has drawn criticism from Devina Mehra, Founder & CMD of First Global, who questioned the fundraising strategy of loss-making startups. Mehra highlighted that Swiggy had raised Rs 4,500 crore in its IPO a year ago with an additional Rs 6,800 crore offer for sale. She noted that the company is making losses at the rate of Rs 1,100 crore per quarter, leaving no return on capital to dilute. Mehra criticized the shift in public markets from rewarding profitability to facilitating exits for promoters and earlier investors, and questioned which institutions would subscribe to the QIP. She emphasized that traditional valuation methods remain the only reliable way to value companies, cautioning against fancy new valuation parameters used to justify high valuations.",
            "Sentiment": "negative",
            "PublishDate": 1762770056489,
            "Source": "stock"
        },
        {
            "Title": "New App Toastr Faces Backlash Over Price Comparison Accuracy and Login Requirements",
            "Summary": "Toastr, an app claiming to compare food prices between Swiggy and Zomato in real-time, has faced user complaints after initial social media praise. The app requires users to provide login details for both food delivery platforms to function. Users have reported inaccuracies in price comparisons, with one example showing an item priced at 299 on Zomato and 99 on Swiggy when both platforms actually charged 99. Additional concerns include questions about data scraping methods, whether comparisons include delivery charges and coupons, and potential bias toward certain platforms. Some users noted that Zomato prices displayed on the app are not live and don't include current offers. Meanwhile, brokerage house Nuvama Institutional Equities initiated coverage on Swiggy, stating the company is recovering from earlier strategic missteps, with its food delivery business outpacing Zomato for four consecutive quarters alongside improved profitability.",
            "Sentiment": "negative",
            "PublishDate": 1762769067783,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Reports Strong Growth with Food Delivery Turning Profitable and Quick Commerce Scaling Rapidly",
            "Summary": "Swiggy delivered strong performance with Monthly Transacting Users growing to 16.3 million and Gross Order Value reaching INR 8,542 crores in quarterly results, representing 18.8% year-over-year growth. The food delivery business achieved profitability with an annualized adjusted EBITDA of INR 960 crores. Quick commerce segment showed triple-digit growth with GOV increasing 107.6% year-over-year to INR 4,670 crores, though it remains loss-making with negative 12.1% EBITDA margin. The company expanded its dark store network to 1,102 stores across 128 cities. Out-of-home consumption segment maintained 50% year-over-year GOV growth and has been profitable for three consecutive quarters. Overall platform saw accelerating B2C GOV growth of 30%, driven by cross-pollination between services and increased user engagement across multiple offerings.",
            "Sentiment": "positive",
            "PublishDate": 1762745665646,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Board to Consider ₹10,000 Crore Fundraise via QIP",
            "Summary": "Swiggy's board will meet to consider raising ₹10,000 crore through a qualified institutional placement or other modes. The company reported a net loss of ₹1,092 crore for the September quarter, widening from ₹626 crore year-on-year, while revenue grew 54% to ₹5,561 crore. EBITDA loss increased to ₹798 crore from ₹554 crore. Food Delivery revenue rose to ₹1,923 crore and Quick Commerce revenue jumped to ₹980 crore from ₹490 crore. Cash on books decreased to ₹4,605 crore from ₹5,354 crore in the previous quarter. Nomura noted the fundraise would strengthen Swiggy's balance sheet and support its quick commerce business. Swiggy shares closed 1.84% lower at ₹405.75, remaining above the IPO price of ₹390 but down 25% for the year.",
            "Sentiment": "negative",
            "PublishDate": 1762483265567,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Reports Strong Q2 Performance with 110% Quick Commerce Growth, Plans Capital Raise",
            "Summary": "Swiggy delivered robust quarterly results with quick commerce business achieving 110% gross order value growth. The company's Instamart division improved contribution margins by 200 basis points to negative 2.6%, moving closer to its June 2026 profitability target. Food delivery business maintained strong performance with EBITDA margins improving 44 basis points quarter-on-quarter. Non-grocery categories expanded significantly from 9% to 26% of quick commerce mix over the past year, driven by the Quick India Movement initiative. The company is seeking board approval for a Qualified Institutional Placement to raise growth capital and strategic reserves. Management highlighted that current store network can support double the order volume, with 25% of stores now operating at positive contribution margins. Swiggy expects to demonstrate contribution margin profitability in quick commerce by June 2026 while maintaining competitive positioning in both food delivery and quick commerce segments.",
            "Sentiment": "positive",
            "PublishDate": 1762457763612,
            "Source": "earnings"
        },
        {
            "Title": "Swiggy Shareholders Approve Sale of Instamart Business and Related Party Transaction via Postal Ballot",
            "Summary": "Swiggy Limited shareholders approved two key resolutions through postal ballot conducted via remote e-voting from October 3 to November 1, 2025. The first resolution, a special resolution, approved the sale and transfer of the Instamart Undertaking to an indirect wholly owned subsidiary of the company, receiving 99.9951% votes in favor from 1,864 members. The second resolution, an ordinary resolution, approved a material related party transaction for the sale and transfer of 1,63,990 Series D Compulsorily Convertible Preference Shares and 10 equity shares held by the company in Roppen Transportation Services Private Limited to MIH Investments One B.V., with 99.4480% votes in favor from 1,802 members. The voting process was scrutinized by Pramod SM of BMP Co. LLP, and both resolutions were deemed passed with requisite majority on November 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762180097612,
            "Source": "corporate_action"
        },
        {
            "Title": "Swiggy Targets Profitability by June 2026, Plans to Double Business Without Major Store Investments",
            "Summary": "Swiggy has announced its aim to achieve profitability by the June 2026 quarter. The company stated it can double its business without requiring major store investments, indicating a focus on scaling operations efficiently through existing infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1761982777166,
            "Source": "stock"
        },
        {
            "Title": "Swiggy-Zomato Duopoly to Remain Strong Despite Market Maturity, Says Elara Capital",
            "Summary": "India's food delivery market has matured with growth normalizing to 17-18% GMV from earlier 25%, according to Karan Taurani of Elara Capital. Revenue and EBITDA growth are converging with margins stabilizing around 25-28% from previous 40%+ CAGR levels. Swiggy and Zomato continue their market dominance with no major new entrants challenging their duopoly. Quick commerce expansion and aggressive capital burn are pushing profitability for both companies beyond FY27. Taurani believes Eternal and Blinkit have struck a better balance in growth versus losses. Swiggy's Q1 FY27 breakeven guidance appears achievable from contribution margin perspective, with stock expected to remain range-bound between ₹400-₹470. Reliance's entry into quick commerce through dark stores and JioMart expansion is unlikely to disrupt market leaders due to scale and consumer experience challenges. In the alcoholic beverages sector, Taurani remains bullish on Radico Khaitan, citing strong innovation pipeline and high-margin premium portfolio with P&A segment contributing over 80% of revenue and growing at 20%+. United Breweries faces pressure in regular beer segment with weak volume growth, while United Spirits shows slower 12% growth.",
            "Sentiment": "neutral",
            "PublishDate": 1761899314360,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Reports Strong Q2 Growth with Food Delivery Margins at 2.8% and Quick-Commerce GOV Up 108% YoY",
            "Summary": "Swiggy reported quarterly results with B2C GOV reaching INR 16,683 Cr (47.6% YoY growth) and consolidated adjusted revenue of INR 5,911 Cr (52.6% YoY growth). Food delivery segment achieved GOV of INR 8,542 Cr (18.8% YoY) with adjusted EBITDA margin improving to 2.8%. Quick-commerce business delivered strong performance with GOV of INR 7,022 Cr (107.6% YoY growth) and average order value reaching INR 697 (40% YoY). The company added 40 dark stores to reach 1,102 stores across 128 cities. Platform monthly transacting users grew 34% YoY to 22.9 million. Consolidated adjusted EBITDA loss was INR 695 Cr, improving from INR 813 Cr in Q1. The company announced plans to sell its 12% stake in Rapido for INR 2,400 Cr and the Board will consider fundraising up to INR 10,000 Cr through QIP route.",
            "Sentiment": "positive",
            "PublishDate": 1761858219326,
            "Source": "earnings"
        },
        {
            "Title": "Swiggy Reports Strong Performance with Food Delivery Growth and Instamart Expansion",
            "Summary": "Swiggy's food delivery service demonstrated strong growth with double-digit order increases, marking the highest growth in two years alongside improved profitability. The company's quick commerce platform Instamart recorded significant expansion with 108% yearly growth and 24% quarterly growth, supported by a 40% increase in average order value. Swiggy's overall platform gross order value grew 48% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761833149711,
            "Source": "stock"
        },
        {
            "Title": "Swiggy's Quick Commerce Division Reduces Losses as Profit Margins Improve",
            "Summary": "Swiggy's quick commerce division showed improvement in profitability with profit margins rising from -4.6% in Q1 to -2.6% in Q2. The company reduced its losses in the quick commerce segment by 2 percentage points quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761824870476,
            "Source": "earnings"
        },
        {
            "Title": "Swiggy Considers Rs 10,000 Crore Fundraise Via QIP",
            "Summary": "Swiggy Ltd. announced it is considering raising Rs 10,000 crore through Qualified Institutional Placement or other permitted modes under applicable laws. The announcement came shortly after the company reported quarterly results showing widening net loss year-on-year while revenue increased.",
            "Sentiment": "neutral",
            "PublishDate": 1761823345667,
            "Source": "stock"
        },
        {
            "Title": "Swiggy Reports Wider Net Loss of ₹1,092 Crore Despite 54% Revenue Growth",
            "Summary": "Swiggy reported a net loss of ₹1,092 crore for the September quarter, significantly higher than the ₹626 crore loss in the same quarter last year. Revenue grew 54% to ₹5,561 crore from ₹3,601 crore year-on-year. EBITDA loss widened to ₹798 crore from ₹554 crore in the previous year's quarter. The Food Delivery business generated ₹1,923 crore in revenue, up from ₹1,577 crore, while Quick Commerce revenue doubled to ₹980 crore from ₹490 crore. Swiggy shares closed 0.23% lower at ₹418, remaining above the IPO price of ₹390, though down 23% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761821536389,
            "Source": "earnings"
        },
        {
            "Title": "Swiggy to Announce Q2 Results on October 30 with Earnings Call Scheduled",
            "Summary": "Swiggy will announce its financial results for the second quarter on October 30, with a board meeting scheduled to approve unaudited standalone and consolidated financial results for the quarter and half-year ended September 30. The company has scheduled an earnings call with investors and analysts at 5 p.m. on the same day. In the previous quarter, Swiggy reported a consolidated net loss of Rs 1,197 crore compared to Rs 611 crore loss in the same quarter last year, while total income rose 52.5% to Rs 5,048 crore. Total expenses increased almost 60% to Rs 6,244 crore. Swiggy shares have fallen 0.85% in the past five trading sessions and are down 21.69% year-to-date, though they have gained 32.78% over the past six months. The stock was trading 0.62% up at Rs 424.70 on Wednesday morning.",
            "Sentiment": "neutral",
            "PublishDate": 1761710932079,
            "Source": "earnings"
        },
        {
            "Title": "Swiggy and Magicpin Report Surge in Food Delivery Orders During Festive Season",
            "Summary": "Food delivery platforms Swiggy and magicpin experienced significant increases in orders during India's festive season. Swiggy expects to double last year's food delivery numbers, with cities like Mumbai, Bengaluru, and Kolkata leading demand, alongside emerging markets including Surat, Thiruvananthapuram, and Vadodara. Choco lava cakes topped dessert orders across metros, while Kolkata maintained strong biryani demand. Magicpin reported a 40% surge in vegetarian and thali orders during Navratri, followed by a rebound in both vegetarian and non-vegetarian cuisine demand post-Dussehra. The platform saw a 2.5x increase in bulk and party food delivery orders after Navratri and a 30% jump in orders on October 10 compared to regular days.",
            "Sentiment": "positive",
            "PublishDate": 1760852472819,
            "Source": "stock"
        }
    ]
}