{
    "Symbol": "SWSOLAR",
    "ISIN": "INE00M201021",
    "News": [
        {
            "Title": "Sterling & Wilson Q3FY26 Revenue Surges 48% YoY",
            "Summary": "Sterling & Wilson Renewable Energy achieved highest-ever Q3 revenue of ₹2,092 crores, up 48% YoY, with strong order inflows of ₹6,929 crores YTD and revised guidance of ₹11,000+ crores for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769162301062,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling & Wilson Expects Indian Solar Market Stability",
            "Summary": "Sterling & Wilson Renewable Energy management anticipates Indian domestic solar markets will remain unaffected by potential fluctuations in solar module prices due to China's export rebate changes.",
            "Sentiment": "neutral",
            "PublishDate": 1768541308362,
            "Source": "stocks"
        },
        {
            "Title": "Sterling & Wilson Shares Jump 13% on Strong Q3 Results",
            "Summary": "Sterling & Wilson Renewable Energy shares surged 13% following Q3 results showing 14% revenue growth to ₹2,092 cr and new orders worth ₹3,086 cr, despite net loss due to one-time charges.",
            "Sentiment": "positive",
            "PublishDate": 1768539736825,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling Wilson Targets 15-20% Revenue Growth For FY27",
            "Summary": "Sterling & Wilson Renewable Energy management expects 15-20% revenue growth for FY27 compared to FY26, maintaining ₹11,000 crore guidance excluding Reliance orders.",
            "Sentiment": "positive",
            "PublishDate": 1768538492005,
            "Source": "stocks"
        },
        {
            "Title": "Sterling & Wilson Renewable Energy Q3FY26 Results",
            "Summary": "Sterling & Wilson Renewable Energy reported 48% YoY revenue growth to ₹5,602 crore in 9MFY26, with operational EBITDA rising 115% to ₹289 crore. Company revised order inflow guidance to over ₹11,000 crore for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768472440110,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling & Wilson Q3FY26 Results: Profit Jumps to ₹73cr",
            "Summary": "Sterling & Wilson Renewable Energy reported Q3FY26 net profit of ₹73.09 crore vs ₹77.47 crore in Q3FY25. Revenue grew 21.4% to ₹1,805.51 crore. Company appointed Rajesh Mittal as Senior VP-IT.",
            "Sentiment": "positive",
            "PublishDate": 1768462914793,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling & Wilson Q3FY26 Results Show Strong Recovery",
            "Summary": "Sterling & Wilson Renewable Energy reported Q3FY26 net profit of ₹73.09 crore vs ₹77.47 crore YoY, with revenue rising 21.4% to ₹1,805.51 crore. Company appointed Rajesh Mittal as Senior VP-IT.",
            "Sentiment": "positive",
            "PublishDate": 1768462774858,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling & Wilson Q3 EBITDA Drops to ₹66 cr",
            "Summary": "Sterling & Wilson Renewable Energy reported Q3 EBITDA of ₹66 crore vs ₹70 crore YoY, with EBITDA margin declining to 3.15% from 3.81%. Consolidated revenue grew 13.89% to ₹2,092.21 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1768461831421,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling & Wilson Reports Q3FY26 Results",
            "Summary": "Sterling & Wilson Renewable Energy announced Q3FY26 results with revenue of ₹1,805.51 cr and profit of ₹73.09 cr. Board appointed Rajesh Mittal as Senior VP-IT.",
            "Sentiment": "positive",
            "PublishDate": 1768461796860,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling & Wilson Renewable Energy Q3FY26 Call",
            "Summary": "Sterling & Wilson Renewable Energy Limited announces earnings call scheduled for January 16, 2026 at 10:00 AM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768213822991,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling & Wilson Gets GST Order for ₹14.62 Lakhs",
            "Summary": "Sterling & Wilson Renewable Energy receives GST order for input tax credit mismatch of ₹14.62 lakhs including penalty for April 2018-March 2023 period. Amount partially covered under indemnity agreement.",
            "Sentiment": "negative",
            "PublishDate": 1767360620889,
            "Source": "stocks"
        },
        {
            "Title": "Sterling & Wilson Gets ₹9.40 Cr GST Order from UP",
            "Summary": "Sterling & Wilson Renewable Energy receives revised GST order of ₹9.40 crores from Uttar Pradesh tax authorities for input tax mismatch during April 2021-March 2022. Amount partially covered under indemnity agreement.",
            "Sentiment": "negative",
            "PublishDate": 1767200581298,
            "Source": "stocks"
        },
        {
            "Title": "Sterling & Wilson Gets ₹23.65L GST Order from Jaipur",
            "Summary": "Sterling & Wilson Renewable Energy receives GST order for ₹23.65 lakhs from CGST Jaipur for tax shortfall during April 2018-March 2019. Matter covered under indemnity agreement with key stakeholders.",
            "Sentiment": "negative",
            "PublishDate": 1766573971908,
            "Source": "stocks"
        },
        {
            "Title": "Sterling Wilson Gets ₹2.96 Cr GST Order from Guntur",
            "Summary": "Sterling and Wilson Renewable Energy receives GST order for ₹2.96 crores from Additional Commissioner, CGST Guntur for tax shortfall and input tax mismatch during April 2018 to March 2023 period.",
            "Sentiment": "negative",
            "PublishDate": 1766203266561,
            "Source": "stocks"
        },
        {
            "Title": "Sterling & Wilson Gets GST Order for ₹6.85 Lakh",
            "Summary": "Sterling & Wilson Renewable Energy receives GST order from Haryana authorities for input tax mismatch in FY2018-19, totaling ₹6.85 lakh plus penalty and interest. Company evaluating response.",
            "Sentiment": "negative",
            "PublishDate": 1765456766214,
            "Source": "stocks"
        },
        {
            "Title": "Sterling & Wilson Forms Romania Subsidiary",
            "Summary": "Sterling & Wilson Renewable Energy establishes fully owned subsidiary in Romania with 100 LEI capital for utility electricity projects and European market expansion.",
            "Sentiment": "positive",
            "PublishDate": 1765377603986,
            "Source": "stocks"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Faces Credit Rating Downgrades Across Multiple Facilities",
            "Summary": "Infomerics Valuation and Rating Limited downgraded Sterling and Wilson Renewable Energy's long-term bank facilities from IVR BBB+/Stable to IVR BBB/Stable and short-term facilities from IVR A3+ to IVR A2. The downgrades affect facilities totaling Rs 5,903.99 crore, while one facility worth Rs 22.75 crore was withdrawn following full repayment and company request.",
            "Sentiment": "negative",
            "PublishDate": 1765285803021,
            "Source": "stock"
        },
        {
            "Title": "Bombay High Court Orders Axis Bank to Deposit 614 Million Rupees in Sterling And Wilson Renewable Energy Suit",
            "Summary": "The Bombay High Court has passed an order in a suit filed by Sterling And Wilson Renewable Energy against Axis Bank, requiring the defendant to deposit 614 million rupees for leave to defend. This legal development involves significant financial exposure for Axis Bank in its dispute with the renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1764893279428,
            "Source": "stock"
        },
        {
            "Title": "Sterling And Wilson Establishes New Subsidiary In Portugal For Renewable Energy Expansion",
            "Summary": "Sterling And Wilson has established a new subsidiary in Portugal as part of its renewable energy business expansion strategy. The move positions the company to strengthen its presence in the European renewable energy market and enhance its operational capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1764779940872,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling And Wilson Renewable Secures ₹1,381 Crores Orders From Adani Green Energy",
            "Summary": "Sterling And Wilson Renewable secured orders worth ₹1,381 crores from Adani Green Energy and entered into a 5-year strategic partnership agreement. The deal strengthens Sterling And Wilson's order book and establishes a long-term business relationship with one of India's leading renewable energy companies.",
            "Sentiment": "positive",
            "PublishDate": 1764556387408,
            "Source": "order&deals"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Receives Rs. 31.42 Crore Indemnity Payment, Awaits Rs. 143.12 Crore from SPCPL",
            "Summary": "Sterling and Wilson Renewable Energy received full payment of Rs. 31.42 crore from Mr. Khurshed Yazdi Daruvala under an indemnity agreement, while SPCPL has committed to pay the remaining Rs. 143.12 crore by January 31, 2026. The total indemnity claim of Rs. 174.54 crore stems from agreements dated 2021 involving the company, promoter selling shareholders, and Reliance New Energy Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764428747324,
            "Source": "stock"
        },
        {
            "Title": "Sterling And Wilson Renewable Energy Faces $4.97 Million Arbitration Award to Conti LLC",
            "Summary": "An arbitral tribunal has awarded $4.97 million to Conti LLC in a dispute against Sterling And Wilson Renewable Energy, with additional payments required for legal fees and costs. This arbitration ruling creates a financial obligation for Sterling And Wilson Renewable Energy that will impact the company's finances.",
            "Sentiment": "negative",
            "PublishDate": 1764403623668,
            "Source": "stock"
        },
        {
            "Title": "Sterling And Wilson Renewable Secures ₹1,313 Crore South African Solar Project",
            "Summary": "Sterling And Wilson Renewable has won a 240 MW AC turnkey solar project in South Africa valued at ₹1,313 crores and received the Letter of Award. This project win adds to the company's international renewable energy portfolio and strengthens its presence in the South African market.",
            "Sentiment": "positive",
            "PublishDate": 1764213544797,
            "Source": "stock"
        },
        {
            "Title": "Retail Investors Increase Stakes in Underperforming Stocks During September Quarter",
            "Summary": "Retail investors significantly increased their holdings in some of the market's worst-performing stocks during the September quarter. Sterling & Wilson Renewable Energy saw retail ownership rise to 35.3%, while Tejas Networks reached 22.1% retail shareholding. Both companies lost nearly 60% of their value over the past 12 months, ranking among the weakest performers in the BSE 500 index. Praj Industries, down 52%, also saw retail shareholding increase by 5.3 percentage points to 28.6%. Ola Electric Mobility attracted strong retail interest with ownership surging to 17.3%. This contrasts with the BSE 500 index gaining 5% and Nifty50 returning 7% during the same period. Retail investors also raised stakes in Zee Entertainment Enterprises, Angel One, JK Lakshmi Cement, and Indian Energy Exchange. Despite this trend, a SEBI study found that 91% of individual traders in equity derivatives incurred net losses in FY25, with collective losses of ₹1.06 lakh crore. The number of demat accounts reached 20.7 crore in September, with retail investors now accounting for more than half of daily trades.",
            "Sentiment": "neutral",
            "PublishDate": 1762266008745,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson Reports INR 478 Crore Loss After US Legal Settlement Write-offs",
            "Summary": "Sterling and Wilson Renewable Energy reported a quarterly loss of INR 478 crores due to exceptional items totaling INR 637 crores related to US subsidiary legal matters. The company wrote off INR 580 crores from a Conti LLC arbitration ruling where their USD 55.06 million claim was dismissed and they were awarded USD 6.44 million against them. Additionally, a customer invoked a USD 7.19 million standby letter of credit, and the company settled with OEG Inc. for USD 2.25 million. Despite these setbacks, operational revenue grew 70% year-on-year to INR 1,749 crores. The company secured new orders worth INR 3,775 crores this fiscal, including projects in South Africa, Rajasthan, and Uttar Pradesh. Current unexecuted order value stands at INR 9,287 crores with 84% comprising domestic Indian projects. The company maintains gross margins of 10.3% for the first half and expects to continue 20% revenue growth guidance.",
            "Sentiment": "negative",
            "PublishDate": 1761464732360,
            "Source": "earnings"
        },
        {
            "Title": "Sw Solar Secures Three New Orders Worth 17.72 Billion Rupees",
            "Summary": "Sw Solar has received three new orders with a combined value of 17.72 billion rupees. The company announced these new contract wins, which represent significant business for the solar energy firm.",
            "Sentiment": "positive",
            "PublishDate": 1760920855273,
            "Source": "order&deals"
        },
        {
            "Title": "Sterling & Wilson Renewable Plans Global Expansion with Storage-Solar Integration",
            "Summary": "Sterling & Wilson Renewable is pursuing global expansion and storage-linked solar growth. The company has a 24.4 GW EPC portfolio and a rising operations and maintenance pipeline, which it plans to leverage for margin recovery and order diversification.",
            "Sentiment": "positive",
            "PublishDate": 1760715313374,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Secures Three New Orders Worth INR 1,772 Crore",
            "Summary": "Sterling and Wilson Renewable Energy Limited announced three new project orders with a total value of approximately INR 1,772 crore. The company was declared L1 for two domestic solar EPC projects: a 363 MWp DC project in Rajasthan and a 580 MWp DC project in Uttar Pradesh, both on BOS basis. Additionally, SWREL received a Letter of Intent for a 115 MWp project in South Africa worth approximately USD 120 million. With these new orders, the company's total EPC order inflows for the fiscal year have exceeded INR 3,775 crore. Global CEO Chandra Kishore Thakur expressed satisfaction with the domestic project wins and noted strong progress in the South African market, where the company has secured its third order. The projects are expected to be completed in Q1 FY2027 while maintaining order booking margins.",
            "Sentiment": "positive",
            "PublishDate": 1760702018957,
            "Source": "order&deals"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Reports 70% Revenue Growth Despite INR 637 Crore Write-off",
            "Summary": "Sterling and Wilson Renewable Energy Limited reported quarterly revenue of INR 1,749 crore, marking a 70% year-on-year increase driven by higher domestic and international project execution. The company's operational EBITDA improved to INR 62 crore from INR 23 crore in the previous year quarter. However, reported results were significantly impacted by a one-time write-off of approximately INR 637 crore due to an adverse arbitration ruling in the US, resulting in a reported PAT loss of INR 478 crore. The company secured new orders worth INR 3,775 crore during the fiscal year to date, with current unexecuted order value standing at INR 9,287 crore. Half-year revenue reached INR 3,510 crore, representing an 80% increase over the same period last year. The company maintains a total portfolio of over 24.4 GWp and operates across 28 countries.",
            "Sentiment": "neutral",
            "PublishDate": 1760693002597,
            "Source": "earnings"
        },
        {
            "Title": "Sterling & Wilson Reports ₹473 Crore Loss Despite 70% Revenue Growth",
            "Summary": "Sterling & Wilson Renewable Energy Ltd. reported a net loss of ₹473 crore compared to a net profit of ₹7 crore in the same quarter last year. Revenue increased nearly 70% year-on-year to ₹1,748 crore. EBITDA declined 79% to ₹3.7 crore, with margins falling to 0.2% from 1.7% in the previous year. The company's shares fell 4% initially and dropped 5.5% to ₹230.75 during trading. The stock has declined 51% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1760688915909,
            "Source": "earnings"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Reports ₹2,638 Crore Exceptional Loss in Q2 FY26",
            "Summary": "Sterling and Wilson Renewable Energy Limited announced its quarterly results with revenue from operations of ₹1,276.07 crore for the quarter ended September 30, 2025, compared to ₹995.97 crore in the same period last year. However, the company reported an exceptional loss of ₹2,638.42 crore primarily due to write-offs and impairments related to a wholly owned subsidiary. This included ₹599.70 crore written off due to unfavorable arbitration outcomes and ₹2,038.72 crore impaired due to uncertainty in projected cash flows from a contract. The company's net loss for the quarter was ₹2,583.54 crore compared to a profit of ₹75.02 crore in the previous year. Basic earnings per share stood at negative ₹110.63 for the quarter. The company operates in Engineering, Procurement and Construction (EPC) business and Operation and Maintenance services for renewable energy projects.",
            "Sentiment": "negative",
            "PublishDate": 1760687437728,
            "Source": "earnings"
        },
        {
            "Title": "Sterling And Wilson Renewable Energy Settles Arbitration with OEG for $2.25 Million",
            "Summary": "Sterling And Wilson Renewable Energy has agreed to settle certain claims and counterclaims arising from arbitration initiated by OEG. Under the settlement agreement, SWSS will pay OEG $2.25 million to resolve the dispute.",
            "Sentiment": "neutral",
            "PublishDate": 1760314548355,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Settles Litigation with OEG Inc. for $2.25 Million",
            "Summary": "Sterling and Wilson Renewable Energy Limited disclosed a settlement agreement reached on October 9, 2025, between its subsidiary Sterling and Wilson Solar Solutions Inc. (SWSS) and OEG Inc. USA. The settlement resolves certain claims and counterclaims arising from arbitration initiated by OEG. Under the agreement, SWSS will pay OEG $2.25 million (approximately INR 19.95 crore) in two installments: $0.75 million by October 16, 2025, and $1.50 million by November 8, 2025. SWSS withdrew certain counterclaims against OEG in the arbitration, though these claims are reserved and may be pursued later upon crystallization. The settlement will have a financial impact of INR 19.95 crore on the company's financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1760101575439,
            "Source": "stock"
        },
        {
            "Title": "Tata Trusts And Tata Sons In Talks To Acquire Stake In SP Group",
            "Summary": "Tata Trusts and Tata Sons are in discussions to purchase a 4-6% stake in SP Group. The potential acquisition is aimed at helping alleviate SP Group's debt burden of ₹30,000 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1759833864692,
            "Source": "order&deals"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Reports USD 7.19 Million Letter of Credit Drawdown by US Customer",
            "Summary": "Sterling and Wilson Renewable Energy Ltd announced that a customer, Montague Solar LLC, has drawn down a Standby Letter of Credit worth USD 7,187,989.98 (approximately INR 63.47 Crores) issued in favor of its US subsidiary Sterling and Wilson Solar Solutions Inc. The amount has been reimbursed as required. The company's US subsidiary will examine the matter and pursue recovery from the customer through ongoing litigation proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1758545844711,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Loses USD 55.06 Million Arbitration Claim, Ordered to Pay USD 6.44 Million",
            "Summary": "Sterling and Wilson Renewable Energy Limited received an interim arbitration award that dismissed their subsidiary's USD 55.06 million claim and granted Conti, LLC a claim of USD 6.44 million plus interest. The arbitral tribunal ruled against Sterling and Wilson Solar Solutions Inc., a wholly owned step-down subsidiary of the company, dismissing their claim worth approximately INR 485.64 crore. Instead, Conti, LLC, USA was awarded USD 6.44 million (approximately INR 56.80 crore) plus interest. This represents a significant adverse outcome for the renewable energy company in the material litigation proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1758527656212,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson's South African Tax Demand Reduced by 76% to 9.59 Crore Rupees",
            "Summary": "Sterling and Wilson has seen its South African tax demand significantly reduced from 40.24 crore rupees to 9.59 crore rupees. This represents a substantial decrease in the company's tax liability in South Africa.",
            "Sentiment": "positive",
            "PublishDate": 1758291405356,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Faces Rs. 50.41 Crore Tax Demand from Kenya Revenue Authority",
            "Summary": "Sterling and Wilson Renewable Energy has received a tax demand of Rs. 50.41 crore from the Kenya Revenue Authority. The company plans to file an appeal against this tax demand.",
            "Sentiment": "negative",
            "PublishDate": 1758200434022,
            "Source": "stock"
        },
        {
            "Title": "Array Technologies Files USD 10 Million Claim Against Sterling and Wilson Renewable Energy",
            "Summary": "Array Technologies has filed a claim for approximately USD 10 million against Sterling and Wilson Renewable Energy. The nature of the claim and underlying dispute details were not specified.",
            "Sentiment": "negative",
            "PublishDate": 1757510196009,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Secures INR 415 Crore Solar EPC Contract in Rajasthan",
            "Summary": "Sterling and Wilson Renewable Energy Limited received a Letter of Intent for a Balance of System EPC package worth approximately INR 415 crore from a private IPP developer. The contract involves developing a 300 MW AC / 420 MWp DC Solar PV Project along with 220/33 kV Pooling Substation in Rajasthan, India. The total contract value includes O&M and taxes. Global CEO Chandra Kishore Thakur noted this marks their first order from the Private IPP market this fiscal and contributes to gross order inflows exceeding INR 2,400 crore this year. Sterling and Wilson Renewable Energy is a global renewable EPC solutions provider with a total portfolio of over 22.8 GWp and manages O&M for 9.3 GWp solar power projects across 28 countries.",
            "Sentiment": "positive",
            "PublishDate": 1757414885015,
            "Source": "order&deals"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Dissolves Three Spanish Subsidiaries",
            "Summary": "Sterling and Wilson Renewable Energy Limited dissolved three step-down subsidiary companies in Spain effective April 25, 2025. The three subsidiaries - Esterlina Solar – Proyecto Cinco, S.L., Esterlina Solar – Proyecto Seis, S.L., and Esterlina Solar – Proyecto Ocho, S.L. - had not commenced any business operations since their incorporation. The subsidiaries contributed nil turnover, revenue, income and net worth for Financial Year 2024-25. The company stated that the dissolution will not affect its revenue or business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1757137307962,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Wins 245 MW Solar EPC Contract in Gujarat",
            "Summary": "Sterling and Wilson Renewable Energy Limited emerged as the L1 bidder for a turnkey EPC package to develop a 245 MW AC grid-connected solar PV project in Gujarat from a PSU developer. Global CEO Chandra Kishore Thakur stated that the company's gross order inflows have exceeded INR 2,000 crore this year, strengthening their position in the domestic renewable market. The company operates as a global renewable EPC solutions provider with a total portfolio of over 22.8 GWp and manages an O&M portfolio of 9.3 GWp solar power projects across 28 countries.",
            "Sentiment": "positive",
            "PublishDate": 1755107470196,
            "Source": "stock"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Reports 93% Revenue Growth in Q1 FY26",
            "Summary": "Sterling and Wilson Renewable Energy reported strong quarterly results with revenue growing 93% year-on-year to INR 1,762 crores. The company commissioned over 1 gigawatt of projects during the quarter despite disruptions from cross-border conflicts affecting projects in Rajasthan and Gujarat for 40-45 days. Gross margins improved to 11.7% from 10.1% in FY25, aided by softening input costs, particularly module prices. EBITDA increased 175% year-on-year to INR 102 crores with a 5.8% margin. The company's unexecuted order book stands at INR 8,348 crores as of June 2025, with 88% comprising domestic Indian projects. The bid pipeline has grown significantly to over 30 gigawatts, including 26 gigawatts for India alone, with majority expected to be awarded before December 2025. The company received a two-notch rating upgrade to BBB+ and secured fresh sanctions from three new banks for INR 900 crores plus surety bonds of INR 200 crores. Management maintains 15-20% growth guidance and expects 20% growth in order booking year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1753365886402,
            "Source": "earnings"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Publishes Notice on Unclaimed Shares Transfer to IEPF",
            "Summary": "Sterling and Wilson Renewable Energy Limited has published a notice to shareholders regarding the transfer of unclaimed shares to the Investor Education and Protection Fund (IEPF) Demat Account. The company disclosed this information to BSE Limited and National Stock Exchange of India Limited on July 23, 2025. The notice was published in Financial Express and Navshakti newspapers and was signed by Company Secretary and Compliance Officer Jagannadha Rao Ch. V. This disclosure was made under Regulation 30 read with Regulation 47 of the SEBI Listing Obligations and Disclosure Requirements Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1753271007949,
            "Source": "corporate_action"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy: Q1 Profit Soars, Revenue Up 93%",
            "Summary": "Sterling and Wilson Renewable Energy Ltd reported a nearly eightfold increase in Q1 FY26 consolidated net profit to ₹38.7 crore. Revenue rose 92.5% year-on-year to ₹1,761.6 crore. EBITDA improved to ₹85.4 crore with margin expansion. Gross profit doubled with margins rising to 11.7%. The company cited improved project execution despite domestic market challenges.",
            "Sentiment": "positive",
            "PublishDate": 1752754631000,
            "Source": "earnings"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Reports Q1 Financial Results",
            "Summary": "Sterling and Wilson Renewable Energy has reported its Q1 financial results. The company's EBITDA increased to 855 million rupees from 264 million rupees year-over-year. The EBITDA margin improved to 4.85% from 2.7% in the same period last year. Revenue grew to 17.62 billion rupees from 9.15 billion rupees year-over-year. The consolidated net profit rose to 320 million rupees from 42 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752746312000,
            "Source": "result"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Wins 225 MW Solar Project Bid in Gujarat",
            "Summary": "Sterling and Wilson Renewable Energy has emerged as the lowest bidder (L1) for a 225 MW (AC) solar project in Gujarat. The project will be developed on an EPC (Engineering, Procurement, and Construction) basis for a public sector undertaking (PSU) developer.",
            "Sentiment": "positive",
            "PublishDate": 1748488956000,
            "Source": "default"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy Dissolves Six Spanish Subsidiaries",
            "Summary": "Sterling and Wilson Renewable Energy has announced the dissolution of six of its subsidiaries located in Spain. This move appears to be part of the company's corporate restructuring or strategic realignment of its operations in the European market.",
            "Sentiment": "neutral",
            "PublishDate": 1745588088000,
            "Source": "default"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy: Q4 Profit Doubles but Misses Estimates",
            "Summary": "Sterling and Wilson Renewable Energy's Q4 net profit surged to Rs 55.01 crore, falling short of the Rs 70.15 crore estimate. Revenue doubled to Rs 2,519.11 crore, marking the highest quarterly revenue since listing. Unexecuted order value increased to Rs 9,096 crore. Share price fell 5% following the results.",
            "Sentiment": "neutral",
            "PublishDate": 1745555696000,
            "Source": "earnings"
        },
        {
            "Title": "Sterling and Wilson Renewable Energy: Q4 Profit Soars but Misses Estimates",
            "Summary": "Sterling and Wilson Renewable Energy's Q4 FY25 net profit surged to Rs 55.01 crore, missing analyst estimates of Rs 70.15 crore. Revenue more than doubled to Rs 2,519.11 crore. EBITDA margin expanded to 5.3% from 2.5% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745491951000,
            "Source": "earnings"
        }
    ]
}