{
    "Symbol": "SYMPHONY",
    "ISIN": "INE225D01027",
    "News": [
        {
            "Title": "Symphony Q3FY26: Profit Drops 32% Despite Dividend",
            "Summary": "Symphony Limited reported Q3FY26 net profit of ₹20 crores vs ₹134 crores in Q3FY25. Board declared 3rd interim dividend of ₹2 per share and rolled back subsidiary divestment plans.",
            "Sentiment": "negative",
            "PublishDate": 1769601929158,
            "Source": "co_actions_results"
        },
        {
            "Title": "Symphony Board Meet on Jan 28 for Q3FY26 Results",
            "Summary": "Symphony Limited has scheduled its board meeting for January 28, 2026, to consider Q3FY26 unaudited financial results and potential third interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768828823230,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCLT Rejects Symphony's Request to Resolve Share Register Issues in Sharepro Fraud Case",
            "Summary": "The National Company Law Tribunal (NCLT) has rejected Symphony's request to fix share register issues related to the Sharepro fraud case. This decision affects Symphony's ability to address complications in its shareholding records stemming from the fraud incident.",
            "Sentiment": "negative",
            "PublishDate": 1765012717912,
            "Source": "corporate_governance"
        },
        {
            "Title": "Symphony Limited's Chief Human Resource Officer Nitendra Patel Resigns for Career Growth",
            "Summary": "Nitendra Patel resigned from his position as Chief Human Resource Officer at Symphony Limited, effective at the close of business on December 03, 2025. The resignation was submitted to pursue better job opportunities for professional growth, affecting the company's senior management structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764851060577,
            "Source": "corporate_governance"
        },
        {
            "Title": "Symphony Limited Receives ₹21.05 Crore Penalty Order from Central GST Commissioner",
            "Summary": "Symphony Limited received a consolidated penalty order of ₹21.05 crores from the Commissioner, Central GST and Central Excise Commissionerate, Daman, related to Show Cause Notices for valuation disputes from 2012-2017. The company plans to challenge the order through CESTAT appeal, citing previous favorable rulings in identical matters and external legal advisors' opinion that the findings lack substantive merit.",
            "Sentiment": "negative",
            "PublishDate": 1763204371400,
            "Source": "stock"
        },
        {
            "Title": "Symphony Limited Reports Disappointing Q2 FY26 Results with Revenue Declining to ₹155 Crores",
            "Summary": "Symphony Limited reported a challenging second quarter with standalone revenue falling to ₹155 crores from ₹259 crores in the previous year. EBITDA dropped to ₹27 crores from ₹72 crores, while profit after tax declined to ₹28 crores from ₹67 crores. The company attributed the poor performance to an exceptionally weak summer season in 2025, contrasting with the phenomenal summer of 2024. Despite the quarterly decline, management noted that the first six months still represented the third-highest performance in company history. The air cooler industry experienced substantial degrowth across all players. Symphony's round-the-year product portfolio, including tower fans, kitchen cooling fans, water heaters, and exports, contributed 21% of quarterly revenue and 26% of trailing 12-month revenue. Channel inventory levels remain slightly higher than normal due to reduced sales, though management expects normalization as the season approaches. The company launched 9 new air cooler models in the AirForce range targeting mass and rural markets, along with 8 new water heater models. Symphony's treasury stands at ₹577 crores as of September 30, 2025, compared to ₹685 crores previously.",
            "Sentiment": "negative",
            "PublishDate": 1762899060998,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Limited Declares 50% Interim Dividend for FY 2025-26",
            "Summary": "Symphony Limited's Board of Directors declared an interim dividend of ₹1.00 per equity share (50% on face value of ₹2.00 each) for financial year 2025-26 at their meeting held on November 6, 2025. The dividend will be payable to shareholders whose names appear in the Register of Members on the record date of November 12, 2025. Payment will be made through electronic credit to registered bank accounts, with demand drafts sent to registered addresses for shareholders without registered bank details. The company has issued detailed guidelines regarding Tax Deduction at Source (TDS) provisions following the abolition of Dividend Distribution Tax. TDS rates vary based on shareholder categories - 0% for SEBI-registered mutual funds and certain AIFs, 10% for other resident shareholders (with exemptions for dividends below ₹10,000 annually), and 20% for non-resident shareholders including FPIs and FIIs. Shareholders must ensure their residential status, PAN, category details, email, and address are updated by the record date. Required documentation for tax exemptions must be submitted to the company's registrar by November 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762470958872,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Limited Reports 40% Revenue Decline Amid Air Cooler Inventory Overhang",
            "Summary": "Symphony Limited reported quarterly results showing a 40% year-on-year decline in standalone revenue, attributed to inventory overhang in the General Trade channel for air coolers. EBITDA margins fell to 17.3% from 27.8% due to product mix shifts and operating deleverage. The company's round-the-year product portfolio including large space venti cooling, tower fans, kitchen cooling fans, and water heaters recorded growth on a low base. Symphony expanded its AirForce range from three to seven SKUs and added six new storage water heater variants and two instant variants. The company achieved ₹4 crore additional recovery from Pathways in October 2025, bringing year-to-date recovery to ₹8.5 crore against ₹50.2 crore written off in FY2024-25. The Board approved a second interim dividend of ₹1 per share for FY2025-26. International operations showed mixed performance with GSK China progressing toward debt-free status through IPR monetization of approximately ₹45 crore, while Climate Holdings Australia registered its third consecutive quarter of year-on-year growth.",
            "Sentiment": "negative",
            "PublishDate": 1762418890247,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Reports 66% Decline in Q2 Net Profit to 190 Million Rupees",
            "Summary": "Symphony reported quarterly consolidated net profit of 190 million rupees, down from 560 million rupees in the same period last year. The company's EBITDA fell to 240 million rupees from 770 million rupees year-over-year. EBITDA margin compressed significantly to 14.72% compared to 26.64% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762412363112,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Limited Announces 24th Interim Dividend for FY2025-26",
            "Summary": "Symphony Limited has declared its 24th interim dividend for FY2025-26. The company submitted newspaper clippings of the record date notice to both the National Stock Exchange of India Limited and BSE Limited. The notice was published on October 30, 2025, with the submission made by Company Secretary and Head-Legal Mayur Barvadiya.",
            "Sentiment": "positive",
            "PublishDate": 1761832943130,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Limited Q1 FY26 Revenue Drops 39% to ₹229 Crores Due to Subdued Summer Season",
            "Summary": "Symphony Limited reported quarterly revenue of ₹229 crores, down from ₹373 crores in the previous year, with profit after tax declining to ₹37 crores from ₹69 crores. The company attributed the decline to a shortened and rain-disrupted summer season, though noted this was the second-highest June quarter sales ever, surpassing June 2022 by 10%. The Board approved an interim dividend of ₹1 per share. Channel inventory remains higher than normal due to the weak summer. The company's alternative product categories including tower fans, kitchen cooling fans, and water heaters showed robust growth and now constitute approximately 25% of Symphony India's sales, up from less than 10% previously. For trailing 12 months, standalone revenue increased to ₹1,038 crores from ₹996 crores. The company continues its divestment process for IMPCO Mexico and Symphony Australia subsidiaries, with potential completion expected by end of current financial year or early next year. GSK China completed the first tranche of a USD 5.2 million IPR transaction with IMPCO Mexico, receiving ₹22 crores in the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754650027457,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Limited Reports Q1 FY2026 Results and Declares ₹1 Interim Dividend",
            "Summary": "Symphony Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹251 crores compared to ₹393 crores in the same quarter last year. Net profit from continuing operations was ₹39 crores versus ₹73 crores in the previous year quarter. The company declared a first interim dividend of ₹1 per equity share (50% on face value of ₹2 each) for FY2025-26, amounting to ₹6.87 crores. The board also approved exploring divestment of stakes in wholly owned subsidiaries Symphony AU Pty Limited (Australia) and IMPCO S de R.L. de C.V. (Mexico), which are now classified as discontinued operations. These subsidiaries contributed ₹3 crores profit from discontinued operations during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754028526458,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Reports Sharp Decline in Q1 Financial Performance",
            "Summary": "Symphony reported significantly lower financial results for Q1. Net profit dropped to 420 million rupees from 880 million rupees in the same period last year. Revenue fell to 2.5 billion rupees compared to 3.93 billion rupees year-over-year. EBITDA declined to 260 million rupees from 870 million rupees, while EBITDA margin compressed to 10.36% from 22.14% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754028136593,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Limited Schedules Q1 Results Conference Call for August 1, 2025",
            "Summary": "Symphony Limited has arranged an analysts conference call on August 1, 2025, at 4:30 PM IST to discuss its unaudited financial results for the first quarter ended June 30, 2025. The call will be conducted through IIFL Securities Limited with senior management participation including Chairman & Managing Director Achal Bakeri, Managing Director Nrupesh Shah, Group CEO & Executive Director Amit Kumar, and CEO International Rajesh Mishra. The conference call will provide access through multiple channels including audio-only options and international dial-in numbers for participants from various regions including the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753797270118,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Limited Extends Divestment Plan to Include Australian Subsidiary SAPL",
            "Summary": "Symphony Limited's Board of Directors confirmed the extension of its divestment plan to include Symphony AU Pty Limited (SAPL), Australia, alongside the previously announced divestment of Climate Technologies Pty Limited. SAPL is a wholly owned subsidiary of Symphony Limited, incorporated in 2018 as a Special Purpose Vehicle for acquiring Climate Technologies. SAPL holds 100% equity in Climate Technologies Pty Limited. The board decision extends the scope of the monetization strategy that was initially announced in April 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753424396468,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Limited Sets August 7, 2025 as Record Date for First Interim Dividend of FY 2025-26",
            "Summary": "Symphony Limited has fixed August 7, 2025 as the record date for determining shareholder eligibility for the first interim dividend of FY 2025-26. The Board will meet on August 1, 2025 to declare the dividend. Shareholders whose names appear as beneficial owners in depository statements and as members in the company's register as of close of business on August 7, 2025 will be entitled to the interim dividend, if declared by the Board.",
            "Sentiment": "neutral",
            "PublishDate": 1753352574290,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Ltd: Q4 Revenue Surges 47%, Profit Up 65%",
            "Summary": "Symphony Ltd reported strong Q4 results with revenue up 47% YoY to ₹488 crore and net profit up 65% YoY to ₹79 crore. EBITDA margin expanded by 480 bps to 22%. The company plans to exit loss-making international subsidiaries in Australia and Mexico. Management expects margins to remain stable through FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1746687612000,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Symphony has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.1 billion rupees from 570 million rupees last year, with the EBITDA margin rising to 21.93% from 17.17%. Consolidated net profit grew to 790 million rupees from 480 million rupees year-over-year, although there was a 100 million rupee loss quarter-over-quarter. Revenue rose to 4.9 billion rupees from 3.3 billion rupees in the same quarter last year. Additionally, Symphony has recommended a final dividend of 8 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746621586000,
            "Source": "result"
        },
        {
            "Title": "Symphony Ltd: Q4 Profit Surges 65%, ₹8 Dividend Declared",
            "Summary": "Symphony Ltd reported a 64.6% YoY increase in Q4 net profit to ₹79 crore. Revenue grew 47% to ₹488 crore, while EBITDA jumped 87.7% to ₹107 crore. The board recommended a final dividend of ₹8 per share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1746621569000,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Ltd: Plans Stake Sale in Australian and Mexican Subsidiaries",
            "Summary": "Symphony Ltd. is exploring divestment of stakes in Climate Technologies (Australia) and IMPCO (Mexico) to enhance capital efficiency. Climate Technologies remains Ebitda-negative despite Rs 350 crore investment. IMPCO Mexico shows strong performance with Rs 24 crore Ebitda. The move aims to reallocate resources towards higher-growth opportunities in India and international markets. Symphony also plans to streamline internal financial structure, with GSK China selling technology to IMPCO Mexico for Rs 43 crore.",
            "Sentiment": "positive",
            "PublishDate": 1745048544000,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony to Sell Technology and IPR of Chinese Subsidiary",
            "Summary": "Symphony's board will consider and approve the sale of technology and intellectual property rights from its Chinese subsidiary, Guangdong Symphony Keruilai Air Coolers Co. Ltd., to IMPCO for approximately USD 5.1 million (around ₹43.5 crores).",
            "Sentiment": "positive",
            "PublishDate": 1744120507000,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Announces Board Meeting to Consider Divestment of Subsidiaries",
            "Summary": "Symphony has scheduled a board meeting for April 12 to discuss several key points, including the potential divestment or monetization of its stakes in two subsidiaries: Symphony AU PTY Limited in Australia and IMPCO S de R.I. de C.V. in Mexico.",
            "Sentiment": "neutral",
            "PublishDate": 1744120495000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Symphony Ltd: Anticipates Strong Q1 FY25 Performance and Improved Margins",
            "Summary": "Symphony Ltd expects robust Q1 FY25 performance due to early summer sales. The company anticipates maintaining or improving EBITDA margins from the first 9 months of the current fiscal. International subsidiaries, except the Australian one, are showing strong growth. The Australian subsidiary has reduced costs significantly and is expected to turn around in 1-2 years.",
            "Sentiment": "positive",
            "PublishDate": 1741162157000,
            "Source": "normal_news"
        },
        {
            "Title": "Symphony Reports Decline in Q3 Profit with Exceptional Item",
            "Summary": "Symphony Limited reported a profit before tax (PBT) of 280 million rupees for the third quarter, down from 500 million rupees in the same period last year. The company also recorded an exceptional item of 460 million rupees, which significantly impacted its financial results.",
            "Sentiment": "negative",
            "PublishDate": 1738740150000,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Declares Third Interim Dividend",
            "Summary": "Symphony Limited has announced a third interim dividend of Rs 2 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1738740029000,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Reports Q3 Revenue Decline",
            "Summary": "Symphony Limited has reported its third-quarter revenue figures. The company's revenue for Q3 stood at 2.4 billion rupees, compared to 2.47 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738739954000,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Symphony Limited has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 290 million rupees from 440 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 12% from 17.81% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738739931000,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Reports Q3 Consolidated Net Loss of 100 Million Rupees",
            "Summary": "Symphony Limited has reported a consolidated net loss of 100 million rupees for the third quarter, compared to a profit of 410 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1738739847000,
            "Source": "earnings"
        },
        {
            "Title": "Symphony Increases Loan Agreement Size with Subsidiary",
            "Summary": "Symphony has entered into a second addendum to its loan agreement with its subsidiary. The agreement size has been increased from A$10 million to A$15 million.",
            "Sentiment": "positive",
            "PublishDate": 1734958577000,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Ltd Expects Double-Digit Growth in India",
            "Summary": "Symphony Ltd has expressed confidence in its growth prospects during a recent conference call. The company believes it is well-positioned for consistent growth and anticipates achieving a respectable double-digit Compound Annual Growth Rate (CAGR) in its India operations moving forward.",
            "Sentiment": "positive",
            "PublishDate": 1730259634000,
            "Source": "normal_news"
        },
        {
            "Title": "Symphony Declares Second Interim Dividend",
            "Summary": "Symphony Limited has announced a second interim dividend of 2 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730184809000,
            "Source": "corporate_action"
        },
        {
            "Title": "Symphony Reports Strong Q2 EBITDA Growth",
            "Summary": "Symphony Limited has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 640 million rupees from 410 million rupees in the same quarter last year. Additionally, Symphony's EBITDA margin expanded to 20.32% from 14.91% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730184743000,
            "Source": "result"
        },
        {
            "Title": "Symphony Reports Q2 Revenue Growth",
            "Summary": "Symphony Limited has reported a revenue of 3.15 billion rupees for the second quarter, compared to 2.75 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730184701000,
            "Source": "result"
        },
        {
            "Title": "Symphony Reports 60% Increase in Q2 Net Profit",
            "Summary": "Symphony Limited has announced its Q2 consolidated net profit of 560 million rupees, compared to 350 million rupees in the same quarter last year, representing a significant year-over-year increase of 60%.",
            "Sentiment": "positive",
            "PublishDate": 1730184674000,
            "Source": "result"
        }
    ]
}