{
    "Symbol": "SYNCOMF",
    "ISIN": "INE312C01025",
    "News": [
        {
            "Title": "Syncom Formulations Board Meet Set for Feb 12, 2026",
            "Summary": "Syncom Formulations (India) Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770193008307,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syncom Formulations Faces ₹1.42 Cr GST Demand",
            "Summary": "Syncom Formulations receives revised GST demand notice of ₹1.42 crores including penalty for ineligible input tax credits, plans to appeal the decision.",
            "Sentiment": "negative",
            "PublishDate": 1767423440987,
            "Source": "stocks"
        },
        {
            "Title": "Syncom Formulations Acquires Commercial Property in Mumbai for ₹51.70 Crores",
            "Summary": "Syncom Formulations (India) Limited has successfully acquired the entire 3rd Floor of TradeStar building on Andheri-Kurla Road, Mumbai, from HDFC Bank Ltd. The pharmaceutical company paid ₹51.70 crores as full and final consideration for this commercial property acquisition, which the company considers material in nature.",
            "Sentiment": "positive",
            "PublishDate": 1763809030896,
            "Source": "corporate_action"
        },
        {
            "Title": "Syncom Formulations Reports Mixed Q2 Performance with Revenue Decline and Profit Drop",
            "Summary": "Syncom Formulations (India) Limited reported quarterly results for the period ended September 30, 2025. The company's revenue from operations decreased to Rs 12,143.51 lakhs compared to Rs 16,546.69 lakhs in the previous quarter. Net profit for the quarter stood at Rs 1,572.93 lakhs, down from Rs 1,695.00 lakhs in the prior quarter. For the half-year period, revenue reached Rs 28,690.20 lakhs versus Rs 18,735.68 lakhs in the corresponding previous period. The company operates in three business segments: Pharmaceuticals, Drugs & Formulations, Trading of Commodities, and Renting of Property. Basic earnings per share for the quarter was Rs 0.18 compared to Rs 0.21 in the previous quarter. The results were approved by the Board of Directors at their meeting held on November 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762982492735,
            "Source": "earnings"
        },
        {
            "Title": "Syncom Formulations Reports 49% Jump in Q2 Net Profit to 166 Million Rupees",
            "Summary": "Syncom Formulations (India) reported quarterly net profit of 166 million rupees compared to 111 million rupees in the same period last year. Revenue increased to 1.2 billion rupees from 1.02 billion rupees year-over-year. EBITDA rose to 184 million rupees from 122 million rupees, while EBITDA margin improved to 15.12% from 11.89% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762963140670,
            "Source": "earnings"
        },
        {
            "Title": "Syncom Formulations Announces Dual Leadership Resignations of CFO and Whole-time Director",
            "Summary": "Syncom Formulations (India) Limited announced the resignation of two key executives effective August 8, 2025. Shri Ankit Kedarmal Bankda resigned from his position as Chief Financial Officer, while Smt. Rinki Ankit Banka stepped down from her roles as Director and Whole-time Director. The company filed the disclosure on August 18, 2025, explaining that the delay in submitting resignation letters was due to internal processing and final settlement formalities with the departing executives. The resignations affect the company's senior management structure and board composition.",
            "Sentiment": "negative",
            "PublishDate": 1755524995916,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syncom Formulations Reports Strong Q1 Growth with Revenue Up 34% and Net Profit Doubling",
            "Summary": "Syncom Formulations (India) delivered robust Q1 performance with revenue rising to 1.17 billion rupees from 872.6 million rupees year-over-year. Net profit more than doubled to 158 million rupees compared to 76.3 million rupees in the same period last year. EBITDA increased to 158 million rupees from 104.5 million rupees, while EBITDA margin improved to 13.52% from 11.98% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754662737160,
            "Source": "earnings"
        },
        {
            "Title": "Syncom Formulations Board Approves Changes to Articles and Memorandum of Association",
            "Summary": "Syncom Formulations (India) Limited's Board of Directors approved alterations to the company's Articles of Association and Memorandum of Association at a meeting held on August 8, 2025. The changes include inserting new articles related to power purchase agreements, projects, sweat equity shares, and ESOP provisions. The Board also approved substituting the existing dividend waiver article and adding new business clauses for nutraceuticals, dietary supplements, wellness products, and real estate development activities. All proposed changes are subject to shareholder approval at the upcoming 37th Annual General Meeting scheduled for September 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754660141729,
            "Source": "corporate_action"
        },
        {
            "Title": "Syncom Formulations Announces Leadership Reshuffle and Approves Q1 Results",
            "Summary": "Syncom Formulations India Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company announced significant leadership changes effective August 9, 2025: Kedarmal Shankarlal Bankda was re-designated from Chairman to Whole-time Director, while his son Ankit Kedarmal Bankda resigned as CFO and was appointed as the new Chairman and Whole Time Director. Rahul Vijay Bankda, son of Managing Director Vijay Shankarlal Bankda, was appointed as the new CFO. Additionally, Rinki Ankit Banka resigned from her position as Whole-time Director. The board also approved the notice for the 37th Annual General Meeting scheduled for September 29, 2025, to be held via video conferencing, and appointed various auditors including secretarial, cost, and internal auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1754656422662,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syncom Formulations Reports Strong Q1 Performance with Revenue of ₹8,683 Crores",
            "Summary": "Syncom Formulations (India) Limited reported quarterly results with revenue from operations of ₹8,683.09 lakhs and profit of ₹1,572.93 lakhs for continuing operations. The company operates in three segments: Pharmaceuticals Drugs & Formulations (₹8,585.33 lakhs revenue), Trading of Commodities (₹96.66 lakhs), and Renting of Property (₹1.10 lakhs). Basic earnings per share stood at ₹0.16. The Board of Directors approved these unaudited standalone and consolidated financial results at their meeting held on August 8, 2025. The company has three wholly owned subsidiaries: Synmex Pharma Pvt. Ltd., Sante Biotech Pvt. Ltd., and Vincit Biotech International Pvt. Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1754654964006,
            "Source": "earnings"
        },
        {
            "Title": "Syncom Formulations Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Syncom Formulations has reported a substantial increase in both net profit and revenue for the fourth quarter. The company's net profit rose to 175 million rupees, up from 67.5 million rupees year-over-year and 128 million rupees quarter-over-quarter. Revenue for Q4 reached 1.5 billion rupees, compared to 732.7 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747700292000,
            "Source": "default"
        },
        {
            "Title": "Syncom Formulations Reports Significant Q4 Financial Growth",
            "Summary": "Syncom Formulations has reported substantial year-over-year growth in its Q4 financial results. The company's EBITDA increased to 175 million rupees from 88.1 million rupees in the previous year. However, the EBITDA margin slightly decreased to 11.77% from 12.02%. Net profit rose to 175 million rupees from 67.5 million rupees year-over-year and 128 million rupees quarter-over-quarter. Revenue showed significant growth, reaching 1.5 billion rupees compared to 732.7 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747666836000,
            "Source": "result"
        }
    ]
}