{
    "Symbol": "SYNGENE",
    "ISIN": "INE398R01022",
    "News": [
        {
            "Title": "Syngene Intl drops 10.64% amid market decline",
            "Summary": "Syngene International shares fell 10.64% to Rs 485.95, becoming one of the top losers on Nifty Midcap 150. The company reported revenue of Rs 3,642.40 crore in 2025, up from Rs 3,488.60 crore in 2024.",
            "Sentiment": "negative",
            "PublishDate": 1769506429681,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syngene Revises FY26 Outlook to 2-3% Decline",
            "Summary": "Syngene International has revised its FY26 growth forecast, now expecting a 2-3% decline compared to its previous prediction of mid-single digit growth, marking a significant shift in the company's outlook.",
            "Sentiment": "negative",
            "PublishDate": 1769148447201,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syngene Pays ₹20,000 Fine for Committee Non-Compliance",
            "Summary": "Syngene International paid ₹20,000 plus GST fine to stock exchanges for non-compliance with Nomination & Remuneration Committee composition requirements under SEBI regulations during Q2 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1769091576465,
            "Source": "stocks"
        },
        {
            "Title": "Syngene Q3FY26 Results: Profit Drops 86.6% YoY",
            "Summary": "Syngene International reports Q3FY26 standalone profit of ₹165 million, down 86.6% YoY from ₹1,231 million. Revenue declined 4.9% to ₹8,344 million amid exceptional charges of ₹658 million.",
            "Sentiment": "negative",
            "PublishDate": 1769089944509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syngene extends Bristol Myers partnership till 2035",
            "Summary": "Syngene International announced extension of its strategic research collaboration with Bristol Myers Squibb until 2035, expanding the 25-year partnership to include integrated services across the entire drug development lifecycle.",
            "Sentiment": "positive",
            "PublishDate": 1768805178353,
            "Source": "stocks"
        },
        {
            "Title": "Syngene Extends Bristol Myers Partnership to 2035",
            "Summary": "Syngene International announces extension of its research partnership with Bristol Myers Squibb, prolonging collaboration through 2035 in a significant strategic move.",
            "Sentiment": "positive",
            "PublishDate": 1768798277210,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syngene Gets Partial Relief in Tax Appeal Case",
            "Summary": "Syngene International receives favorable ruling from National Faceless Appeal Centre in tax litigation case for Assessment Year 2016-17, expects reduced contingent liability and potential refund.",
            "Sentiment": "positive",
            "PublishDate": 1767966437608,
            "Source": "stocks"
        },
        {
            "Title": "Syngene International Q3 Results on Jan 22",
            "Summary": "Syngene International has announced that its board will convene on January 22 to consider and approve the company's third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1767860732763,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syngene Wins Tax Refund Case Worth ₹48.90 Crores",
            "Summary": "High Court of Karnataka allows Syngene International's writ petition, directing income tax authorities to refund ₹48.90 crores with interest for assessment years 2010-13.",
            "Sentiment": "positive",
            "PublishDate": 1767118888683,
            "Source": "stocks"
        },
        {
            "Title": "Syngene Invests ₹35 Cr in O2 Renewable Energy V",
            "Summary": "Syngene International announces ₹35 crore investment in O2 Renewable Energy V Private Limited to acquire 8.23% stake for renewable power sourcing through wind-solar hybrid assets.",
            "Sentiment": "positive",
            "PublishDate": 1766505771366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syngene Reports Sharp Drop in CO Exports",
            "Summary": "Syngene International experiences significant decline in CO exports with 77% month-over-month drop and 53% year-over-year decrease, indicating challenging export conditions.",
            "Sentiment": "negative",
            "PublishDate": 1766118521162,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syngene Hosts Clinical Trials Market Webinar",
            "Summary": "Syngene International conducted an investor webinar on December 17, 2025, focusing on its Translation and Clinical Research business and the growing clinical trials market opportunity.",
            "Sentiment": "positive",
            "PublishDate": 1765957434618,
            "Source": "stocks"
        },
        {
            "Title": "Syngene International Announces Senior Management Changes in CDMO Leadership",
            "Summary": "Syngene International announced that Alex DelPriore, Head of Large Molecules CDMO and Executive Committee member, will leave the company by mutual consent with immediate effect. Dr. Rohtash Kumar has been appointed as Head of CDMO, Small and Large Molecules and Executive Committee member, effective December 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763484212609,
            "Source": "corporate_governance"
        },
        {
            "Title": "SynGene Reports 263% Increase in CO Exports Year Over Year",
            "Summary": "SynGene reported a 263% year-over-year increase in CO exports.",
            "Sentiment": "positive",
            "PublishDate": 1762833662369,
            "Source": "stock"
        },
        {
            "Title": "Syngene International Provides FY26 Financial Guidance with Mid-Single Digit Revenue Growth",
            "Summary": "Syngene International has issued guidance for FY26, projecting mid-single digit revenue growth in constant currency and mid-20s EBITDA margins, though with declining profit after tax. The company expects capital expenditure of $45 million plus an additional $10 million for the Bayview facility. Raw material costs are projected at around 25% of revenue for the full year, with an effective tax rate of 21-23%. Management maintains their full year guidance and notes historically stronger performance in the second half of the year.",
            "Sentiment": "neutral",
            "PublishDate": 1762486913993,
            "Source": "stock"
        },
        {
            "Title": "Syngene International Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Syngene International reported Q2 revenue of 9.1 billion rupees, up from 8.9 billion rupees year-over-year. However, the company's consolidated net profit declined to 671 million rupees from 1.06 billion rupees in the same period last year. EBITDA fell to 1.99 billion rupees compared to 2.45 billion rupees year-over-year, while EBITDA margin compressed to 21.91% from 27.5% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762395266287,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International Reports Quarterly Financial Results for September 2025",
            "Summary": "Syngene International Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved both standalone and consolidated financial results prepared under Indian Accounting Standards. The company wrote off Rs. 277 million net (Rs. 202 million after tax) as unrecoverable receivables due to foreign exchange rate changes during the quarter. The company operates in a single segment providing Contract Research and Manufacturing Services. During the six months ended September 2025, additional pre-operating costs of Rs. 165 million were accumulated under capital work in progress related to their US biologics facility acquisition. The Board meeting was held on November 5, 2025, and the results have been subject to limited review by statutory auditors with unqualified reports.",
            "Sentiment": "neutral",
            "PublishDate": 1762370077025,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International Receives Tax Order Reducing Demand to Rs 48.61 Crore for AY 2015-16",
            "Summary": "Syngene International Limited received an order dated October 17, 2025 from the Deputy Commissioner of Income-tax, Circle 6(1)(1), Bengaluru regarding Assessment Year 2015-16. The order gives effect to a previous ruling by the National Faceless Appeal Centre and reduces the tax demand from Rs 79.84 crore to Rs 48.61 crore (including interest). The original assessment in December 2017 had disallowed various deductions claimed by the company and raised a demand of Rs 37.20 crore. A subsequent reassessment in September 2021 increased the demand to Rs 79.84 crore, but the National Faceless Appeal Centre quashed the reassessment proceedings in December 2023. The company believes it has merits in the case and expects there may not be material impact on its financials, operations or activities. Appeal proceedings related to the original assessment remain in progress.",
            "Sentiment": "neutral",
            "PublishDate": 1762284978361,
            "Source": "stock"
        },
        {
            "Title": "Syngene International Appoints Surender Sharma as General Counsel and Executive Committee Member",
            "Summary": "Syngene International Limited has appointed Surender Sharma as General Counsel and member of the Executive Committee, effective October 28, 2025. Sharma joins from Colgate-Palmolive (India) Limited, where he served as Whole-Time Director and Vice President — Legal, Secretarial, and Corporate Affairs. He brings over two decades of experience in corporate governance, mergers and acquisitions, joint ventures, compliance, and regulatory affairs, having worked with organizations including Colgate-Palmolive, Marico, Heinz, Indian Hotels, Reckitt, and Maruti. Sharma holds a Bachelor of Science in Chemistry from St. Stephen's College, an LLB from Delhi University, and is a qualified Company Secretary.",
            "Sentiment": "positive",
            "PublishDate": 1761650314810,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syngene Expands Biologics Facility with New ADC Bioconjugation Capability",
            "Summary": "Syngene International confirmed plans to provide fully integrated, end-to-end services for antibody-drug conjugates (ADCs), from discovery through GMP manufacturing. The expansion will enable both Monoclonal Antibodies production and GMP bioconjugation at a single site, complementing the company's existing commercial capabilities in payload and linker manufacturing. The investment in bioconjugation capabilities is considered part of ordinary business operations and does not meet materiality criteria under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761238028690,
            "Source": "stock"
        },
        {
            "Title": "Syngene Reports Sharp Export Decline with 35% Drop in September Quarter",
            "Summary": "Syngene experienced a significant decline in its export performance during the September quarter, with exports falling by 35%. The company's export data also showed a steeper 52% decrease specifically for the month of September.",
            "Sentiment": "negative",
            "PublishDate": 1760421846583,
            "Source": "stock"
        },
        {
            "Title": "Syngene International Releases Q1 FY2026 Earnings Call Transcript",
            "Summary": "Syngene International Limited has made available the transcript of its Q1 FY2026 earnings call held on July 24, 2025, on the company's website. The company notified stock exchanges NSE and BSE about the transcript availability through a formal communication signed by Company Secretary & Compliance Officer Chethan Yogesh on July 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753802742168,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International Reports Strong Q1 Results, CEO Confident of Mid-Teens Revenue Growth for FY26",
            "Summary": "Syngene International delivered strong quarterly results with revenue from operations rising 11% to Rs 875 crore, while profit after tax surged 59% to Rs 87 crore. EBITDA increased 19% to Rs 224 crore with margins improving to 25%. CEO Peter Bains expressed confidence in maintaining full-year guidance for revenue growth in early teens for FY26, noting the performance was driven by strong momentum in research services and successful conversion of pilot projects into larger programmes. The company operationalized its Unit 3 biologics facility in Bengaluru and expects its Bayview facility in the US to become operational in the second half of the fiscal year. Bains acknowledged that biotech funding has not fully recovered to pre-pandemic levels but noted strong interest from multinational biopharma companies. Shares closed 1.47% lower at Rs 670.75.",
            "Sentiment": "positive",
            "PublishDate": 1753408732334,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International Reports 11% Revenue Growth to Rs. 875 Cr in Q1 FY26, Updates Key Management Personnel",
            "Summary": "Syngene International Limited reported revenue from operations of Rs. 875 crores for the first quarter of FY26, representing an 11% year-on-year increase from Rs. 790 crores. The company's reported EBITDA grew 19% to Rs. 224 crores with EBITDA margin improving to 25% from 23%. Reported PAT increased 59% to Rs. 87 crores compared to Rs. 54 crores in the same quarter last year. The company updated its list of Key Managerial Personnel authorized to determine materiality of events, naming Peter Bains as Managing Director and CEO, Deepak Jain as CFO, and Chethan Yogesh as Company Secretary and Compliance Officer. Syngene successfully completed a USFDA Good Clinical Practices inspection with no observations and received recognition from TIME magazine as one of the World's Most Sustainable Companies in 2025, ranking #1 in India among pharma and biotech companies. The company inaugurated a new peptide laboratory and started operations at its Unit III facility in Bengaluru while preparing to commence operations at its Bayview facility in the U.S.",
            "Sentiment": "positive",
            "PublishDate": 1753265296744,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syngene International Reaffirms Annual Guidance Amid Economic Uncertainty",
            "Summary": "Syngene International's Co MD stated that the company remains on track to deliver results in line with its annual guidance. The executive emphasized the importance of maintaining awareness of current economic conditions while keeping a positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1753264443953,
            "Source": "stock"
        },
        {
            "Title": "Syngene International Reports Q1 FY26 Results; Revenue at Rs 7,993 Million, Net Profit at Rs 740 Million",
            "Summary": "Syngene International Limited reported quarterly results for the period ended June 30, 2025, with revenue from operations of Rs 7,993 million and net profit of Rs 740 million. On a consolidated basis, the company recorded revenue of Rs 8,745 million and profit of Rs 867 million. The company appointed Mr. Chethan Yogesh as Company Secretary and Compliance Officer effective July 23, 2025. Yogesh is a Fellow Member of the Institute of Company Secretaries of India with over 16 years of experience in corporate governance and compliance. The Board of Directors recommended a final dividend of Rs 1.25 per equity share, subject to shareholder approval. During the quarter, the company capitalized Rs 3,438 million as property, plant and equipment after receiving licenses for drug substance production line and bonded warehouse at its Bangalore biologics facility.",
            "Sentiment": "neutral",
            "PublishDate": 1753264389304,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International Reports Strong Q1 Growth with 14.5% Revenue Increase",
            "Summary": "Syngene International reported quarterly results showing consolidated net profit of 867 million rupees compared to 757 million rupees in the same period last year. Revenue increased to 8.75 billion rupees from 7.9 billion rupees year-over-year. EBITDA rose to 2.1 billion rupees from 1.7 billion rupees, while EBITDA margin improved to 23.60% from 21.5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753263542404,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International: USFDA Updates Boost Regulatory Compliance",
            "Summary": "Syngene International received positive USFDA updates for two Bengaluru facilities. The Semicon Park facility passed a GCP inspection with zero observations, classified as 'No Action Indicated'. The Biocon Park SEZ facility received an EIR with 'Voluntary Action Indicated' classification, with USFDA accepting the company's CAPA plans. These outcomes are not expected to impact financials or operations.",
            "Sentiment": "positive",
            "PublishDate": 1750043874000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syngene International Receives EIR from USFDA for Bengaluru Facilities",
            "Summary": "Syngene International has received an Establishment Inspection Report (EIR) from the United States Food and Drug Administration (USFDA) for its Good Manufacturing Practice (GMP) manufacturing facilities located at Biocon Park in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1750031774000,
            "Source": "default"
        },
        {
            "Title": "Syngene International: Bengaluru Unit Passes FDA Inspection with VAI Classification",
            "Summary": "Syngene International's GMP manufacturing facilities at Biocon Park, Bengaluru, received an Establishment Inspection Report (EIR) from the US FDA with a Voluntary Action Indicated (VAI) classification. The FDA accepted Syngene's responses and CAPA plans. The company states this outcome won't impact its financials or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1749828514000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syngene International Receives EIR from USFDA for Bengaluru Facilities",
            "Summary": "Syngene International has obtained an Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (USFDA) for its Good Manufacturing Practice (GMP) manufacturing facilities located at Biocon Park in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1749825431000,
            "Source": "default"
        },
        {
            "Title": "Syngene International Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 428,971 shares of Syngene International Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 670.25 per share. The total value of the transaction was Rs. 28.75 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749706017000,
            "Source": "block_details"
        },
        {
            "Title": "Syngene International Ltd. Block Trade: 284,191 Shares at Rs. 665.10",
            "Summary": "A block trade of approximately 284,191 shares of Syngene International Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 665.10 per share. The total value of the transaction was Rs. 18.90 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749700474000,
            "Source": "block_details"
        },
        {
            "Title": "Syngene International Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 1,961,877 shares of Syngene International Ltd. occurred on the National Stock Exchange (NSE) for Rs. 128.42 crores. The trade was executed at a price of Rs. 654.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748332508000,
            "Source": "block_details"
        },
        {
            "Title": "Syngene International Ltd. Block Trade: 403,379 Shares at Rs. 620.20",
            "Summary": "A block trade of approximately 403,379 shares of Syngene International Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 620.20 per share. The total value of the transaction was Rs. 25.02 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747033225000,
            "Source": "block_details"
        },
        {
            "Title": "Syngene International: Shares Plummet 10% on Revenue Miss and Weak FY26 Outlook",
            "Summary": "Syngene International's shares fell 10% after Q4 revenue missed estimates and FY26 guidance disappointed analysts. The company expects single-digit growth for FY26, lower than the 15% analysts projected. Q4 revenue grew 11% to ₹1,018 crore, below expectations. EBITDA margins declined year-over-year to 33.7% due to higher employee costs.",
            "Sentiment": "negative",
            "PublishDate": 1745467617000,
            "Source": "earnings"
        },
        {
            "Title": "Syngene's FY26 Guidance Falls Short of Expectations",
            "Summary": "Syngene International has provided guidance for fiscal year 2026 that is significantly below market expectations. This underwhelming forecast is likely to result in substantial downward revisions of approximately 25% to the company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) estimates for FY26.",
            "Sentiment": "negative",
            "PublishDate": 1745466335000,
            "Source": "default"
        },
        {
            "Title": "Syngene International Reports Q4 Financial Results and Dividend",
            "Summary": "Syngene International announced its Q4 consolidated net profit of 1.83 billion rupees, slightly down from 1.89 billion rupees year-over-year, but up from 1.3 billion rupees quarter-over-quarter. The company's Q4 revenue increased to 10.2 billion rupees from 9.17 billion rupees in the previous year. Additionally, Syngene has recommended a dividend of 1.25 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745453464000,
            "Source": "default"
        },
        {
            "Title": "Syngene International: Q4 Profit Dips 3%, FY25 Revenue Grows 4%",
            "Summary": "Syngene International reported Q4 FY25 net profit of Rs 183 crore, down 3% YoY. FY25 revenue grew 4% to Rs 3,714 crore. The company expects early teens revenue growth for FY26 on an underlying basis, with mid-single digit reported growth due to inventory adjustments. Board recommends final dividend of Rs 1.25 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745421443000,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International Forecasts Margin Moderation and Revenue Growth",
            "Summary": "Syngene International anticipates a moderation in EBITDA margin to mid-twenties and a year-on-year decline in profit after tax. The company attributes this to additional operating costs and depreciation from new biologics manufacturing facilities. Despite these challenges, Syngene expects mid-single digit revenue growth in the next financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1745421424000,
            "Source": "default"
        },
        {
            "Title": "Syngene International Reports Q4 Results and Dividend",
            "Summary": "Syngene International has announced its Q4 financial results and dividend. The company's Q4 consolidated net profit was 1.83 billion rupees, down from 1.89 billion rupees year-over-year. Revenue increased to 10.2 billion rupees from 9.17 billion rupees in the same period last year. EBITDA rose to 3.44 billion rupees from 3.17 billion rupees, although the EBITDA margin decreased slightly to 33.75% from 34.56%. The company has recommended a dividend of 1.25 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745419736000,
            "Source": "result"
        },
        {
            "Title": "Syngene International: Q4 Profit Falls Short of Estimates",
            "Summary": "Syngene International's Q4 FY25 consolidated net profit decreased by 2.8% to Rs 183 crore, missing analysts' estimates of Rs 192.9 crore. Revenue increased by 11% to Rs 1,018 crore, while EBITDA rose 8.4% to Rs 344 crore. The company's margin narrowed to 33.8% from 34.6% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1745419392000,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International to Consider Q4 Results on April 23",
            "Summary": "Syngene International has announced that it will consider its fourth quarter (Q4) financial results on April 23. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744116133000,
            "Source": "earnings"
        },
        {
            "Title": "Syngene International Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Syngene International Ltd. on the National Stock Exchange (NSE). Approximately 1,014,870 shares were traded at a price of Rs. 748.40 per share, totaling Rs. 75.95 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1743654930000,
            "Source": "block_deals"
        },
        {
            "Title": "Syngene International Appoints New Managing Director and CEO",
            "Summary": "Syngene International has announced the appointment of Peter Bains as the company's new Managing Director and Chief Executive Officer. The appointment will take effect from April 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1743552562000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syngene International Appoints New Managing Director and CEO",
            "Summary": "Syngene International has announced the appointment of Peter Bains as the company's new Managing Director and Chief Executive Officer. Bains is set to assume his new role effective April 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1743523952000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syngene Completes Acquisition of US Biologics Manufacturing Facility",
            "Summary": "Syngene International Limited has finalized the acquisition of a biologics manufacturing facility in the United States from Emergent BioSolutions Inc. for USD 36.5 million. This strategic move expands Syngene's manufacturing capabilities and strengthens its presence in the US biologics market.",
            "Sentiment": "positive",
            "PublishDate": 1742438586000,
            "Source": "corporate_action"
        },
        {
            "Title": "Syngene International Acquires First Biologics Site in USA",
            "Summary": "Syngene International has acquired its first biologics site in the USA, increasing its bioreactor capacity to 50,000L. The company estimates an investment of $50 million in the US facility. Additionally, Syngene International plans to make an extra investment of up to $56 million in the equity share capital of its unit Syngene USA Inc (SUSA).",
            "Sentiment": "positive",
            "PublishDate": 1741651405000,
            "Source": "corporate_action"
        },
        {
            "Title": "Syngene International: Acquires US Facility, Lowers Growth Forecast",
            "Summary": "Syngene International's US subsidiary is acquiring a manufacturing facility for $50 million, with $36.5 million upfront. The deal is expected to close by March 2025. Simultaneously, Syngene has lowered its FY2025 revenue growth forecast to single digits due to delayed market recovery. Q3 profit rose 18% YoY to Rs 131 crore, missing analyst expectations.",
            "Sentiment": "neutral",
            "PublishDate": 1741623851000,
            "Source": "corporate_action"
        },
        {
            "Title": "Syngene International to Invest $56 Million in US Subsidiary",
            "Summary": "Syngene International has announced plans to make an additional investment of up to $56 million in the equity share capital of its U.S. subsidiary, Syngene USA Inc (SUSA). This move indicates a significant expansion of the company's operations in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1741619291000,
            "Source": "corporate_action"
        }
    ]
}