{
    "Symbol": "SYRMA",
    "ISIN": "INE0DYJ01015",
    "News": [
        {
            "Title": "Syrma SGS Q3FY26 QIP Monitoring Report Filed",
            "Summary": "Syrma SGS Technology submits Q3FY26 monitoring agency report showing complete utilization of Rs.1,000.00 crore QIP proceeds with Rs.224.262 crore used for Elcome acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1769764792417,
            "Source": "stocks"
        },
        {
            "Title": "Syrma SGS schedules Q3FY26 earnings call for Jan 30",
            "Summary": "Syrma SGS Technology announces investor earnings call on January 30, 2026, at 10:30 AM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769514337724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syrma SGS Acquires 60% Stake in Elcome for ₹235 Cr",
            "Summary": "Syrma SGS Technology Limited announces acquisition of 60% stake in Elcome Integrated Systems for approximately ₹235 crore in the first tranche of the strategic investment deal.",
            "Sentiment": "positive",
            "PublishDate": 1765984402048,
            "Source": "co_actions_results"
        },
        {
            "Title": "Syrma SGS Tech Begins Construction of New PCB Facility, Partners with Shinhyup Electronics",
            "Summary": "Syrma SGS Tech has initiated construction on a new PCB manufacturing facility and entered into a joint venture with Shinhyup Electronics. The new plant is expected to create over 1,000 direct jobs, representing significant expansion in the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764633578374,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Technology Reports 37% Revenue Growth in Q2 FY26, Expands Through Strategic Acquisitions",
            "Summary": "Syrma SGS Technology achieved record quarterly revenue of INR 1,146 crores with 37% year-on-year growth and 10.1% EBITDA margin, while acquiring 60% stake in defense company Elcome and securing ECMS approval for PCB manufacturing project. The company onboarded 8 major customers with potential revenues of $100 million and entered a long-term framework contract worth $250 million over 2-3 years, positioning for sustained growth across automotive, industrial, and defense segments.",
            "Sentiment": "positive",
            "PublishDate": 1763220580727,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Technology Allots 3.66 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Syrma SGS Technology Limited's Board approved the allotment of 3,66,322 equity shares of face value Rs. 10 each to eligible employees under the Employee Stock Option Plan 2020. The company's paid-up equity share capital increased from Rs. 1,92,46,41,630 to Rs. 1,92,83,04,850, expanding the total share count to 19,28,30,485 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763128833669,
            "Source": "corporate_action"
        },
        {
            "Title": "Syrma SGS Technology Reports No Deviation in IPO Proceeds Utilization for September 2025 Quarter",
            "Summary": "Syrma SGS Technology Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025. CRISIL Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objects of the IPO. The company's IPO raised Rs 8,401.26 million in August 2022, with net proceeds of Rs 7,257.22 million allocated for three main purposes: Rs 4,030 million for R&D facility development and manufacturing expansion, Rs 1,315.80 million for working capital requirements, and Rs 1,911.42 million for general corporate purposes. As of September 30, 2025, the company had utilized Rs 3,209.15 million for capital expenditure projects, fully utilized working capital funds, and deployed Rs 1,900 million for general corporate purposes. Unutilized proceeds of Rs 832.94 million remain invested in fixed deposits and bank accounts. The monitoring agency confirmed all utilization aligned with the original offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1762863241895,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Technology Allots 3.66 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Syrma SGS Technology Limited's Board of Directors approved the allotment of 3,66,322 equity shares with a face value of Rs. 10 each to eligible employees through exercise of stock options under the Syrma SGS Employee Stock Option Plan 2020, Scheme II. The allotment was approved via circular resolution on November 5, 2024. Following this allotment, the company's paid-up equity share capital increased from Rs. 1,92,46,41,630 (comprising 19,24,64,163 equity shares) to Rs. 1,92,83,04,850 (comprising 19,28,30,485 equity shares).",
            "Sentiment": "neutral",
            "PublishDate": 1762821440929,
            "Source": "corporate_action"
        },
        {
            "Title": "Syrma SGS Technology Reports Quarterly Results and Completes Major Amalgamation Scheme",
            "Summary": "Syrma SGS Technology Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company completed a scheme of amalgamation with its wholly-owned subsidiaries SGS Infosystems Private Limited and SGS Tekniks Manufacturing Private Limited, approved by the National Company Law Tribunal on October 7, 2025, with an appointed date of April 1, 2023. During the period, the company issued 14,306,151 equity shares through Qualified Institutional Placement (QIP) at Rs. 699 per share, raising Rs. 10,000 million. The company entered into joint venture agreements for manufacturing multi-layer Printed Circuit Boards and other electronics manufacturing services. Revenue from operations was Rs. 10,940.78 million for the quarter. The company operates in Electronics Manufacturing Services (EMS) segment and has approved a final dividend of 15% (Rs. 1.5 per equity share) for FY 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1762804372751,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Technology Reports 60% EBITDA Growth, Acquires Stake in Defence Electronics Firm",
            "Summary": "Syrma SGS Technology reported EBITDA growth of 60% year-on-year to ₹2,266 million and profit before tax growth of 95%. The company is acquiring a 60% stake in Elcome Integrated Systems to enter the defence and maritime electronics sector. Export revenue increased 34% year-on-year and now represents 24% of total revenue. The company has outlined a multi-year expansion plan to build a defence and industrial electronics ecosystem as part of its design-led manufacturing platform supporting Aatmanirbhar Bharat.",
            "Sentiment": "positive",
            "PublishDate": 1762787713899,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Tech Acquires Two Companies to Enter Defence and Maritime Sectors",
            "Summary": "Syrma SGS Tech has acquired Elcome Integrated and Navicom Technology International as part of its strategic expansion into the defence and maritime sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762781079713,
            "Source": "order&deals"
        },
        {
            "Title": "Syrma SGS Tech Reports Strong Q2 Growth with 77% Jump in Net Profit",
            "Summary": "Syrma SGS Tech reported consolidated net profit of 641 million rupees in Q2, representing a 77% increase from 362 million rupees in the same quarter last year. Revenue grew 38% to 11.46 billion rupees compared to 8.3 billion rupees year-over-year. EBITDA rose 56% to 1.15 billion rupees from 738.4 million rupees, while EBITDA margin improved to 10.06% from 8.87% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762777601938,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Plans ₹765 Crore Investment in Andhra Pradesh Under ECMS Scheme",
            "Summary": "Syrma SGS announced plans to invest ₹765 crore in Andhra Pradesh under the Electronics and Computer Software Export Promotion Scheme (ECMS). The investment is expected to generate production worth ₹6,933 crore and create 955 new jobs. The company will receive subsidies as part of the ECMS initiative.",
            "Sentiment": "positive",
            "PublishDate": 1761587352074,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Technology Acquires 49% Stake in Solar Inverter Manufacturer KSolare for Rs 83.3 Crores",
            "Summary": "Syrma SGS Technology Limited's board approved the acquisition of a 49% equity stake in KSolare Energy Private Limited for Rs 83.3 crores, as part of a joint acquisition with Premier Energies Limited. The total transaction values KSolare at Rs 170 crores, with Premier Energies acquiring the remaining 51% stake for Rs 86.7 crores. KSolare, established in 2012 and based in Pune, manufactures solar inverters with a production capacity of 500,000 units annually. The company reported revenues of Rs 342 crores in FY25, Rs 226 crores in FY24, and Rs 145 crores in FY23. The acquisition allows Syrma SGS to enter the residential solar inverter segment, aligned with the government's PM Surya Ghar Muft Bijli Yojana. The transaction is expected to complete within 90 days and will be funded through cash consideration. The joint venture board will have 4 directors, with 2 each from Premier Energies and Syrma SGS, while Premier Energies will have the right to appoint the chairman.",
            "Sentiment": "positive",
            "PublishDate": 1761214202718,
            "Source": "order&deals"
        },
        {
            "Title": "Syrma SGS Technology Appoints Sudeep Tandon as Non-Executive Director",
            "Summary": "Syrma SGS Technology Limited appointed Mr. Sudeep Tandon as Non-Executive Non-Independent Director at its 21st Annual General Meeting held on September 26, 2025. He replaces Mr. Jaideep Tandon, who retired by rotation and chose not to seek reappointment. Sudeep Tandon has worked in various capacities in the technology industry across California, Boston, South Korea and the UK. He serves as Managing Director of Infinx Services Private Limited, a technology platform for healthcare administration in the United States, and was previously Ex-CBO at Freecharge, which was acquired by Snapdeal.com. Sudeep Tandon is related to Mr. Sandeep Tandon as his brother.",
            "Sentiment": "neutral",
            "PublishDate": 1758910333039,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syrma SGS Technology Gets Andhra Pradesh Approval for INR 1,595 Crore Manufacturing Joint Venture",
            "Summary": "Syrma SGS Technology Limited received approval from the Government of Andhra Pradesh for its joint venture with Shinhyup Electronics Co. Ltd. The approval includes allotment of 26.70 acres of land at Menakuru Village, Naidupeta for establishing manufacturing facilities for printed circuit boards, copper clad laminates, and electronics manufacturing services. The joint venture, originally agreed upon on July 15, 2025, involves a total investment of INR 1,595 crores. The projects are eligible for incentive packages under Andhra Pradesh Electronics Components Manufacturing Policy 4.0, including early-bird incentives and 75% subsidy on land cost. The manufacturing facilities will produce multi-layer PCBs and CCLs for automobile electronic equipment, home appliances, IT and medical services.",
            "Sentiment": "positive",
            "PublishDate": 1757491291041,
            "Source": "order&deals"
        },
        {
            "Title": "Syrma SGS Partners with Korea's Shinhyup Electronics for Rs 1,595 Crore Investment",
            "Summary": "Syrma SGS will invest Rs 1,595 crore in partnership with Korea's Shinhyup Electronics to establish a new manufacturing plant. The facility is expected to commence operations by October 2026 and is projected to contribute Rs 6,200 crore to the company's revenue in FY 2027.",
            "Sentiment": "positive",
            "PublishDate": 1756970091923,
            "Source": "order&deals"
        },
        {
            "Title": "Andhra Pradesh Approves ₹856 Crore Investment for Syrma SGS PCB Manufacturing Facility",
            "Summary": "Andhra Pradesh has approved an ₹856 crore investment plan for Syrma SGS to establish a printed circuit board manufacturing facility. The project is positioned to become India's largest PCB factory.",
            "Sentiment": "positive",
            "PublishDate": 1756969748091,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS-Elemaster Joint Venture Targets ₹200 Crore Revenue by FY27",
            "Summary": "Mumbai-based electronics components maker Syrma SGS Technologies has formed a joint venture with Italy's Elemaster to manufacture products for railway, industrial, and medical clients. The partnership will establish a Bengaluru facility with an initial investment of ₹55 crore, targeting ₹200 crore revenue by FY27 and potentially ₹400 crore by FY28. The venture will serve both Indian and European markets. Separately, Syrma SGS is advancing its PCB project in Andhra Pradesh with a planned ₹300 crore investment over two to three years. The company maintains a cautious approach toward semiconductor opportunities, seeking the right partner before expansion. Syrma SGS has a market capitalization of ₹15,061 crore, with shares trading at ₹782.90 and gaining 79% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1756875336389,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Technology Forms Joint Venture with Italy's Elemaster",
            "Summary": "Syrma SGS Technology has established a joint venture with Italy-based Elemaster. The company will hold a 60% stake in the joint venture, which will focus on rail, industrial, and medical electronics sectors.",
            "Sentiment": "positive",
            "PublishDate": 1756744777516,
            "Source": "order&deals"
        },
        {
            "Title": "Syrma SGS shares worth ₹2,618 crore become eligible for trading as lock-in period ends",
            "Summary": "Syrma SGS Technology's shareholder lock-in period ended on August 25, making 3.52 crore shares (20% of outstanding equity) eligible for trading, valued at ₹2,618 crore based on Friday's closing price. The company recently raised ₹1,000 crore through a Qualified Institutional Placement, issuing shares to funds including HDFC Life, Tata AIA Life, Axis MF, and others. Promoter stake decreased to 42.97% at the end of June quarter from 46.52% in March. The stock trades near its 52-week high, has gained 20% in 2025, and has more than tripled from its IPO price of ₹220, closing at ₹744.2 on Friday.",
            "Sentiment": "neutral",
            "PublishDate": 1756075195987,
            "Source": "stock"
        },
        {
            "Title": "Syrma Johari Medtech Chairman and MD Satyendra Johari Passes Away at 77",
            "Summary": "Satyendra Johari, Chairman and Managing Director of Syrma Johari Medtech Limited, passed away on August 8, 2025, at the age of 77. Johari was the founder of the subsidiary company, which was formerly known as Johari Digital Healthcare Limited. Syrma Johari Medtech Limited is a subsidiary of Syrma SGS Technology Limited, which trades on BSE and NSE under symbols 543573 and SYRMA respectively. The Board of Syrma Johari Medtech Limited will take necessary steps to ensure continuity of operations following his passing.",
            "Sentiment": "negative",
            "PublishDate": 1755025521202,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syrma SGS Tech Sets QIP Share Price at Rs 699 Per Share",
            "Summary": "Syrma SGS Tech has set the share price at Rs 699 per share for its Qualified Institutional Placement (QIP).",
            "Sentiment": "neutral",
            "PublishDate": 1755013836873,
            "Source": "corporate_action"
        },
        {
            "Title": "Syrma SGS Technology Subsidiary Chairman and MD Satyendra Johari Passes Away",
            "Summary": "Syrma SGS Technology Limited announced the passing of Mr. Satyendra Johari, Chairman and Managing Director of its subsidiary Syrma Johari Medtech Limited, on August 8, 2025. Mr. Johari was 77 years old and was the founder of SJML, formerly known as Johari Digital Healthcare Limited. The board of SJML will take necessary steps to ensure continuity of operations following his passing.",
            "Sentiment": "negative",
            "PublishDate": 1754838295889,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syrma SGS Technology Launches Rs 1,000 Crore QIP With 7.43% Equity Dilution",
            "Summary": "Syrma SGS Technology is raising Rs 1,000 crore through a qualified institutional placement that opened Thursday and closes Friday. The QIP will result in 7.43% equity dilution of post-issue outstanding equity capital. The floor price is set at Rs 735.61 per share, representing a 1.60% discount from the previous closing price of Rs 710.40 on NSE. Dam Capital serves as the book-running lead manager. Shares will receive trading approval on August 14, with institutional buyers receiving shares in their demat accounts the same day, and trading to commence on August 18. The company reported strong quarterly performance with consolidated net profit surging 157.5% to Rs 49.7 crore from Rs 19.3 crore, driven by operating leverage. EBITDA increased 90.6% to Rs 86.6 crore from Rs 45.4 crore, while profit margin jumped 530 basis points to 9.2%. However, consolidated revenue declined 18.6% to Rs 944 crore compared to Rs 1,160 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754620856615,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Technology Launches QIP with Floor Price of ₹735.61 Per Share",
            "Summary": "Syrma SGS Technology Limited has launched a Qualified Institutional Placement (QIP) of equity shares with a face value of ₹10 each. The QIP Committee approved a floor price of ₹735.61 per equity share based on SEBI ICDR Regulations pricing formula. The company may offer up to 5% discount on the floor price, with the final issue price to be determined in consultation with book running lead managers. The QIP received board approval on May 10, 2024, and shareholder approval through special resolution on September 17, 2024. The company has filed preliminary placement documents with BSE and NSE. Trading window for designated persons will remain closed from August 7, 2025, until 48 hours after issue price determination.",
            "Sentiment": "neutral",
            "PublishDate": 1754581942233,
            "Source": "corporate_action"
        },
        {
            "Title": "Komal Malik Resigns as Company Secretary and Compliance Officer of Syrma SGS Technology",
            "Summary": "Komal Malik has resigned from her position as Company Secretary, Compliance Officer, and Key Managerial Personnel of Syrma SGS Technology Limited, effective July 30, 2025. She was relieved from her duties at the close of business hours on that date. Malik expressed her intention to resign to take up a new role outside the organization. The company disclosed this information through Chief Financial Officer Bijay Kumar Agrawal in compliance with listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754410990225,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syrma SGS Technology Appoints Bhabagrahi Pradhan as Company Secretary and Compliance Officer",
            "Summary": "Syrma SGS Technology Limited appointed Mr. Bhabagrahi Pradhan as Company Secretary, Compliance Officer, and Key Managerial Personnel effective August 5, 2025. The appointment was approved by the Board of Directors. Pradhan is a fellow member of the Institute of Company Secretaries of India, an associate member of ICWAI, and holds a law degree. He brings approximately 25 years of post-qualification experience in corporate secretarial, compliance, legal and governance functions across various sectors including NBFC, pharmaceuticals, textiles, IT, cement and power. He has previously worked with organizations including MGF Group, Intime Spectrum, Medicamen, DSCI, DCM Group, Dalmia Group and NTPC Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754409406523,
            "Source": "corporate_governance"
        },
        {
            "Title": "Syrma SGS Technology to Participate in Non-Deal Roadshow with DAM Capital, Kotak Securities, and JM Financial",
            "Summary": "Syrma SGS Technology Limited announced its participation in investor meetings scheduled for August 4-6, 2025, in Mumbai. The company will conduct one-on-one meetings during a Non-Deal Roadshow organized with DAM Capital, Kotak Securities, and JM Financial from 9:00 am to 6:00 pm IST. The company stated that no unpublished price sensitive information will be disclosed during these meetings, and discussions will focus on general business outlook and publicly available information. The meeting dates may change due to exigencies from investors or the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753872675632,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Reports Strong Q1 FY26 Results with 75% EBITDA Growth, Announces PCB Manufacturing JV",
            "Summary": "Syrma SGS Technology delivered robust quarterly results with EBITDA margins improving from 5.2% to over 10% year-on-year, while gross material margins increased from 15% to 24%. The company reported 75% year-on-year EBITDA growth to Rs. 96 crores and 145% PAT growth to Rs. 50 crores. Export revenue grew 29% to Rs. 232 crores, representing 25% of total revenue. The company announced a joint venture for PCB manufacturing with planned Phase-1 CAPEX of $91 million over 3-4 years, targeting 12-15% EBITDA margins. Management guided for 30-35% revenue growth and 8.5-9% EBITDA margins for the full year. The business mix showed strategic improvement with automotive segment growing from 16% to 24% and industrial from 19% to 30%, while lower-margin consumer business declined from 53% to 34% of revenue. Order book stands at approximately Rs. 5,400-5,500 crores with automotive comprising 35-40% of the pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1753796118349,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Technology Releases Corporate Presentation Highlighting Growth Strategy and Financial Performance",
            "Summary": "Syrma SGS Technology Limited submitted a corporate presentation to stock exchanges. The company reported revenue of INR 37,867 million for FY25, representing a 10.0% CAGR over FY22-25. EBITDA reached INR 3,238 million with an 8.6% margin. The company operates across multiple verticals including Industrials (28.4% of revenue), Consumer (35.6%), Automotive & Electric Mobility (21.7%), Healthcare & Medical Devices (7.7%), and Railways & IT (6.6%). Export revenue accounts for 23.2% of total revenue. The company has 18 facilities globally including 14 manufacturing and 4 R&D centers, serving 300+ customers across 20+ countries. Syrma SGS has entered PCB manufacturing through a 75:25 joint venture with Shinhyup Electronics. The presentation outlines strategic focus on strengthening presence in non-consumer verticals, expanding into high-growth segments, and enhancing export profile through value chain expansion and capability enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1753538588718,
            "Source": "corporate_action"
        },
        {
            "Title": "Syrma SGS Targets 8.5-9% Ebitda Margin and 30%+ Revenue Growth in FY26",
            "Summary": "Syrma SGS Technology is targeting Ebitda margins of 8.5-9% and revenue growth of over 30% in FY26 by focusing on higher-margin businesses in automotive and industrial manufacturing. The company's revenue declined 18% to Rs 960 crore in Q1FY26 from Rs 1,175.2 crore in Q1FY25. Managing Director JS Gujral expects growth of 35-40% in the next three quarters to achieve the annual target, as Q1 typically accounts for 20% of revenue. The company has strategically shifted its revenue mix, reducing consumer segment contribution from 54% to 34%, while increasing automotive from 16% to 24% and industrial from 19% to 30%. Over the past two years, revenues grew 25%, Ebitda increased 50%, profit before tax rose 27%, and profit after tax climbed 32%. Gujral emphasized the importance of partnerships with Chinese companies for technology transfer and the need for Indian firms to invest in R&D for long-term sustainability. Shares closed 1.07% higher at Rs 706.7 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1753498881507,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Technology Reports IPO Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Syrma SGS Technology Limited submitted its monitoring agency report on IPO proceeds utilization for the quarter ended June 30, 2025. The company raised Rs 7,257.22 million in net proceeds from its August 2022 IPO. Out of the total proceeds, Rs 6,387.25 million has been utilized, leaving Rs 869.97 million unutilized. The funds were allocated across three main objectives: Rs 4,030 million for capital expenditure and manufacturing facility expansion (Rs 3,172.12 million utilized), Rs 1,315.80 million for working capital requirements (Rs 1,315.13 million utilized), and Rs 1,911.42 million for general corporate purposes (Rs 1,900 million utilized). During the quarter, only Rs 134.62 million was spent on capital expenditure projects. CRISIL Ratings Limited, the monitoring agency, reported no deviations from the stated objectives and confirmed all utilization was as per the offer document disclosures. The unutilized amount of Rs 1,159.07 million is deployed in fixed deposits and monitoring agency accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1753442689532,
            "Source": "corporate_action"
        },
        {
            "Title": "Syrma SGS Technology to Participate in Non-Deal Roadshows in Singapore and Mumbai",
            "Summary": "Syrma SGS Technology Limited will participate in non-deal roadshows organized by DAM Capital, Kotak Securities, and JM Financial. The company's management will conduct one-on-one investor meetings in Singapore from July 28-29, 2025 (9:00 am to 6:00 pm SGT) and in Mumbai from July 30 to August 1, 2025 (9:00 am to 6:00 pm IST). The company stated that no unpublished price sensitive information will be disclosed during these meetings, and discussions will focus on general business outlook and publicly available information. Meeting dates may change due to exigencies from investors or the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753414586697,
            "Source": "stock"
        },
        {
            "Title": "Syrma SGS Technology Uploads Audio Recording of Q1 FY26 Earnings Conference Call",
            "Summary": "Syrma SGS Technology Limited has uploaded the audio recording of its conference call discussing unaudited financial results for the quarter ended June 30, 2025, to its company website. The conference call was held on July 24, 2025, and the recording is accessible through the company's investor relations webpage at https://www.syrmasgs.com/investor-relations/. The company informed both BSE and NSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1753366777353,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Tech Reports Mixed Q1 Results with Profit Surge Despite Revenue Decline",
            "Summary": "Syrma SGS Tech reported consolidated net profit of 497 million rupees in Q1, representing a significant increase from 193 million rupees in the same period last year. However, the company's revenue declined to 9.4 billion rupees compared to 11.6 billion rupees in the previous year's corresponding quarter. The results show contrasting performance with profitability improving substantially while top-line growth faced challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1753263556260,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Technology Schedules Investor Earnings Call for July 24, 2025",
            "Summary": "Syrma SGS Technology Limited has scheduled an investor earnings call on July 24, 2025 at 10:30 AM IST to discuss the financial results for the quarter ended June 30, 2025. The call will be hosted by Nuvama Wealth Management and include senior management representation from Syrma SGS. The company has provided dial-in details for participants from India, USA, UK, Singapore, and Hong Kong. The transcript of the earnings call will be posted on the company's website following the discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1753096260960,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Technology: Shares Hit 52-Week High on PCB Joint Venture Announcement",
            "Summary": "Syrma SGS Technology's shares reached a 52-week high following the announcement of a joint venture with South Korea's Shinhyup Electronics to manufacture multi-layer Printed Circuit Boards (PCBs). Syrma SGS will hold 75% of the JV initially. The company is also planning a potential QIP of up to ₹1,000 crore for acquisitions or capital expenditure. JPMorgan initiated coverage with an 'Overweight' rating, projecting a 32% revenue CAGR over FY25-30.",
            "Sentiment": "positive",
            "PublishDate": 1752762369000,
            "Source": "corporate_action"
        },
        {
            "Title": "Syrma SGS Partners with South Korea's Shinhyup Electronics for PCB Production",
            "Summary": "Syrma SGS has formed a partnership with South Korea's Shinhyup Electronics for advanced Printed Circuit Board (PCB) production. This collaboration aims to enhance Syrma SGS's capabilities in manufacturing sophisticated PCBs.",
            "Sentiment": "positive",
            "PublishDate": 1752566451000,
            "Source": "default"
        },
        {
            "Title": "Syrma SGS Confirms Progress on ₹1,800-crore PCB Plant in Andhra Pradesh",
            "Summary": "Syrma SGS has addressed rumors and confirmed that it is making progress on its planned ₹1,800-crore Printed Circuit Board (PCB) manufacturing plant in Andhra Pradesh. The company has taken steps to clarify its position regarding the project, which appears to be moving forward as intended.",
            "Sentiment": "positive",
            "PublishDate": 1752106146000,
            "Source": "default"
        },
        {
            "Title": "Syrma SGS Technology: Partners with Dynabook for Domestic Laptop Manufacturing",
            "Summary": "Syrma SGS Technology Ltd has formed a strategic partnership with Dynabook Singapore Pte Ltd to manufacture laptops in India, supporting the 'Make in India' initiative. This is Syrma SGS's second global brand partnership this year. The company will produce Dynabook's laptop portfolio for enterprise customers and commercial channels across India.",
            "Sentiment": "positive",
            "PublishDate": 1747996032000,
            "Source": "corporate_action"
        },
        {
            "Title": "Syrma SGS Technology to Manufacture Dynabook Laptops in India",
            "Summary": "Syrma SGS Technology has entered into a strategic partnership to manufacture Dynabook laptops in India. This collaboration marks a significant move in the electronics manufacturing sector, potentially boosting local production of laptops in the country.",
            "Sentiment": "positive",
            "PublishDate": 1747918177000,
            "Source": "default"
        },
        {
            "Title": "Syrma SGS Technology: Targets 30-35% Revenue Growth, Shifts Focus to High-Margin Verticals",
            "Summary": "Syrma SGS Technology aims for 30-35% revenue growth in FY26, targeting 8% EBITDA margin. The company plans to reduce low-margin consumer business to 30% of revenue, focusing on high-margin industrial, healthcare, and automotive segments. They've started assembling high-end laptops for MSI and are cautiously considering OSAT market entry.",
            "Sentiment": "positive",
            "PublishDate": 1747355208000,
            "Source": "normal_news"
        },
        {
            "Title": "Syrma SGS Technology: Targets 30-35% Revenue Growth, Plans QIP",
            "Summary": "Syrma SGS Technology expects 30-35% revenue growth in FY26, driven by smart metering and healthcare segments. The company aims for 8% EBITDA margins, plans to reduce reliance on lower-margin consumer segment, and targets over ₹1,000 crore in exports. An enabling resolution for a QIP of up to ₹1,000 crore has been taken for potential acquisitions or capital expenditure.",
            "Sentiment": "positive",
            "PublishDate": 1747196657000,
            "Source": "earnings"
        },
        {
            "Title": "Syrma SGS Tech Reports Q4 Results and Announces Corporate Actions",
            "Summary": "Syrma SGS Tech reported Q4 consolidated net profit of 654 million rupees, up from 350 million rupees year-over-year and 488 million rupees quarter-over-quarter. Q4 revenue was 9.2 billion rupees, down from 11.34 billion rupees year-over-year. The company recommended a dividend of 1.5 rupees per equity share and plans to raise funds up to 10 billion rupees through a Qualified Institutional Placement (QIP) or other modes.",
            "Sentiment": "positive",
            "PublishDate": 1747181898000,
            "Source": "default"
        },
        {
            "Title": "Syrma SGS Technology to Raise Up to 10 Billion Rupees Through QIP",
            "Summary": "Syrma SGS Technology has announced plans to raise funds not exceeding 10 billion rupees through a Qualified Institutional Placement (QIP) or other modes. This move indicates the company's intention to secure significant capital for potential expansion or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1747140237000,
            "Source": "default"
        },
        {
            "Title": "Syrma SGS Tech Announces Dividend and Q4 EBITDA Growth",
            "Summary": "Syrma SGS Tech has recommended a dividend of 1.5 rupees per equity share. The company's Q4 EBITDA increased to 1.16 billion rupees from 820 million rupees year-over-year. The Q4 EBITDA margin improved to 12.52% from 7.23% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747139915000,
            "Source": "result"
        },
        {
            "Title": "Syrma SGS Tech Reports Q4 Financial Results",
            "Summary": "Syrma SGS Tech announced its Q4 consolidated net profit of 654 million rupees, showing significant growth compared to 350 million rupees year-over-year and 488 million rupees quarter-over-quarter. However, the company's Q4 revenue decreased to 9.2 billion rupees from 11.34 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747139791000,
            "Source": "result"
        },
        {
            "Title": "Syrma SGS Technology to Consider Fund Raising via QIP",
            "Summary": "Syrma SGS Technology has announced a board meeting scheduled for May 13 to consider raising funds through a private placement by Qualified Institutional Placement (QIP). This decision indicates the company's intention to secure additional capital, potentially for expansion or other strategic purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1746541823000,
            "Source": "default"
        },
        {
            "Title": "Syrma SGS Technology: Stock Surges 34% Following Strong Q3 Results",
            "Summary": "Syrma SGS Technology's stock has risen 34% in 6 sessions after reporting strong Q3 FY25 results. Net profit jumped 165% YoY to ₹53 crore. The company is shifting focus to higher margin segments, potentially improving its RoCE. FY2025 revenue guidance lowered to ₹41-42 billion, but EBITDA guidance maintained at ₹3.1 billion. Current order book stands at ₹53 billion.",
            "Sentiment": "positive",
            "PublishDate": 1738744797000,
            "Source": "earnings"
        }
    ]
}