{
    "Symbol": "SYSTMTXC",
    "ISIN": "INE356B01024",
    "News": [
        {
            "Title": "Systematix Invests ₹39.89 Cr in Industrial Investment Trust",
            "Summary": "Systematix Corporate Services acquired 2,77,000 equity shares of Industrial Investment Trust Limited for ₹3,98,88,000 through market purchase, securing 1.23% stake in the NBFC.",
            "Sentiment": "positive",
            "PublishDate": 1769695625600,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCLT Mumbai schedules amalgamation hearing for Feb 7",
            "Summary": "National Company Law Tribunal Mumbai has scheduled a hearing for February 7, 2026, regarding the scheme of amalgamation between four companies including Bloom Foods and Beverages Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769150882461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Systematix Corporate Services Q3FY26 Results",
            "Summary": "Systematix Corporate Services reported Q3FY26 standalone net profit of ₹456.51 lakhs vs ₹1,290.70 lakhs YoY. Revenue from operations declined to ₹1,473.02 lakhs from ₹2,598.46 lakhs. Board appointed new independent director.",
            "Sentiment": "neutral",
            "PublishDate": 1769008668676,
            "Source": "co_actions_results"
        },
        {
            "Title": "Systematix Group Reports 52% Revenue Growth in Q2FY26, Launches New SME Growth Fund",
            "Summary": "Systematix Group reported total income from operations of Rs 55.72 crore in Q2FY26 compared to Rs 36.67 crore in Q2FY25, marking a 52% year-on-year growth. For H1FY26, total income reached Rs 89.07 crore versus Rs 65.94 crore in H1FY25, representing 35% growth. The company's profit after tax increased to Rs 14.48 crore in Q2FY26 from Rs 10.46 crore in the previous quarter. Net worth stands at Rs 323.42 crore with an annualized ROE of 16%. The company launched India SME Growth Fund in August 2025 with a fund size of Rs 125 crore, achieving first closure in September 2025 with Rs 15 crore commitment received. The fund focuses on high-growth SMEs across sectors including manufacturing, services, pharma, tech, consumer, defence, chemical and engineering. Systematix Group has a robust pipeline of transactions worth Rs 5,300 crore including 21 IPOs. The company appointed Partha Sengupta and Bhaskar Hazra as Joint Managing Directors and CEOs for Private Wealth Business. Over the past four years, the company has grown revenue at a CAGR of 61% and profits at a CAGR of 98%.",
            "Sentiment": "positive",
            "PublishDate": 1762911923383,
            "Source": "earnings"
        },
        {
            "Title": "Systematix Corporate Services Reports Rs 26.5 Crore Fund Utilization from Rs 103.12 Crore Preferential Issue",
            "Summary": "Systematix Corporate Services Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of funds from its preferential issue worth Rs 103.12 crore. The company has utilized Rs 26.5 crore out of the total raised amount, with Rs 25 crore invested in subsidiary Systematix Shares and Stocks (India) Limited for working capital requirements and Rs 1.5 crore contributed to India SME Growth Fund-Series 2. The remaining Rs 76.62 crore remains unutilized and is kept as fixed deposits with Yes Bank earning interest rates between 4.75% to 6.95%. The preferential issue was conducted from October 1, 2024, to December 31, 2024. CARE Ratings Limited, appointed as the monitoring agency, reported no deviation from stated objectives and confirmed all utilization is as per the offer document. The company received SEBI registration for Category 2 AIF but approval for the scheme launch is still pending.",
            "Sentiment": "neutral",
            "PublishDate": 1762898977639,
            "Source": "corporate_action"
        },
        {
            "Title": "Systematix Corporate Services Grants 7.43 Lakh Stock Options Under ESOP 2025 Scheme",
            "Summary": "Systematix Corporate Services Limited's Nomination and Remuneration Committee approved the grant of 7,43,908 stock options under the Systematix Employee Stock Option Scheme (ESOP 2025) at an exercise price of Rs. 130.92 per option. The options were granted to eligible employees with an exercise period of maximum 4 years from the date of vesting. The vested options can be exercised by option holders either at one time or at various points within the exercise period. The scheme complies with SEBI regulations and the options have not yet been exercised or vested at this stage.",
            "Sentiment": "neutral",
            "PublishDate": 1762878069465,
            "Source": "corporate_action"
        },
        {
            "Title": "Systematix Corporate Services Reports Strong Q2 Performance with 3,220 Lakh Profit Before Tax",
            "Summary": "Systematix Corporate Services Limited announced quarterly results for the period ended September 30, 2025. The company reported a profit before tax of Rs. 3,220.24 lakhs on standalone basis and Rs. 3,323.82 lakhs on consolidated basis. Total income reached Rs. 5,669.37 lakhs for the quarter. The company operates as a Category 1 Merchant banker engaged in merchant banking related activities. Cash and cash equivalents stood at Rs. 2,943.64 lakhs as of September 30, 2025. The Board of Directors approved these unaudited financial results at their meeting held on November 11, 2025. The results include operations across three main segments: Merchant Banking & Related Activities, Financing and other Activities, and Equity, Commodity, Currency and other Transactional Services.",
            "Sentiment": "positive",
            "PublishDate": 1762869424771,
            "Source": "earnings"
        },
        {
            "Title": "Systematix Group Appoints Bhaskar Hazra and Partha Sengupta as Joint Managing Director CEOs for Private Wealth Business",
            "Summary": "Systematix Group announced the appointment of Bhaskar Hazra and Partha Sengupta as Joint Managing Director CEOs of its Private Wealth Business at Systematix Wealth Asset Services Private Limited, a wholly owned subsidiary. Hazra brings 26 years of experience from senior roles at Barclays Private Bank, Standard Chartered Bank, and GE Countrywide across India, UAE and global markets. Sengupta has 27 years of experience across banking, wealth management, and business transformation at Axis Bank, Trust Plutus Wealth Managers, and Standard Chartered Bank. The appointments reflect the group's strategic focus on building a premier wealth management platform. Systematix Group operates across brokerage, investment banking, wealth and asset management, and NBFC businesses, serving 13,000 wealth and asset management clients with over INR 10,000 crores in assets under management through more than 300 professionals.",
            "Sentiment": "positive",
            "PublishDate": 1762241492064,
            "Source": "corporate_governance"
        },
        {
            "Title": "Systematix Corporate Services Receives NSE Approval for Main Board Listing of 13.65 Crore Equity Shares",
            "Summary": "Systematix Corporate Services has received approval from the National Stock Exchange (NSE) for the main board listing of 13.65 crore equity shares. This regulatory clearance enables the company to proceed with its stock exchange listing on NSE's main board platform.",
            "Sentiment": "positive",
            "PublishDate": 1759321716588,
            "Source": "stock"
        },
        {
            "Title": "Systematix Corporate Services Commits Rs 10 Crore to India SME Growth Fund Series 2 as Sponsor",
            "Summary": "Systematix Corporate Services Limited has committed up to Rs 10 crore as a sponsor in India SME Growth Fund – Series 2, a Category I Alternative Investment Fund. The investment will be made in one or more tranches through cash consideration. The company's wholly-owned subsidiary, Systematix Wealth & Asset Services Private Limited, will act as the Investment Manager of the AIF. This investment was approved by shareholders through a Special Resolution at an Extraordinary General Meeting held on October 14, 2024. The AIF scheme has a 5-year term from the Initial Closing Date, extendable by up to 2 additional periods of 1 year each. The transaction is classified as a related party transaction and is conducted on an arm's length basis. SEBI approval has been obtained for the fund structure.",
            "Sentiment": "positive",
            "PublishDate": 1758554177408,
            "Source": "stock"
        },
        {
            "Title": "Systematix Corporate Services Approves Final Dividend and Launches Employee Stock Option Scheme at 40th AGM",
            "Summary": "Systematix Corporate Services Limited held its 40th Annual General Meeting on September 19, 2025, where shareholders approved several key resolutions. The company declared a final dividend of Rs. 0.10 per equity share (10%) for the financial year ended March 31, 2025. Mrs. Sonam Jain, a practicing Company Secretary with over 10 years of experience in corporate laws and SEBI regulations, was appointed as Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30. The meeting also approved the 'Systematix Employee Stock Option Scheme 2025' which authorizes up to 68,26,901 stock options for eligible employees. The ESOP scheme allows exercise prices up to 30% discount to market price but not below face value, with options vesting between 1-4 years and an exercise period of maximum 4 years from vesting date. The scheme extends to employees of subsidiary companies and involves new equity share issuance rather than secondary acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1758550123337,
            "Source": "corporate_action"
        },
        {
            "Title": "Systematix Group Reports Strong Q1 FY26 Results with 34% Revenue Growth",
            "Summary": "Systematix Group reported consolidated revenue of ₹39.17 crore for Q1 FY26, marking a 34% increase compared to the same quarter last year and 32% growth over the previous quarter. The company achieved profit after tax of ₹10.46 crore, representing a significant 501% jump year-over-year and 218% quarter-over-quarter growth. The financial services firm raised approximately ₹950 crore through various channels including IPOs (₹178 crore), block deals (₹145 crore), private market transactions (₹125 crore), QIPs (₹300 crore), and preferential issues (₹200 crore). The company maintains a net worth of ₹31,030 lakhs with an annualized ROE of 13%. Systematix Group, founded in 1987, operates across investment banking, equity capital markets, wealth management, and brokerage services, serving over 40,000 registered clients with assets under management and custody of approximately ₹9,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753717588567,
            "Source": "earnings"
        },
        {
            "Title": "Systematix Corporate Services Reports Strong Q1 Growth with Net Profit Surging to 105M Rupees",
            "Summary": "Systematix Corporate Services reported consolidated net profit of 105 million rupees for Q1, representing a significant increase from 17 million rupees in the same quarter last year. The company's revenue also grew to 394 million rupees compared to 305 million rupees year-over-year. The results show substantial improvement in both profitability and revenue generation.",
            "Sentiment": "positive",
            "PublishDate": 1753715344297,
            "Source": "earnings"
        },
        {
            "Title": "Systematix Corporate Services Reports Q4 Financial Results",
            "Summary": "Systematix Corporate Services has reported its Q4 consolidated net profit at 33 million rupees, compared to 232 million rupees year-over-year and 186 million rupees quarter-over-quarter. The company's Q4 total income stood at 336 million rupees, down from 584 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747403585000,
            "Source": "result"
        },
        {
            "Title": "Systematix Corporate Services Invests 250M Rupees in Subsidiary",
            "Summary": "Systematix Corporate Services has invested 250 million rupees in one of its subsidiaries through a rights issue. This corporate action indicates a significant financial commitment to support and potentially expand the operations of the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1747136804000,
            "Source": "default"
        }
    ]
}