{
    "Symbol": "TAC",
    "ISIN": "INE0SOY01013",
    "News": [
        {
            "Title": "TAC InfoSec Hits 5% Upper Circuit as PAT Surges 138% YoY in H1 Results",
            "Summary": "TAC InfoSec shares hit the 5% upper circuit at Rs 751.15 following strong H1 FY26 results. The cybersecurity firm reported PAT growth of 138.5% YoY to Rs 1,557.3 crore, compared to Rs 6.53 crore in the previous year. Total income increased 130.7% to Rs 30.36 crore, while EBITDA surged 178.3% to Rs 19.23 crore. The company achieved an EBITDA margin of 63.4% and PAT margin of 51.3%. Growth was driven by the acquisition of Cyberscope, launch of Socify.ai, enterprise contract expansion, and increased per-client revenue. TAC Security has become the fifth largest Vulnerability Management company globally by client base, onboarding clients including Salesforce, Autodesk, Dropbox, and SoftBank Corp. The company announced a USD 100 million CAPEX plan for AI R&D and platform capabilities. Investor Vijay Kedia holds a 10.95% stake with 11,47,500 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1760608974794,
            "Source": "earnings"
        },
        {
            "Title": "TAC Infosec Announces 1:1 Bonus Issue Following Strong Financial Performance",
            "Summary": "TAC Infosec Ltd shares rose 5% to Rs 1,315 after announcing a one-for-one bonus issue of fully paid equity shares worth Rs 10 each. The cybersecurity firm received shareholder approval at its Annual General Meeting on September 30 and clearance from the National Stock Exchange. The record date is set for October 15, with bonus shares to be credited by October 16 and trading to begin October 17. The company reported 157% year-on-year revenue growth for the second half of FY25, with net profit doubling over the same period. The stock has gained nearly 195% over the past year. TAC Infosec announced plans for $100 million capital expenditure by 2030 to advance AI-led cybersecurity capabilities and establish R&D hubs across India, the US, Canada, Europe, and Southeast Asia. The company serves over 6,000 clients across 100 countries, including Apple, Microsoft, Google, AWS, and Adobe, and has become the fifth-largest vulnerability management firm globally. TAC is also planning a Nasdaq listing for its US arm, CyberScope, which recently secured a $1 million global order.",
            "Sentiment": "positive",
            "PublishDate": 1760097461271,
            "Source": "corporate_action"
        },
        {
            "Title": "Tac Infosec Surges 16% as US Subsidiary Plans Nasdaq IPO",
            "Summary": "Tac Infosec shares jumped 5% to Rs 985.7, extending a two-day rally to 15.8%, after its US subsidiary CyberScope Web3 Security Inc. announced plans for a Nasdaq Capital Market IPO. The cybersecurity firm's wholly owned subsidiary, incorporated in the Cayman Islands, has approved filing a confidential Draft Registration Statement with the US Securities and Exchange Commission. Veteran investor Vijay Kedia holds a 14.6% stake in Tac Infosec, making it one of only three stocks in his portfolio where his holding exceeds 10%. The stock, listed in April 2024, has gained 7% over the last month and 57% over the past year. From a technical standpoint, the stock trades above five of its eight key simple moving averages, suggesting short-term strength, while the RSI stands at 53.3.",
            "Sentiment": "positive",
            "PublishDate": 1755682391697,
            "Source": "stock"
        },
        {
            "Title": "Tac Infosec: Vijay Kedia-Backed Stock Soars 195% in One Year",
            "Summary": "Tac Infosec, an SME cybersecurity firm with a 14.6% stake held by investor Vijay Kedia, has seen a 195% return over the past year. The stock recently corrected, trading below its 50-day SMA but above its 200-day SMA. It closed at ₹1,200 on NSE, down 1.84% for the day.",
            "Sentiment": "neutral",
            "PublishDate": 1749003054000,
            "Source": "normal_news"
        },
        {
            "Title": "TAC Infosec: Vijay Kedia-Backed Stock Hits Upper Circuit, Surges 1,100% Since IPO",
            "Summary": "TAC Infosec share price hit 5% upper circuit, reaching ₹1,273 on NSE. The stock has gained 1,100.9% since its April 2024 debut. H1 FY25 revenue was ₹13.16 crore with ₹6.5 crore profit. The company is expanding internationally and invested in CyberScope for Web3 security. Vijay Kedia family holds 15% stake.",
            "Sentiment": "positive",
            "PublishDate": 1740377242000,
            "Source": "normal_news"
        },
        {
            "Title": "TAC INFOSEC Acquires 60% Stake in Cyberscope for $1.4 Million",
            "Summary": "TAC INFOSEC has acquired a 60% stake in WE3 security firm Cyberscope for $1.4 million. This acquisition represents a significant investment in the cybersecurity sector and expands TAC INFOSEC's portfolio in the information security industry.",
            "Sentiment": "positive",
            "PublishDate": 1738759989000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tac Infosec's US Subsidiary to Establish UK Step-down Subsidiary",
            "Summary": "Tac Security Inc., the US-based subsidiary of Tac Infosec, is planning to incorporate a wholly owned subsidiary named Vulman Ltd in the United Kingdom. This new entity will become a step-down subsidiary of Tac Infosec.",
            "Sentiment": "neutral",
            "PublishDate": 1737678222000,
            "Source": "corporate_action"
        },
        {
            "Title": "TAC Security Inc. to Establish UK Subsidiary",
            "Summary": "TAC INFOSEC's U.S.-based subsidiary, TAC Security Inc., is planning to incorporate a wholly owned subsidiary called Vulman Ltd in the United Kingdom. This new entity will become a step-down subsidiary of TAC INFOSEC.",
            "Sentiment": "positive",
            "PublishDate": 1737628154000,
            "Source": "corporate_action"
        },
        {
            "Title": "TAC INFOSEC Achieves Milestone with 2,000 New Customers",
            "Summary": "TAC INFOSEC has reached a significant milestone by acquiring 2,000 new customers since April 2024. This achievement highlights the company's growth and success in the information security sector.",
            "Sentiment": "positive",
            "PublishDate": 1736231120000,
            "Source": "corporate_action"
        },
        {
            "Title": "TAC Infosec: Net Profit Triples to Rs 6.52 Crore in H1 FY25",
            "Summary": "TAC Infosec reported a net profit of Rs 6.52 crore for H1 FY25, up from Rs 1.93 crore last year. Operating income rose to Rs 13.15 crore from Rs 5 crore. The company added 200 new clients in September 2024, including Microsoft and Lenovo. TAC Security partnered with Google for mobile app security assessment and aims to onboard 10,000 customers by 2026.",
            "Sentiment": "positive",
            "PublishDate": 1730904843000,
            "Source": "result"
        },
        {
            "Title": "TAC INFOSEC Partners for Mobile App Security Assessment",
            "Summary": "<p>TAC INFOSEC has announced a <span class='positive'>partnership</span> that will provide <span class='positive'>access</span> to approximately <b>10,000</b> <span class='positive'>premium clients</span> per month for selected players in mobile apps security assessment. This <span class='positive'>collaboration</span> is expected to <span class='positive'>significantly expand</span> the company's <span class='positive'>potential client base</span> in the mobile security sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728881787000,
            "Source": "corporate_action"
        },
        {
            "Title": "TAC InfoSec Partners with Google for Mobile App Security Assessment",
            "Summary": "<p>TAC InfoSec has announced a <span class=\"positive\">partnership</span> with <b>Google</b> to provide <span class=\"positive\">mobile application security assessment</span> services. This <span class=\"positive\">collaboration</span> aims to <span class=\"positive\">enhance</span> the <span class=\"positive\">security</span> of mobile apps, likely leveraging Google's <span class=\"positive\">expertise</span> in the field.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728881719000,
            "Source": "corporate_action"
        }
    ]
}