{
    "Symbol": "TAINWALCHM",
    "ISIN": "INE123C01018",
    "News": [
        {
            "Title": "Tainwala Chemicals Reports Strong Q3 FY26 Results",
            "Summary": "Tainwala Chemicals posted net profit of ₹338.66 lakhs in Q3 FY26, up from ₹16.36 lakhs in Q3 FY25. Revenue from operations grew to ₹1,008.10 lakhs versus ₹458.99 lakhs year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1770807434265,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tainwala Chemicals Reports Mixed Quarterly Performance with Revenue Decline",
            "Summary": "Tainwala Chemicals and Plastics (India) Limited announced its quarterly results for the period ended September 30, 2025. The company reported income from operations of Rs 340.30 lakhs compared to Rs 487.48 lakhs in the previous quarter, showing a decline. However, the company posted a profit after tax of Rs 587.63 lakhs for the quarter versus Rs 296.23 lakhs in the prior quarter. For the half-year period, profit after tax stood at Rs 883.86 lakhs compared to Rs 356.53 lakhs in the corresponding period last year. The company operates in two segments - plastic sheets and tradable items. Total comprehensive income for the quarter was negative at Rs 360.89 lakhs due to other comprehensive income losses, primarily from equity instruments through other comprehensive income showing a loss of Rs 948.52 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1762342795546,
            "Source": "earnings"
        },
        {
            "Title": "Tainwala Chemicals Reports Strong Q1 Results, Declares INR 3 Interim Dividend",
            "Summary": "Tainwala Chemicals and Plastics (India) Limited approved its unaudited financial results for the quarter ended June 30, 2025, showing significant improvement in profitability. The company reported a profit of INR 281.23 lakhs compared to INR 78.91 lakhs in the same quarter last year. Total income increased to INR 409.58 lakhs from INR 233.68 lakhs year-over-year. The board declared an interim dividend of INR 3 per equity share (30% on face value of INR 10) with a record date of August 11, 2025. The company scheduled its 40th Annual General Meeting for September 18, 2025, via video conferencing. Additionally, the board approved a charitable contribution of INR 50 lakhs to Central Hindu Military Education Society, subject to shareholder approval. Earnings per share improved to INR 3.00 from INR 0.84 in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754391616897,
            "Source": "corporate_action"
        },
        {
            "Title": "Tainwala Chemicals Sets August 11, 2025 as Record Date for Interim Dividend",
            "Summary": "Tainwala Chemicals and Plastics (India) Limited has set August 11, 2025, as the record date for determining shareholder eligibility for interim dividend for financial year 2025-26. The Board of Directors will meet on August 5, 2025, to decide on declaring the interim dividend. The company has a paid-up equity share capital of Rs. 9,36,38,630 with shares valued at Rs. 10 each. Shareholders need to submit TDS exemption certificates by the record date to enable appropriate tax deduction on any declared dividend.",
            "Sentiment": "neutral",
            "PublishDate": 1753961627008,
            "Source": "corporate_action"
        }
    ]
}