{
    "Symbol": "TAJGVK",
    "ISIN": "INE586B01026",
    "News": [
        {
            "Title": "TAJ GVK Acquires 2.01% Stake in Green Woods Palaces",
            "Summary": "TAJ GVK Hotels & Resorts acquires additional 2.01% equity stake in Green Woods Palaces and Resorts for Rs.16.09 crores, increasing shareholding to 51% and making it a subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1770741608177,
            "Source": "co_actions_results"
        },
        {
            "Title": "TAJGVK Hotels Reports Strong Q3 & 9M FY26 Results",
            "Summary": "TAJGVK Hotels & Resorts achieved 36% EBITDA margin in 9M FY26 with all-time high PAT of INR 89 crore, up 35%. Company to acquire majority stake in JV operating Taj Santacruz Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1770627658864,
            "Source": "co_actions_results"
        },
        {
            "Title": "TAJ GVK Hotels Clarifies GST Order Non-Material",
            "Summary": "TAJ GVK Hotels & Resorts confirms GST order from Chennai authorities is non-material event, filed as general disclosure under SEBI regulations on January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768304677127,
            "Source": "stocks"
        },
        {
            "Title": "TAJ GVK Hotels faces ₹17.54 lakh GST demand order",
            "Summary": "TAJ GVK Hotels & Resorts received GST demand order of ₹17.54 lakhs with ₹1.94 lakh penalty for FY 2021-22 assessment issues including excess ITC claims and short tax payments.",
            "Sentiment": "negative",
            "PublishDate": 1768216561177,
            "Source": "stocks"
        },
        {
            "Title": "Taj GVK Hotels Plans Efficiency & Sustainability Boost",
            "Summary": "Taj GVK Hotels & Resorts Limited announces strategic plans to enhance operational efficiency while emphasizing sustainability initiatives and improving guest experience across its properties.",
            "Sentiment": "positive",
            "PublishDate": 1767778910799,
            "Source": "stocks"
        },
        {
            "Title": "TAJ GVK Hotels Revises Pledge Disclosure Details",
            "Summary": "TAJ GVK Hotels & Resorts promoter trusts submit revised disclosure correcting encumbrance details for shares pledged to 360 ONE PRIME Limited, following BSE observations on regulatory filing discrepancies.",
            "Sentiment": "neutral",
            "PublishDate": 1767186324563,
            "Source": "stocks"
        },
        {
            "Title": "Taj GVK Hotels confirms IHCL stake sale completion",
            "Summary": "Taj GVK Hotels officially confirms completion of IHCL's 25.52% stake sale through Share Purchase Agreement on December 30, with regulatory disclosures filed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767080130335,
            "Source": "co_actions_results"
        },
        {
            "Title": "TAJGVK Hotels Completes Inter-Se Share Transfer",
            "Summary": "TAJGVK Hotels Resorts Limited announces completion of inter-se transfer of 1.60 crore equity shares among promoter group members under SEBI SAST regulations, with Ms. Shalini Bhupal acquiring 25.52% stake from IHCL.",
            "Sentiment": "neutral",
            "PublishDate": 1766150677970,
            "Source": "co_actions_results"
        },
        {
            "Title": "TAJGVK Hotels Receives Rs 12.59 Crore Demand Notice for Wheeling Charges from Telangana Power Company",
            "Summary": "TAJGVK Hotels & Resorts received a demand notice from TGSPDCL for wheeling charges of Rs 9.16 crore plus surcharge totaling Rs 12.59 crore for FY2004-05 to FY2013-14 at their Taj Deccan hotel in Hyderabad. The company plans to file an appeal with the Telangana High Court for a stay on recovery, maintaining that the charges should be paid by the third-party electricity producer rather than the recipient.",
            "Sentiment": "negative",
            "PublishDate": 1763107086498,
            "Source": "stock"
        },
        {
            "Title": "TAJGVK Hotels & Resorts Reports Growth in Q2 Financial Metrics",
            "Summary": "TAJGVK Hotels & Resorts reported consolidated net profit of 276 million rupees in Q2, up from 243.2 million rupees in the same period last year. Revenue increased to 1.07 billion rupees from 1.05 billion rupees year-over-year. EBITDA rose to 336 million rupees from 295 million rupees, with EBITDA margin improving to 31.39% from 28% compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762156775409,
            "Source": "earnings"
        },
        {
            "Title": "TAJ GVK Hotels & Resorts Reschedules Board Meeting to November 3 for Q2 Financial Results Review",
            "Summary": "TAJ GVK Hotels & Resorts Limited has rescheduled its Board of Directors meeting from November 1, 2025, to November 3, 2025. The meeting will consider and record the unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The company's trading window for securities will remain closed until 48 hours after the declaration of these financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1761115810651,
            "Source": "corporate_action"
        },
        {
            "Title": "Taj GVK Hotels Signs 20-Year Partnership Deal With IHCL For Bengaluru Hotel Project",
            "Summary": "Taj GVK Hotels has entered into a 20-year agreement with IHCL for the development of a new 5-star hotel in Yelahanka, Bengaluru. The partnership represents a significant hospitality expansion in the Bengaluru market.",
            "Sentiment": "positive",
            "PublishDate": 1760346819619,
            "Source": "order&deals"
        },
        {
            "Title": "TAJ GVK Hotels Seeks Shareholder Approval for Two Independent Director Appointments via Postal Ballot",
            "Summary": "TAJ GVK Hotels & Resorts Limited has issued a postal ballot notice seeking shareholder approval for the appointment of two independent directors through remote e-voting. The company is proposing to appoint Mr. N Sambasiva Rao (DIN: 06638926), a retired IPS officer and mechanical engineer with MTech from IIT Kanpur who served as Director General of Police in Andhra Pradesh until 2017, and Mr. Jasthi Krishna Kishore (DIN: 08001625), a chartered accountant from Indian Revenue Service who retired as Chief Commissioner of Income Tax in 2024. Both directors were initially appointed by the Board on September 9, 2025, and are proposed for five-year terms from September 9, 2025 to September 8, 2030. The e-voting period runs from October 6, 2025 at 9:00 AM to November 5, 2025 at 5:00 PM, with results to be declared by November 7, 2025. The cut-off date for eligible shareholders is September 26, 2025, and Mrs. V Vidya Rani has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1758872649022,
            "Source": "corporate_governance"
        },
        {
            "Title": "TAJ GVK Hotels & Resorts Appoints Two Additional Non-Executive Directors",
            "Summary": "TAJ GVK Hotels & Resorts Limited's Board of Directors approved the appointment of Mr. N Sambasiva Rao and Mr. Jasti Krishna Kishore as Additional Directors (Non-Executive & Non-Independent) for a term of 5 years, effective from 09.09.2025. Both appointments are subject to shareholder approval at the upcoming General Meeting. The appointments were made upon recommendation of the Nomination and Remuneration Committee. The company has called for a postal ballot meeting to approve these appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1757423159056,
            "Source": "corporate_governance"
        },
        {
            "Title": "TAJ GVK Hotels & Resorts Reports Malware Incident Affecting Select IT Systems",
            "Summary": "TAJ GVK Hotels & Resorts Limited detected a malware incident that affected select IT systems. The company has taken immediate action to contain the impact and secure the affected systems. Relevant authorities have been notified of the incident. The company stated that business operations continue as usual while they monitor the situation closely.",
            "Sentiment": "negative",
            "PublishDate": 1757051499681,
            "Source": "stock"
        },
        {
            "Title": "TAJGVK Hotels & Resorts Reports Strong Q1 Growth with Revenue Up 18% and Net Profit Surging 143%",
            "Summary": "TAJGVK Hotels & Resorts delivered robust quarterly results with revenue rising to 1.1 billion rupees from 928 million rupees year-over-year. The company's EBITDA increased to 319 million rupees compared to 267 million rupees in the same period last year, while EBITDA margin improved to 29.95% from 28.77%. Consolidated net profit showed significant growth, reaching 411 million rupees versus 169 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754035204775,
            "Source": "earnings"
        },
        {
            "Title": "TAJGVK Hotels & Resorts Reports Q4 EBITDA Decline",
            "Summary": "TAJGVK Hotels & Resorts experienced a year-over-year decrease in Q4 EBITDA, dropping from 409 million rupees to 332 million rupees. The company's EBITDA margin also declined, falling from 35.3% to 26.63% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747123578000,
            "Source": "result"
        },
        {
            "Title": "TAJGVK Hotels & Resorts Reports Q4 Financial Results",
            "Summary": "TAJGVK Hotels & Resorts announced its Q4 financial results. The company's revenue increased to 1.25 billion rupees from 1.16 billion rupees year-over-year. The consolidated net profit rose to 348 million rupees from 259 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747123411000,
            "Source": "result"
        },
        {
            "Title": "Taj GVK Hotels Declares Dividend of Rs 2 Per Share",
            "Summary": "Taj GVK Hotels has announced a dividend of 2 rupees per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1747122781000,
            "Source": "result"
        },
        {
            "Title": "TAJ GVK Hotels & Resorts Reports Improved Q2 Financial Performance",
            "Summary": "TAJ GVK Hotels & Resorts has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 216 million rupees to 295 million rupees. Additionally, the EBITDA margin expanded from 24.18% to 28%.",
            "Sentiment": "positive",
            "PublishDate": 1730704824000,
            "Source": "result"
        },
        {
            "Title": "TAJ GVK Hotels & Resorts Reports Q2 Revenue Growth",
            "Summary": "TAJ GVK Hotels & Resorts has reported a revenue of 1.05 billion rupees for the second quarter, compared to 894 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730704818000,
            "Source": "result"
        },
        {
            "Title": "TAJ GVK Hotels & Resorts Reports Q2 Net Profit Increase",
            "Summary": "TAJ GVK Hotels & Resorts has announced its Q2 financial results, reporting a net profit of 197 million rupees, up from 111 million rupees in the same quarter last year. This represents a significant year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730704768000,
            "Source": "result"
        }
    ]
}