{
    "Symbol": "TAKE",
    "ISIN": "INE142I01023",
    "News": [
        {
            "Title": "TAKE Solutions Plans AI-Driven One Minute Clinics",
            "Summary": "TAKE Solutions announces plans to establish AI-enabled One Minute Clinic units across India, targeting the USD 197 billion preventive healthcare market with smart diagnostic solutions imported from China.",
            "Sentiment": "positive",
            "PublishDate": 1770720165323,
            "Source": "stocks"
        },
        {
            "Title": "Take Solutions Appoints New Company Secretary",
            "Summary": "Take Solutions Limited announces resignation of Sonia Bhimrajka and appointment of Vandana Gupta as Company Secretary and Compliance Officer, effective 28th January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769607715840,
            "Source": "stocks"
        },
        {
            "Title": "Take Solutions Gains 2% Despite Market Decline",
            "Summary": "Take Solutions closed 2% higher at ₹42.25 despite weak markets, extending its remarkable 500% rally since March 2025. Retail investors hold 94.81% stake in the multibagger small-cap stock.",
            "Sentiment": "positive",
            "PublishDate": 1768835875941,
            "Source": "stocks"
        },
        {
            "Title": "TAKE Solutions CFO & Director Resign Dec 31, 2025",
            "Summary": "TAKE Solutions announces resignation of Whole Time Director & CFO Vedamirtham Venkatesan and Director Cecily Dheepa effective December 31, 2025, citing personal commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1767192678868,
            "Source": "stocks"
        },
        {
            "Title": "TAKE Solutions Plans AI-Driven Healthcare Platform",
            "Summary": "TAKE Solutions announces strategic plan to develop advanced AI-powered diagnostic preventive care platform targeting India's USD 197 billion preventive healthcare market by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1766499409659,
            "Source": "stocks"
        },
        {
            "Title": "Take Solutions Shifts Registered Office in Chennai",
            "Summary": "Take Solutions Limited's Board approves relocation of registered office from Mylapore to Anna Nagar East in Chennai, effective December 18, 2025, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766054493200,
            "Source": "stocks"
        },
        {
            "Title": "Take Solutions Appoints New Non-Executive Director",
            "Summary": "Take Solutions Limited announces the appointment of Mr. Parmeshvar Namdev Dhangare as Additional Non-Executive Non-Independent Director, effective December 12, 2025, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1765552041281,
            "Source": "stocks"
        },
        {
            "Title": "Take Solutions Promoter H.R. Srinivasan Disposes Equity Shares",
            "Summary": "Take Solutions Limited disclosed that its Promoter and Director H.R. Srinivasan has disposed of equity shares in the company. The disposal was disclosed under SEBI insider trading regulations and notified to BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764934850866,
            "Source": "corporate_action"
        },
        {
            "Title": "Take Solutions Director Srinivasan Ramani Harikesanallur Resigns Due to Personal Commitments",
            "Summary": "Mr. Srinivasan Ramani Harikesanallur resigned from his position as Non-Executive Non-Independent Director of Take Solutions Limited effective December 1, 2025, citing pre-occupations and personal commitments. The resignation affects the company's board composition and was disclosed to BSE and NSE in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764608222172,
            "Source": "corporate_governance"
        },
        {
            "Title": "Esyspro Infotech Sells 75.41 Lakh Shares in Take Solutions Through Off-Market Transaction",
            "Summary": "Esyspro Infotech Limited sold 75,40,998 equity shares of face value Re. 1 each in Take Solutions Limited through an off-market transaction on November 6, 2025. The seller belongs to the promoter/promoter group category. The disclosure was made under SEBI regulations regarding substantial acquisition of shares and takeovers. The transaction details show the company's shareholding changes before and after the disposal of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762766690724,
            "Source": "corporate_action"
        },
        {
            "Title": "TAKE Solutions Reports Quarterly Results Amid Going Concern Uncertainties and Auditor Resignation",
            "Summary": "TAKE Solutions Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025, approved by the Board of Directors on October 27, 2025. The company faces material uncertainties regarding its ability to continue as a going concern due to significant business deterioration, unpaid statutory dues, and ongoing tax litigations totaling INR 108.03 Million in contingent liabilities. The company incurred a huge loss of INR 697.36 Million in the previous year ending March 31, 2025, primarily from divesting Ecron Acunova Limited and impairment losses on financial assets. TAKE Solutions has divested its subsidiary Take Consultancy Services Inc during the reporting period and is exploring diversification opportunities and potential mergers & acquisitions for Financial Year 2026. The statutory auditors issued a qualified conclusion citing concerns over tax asset recoverability of INR 88.32 Million and indirect tax receivables of INR 51.64 Million. Additionally, the company's statutory auditors resigned on October 8, 2025, effective after completing the limited review of these quarterly results.",
            "Sentiment": "negative",
            "PublishDate": 1761544307674,
            "Source": "earnings"
        },
        {
            "Title": "Take Solutions Pte Limited Sells 2.2 Crore Equity Shares in Off-Market Transaction",
            "Summary": "Take Solutions Pte Limited sold 2,20,38,530 equity shares of Take Solutions Limited through an off-market transaction on September 24, 2025. The shares, with a face value of Re. 1 each, were sold by the promoter group entity. The buyer was Esyspro Infotech Limited, which acquired a 14.90% stake in the company. After the transaction, Take Solutions Pte Limited's holding reduced from 14.90% to 0%, while the total promoter group holding remained at 14.99%. The company's total equity share capital stands at 14,79,34,000 shares worth Rs. 14,79,34,000. The transaction was disclosed under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758953153121,
            "Source": "order&deals"
        },
        {
            "Title": "Aakanksha Management Consultancy Sells 63.61 Lakh Shares of Take Solutions Limited",
            "Summary": "Aakanksha Management Consultancy and Holdings Private Limited sold 63,61,162 equity shares of Take Solutions Limited through an off-market transaction on September 23, 2025. The seller is part of the promoter group and the shares have a face value of Re. 1 each. The transaction reduced the seller's shareholding from 4.30% to 0.00% in Take Solutions Limited. Take Solutions Limited has a total equity share capital of 14,79,34,000 shares of Re. 1 each, and its shares are listed on BSE Limited and National Stock Exchange of India Limited. The disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758866152059,
            "Source": "corporate_action"
        },
        {
            "Title": "Take Solutions Promoter Group Entity Aakanksha Management Sells 53% Stake in Off-Market Transaction",
            "Summary": "Take Solutions Limited disclosed that Aakanksha Management Consultancy and Holdings Private Limited, a promoter group member, disposed of 7,248,766 equity shares through off-market transactions. The disposal reduced Aakanksha's shareholding from 13,609,728 shares (9.20%) to 6,360,962 shares (4.30%). The transactions occurred on September 9 and 11, 2025, with the company receiving disclosure on September 11, 2025. The disposal represents a significant reduction in the promoter group entity's stake in Take Solutions Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757937261493,
            "Source": "corporate_action"
        },
        {
            "Title": "Aakanksha Management Consultancy Sells 7.25 Crore Shares in Take Solutions Through Off-Market Transaction",
            "Summary": "Aakanksha Management Consultancy and Holdings Private Limited sold 72,48,766 equity shares of Take Solutions Limited through an off-market transaction on September 09, 2025. The seller, which belongs to the promoter group, disposed of shares with a face value of Re. 1 each. Following the transaction, Aakanksha's shareholding in Take Solutions decreased from 9.20% to 4.30% of the total share capital. Take Solutions' total equity share capital remains at 14,79,34,000 shares. The transaction was disclosed under SEBI regulations for substantial acquisition of shares and takeovers. Take Solutions is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757749628045,
            "Source": "corporate_action"
        },
        {
            "Title": "Aakanksha Management Consultancy Sells 7.25 Crore Shares in Take Solutions Through Off-Market Transaction",
            "Summary": "Aakanksha Management Consultancy and Holdings Private Limited sold 72,48,766 equity shares of Take Solutions Limited through an off-market transaction on August 21, 2025. The seller, which belongs to the promoter group, reduced its shareholding from 19% to 14.10% in the company. Take Solutions Limited has equity shares listed on BSE Limited and National Stock Exchange of India Limited. The company's total equity share capital remains at 14,79,34,000 shares of Re. 1 each before and after the transaction. The combined holding of the seller and persons acting in concert decreased from 33.99% to 29.09% following this disposal.",
            "Sentiment": "neutral",
            "PublishDate": 1756122478138,
            "Source": "corporate_action"
        },
        {
            "Title": "Asia Global Trading Sells 63.61 Lakh Shares of Take Solutions in Off-Market Transaction",
            "Summary": "Asia Global Trading (Chennai) Private Limited sold 63,61,162 equity shares of Take Solutions Limited through an off-market transaction on August 08, 2025. The seller is part of the promoter group. The transaction reduced Asia Global Trading's shareholding from 4.30% to 0.00% in Take Solutions Limited. The company's total equity share capital remains at 14,79,34,000 equity shares of Re. 1 each before and after the disposal. Take Solutions Limited shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754973142317,
            "Source": "corporate_action"
        },
        {
            "Title": "Asia Global Trading Sells 4.9% Stake in Take Solutions Limited",
            "Summary": "Asia Global Trading (Chennai) Private Limited, a promoter group member of Take Solutions Limited, disposed of 72,48,766 equity shares through off-market transactions. The disposal reduced their shareholding from 9.20% (1,36,09,928 shares) to 4.30% (63,61,162 shares). The transactions occurred between August 1-4, 2025, with the disclosure made in compliance with SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754469470669,
            "Source": "corporate_action"
        },
        {
            "Title": "Asia Global Trading Sells 7.25 Crore Shares in Take Solutions Through Off-Market Transaction",
            "Summary": "Asia Global Trading (Chennai) Private Limited sold 72,48,766 equity shares of Take Solutions Limited through an off-market transaction on August 01, 2025. The seller, which belongs to the promoter group, disposed of shares worth Re. 1 face value each. Following the transaction, Asia Global Trading's shareholding in Take Solutions decreased from 9.20% to 4.30% of the total share capital. The disposal represents 4.90% of Take Solutions' total voting capital. Take Solutions' equity share capital remains unchanged at 14,79,34,000 shares. The promoter group's collective holding, including persons acting in concert, reduced from 43.19% to 38.29% after the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1754369306032,
            "Source": "order&deals"
        },
        {
            "Title": "TAKE Solutions Limited Approves Director Appointments and Remuneration in Extraordinary General Meeting",
            "Summary": "TAKE Solutions Limited held an Extraordinary General Meeting on July 30, 2025, where shareholders approved six resolutions through remote e-voting and electronic voting. The company regularized the appointments of Ms. Cecily Dheepa as Non-Executive Director and Mr. Vedamirtham Venkatesan as Executive Director. Additionally, Mr. Venkatesan was appointed as Whole Time Director with fixed remuneration. Three new Independent Directors were appointed: Ms. Pushpa Joshi, Mr. Kanwar Nitin Singh, and Mr. Peeyush Sethia, all in non-executive capacity. All resolutions were approved with over 99.99% votes in favor, with 76 folios participating in the voting process representing 7.85 crore votes. The meeting was conducted through video conferencing with Central Depository Services India Limited providing the e-voting platform.",
            "Sentiment": "positive",
            "PublishDate": 1754014532714,
            "Source": "corporate_governance"
        },
        {
            "Title": "Take Solutions Promoter Group Entity Asia Global Trading Sells 51.6% of Its Stake",
            "Summary": "Asia Global Trading (Chennai) Private Limited, a promoter group member of Take Solutions Limited, disposed of 1,44,97,532 equity shares through off-market transactions between July 24-28, 2025. The sale reduced Asia Global Trading's shareholding from 2,81,07,460 shares (19.00%) to 1,36,09,928 shares (9.20%) in Take Solutions. The transaction value was ₹1,01,48,272. Take Solutions disclosed this information to BSE and NSE in compliance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753870827209,
            "Source": "corporate_action"
        },
        {
            "Title": "Asia Global Trading Sells 14.5 Crore Shares in Take Solutions Through Off-Market Transaction",
            "Summary": "Asia Global Trading (Chennai) Private Limited sold 1,44,97,532 equity shares of Take Solutions Limited through an off-market transaction on July 24, 2025. The seller, which belongs to the promoter group, disposed of 9.80% of the company's total share capital. Following the transaction, Asia Global Trading's shareholding in Take Solutions decreased from 19.00% to 9.20%. Take Solutions has a total equity share capital of 14,79,34,000 shares of Re. 1 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited. The promoter group's total holding, including persons acting in concert, reduced from 52.99% to 43.19% after the disposal.",
            "Sentiment": "neutral",
            "PublishDate": 1753782702333,
            "Source": "order&deals"
        },
        {
            "Title": "Asia Global Trading Acquires 19% Stake in Take Solutions Through Off-Market Transaction",
            "Summary": "Asia Global Trading (Chennai) Private Limited, a member of the promoter group, acquired 2,81,07,460 equity shares representing 19% shareholding in Take Solutions Limited through an off-market transaction on July 22, 2025. The acquisition was valued at 1,40,53,730. Prior to this transaction, Asia Global Trading held no shares in Take Solutions Limited. The company disclosed this transaction to BSE Limited and National Stock Exchange of India Limited as required under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753442658528,
            "Source": "order&deals"
        },
        {
            "Title": "Take Solutions Pte Limited Sells 19% Stake to Asia Global Trading in Off-Market Transaction",
            "Summary": "Take Solutions Pte Limited sold 2,81,07,460 equity shares (19% stake) of Take Solutions Limited to Asia Global Trading (Chennai) Private Limited through an off-market transaction on July 22, 2025. The seller's shareholding decreased from 52.90% to 33.90%, while the acquirer's holding increased from 0% to 19%. Both entities belong to the promoter group. Take Solutions Limited has a total equity share capital of 14,79,34,000 shares of Re. 1 each, and its shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753421669022,
            "Source": "corporate_action"
        }
    ]
}