{
    "Symbol": "TALBROAUTO",
    "ISIN": "INE187D01029",
    "News": [
        {
            "Title": "Talbros Auto Q3FY26 Results & Leadership Changes",
            "Summary": "Talbros Automotive Components reports Q3FY26 results with consolidated net profit of ₹2,719.55 lakhs. Major leadership restructuring includes Naresh Talwar stepping down as Chairman, Umesh Talwar elevated to Executive Chairman.",
            "Sentiment": "positive",
            "PublishDate": 1770813730433,
            "Source": "co_actions_results"
        },
        {
            "Title": "Talbros Invests ₹3.37 Cr in Solar Power Project",
            "Summary": "Talbros Automotive Components acquires 26% stake in CleanMax Kaziranga for ₹3,37,49,520 to secure solar power for its Haryana manufacturing units through captive consumption model.",
            "Sentiment": "positive",
            "PublishDate": 1770718059728,
            "Source": "co_actions_results"
        },
        {
            "Title": "Talbros Secures Orders Worth Over Rs. 1000 Crores",
            "Summary": "Talbros Automotive Components Limited and its JVs secure multi-year orders worth over Rs. 1000 crores from domestic and international OEMs, including Rs. 100 crores for EV segment and Rs. 700 crores for exports.",
            "Sentiment": "positive",
            "PublishDate": 1770347252696,
            "Source": "co_actions_results"
        },
        {
            "Title": "Talbros Board Meeting Set for Feb 11 to Review Q3 Results",
            "Summary": "Talbros Automotive Components has scheduled a board meeting on February 11, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770115828766,
            "Source": "co_actions_results"
        },
        {
            "Title": "Talbros Automotive Reports Flat H1 FY26 Revenue at INR 427 Crores, Announces New Joint Venture with Lohum Cleantech",
            "Summary": "Talbros Automotive Components reported revenue of INR 427 crores in H1 FY26 with EBITDA margins of 16.5%, impacted by a cyber-attack on a European client causing INR 10 crore business loss. The company announced a strategic joint venture with Lohum Cleantech to develop recovered carbon black and devulcanized rubber products, targeting INR 500-600 crores revenue over 5 years with 15% plus EBITDA margins.",
            "Sentiment": "neutral",
            "PublishDate": 1763379525765,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Reports Strong Q2 Results, Declares 10% Interim Dividend and Approves New Joint Venture",
            "Summary": "Talbros Automotive Components Limited reported quarterly results for the period ended September 30, 2025, with the board declaring an interim dividend of 10% (Rs. 0.20 per equity share) with record date fixed as November 20, 2025. The company also approved entering into a new joint venture with Lohum Cleantech Private Limited, where Talbros will hold 49% shareholding while Lohum will own the remaining 51%.",
            "Sentiment": "neutral",
            "PublishDate": 1763061312230,
            "Source": "corporate_action"
        },
        {
            "Title": "Talbros Automotive Targets 15% CAGR Growth With Record ₹2,000+ Cr Order Book",
            "Summary": "Talbros Automotive reported a record order book exceeding ₹2,000 crores and is targeting 15% CAGR growth over 3 years through capacity expansion at Pune and Faridabad units. The company is focusing on EV-compatible gaskets and lightweighting solutions while pursuing OEM diversification and exports to North America and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1763051922623,
            "Source": "stock"
        },
        {
            "Title": "Talbros Automotive Components Reports Slight Decline in Q2 Financial Performance",
            "Summary": "Talbros Automotive Components reported Q2 consolidated net profit of 231 million rupees, down from 234 million rupees in the same period last year. Revenue decreased to 2.1 billion rupees from 2.16 billion rupees year-over-year. EBITDA fell to 318 million rupees compared to 325 million rupees previously, while EBITDA margin compressed to 14.92% from 15.09% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1763022925446,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Reports 77% Revenue Growth in H1FY22, Achieves Rs 285 Crores",
            "Summary": "Talbros Automotive Components Limited reported revenue of Rs 285 crores during H1FY22, marking 77% year-on-year growth. The company achieved quarterly total income from operations of Rs 146 crores with EBITDA and PAT margins of 14% and 8% respectively. Export portfolio improved from 25% in FY21 to 27% in H1FY22 as percentage of total revenue, with standalone forgings business achieving 53% revenue from exports. The company secured a multi-year order from a large European car manufacturer through its joint venture Marelli Talbros Chassis Systems for supplying Body in White parts, with annual order value estimated at Rs 14.4 crores and total contract value of approximately Rs 92 crores. Talbros entered into a Technical Assistance Agreement with Japanese partner Sanwa Packing Industry for light weight aluminium heat shields. The company is diversifying its product line with addition of critical suspension components supply to electric vehicles and expanding EV product lines in its order book.",
            "Sentiment": "positive",
            "PublishDate": 1761795421472,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Components Reports Modest 1% Revenue Growth in Q1 FY26 Despite Industry Headwinds",
            "Summary": "Talbros Automotive Components achieved total revenue of INR 211 crores in Q1 FY26, representing a marginal 1% year-on-year increase from INR 209 crores. The company maintained EBITDA margins at 16.5% with EBITDA of INR 35 crores, while net profit grew 8% to INR 22 crores. The performance came amid a challenging automotive industry environment, with overall volumes declining 5.1% year-on-year and commercial vehicle segment posting 1% decline. Export revenue contributed 28% of total income, with UK accounting for 56% of export mix, followed by Europe at 27% and US at 13%. The company secured new orders worth INR 580 crores during the quarter. Division-wise, Gasket division recorded 2% growth to INR 135 crores, while Forging division remained flat at INR 75 crores due to subdued European demand and equipment breakdowns. Joint ventures Marelli Talbros and Talbros Marugo delivered strong EBITDA growth of 30% and 26% respectively. Management expects stronger performance in Q2 and Q3, maintaining guidance for double-digit growth for the full year, with new product launches and order executions planned for the second half.",
            "Sentiment": "neutral",
            "PublishDate": 1755091914148,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Secures ₹580 Crore New Orders for FY26, Targets ₹1,500 Crore Revenue by FY27",
            "Summary": "Talbros has secured new orders worth ₹580 crore for FY26. The company has set a revenue target of ₹1,500 crore by FY27. The company's strategy focuses on electric vehicle growth, export expansion, and margin improvement to achieve these targets.",
            "Sentiment": "positive",
            "PublishDate": 1754576646775,
            "Source": "stock"
        },
        {
            "Title": "Talbros Automotive Components Reports Growth in Q1 Financial Performance",
            "Summary": "Talbros Automotive Components reported improved quarterly financial results with EBITDA rising to 310 million rupees from 297 million rupees year-over-year. The company's EBITDA margin increased to 15.01% compared to 14.53% in the same period last year. Consolidated net profit grew to 222 million rupees from 206 million rupees year-over-year, while revenue reached 2.07 billion rupees versus 2.04 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754565780363,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Secures ₹580 Crore in Multi-year Orders",
            "Summary": "Talbros Automotive and its joint ventures have secured new multi-year orders worth ₹580 crore. These orders are expected to boost the company's growth in the electric vehicle (EV) sector and expand its export business. The news indicates a positive development for the company's future business prospects.",
            "Sentiment": "positive",
            "PublishDate": 1749774497000,
            "Source": "default"
        },
        {
            "Title": "Talbros Automotive Components: Secures Rs 580 Crore Multi-Year Orders",
            "Summary": "Talbros Automotive Components Ltd. and its joint ventures have secured new orders worth Rs 580 crore, to be executed over the next five years. The orders span domestic and export markets, with Rs 260 crore from sealing and forgings businesses, including Rs 150 crore in exports. Joint venture Marelli Talbros Chassis Systems secured Rs 290 crore in orders, with 50% for the EV segment. Talbros Marugo Rubber received Rs 30 crore in domestic orders.",
            "Sentiment": "positive",
            "PublishDate": 1749740040000,
            "Source": "order&deals"
        },
        {
            "Title": "Talbros Automotive Secures Multi-Year Orders Worth 5.8 Billion Rupees",
            "Summary": "Talbros Automotive and its joint ventures have obtained multi-year orders valued at 5.8 billion rupees. These orders are expected to boost the company's growth in the electric vehicle sector and expand its export business.",
            "Sentiment": "positive",
            "PublishDate": 1749727879000,
            "Source": "default"
        },
        {
            "Title": "Talbros Automotive: 15% Growth Expected in FY26, 20% in FY27",
            "Summary": "Talbros Automotive Components Ltd. anticipates 15% revenue growth in FY26 and over 20% in FY27, aiming for Rs 2,000 crore turnover by FY27. New orders, previously delayed, are now being commissioned. The company's joint venture with Marelli is expected to contribute Rs 380 crore in FY26. Recent order book secured is Rs 580 crore, in addition to existing Rs 1,475 crore from first nine months of FY25.",
            "Sentiment": "positive",
            "PublishDate": 1749689280000,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Components: Secures ₹580 Crore in New Orders",
            "Summary": "Talbros Automotive Components Ltd. and its joint ventures have received orders worth ₹580 crore for domestic and export markets. The company's direct orders amount to ₹260 crore, including ₹150 crore in exports. Joint venture orders include ₹290 crore for chassis components, with 50% for EV segment, and ₹30 crore for rubber products. Commercialization starts from H2 FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1749616685000,
            "Source": "order&deals"
        },
        {
            "Title": "Talbros Automotive Secures Multi-Year Contracts Worth ₹580 Crores",
            "Summary": "Talbros Automotive and its joint ventures have obtained new contracts valued at ₹580 Crores. These are multi-year contracts, indicating a long-term business commitment. The specific details of the contracts, such as their duration, the products or services involved, or the identity of the joint venture partners, are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749610750000,
            "Source": "default"
        },
        {
            "Title": "Talbros Auto Targets Rs. 2,200 Cr Revenue with Potential Delays",
            "Summary": "Talbros Auto has set a revenue target of Rs. 2,200 crore, with Rs. 2,000 crore expected from the non-LTL division. However, the company anticipates a potential delay of six to nine months in achieving this target due to launch delays, as reported in a concall update.",
            "Sentiment": "neutral",
            "PublishDate": 1748402667000,
            "Source": "default"
        },
        {
            "Title": "Talbros Auto Forecasts Growth and Margin Improvement",
            "Summary": "Talbros Auto expects its EBITDA margin to be around 16.75% to 17% in the future, driven by good margins from joint ventures, particularly Marelli and Marugo. The company anticipates 7% to 8% overall growth, with a target of 8% to 9% growth in the domestic market. This growth is expected to be fueled by new orders from Mahindra, KIA Motors, and Ashok Leyland.",
            "Sentiment": "positive",
            "PublishDate": 1748402571000,
            "Source": "default"
        },
        {
            "Title": "Talbros Automotive Components Reports Q4 Financial Results",
            "Summary": "Talbros Automotive Components has reported its latest quarterly financial results. The company's consolidated net profit for Q4 was 266 million rupees, compared to 498 million rupees year-over-year and 238 million rupees quarter-over-quarter. Q4 revenue remained stable at 2 billion rupees, unchanged from the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748264139000,
            "Source": "result"
        },
        {
            "Title": "Talbros Engineering Reports Q4 Results and Recommends Dividend",
            "Summary": "Talbros Engineering has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 1.25 billion rupees from 1.02 billion rupees year-over-year. EBITDA rose to 139.6 million rupees from 108.2 million rupees, with the EBITDA margin improving to 11.15% from 10.52%. Net profit for Q4 increased to 53.2 million rupees from 44 million rupees year-over-year and 53.4 million rupees quarter-on-quarter. The company has recommended a final dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747757732000,
            "Source": "result"
        },
        {
            "Title": "Talbros Automotive Components Reports Q3 Revenue Growth",
            "Summary": "Talbros Automotive Components has reported a revenue of 2 billion rupees for the third quarter, compared to 1.98 billion rupees in the same period last year, indicating a slight year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739260963000,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Components Reports Improved Q3 EBITDA and Margin",
            "Summary": "Talbros Automotive Components has reported an increase in its Q3 EBITDA to 327 million rupees, up from 304 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 16.22% from 15.32% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739260919000,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Components Reports Q3 Consolidated Net Profit of 238 Million Rupees",
            "Summary": "Talbros Automotive Components has announced its third quarter consolidated net profit of 238 million rupees, compared to 230 million rupees in the same period last year. This represents a slight increase in profitability year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739260882000,
            "Source": "earnings"
        },
        {
            "Title": "Talbros Automotive Secures Multi-Year Orders Worth ₹475 Crore",
            "Summary": "Talbros Automotive Components Limited, along with its joint ventures, has secured new multi-year orders valued at ₹475 crore. These orders represent significant business growth for the company and its partners.",
            "Sentiment": "positive",
            "PublishDate": 1732677507000,
            "Source": "order&deals"
        },
        {
            "Title": "Talbros Automotive Expands EV Portfolio with New Orders",
            "Summary": "Talbros Automotive's Managing Director announced that the company has expanded its electric vehicle (EV) portfolio by securing orders from both domestic and international Original Equipment Manufacturers (OEMs). The company is also increasing its focus on EVs through its joint venture partner and standalone forgings business.",
            "Sentiment": "positive",
            "PublishDate": 1731574926000,
            "Source": "corporate_action"
        },
        {
            "Title": "Talbros Automotive Secures Rs. 2,000 Crore in New Orders",
            "Summary": "The Managing Director of Talbros Automotive has announced that the company has secured over Rs. 2,000 crores in new orders over the past 18 months. Several of these projects are now entering the commercialization phase, which is expected to drive revenue generation and growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731574811000,
            "Source": "corporate_action"
        },
        {
            "Title": "Talbros Automotive Components Reports Q2 EBITDA Growth",
            "Summary": "Talbros Automotive Components has reported an increase in its Q2 EBITDA, rising to 325 million rupees from 282 million rupees year-over-year. The company's EBITDA margin also improved, reaching 15.09% compared to 14.52% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731572907000,
            "Source": "result"
        },
        {
            "Title": "Talbros Automotive Components Reports Q2 Revenue Growth",
            "Summary": "Talbros Automotive Components has reported a revenue of 2.16 billion rupees for the second quarter, compared to 1.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731572865000,
            "Source": "result"
        },
        {
            "Title": "Talbros Automotive Components Reports Q2 Profit Increase",
            "Summary": "Talbros Automotive Components has reported a consolidated net profit of 234 million rupees for the second quarter, up from 202 million rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731572842000,
            "Source": "result"
        }
    ]
}