{
    "Symbol": "TANLA",
    "ISIN": "INE483C01032",
    "News": [
        {
            "Title": "Tanla's AI Protects 100M Users from 2B Scam Messages",
            "Summary": "Tanla Platforms' Wisely AI achieves 99% effectiveness in protecting 100 million Indosat users from over 2 billion scam messages while analyzing 11 billion communications and preventing USD 500 billion in financial losses.",
            "Sentiment": "positive",
            "PublishDate": 1770365265224,
            "Source": "stocks"
        },
        {
            "Title": "Tanla Platforms Q3FY26 Revenue Jumps 12% to ₹1,121 Cr",
            "Summary": "Tanla Platforms reported strong Q3FY26 results with consolidated revenue rising 12% YoY to ₹1,121.04 crores and net profit growing 11% to ₹131.37 crores for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769091694447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tanla Platforms Q3FY26 Results Call on Jan 23",
            "Summary": "Tanla Platforms announces board meeting on January 22, 2026 to approve Q3FY26 unaudited financial results, followed by earnings call on January 23, 2026 at 3:30 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1768309857093,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tanla Platform: Regional Director Approves Gamooga-Karix Merger",
            "Summary": "The Regional Director has approved the merger of Gamooga with Karix through an approved arrangement scheme. This corporate restructuring involves Tanla Platform and affects the organizational structure of these technology entities.",
            "Sentiment": "positive",
            "PublishDate": 1764255426233,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Targets Double-Digit Revenue Growth Through AI Platform and Global Partnerships",
            "Summary": "Tanla Platforms is targeting double-digit revenue growth driven by strong demand for enterprise cloud communication services. The company has launched a new AI platform called Wisely AI and plans to expand margins through global CPaaS (Communications Platform as a Service) partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1760718514244,
            "Source": "stock"
        },
        {
            "Title": "Tanla Platforms Announces Rs 6 Dividend Per Share",
            "Summary": "Tanla Platforms has announced a dividend of Rs 6 per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1760706583700,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Tanla Platforms reported quarterly consolidated net profit of 1.25 billion rupees compared to 1.3 billion rupees in the same period last year, representing a decline. The company's quarterly revenue increased to 10.78 billion rupees from 10 billion rupees year-over-year, showing growth in the top line despite the profit decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1760706042459,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms Appoints MP Sunil Kumar as Chief Growth Officer for Asia & Middle East",
            "Summary": "Tanla Platforms Limited appointed MP Sunil Kumar as Chief Growth Officer - Asia & Middle East, effective September 22, 2025. The appointment was approved by the Board of Directors through circular resolution and represents a senior management (CXO level) position. Kumar brings extensive telecom industry experience, having previously worked with Space World Group Company, Vodafone Group, Tata Communications, and Bharti Infotel Limited. He is described as an accomplished telecom executive with expertise in enterprise and consumer business, C-suite relationship building, and strategic partnerships in regulated telecom markets.",
            "Sentiment": "positive",
            "PublishDate": 1758532271417,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tanla Platforms Announces New ₹175 Crore Buyback and Completes Previous Share Extinguishment",
            "Summary": "Tanla Platforms' Board approved a buyback of up to 20 lakh equity shares at ₹875 per share, totaling ₹175 crore, representing 1.49% of paid-up capital. The buyback will be conducted through tender offer route and requires shareholder approval via postal ballot. Promoters will not participate in the proposed buyback. Ms. Seshanuradha Chava has been appointed as compliance officer, with Kotak Mahindra Capital as the manager. Separately, the company completed extinguishment of 14.17 lakh equity shares from its previous buyback at ₹1,200 per share, reducing total share capital from 13.58 crore to 13.44 crore shares. The pre-buyback shareholding shows promoters holding 45.49%, foreign investors 9.63%, and public shareholders 43.92%.",
            "Sentiment": "positive",
            "PublishDate": 1757079728485,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Completes INR 175 Crore Share Buyback Program",
            "Summary": "Tanla Platforms Limited has successfully completed its buyback of 20,00,000 equity shares at INR 875 per share, totaling INR 175 crore. The company published post-buyback public announcements in various newspapers including Financial Express, Jansatta, Daily Hindi Milap, Mana Telangana, Financial Express Gujarati, and Vishwavani following completion of payments to eligible shareholders. The buyback was conducted through tender offer process and was approved by the Board of Directors and shareholders with requisite majority in accordance with SEBI Buyback Regulations and Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1755074562064,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Partners with Indosat to Deploy AI-Powered Anti-Spam Solution for Nearly 100 Million Users",
            "Summary": "Tanla Platforms Limited announced a multi-year strategic partnership with Indonesian telecom provider Indosat Ooredoo Hutchison to deploy its anti-spam and anti-scam solution. The partnership will protect Indosat's users in Indonesia from spam and scam communications using Tanla's AI-native platform Wisely.ai, built on NVIDIA GPUs. The solution operates as a subscription-based SaaS model and enables real-time threat detection across SMS, Voice, and VoIP channels for both A2P and P2P communications. Wisely.ai is structured across three layers: Data, Infrastructure and Network; Core AI Engines; and Applications layers, with deep integration across SIM cards and handsets on Android and iOS platforms. The partnership represents a key milestone in Tanla's global expansion from India to Southeast Asia. Indosat's solution will be built on their sovereign AI factory using NVIDIA Blackwell GPUs. The collaboration strengthens Tanla's position as a technology partner to the global telecom ecosystem through recurring SaaS solutions.",
            "Sentiment": "positive",
            "PublishDate": 1754542156975,
            "Source": "order&deals"
        },
        {
            "Title": "Tanla Platforms Partners With Indosat",
            "Summary": "Tanla Platforms has entered into a partnership with Indosat. The partnership details and specific terms of the collaboration were not disclosed in the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1754541816377,
            "Source": "order&deals"
        },
        {
            "Title": "Tracxn Technologies and Tanla Platforms Launch Share Buybacks at 25% and 39% Premiums",
            "Summary": "Two companies have announced significant share buyback programs amid record promoter selling in 2025. Tracxn Technologies approved a Rs 800 million buyback at Rs 75 per share, representing a 25% premium to its current market price of Rs 56.21 and accounting for 23.7% of its capital and reserves. The SaaS-based startup intelligence platform tracks over 4 million startups and aims to optimize capital allocation and improve return ratios. Tanla Platforms launched a Rs 1.75 billion buyback program to repurchase 2 million shares at Rs 875 per share, reflecting a 39.4% premium over its trading level of Rs 627.55. The communications platform company serves major clients including BSNL, Airtel, and Vodafone Idea, processing over 800 billion transactions annually. Both buybacks come as promoter selling reached $30 billion in the first half of 2025, with overall promoter ownership dropping to 50.1%.",
            "Sentiment": "positive",
            "PublishDate": 1754032708969,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Reports Q1 FY26 Results with Revenue Growth and AI Platform Launch",
            "Summary": "Tanla Platforms delivered its second consecutive quarter of revenue growth in Q1 FY26, with revenue increasing 1.6% quarter-on-quarter and 3.8% year-on-year to ₹1,041 crores, along with a PAT of ₹118 crores. The company announced a ₹175 crores buyback and launched an AI-native platform with a Southeast Asian telco, expected to go live in August. Management has set an aspiration to achieve 20% EBITDA CAGR growth over the next two years. The company also secured two MaaP platform deals with Indonesian telcos Telkomsel and Indosat, covering 77% of the Indonesian market. Tanla completed acquisition of ValueFirst India and Singapore, while global acquisitions await RBI approval. The enterprise business showed momentum with new client wins and increased wallet share, particularly in India's OTT space. The company maintains a zero-debt balance sheet and has returned nearly ₹1,000 crores to shareholders over five years through dividends and buybacks.",
            "Sentiment": "positive",
            "PublishDate": 1753721466963,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms Announces ₹175 Crore Share Buyback at ₹875 Per Share",
            "Summary": "Tanla Platforms Limited has announced a buyback of up to 20 lakh fully paid-up equity shares at ₹875 per share, representing 1.49% of total paid-up equity capital. The buyback will be conducted through tender offer route with total consideration of up to ₹175 crores. The buyback price represents a premium of 40.53% and 40.62% over closing prices on NSE and BSE respectively as of June 10, 2025. The buyback opens on July 29, 2025 and closes on August 4, 2025, with July 23, 2025 as the record date. Promoters and promoter group members have declared their intention not to participate in the buyback. The company will fund the buyback through free reserves and securities premium account.",
            "Sentiment": "positive",
            "PublishDate": 1753449138493,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Reports 3.8% Revenue Growth to ₹10,407 Mn in Q1 FY26, Announces ₹1,750 Cr Buyback",
            "Summary": "Tanla Platforms delivered revenue of ₹10,407 Mn in Q1 FY26, marking 3.8% year-over-year growth and 1.6% quarter-over-quarter growth. The company reported EBITDA of ₹1,639 Mn with a 15.8% margin, while profit after tax stood at ₹1,184 Mn with an 11.4% margin. Enterprise Communications contributed 91.2% of total revenue at ₹9,488 Mn, growing 3.6% year-over-year, driven by OTT channels including 60.9% growth in WhatsApp revenue. Digital Platforms generated ₹919 Mn revenue with 6.0% year-over-year growth. The company added 99 new customer logos, with 59% of new additions on WhatsApp and RCS platforms. Tanla announced a buyback program of ₹1,750 Cr at ₹875 per share through tender route, expected to complete by end of August 2025. The company deployed its AI-native platform with a Southeast Asian telco, set to go live in August 2025, and completed MaaP platform deployment for RCS across two Southeast Asian telecom operators. Cash and cash equivalents stood at ₹9,104 Mn after paying interim dividend of ₹808 Mn. The company appointed Anubhav Batra as CFO effective July 28, 2025, and Sunil Bhumralkar as Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1753367892025,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Tanla Platforms reported quarterly revenue of 10.4 billion rupees, up from 10 billion rupees in the same period last year. However, the company's profitability declined with EBITDA falling to 1.6 billion rupees from 1.9 billion rupees year-over-year, while EBITDA margin compressed to 15.75% from 18.81%. Consolidated net profit also decreased to 1.18 billion rupees compared to 1.4 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753360140145,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms Launches AI-Native Platform for Telcos, Expects Double-Digit EBITDA Growth",
            "Summary": "Tanla Platforms announced the deployment of its AI-native platform designed for telecommunications companies during its Annual General Meeting. The platform leverages large-scale infrastructure and agentic models to process complex telco data across networks, billing platforms, devices, CRMs, and mobile apps. The company has already deployed the first application with a large Southeast Asian telco under a multi-year contract, going live in August with 50 million users from day one. The platform will be embedded across the telco ecosystem including networks, SIM cards, and mobile handsets. Tanla reports strong interest from telcos and enterprises across key verticals, positioning the company for international expansion. The company expects to deliver double-digit EBITDA growth in coming years. Additionally, shareholders approved the re-appointment of Deepak Satyaprakash Goyal as Executive Director for five years from September 25, 2025 to September 24, 2030, and appointed Mahadev Tirunagari as Secretarial Auditor for five financial years starting April 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753275139249,
            "Source": "stock"
        },
        {
            "Title": "Tanla Platforms Partners with Overseas Telco for First AI Native Platform Deployment",
            "Summary": "Tanla Platforms Limited has partnered with an overseas telecommunications company for the first deployment of its proprietary AI native platform designed for mobile carriers and enterprises. The platform is scheduled to be commercially live in Q2FY26, representing the company's first deployment with a strategic telco partner. The company has not disclosed additional details about the partnership due to confidentiality terms.",
            "Sentiment": "positive",
            "PublishDate": 1753269943265,
            "Source": "order&deals"
        },
        {
            "Title": "Tanla Platforms Announces INR 175 Crore Share Buyback at INR 875 Per Share",
            "Summary": "Tanla Platforms Limited has announced a buyback of up to 20 lakh equity shares at INR 875 per share, totaling INR 175 crores through the tender offer route. The buyback price represents a premium of 67.58% and 66.42% over the volume weighted average market price on NSE and BSE respectively during the three months preceding June 11, 2025. The board approved the proposal on June 16, 2025, and shareholders approved it through postal ballot on July 16, 2025. The buyback represents 1.49% of the company's total paid-up equity capital and 24.81% of paid-up capital and free reserves based on standalone financials as of March 31, 2025. The record date is set for July 23, 2025, with the tender period from July 29 to August 4, 2025. The promoter group, holding 45.49% stake, has declared their intention not to participate in the buyback. The company aims to return surplus cash to shareholders and improve earnings per share through this initiative.",
            "Sentiment": "positive",
            "PublishDate": 1753098810960,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms: Board Approves Rs 175 Crore Share Buyback at Rs 875 Per Share",
            "Summary": "Tanla Platforms' board has approved a share buyback of up to 20 lakh shares at Rs 875 each, totaling Rs 175 crore. This represents 1.49% of the company's equity capital. The buyback will be conducted through a tender offer, subject to shareholder approval via special resolution.",
            "Sentiment": "positive",
            "PublishDate": 1750128066000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Approves Share Buyback",
            "Summary": "Tanla Platforms' board has approved a share buyback program. The company will repurchase shares at a price of 875 rupees per share, with a total buyback amount of up to 1.75 billion rupees. The buyback will be conducted through a tender offer route.",
            "Sentiment": "positive",
            "PublishDate": 1750118866000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms: Board Approves Rs 175-Crore Share Buyback at Rs 875 Per Share",
            "Summary": "Tanla Platforms' board has approved a buyback of up to 20 lakh shares at Rs 875 each, totaling Rs 175 crore. The buyback is subject to shareholder approval via postal ballot. Promoters, who own 45.49%, will not participate. The stock closed at Rs 657.15 on NSE before the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750081117000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Approves Share Buyback Plan",
            "Summary": "Tanla Platforms' Board has approved a share buyback plan. The company will repurchase shares at ₹875 per share, with a total buyback amount of up to ₹1.75 billion. The buyback will be conducted through the tender offer method.",
            "Sentiment": "positive",
            "PublishDate": 1750077860000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms: Board to Consider Third Share Buyback in Five Years",
            "Summary": "Tanla Platforms' board will meet on June 16 to consider a share buyback proposal. This would be the company's third buyback in five years, following previous ones in 2020 and 2022. The trading window for insiders will be closed until June 18, 2025. The company's Q4 net profit declined 9.9% year-over-year, while revenue increased 1.9%.",
            "Sentiment": "neutral",
            "PublishDate": 1749691391000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms to Consider Share Buyback",
            "Summary": "Tanla Platforms has announced that it will consider a buyback of equity shares on June 16. The company has not provided any additional details about the potential buyback, such as the size, price, or method.",
            "Sentiment": "neutral",
            "PublishDate": 1749687226000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms: Board to Consider Share Buyback Proposal",
            "Summary": "Tanla Platforms' board will meet on June 16 to consider a proposal for buyback of equity shares. The company, a leading provider of cloud communications solutions, may repurchase its own shares from the market, potentially enhancing shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1749644643000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms to Consider Share Buyback",
            "Summary": "Tanla Platforms has announced that it will contemplate an equity share buyback on June 16. No further details about the potential buyback were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749641949000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms Ltd: Q4 Revenue Grows 2.4% Q-o-Q, Announces ₹6 Dividend",
            "Summary": "Tanla Platforms reported Q4FY25 revenue of ₹1,024 crore, up 2.4% q-o-q. Q4 PAT was ₹117 crore with EPS of ₹8.74. FY25 revenue grew 2.5% y-o-y to ₹4,028 crore. The company partnered with two overseas telecom operators for MaaP Platform deployment. Board approved ₹6 per share interim dividend.",
            "Sentiment": "positive",
            "PublishDate": 1745565979000,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms Q4 Results and Corporate Actions",
            "Summary": "Tanla Platforms reported Q4 consolidated net profit of 1.17 billion rupees, down from 1.3 billion year-over-year but up from 1.18 billion quarter-over-quarter. Q4 revenue increased to 10.2 billion rupees from 10 billion year-over-year. The company recommended a dividend of 6 rupees per share. Additionally, Karix and Gamooga approved a merger scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1745540081000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms Subsidiaries Approve Merger Scheme",
            "Summary": "Tanla Platforms has announced that its subsidiaries, Karix and Gamooga, have approved a merger scheme. This corporate action suggests a strategic consolidation within the company's structure.",
            "Sentiment": "positive",
            "PublishDate": 1745509807000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms: Q4 Profit Drops 10%, Declares Second Interim Dividend",
            "Summary": "Tanla Platforms reported a 9.9% decline in Q4 net profit to ₹117.3 crore. Revenue rose 1.9% to ₹1,024.4 crore. EBITDA increased 1.9% to ₹163.4 crore, with margin unchanged at 16%. The company declared a second interim dividend of ₹6 per share for FY25, with a record date of April 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1745505001000,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms Announces Q4 Results and Dividend",
            "Summary": "Tanla Platforms has reported its Q4 financial results and recommended a dividend. The company's Q4 EBITDA was 1.63 billion rupees, compared to 1.6 billion rupees in the same period last year. The EBITDA margin remained stable at 15.96%. Additionally, the company has recommended a dividend of 6 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1745504868000,
            "Source": "result"
        },
        {
            "Title": "Tanla Platforms Q4 Financial Results",
            "Summary": "Tanla Platforms reported its Q4 consolidated net profit at 1.17 billion rupees, down from 1.3 billion rupees year-over-year and slightly down from 1.18 billion rupees quarter-over-quarter. However, Q4 revenue increased to 10.2 billion rupees from 10 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745504730000,
            "Source": "result"
        },
        {
            "Title": "Tanla Platforms Partners with Overseas Telcos for Rich Media Messaging",
            "Summary": "Tanla Platforms has announced partnerships with two international telecommunications companies to deploy its Messaging as a Platform (MaaP) solution for rich media messaging. This collaboration aims to enhance the messaging capabilities of these telcos, potentially expanding Tanla's global reach and offering more advanced communication options to users.",
            "Sentiment": "positive",
            "PublishDate": 1744848379000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms Partners with Overseas Telcos for Rich Media Messaging",
            "Summary": "Tanla Platforms has announced partnerships with two international telecommunications companies to deploy its Messaging as a Platform (MaaP) solution for rich media messaging. This collaboration aims to enhance messaging capabilities and expand Tanla's global presence in the telecommunications sector.",
            "Sentiment": "positive",
            "PublishDate": 1744811841000,
            "Source": "default"
        },
        {
            "Title": "Tanla Platforms' Subsidiary Expands to Indonesia",
            "Summary": "Tanla Platforms has announced that its subsidiary, Karix Communications, has incorporated a new entity called PT Karix Communications Indonesia. This move is aimed at extending the company's business operations in Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1740096554000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Expands to Indonesia with New Subsidiary",
            "Summary": "Tanla Platforms has announced that its subsidiary has incorporated PT Karix Communications Indonesia as a new subsidiary. This move is aimed at extending the company's business operations in Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1740057288000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms: Penny Stock Surges 13,340% in 11 Years",
            "Summary": "Tanla Platforms, a Hyderabad-based CPaaS company, has seen its stock price rise from ₹3.90 to ₹524.15 over the past 11 years, marking a 13,340% increase. This growth would have turned a ₹1 lakh investment into ₹1.34 crore. However, the stock has faced recent challenges, declining 64% over the last three years and 46% in the past year.",
            "Sentiment": "neutral",
            "PublishDate": 1739594416000,
            "Source": "normal_news"
        },
        {
            "Title": "Tanla Platforms: Q3 Net Profit Falls 15% YoY, Stock Drops 6%",
            "Summary": "Tanla Platforms' share price declined over 6% following the release of Q3 results. The company reported a 15% year-on-year decrease in net profit. A dividend announcement failed to boost investor sentiment.",
            "Sentiment": "negative",
            "PublishDate": 1737518679000,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms: Q3 Results and Subsidiary Sale Announced",
            "Summary": "Tanla Platforms reported a 21.63% YoY decline in Q3 PAT to Rs 118.50 crore. Revenue decreased by 2.17% YoY to Rs 1,000.43 crore. The company declared an interim dividend of Rs 6 per share. Additionally, Tanla announced the sale of its 100% stake in Gamooga Softtech to Karix Mobile, both wholly-owned subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1737517701000,
            "Source": "result"
        },
        {
            "Title": "Tanla Platforms Reports Q3 Results and Announces Corporate Actions",
            "Summary": "Tanla Platforms reported its Q3 consolidated net profit at 1.19 billion rupees, down from 1.4 billion rupees year-over-year. Revenue remained stable at 10 billion rupees. The company declared an interim dividend of 6 rupees per share. Additionally, Tanla Platforms announced the sale of its 100% equity stake in Gamooga Softtech to Karix Mobile.",
            "Sentiment": "neutral",
            "PublishDate": 1737505312000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms to Sell Gamooga Softtech to Karix Mobile",
            "Summary": "Tanla Platforms has announced its decision to sell its entire 100% equity stake in Gamooga Softtech to Karix Mobile. This move represents a significant corporate action that will likely impact the company's structure and potentially its future operations.",
            "Sentiment": "neutral",
            "PublishDate": 1737470778000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms Declares Interim Dividend",
            "Summary": "Tanla Platforms has announced an interim dividend of 6 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1737470293000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanla Platforms: Q3 Net Profit Drops 15%, Revenue Slightly Down",
            "Summary": "Tanla Platforms reported a 15% YoY decrease in Q3FY25 consolidated net profit to ₹118.51 crore. Revenue from operations marginally declined by 0.21% YoY to ₹1,000.42 crore. The results were announced after market hours on January 21.",
            "Sentiment": "negative",
            "PublishDate": 1737465158000,
            "Source": "earnings"
        },
        {
            "Title": "Tanla Platforms: Shares Surge 16% in Three Days, Recovering from Two-Year Low",
            "Summary": "Tanla Platforms' stock price has risen over 16% in three sessions, reaching a two-month high. The company's market cap increased by Rs 408 crore to Rs 10,508.23 crore. The stock is recovering from an over two-year low reached on December 31, 2024. Trading volume is 92 times the 30-day average, with analysts maintaining a 'buy' rating.",
            "Sentiment": "positive",
            "PublishDate": 1735797802000,
            "Source": "normal_news"
        },
        {
            "Title": "Tanla Platforms: Shares Surge 18% in Two Days",
            "Summary": "Tanla Platforms shares rose 6% in early trading on January 2, following a 12% rally on New Year's Day, totaling an 18% gain over two sessions. The stock opened at ₹750.45 on the BSE, with high trading volumes observed.",
            "Sentiment": "positive",
            "PublishDate": 1735791499000,
            "Source": "normal_news"
        },
        {
            "Title": "Tanla Platforms: Shares Surge 15% on New Year's Day",
            "Summary": "Tanla Platforms shares surged nearly 15% to ₹772.60 on January 1, 2025, closing 11.67% higher at ₹750.45. The stock saw high trading volumes with ₹1,952.94 crore worth of shares traded. Analysts suggest a potential trend reversal based on technical indicators, recommending accumulation with an upside target of ₹850.",
            "Sentiment": "positive",
            "PublishDate": 1735730350000,
            "Source": "normal_news"
        },
        {
            "Title": "Tanla Platforms Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Tanla Platforms has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.75 billion rupees from 1.97 billion rupees year-over-year. Additionally, the EBITDA margin fell to 17.53% from 19.51% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1729167887000,
            "Source": "result"
        },
        {
            "Title": "Tanla Platforms Reports Q2 Revenue",
            "Summary": "Tanla Platforms, a technology company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 10 billion rupees, compared to 10.08 billion rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1729167877000,
            "Source": "result"
        }
    ]
}