{
    "Symbol": "TARAPUR",
    "ISIN": "INE747K01017",
    "News": [
        {
            "Title": "Tarapur Transformers Reports Q3FY26 Loss",
            "Summary": "Tarapur Transformers Limited posted a net loss of ₹24.27 lacs in Q3FY26 compared to a profit of ₹241.39 lacs in Q3FY25, with total income rising to ₹50.75 lacs from ₹9.95 lacs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770821118170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tarapur Transformers Appoints New CFO and Company Secretary",
            "Summary": "Tarapur Transformers Limited appointed Ms. Vaishali Anil Pawar as Chief Financial Officer and Mrs. Hiral Jainesh Shah as Company Secretary and Compliance Officer, both effective November 13, 2025. The appointments were approved by the Board of Directors following recommendations from the Nomination Remuneration Committee and Audit Committee to fulfill statutory requirements under the Companies Act 2013 and SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1763063311266,
            "Source": "earnings"
        },
        {
            "Title": "Tarapur Transformers Reports Rs 9.52 Lacs Net Profit for Quarter Ended June 2025",
            "Summary": "Tarapur Transformers Limited reported a net profit of Rs 9.52 lacs for the quarter ended June 30, 2025, compared to a net profit of Rs 1454.45 lacs in the same quarter last year. Total income declined significantly to Rs 55.37 lacs from Rs 2,381.55 lacs in the previous year quarter. The company's basic earnings per share stood at Rs 0.05 versus Rs 7.46 in the corresponding quarter of the previous year. The company operates in transformer manufacturing and repairs as a single business segment. Tarapur Transformers has filed an insolvency application against Choudhary Global Limited for an outstanding amount of Rs 8.66 crores and received Rs 43.15 lacs from the party during the quarter. The company has also received a show cause notice from SEBI dated June 20, 2025, and is preparing its response. The trading window will reopen 48 hours after the results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1755100114568,
            "Source": "earnings"
        }
    ]
}