{
    "Symbol": "TARC",
    "ISIN": "INE0EK901012",
    "News": [
        {
            "Title": "TARC Reports Strong Q3FY26 Growth with ₹42.30 Cr Income",
            "Summary": "TARC Limited delivered robust Q3FY26 performance with consolidated total income of ₹42.30 crore, marking significant YoY and QoQ growth. Company achieved strong operational milestones with ₹977 crore presales for 9M FY26.",
            "Sentiment": "positive",
            "PublishDate": 1770469510124,
            "Source": "co_actions_results"
        },
        {
            "Title": "TARC Board Meeting Set for February 7 to Review Q3FY26",
            "Summary": "TARC Limited has scheduled a board meeting on February 7, 2026, to consider and approve unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769680124747,
            "Source": "co_actions_results"
        },
        {
            "Title": "TARC Reports ₹977 Cr Sales in 9M FY26",
            "Summary": "TARC Limited achieved sales of ₹977 crore and collections of ₹603 crore for nine months ended December 2025, with Q3 FY26 sales at ₹412 crore. Company secured occupancy certificate for Tripundra project.",
            "Sentiment": "positive",
            "PublishDate": 1768291756256,
            "Source": "co_actions_results"
        },
        {
            "Title": "TARC Limited Reports Strong Q3 FY26 Performance",
            "Summary": "TARC Limited achieved sales of ₹412.00 crore and business cashflows of ₹264.00 crore in Q3 FY26, with nine-month sales reaching ₹977.00 crore. The company received occupation certificate for TARC Tripundra.",
            "Sentiment": "positive",
            "PublishDate": 1768234205426,
            "Source": "co_actions_results"
        },
        {
            "Title": "TARC Gets RERA Addendum for ISHVA Project Expansion",
            "Summary": "TARC Limited receives addendum to RERA registration for TARC ISHVA project in Gurugram, expanding total development area from 6.95 acres to 9.1405 acres. The approval enables sales and strengthens brand value.",
            "Sentiment": "positive",
            "PublishDate": 1768227225325,
            "Source": "stocks"
        },
        {
            "Title": "TARC Limited Credit Rating Reaffirmed by Infomerics",
            "Summary": "Infomerics Valuation and Rating Limited reaffirmed TARC Limited's credit rating at IVR BBB- with rating watch under negative implications for its Non-Convertible Debentures on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766412875727,
            "Source": "stocks"
        },
        {
            "Title": "Tarc's Subsidiary Receives Occupancy Certificate for Residential Project",
            "Summary": "Echo Buildtech, a wholly-owned subsidiary of Tarc, has received a completion cum occupancy certificate from MCD for its 'Tarc Tripundra' residential project. This regulatory approval enables the company to deliver completed units to buyers and marks a key milestone in the project's development.",
            "Sentiment": "positive",
            "PublishDate": 1764720022149,
            "Source": "corporate_action"
        },
        {
            "Title": "TARC Limited Reports Strong H1FY26 Performance with ₹565 Crore Gross Sales and ₹238.4 Crore Net Profit",
            "Summary": "TARC Limited achieved gross sales of ₹565 crores and sales collections of ₹365 crores in H1FY26. The company reported total income of ₹329.5 crores with a net profit of ₹38.4 crores. Total business cash inflow reached ₹652 crores from project sales collections and land receipts. The luxury residential developer received approvals for upcoming developments in New Delhi and Gurugram. TARC Tripundra in New Delhi is approaching delivery, while TARC Kailasa Phase 1 is sold with Phase 2 approaching launch. TARC Ishva in Gurugram has Phase 1 nearly sold. The company's total Gross Development Value (GDV) across three projects stands at ₹7,700 crores, with ₹6,400 crores remaining to be collected. Collections in H1FY26 were ₹365 crores across all projects. The company focuses on luxury residential projects in New Delhi and Gurugram markets, with fully owned land parcels providing development flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1762880696812,
            "Source": "stock"
        },
        {
            "Title": "TARC Reports Narrower Quarterly Loss Despite Revenue Growth",
            "Summary": "TARC reported a consolidated net loss of 157.5 million rupees in its quarterly results, compared to a loss of 673 million rupees in the same period last year. The company's revenue increased to 68.7 million rupees from 43.1 million rupees year-over-year, showing growth of approximately 59% while significantly reducing losses by about 77%.",
            "Sentiment": "positive",
            "PublishDate": 1762868887491,
            "Source": "earnings"
        },
        {
            "Title": "TARC Reports Rs 565 Crore Sales in H1 FY2026 with Total Cash Flows of Rs 1652 Crore",
            "Summary": "TARC reported sales of Rs 565 crore in the first half of FY2026. The company achieved cash collections of Rs 1364 crore, contributing to total cash flows of Rs 1652 crore during the period.",
            "Sentiment": "positive",
            "PublishDate": 1760082070480,
            "Source": "stock"
        },
        {
            "Title": "TARC Limited Reports Sharp Revenue Growth and Returns to Profitability in Q1FY26",
            "Summary": "TARC Limited, a New Delhi-based luxury residential real estate developer, reported strong financial performance for the quarter ended June 30, 2025. Total income surged to ₹295.37 crore from ₹9.63 crore in the corresponding quarter last year, while the company achieved a net profit of ₹54.09 crore compared to a loss of ₹30.53 crore in the same period last year. The company recorded total cash inflow of ₹455.91 crore from project sales and land acquisition receipts. TARC applied for occupancy certificate for its TARC Tripundra project ahead of schedule and plans to commence deliveries this year. The company also received regulatory approval for a key land parcel in Delhi. Managing Director & CEO Amar Sarin highlighted the improved profitability supported by strong cash inflows and noted the company's position to accelerate its launch pipeline in the luxury residential market.",
            "Sentiment": "positive",
            "PublishDate": 1755016874043,
            "Source": "earnings"
        },
        {
            "Title": "TARC Reports Strong Quarterly Turnaround with 542M Rupees Net Profit",
            "Summary": "TARC achieved a consolidated net profit of 542 million rupees in its latest quarterly results, marking a significant turnaround from a loss of 307 million rupees in the same period last year. The company's revenue surged to 759 million rupees compared to 82 million rupees year-over-year, representing substantial growth across both profitability and top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1755009729407,
            "Source": "earnings"
        },
        {
            "Title": "TARC Receives RERA Registration for Trigun Project",
            "Summary": "TARC has obtained RERA (Real Estate Regulatory Authority) registration for its TARC Trigun project. This regulatory approval allows the company to proceed with the real estate development project in compliance with real estate regulations.",
            "Sentiment": "positive",
            "PublishDate": 1753794758559,
            "Source": "stock"
        },
        {
            "Title": "TARC Anticipates Cash Inflow of ₹1300-1500 Crore in FY26",
            "Summary": "TARC Limited expects to generate a cash inflow between ₹1300 crore and ₹1500 crore from ongoing developments in the fiscal year 2026 (FY26).",
            "Sentiment": "positive",
            "PublishDate": 1748575364000,
            "Source": "default"
        },
        {
            "Title": "TARC Ltd: SEBI Appoints Forensic Auditor, Shares Plummet 10%",
            "Summary": "SEBI has appointed a forensic auditor to examine TARC Ltd's financial statements from FY 2020-21 to 2022-23. The regulator suspects potential detrimental disclosures to investors. TARC commits to cooperate fully and maintains this won't affect its growth trajectory. Shares fell 10% to ₹187.92 following the news.",
            "Sentiment": "negative",
            "PublishDate": 1734423912000,
            "Source": "corporate_governance"
        }
    ]
}