{
    "Symbol": "TARIL",
    "ISIN": "INE763I01026",
    "News": [
        {
            "Title": "Transformers & Rectifiers clarifies volume spike",
            "Summary": "Transformers & Rectifiers responds to BSE inquiry on increased trading volume, stating all disclosures are current and volume surge is market-driven with no undisclosed price-sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1770826994128,
            "Source": "stocks"
        },
        {
            "Title": "TARIL Reports Strong Q3FY26 Results with 64% Revenue Growth",
            "Summary": "Transformers & Rectifiers India Limited delivered exceptional Q3FY26 performance with revenue of ₹704.21 crores and EBITDA of ₹114 crores at 16.19% margin. Company secured strategic HVDC repair order from PowerGrid.",
            "Sentiment": "positive",
            "PublishDate": 1768564960192,
            "Source": "co_actions_results"
        },
        {
            "Title": "TARIL Resubmits Q2FY26 Consolidated Review Report",
            "Summary": "Transformers & Rectifiers resubmitted its consolidated limited review report for Q2FY26 after inadvertently omitting the signing page in the initial November 2025 submission to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1768562023509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transformers & Rectifiers faces 31% downside risk",
            "Summary": "InCred cuts target price to ₹200 citing 19% order intake decline and CEO resignation despite strong Q3 FY26 revenue growth of 31.71% YoY to ₹736.76 crore.",
            "Sentiment": "negative",
            "PublishDate": 1767969721543,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transformers & Rectifiers Q3FY26 Results Show Growth",
            "Summary": "Transformers & Rectifiers reports strong Q3FY26 performance with standalone revenue of ₹709.87 crores and net profit of ₹71.03 crores, marking significant improvement over previous periods.",
            "Sentiment": "positive",
            "PublishDate": 1767967694901,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transformers & Rectifiers shares fall 9% post Q3",
            "Summary": "Despite strong Q3 results with 35% profit growth and 31.7% revenue increase, Transformers & Rectifiers shares dropped 9% amid CEO resignation and sector-wide concerns over potential policy changes.",
            "Sentiment": "negative",
            "PublishDate": 1767934468116,
            "Source": "co_actions_results"
        },
        {
            "Title": "InCred Maintains 'Reduce' Rating on T&R at ₹200",
            "Summary": "InCred maintains 'Reduce' rating on Transformers & Rectifiers with price target of ₹200, indicating cautious outlook on the electrical equipment manufacturer's stock performance.",
            "Sentiment": "negative",
            "PublishDate": 1767930944046,
            "Source": "stocks"
        },
        {
            "Title": "Taril Expects World Bank Response by Jan 12",
            "Summary": "Transformers & Rectifiers (Taril) anticipates World Bank response by January 12th with resolution expected in 2-3 weeks. Company confident about competitive position against potential Chinese entrants.",
            "Sentiment": "neutral",
            "PublishDate": 1767924988113,
            "Source": "stocks"
        },
        {
            "Title": "Taril Plans Net Debt Elimination in 18-24 Months",
            "Summary": "Transformers & Rectifiers (Taril) announces strategic plan to eliminate net debt within 18 to 24 months through focused debt reduction initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767889705823,
            "Source": "stocks"
        },
        {
            "Title": "TARIL Awaits World Bank Response by January 12",
            "Summary": "Transformers & Rectifiers expects World Bank response by January 12 with resolution in 2-3 weeks. Company believes Chinese firm entry won't impact operations due to local manufacturing requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767889684571,
            "Source": "stocks"
        },
        {
            "Title": "Taril Targets 200 bps Margin Growth by FY28",
            "Summary": "Transformers & Rectifiers (Taril) announces ambitious medium-term growth strategy, targeting 200 basis points margin expansion by FY28 through operational improvements and strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767889657328,
            "Source": "stocks"
        },
        {
            "Title": "Taril Projects 25% Growth for FY26 with Strong Q4 Focus",
            "Summary": "Transformers & Rectifiers (Taril) highlights Q4 as crucial for execution and new orders, projecting at least 25% growth for FY26 over FY25 with 16% operating margin targets.",
            "Sentiment": "positive",
            "PublishDate": 1767889634809,
            "Source": "stocks"
        },
        {
            "Title": "Taril Eyes ₹8000 Cr Order Book by FY26 End",
            "Summary": "Transformers & Rectifiers anticipates significant order book growth to ₹8000 crores by end of FY26, as disclosed during recent earnings call discussions.",
            "Sentiment": "positive",
            "PublishDate": 1767889609532,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transformers & Rectifiers Q3: Stock Falls 12% Despite Gains",
            "Summary": "Stock declined 11.5% to ₹284.25 despite Q3 profit rising 34.5% to ₹74 crores and revenue growing 32% to ₹737 crores, weighed by CEO resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1767864189200,
            "Source": "co_actions_results"
        },
        {
            "Title": "TARIL Shares Surge 8% on Q3 Results Schedule News",
            "Summary": "Transformers & Rectifiers shares jumped 8% to ₹334.30 following announcement of Q3 FY26 results meeting on January 8, 2026, with high trading volumes at 8.09 times average.",
            "Sentiment": "positive",
            "PublishDate": 1767342560306,
            "Source": "stocks"
        },
        {
            "Title": "TARIL Earnings Call Set for Jan 8 to Discuss Q3FY26",
            "Summary": "Transformers & Rectifiers scheduled earnings conference call on January 8, 2026 at 4:00 PM IST hosted by Nuvama Wealth Management to discuss Q3FY26 financial results with MD and Finance Director participating.",
            "Sentiment": "neutral",
            "PublishDate": 1767193613711,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transformers & Rectifiers Targets ₹8000 Cr Order Book",
            "Summary": "Transformers & Rectifiers maintains steady yearly order guidance while targeting an ambitious ₹8000 crore order book by the end of FY26, signaling strong growth expectations.",
            "Sentiment": "positive",
            "PublishDate": 1765772374037,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transformers and Rectifiers (India) Limited Secures Rs. 53.33 Cr HVDC Converter Transformer Order",
            "Summary": "Transformers and Rectifiers (India) Limited has secured a Rs. 53.33 crore order for repair, erection, testing, and commissioning of a 397 MVA HVDC Converter Transformer, making it the first Indian private sector company to receive such an order. This milestone positions TARIL in the exclusive global HVDC transformer manufacturers club and opens major opportunities in India's rapidly growing HVDC segment driven by renewable energy integration and grid modernization needs.",
            "Sentiment": "positive",
            "PublishDate": 1764826839633,
            "Source": "order&deals"
        },
        {
            "Title": "Transformers and Rectifiers (India) Limited Secures Rs. 389.97 Crore Order",
            "Summary": "Transformers and Rectifiers (India) Limited secured a domestic order worth Rs. 389.97 crore, bringing their total quarterly order book from Gujarat Energy Transmission Corporation Limited to Rs. 493.42 crore. The order falls under the company's normal business operations and will be executed during the current financial year, strengthening the position of India's second-largest transformer manufacturer by capacity.",
            "Sentiment": "positive",
            "PublishDate": 1764055803933,
            "Source": "order&deals"
        },
        {
            "Title": "Transformers and Rectifiers (India) Limited Independent Director Resigns",
            "Summary": "Mr. Ajay S. Patil resigned as Independent Director of Transformers and Rectifiers (India) Limited effective November 12, 2025, citing existing professional and personal commitments requiring greater time and attention. The resignation does not affect the Board composition or committee structure, and the company remains compliant with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763443514235,
            "Source": "corporate_governance"
        },
        {
            "Title": "TARIL Reports 65% EBITDA Drop in Q2 FY26 Due to Raw Material Shortages and Project Delays",
            "Summary": "Transformers and Rectifiers India Limited reported quarterly revenue of INR 460 crores with EBITDA falling to INR 65 crores from INR 65 crores in Q2 FY25, impacted by CTC raw material shortages and heavy rainfall causing delivery delays. The company maintains full-year revenue growth guidance of 25% to reach INR 2,600 crores with 16% EBITDA margin, while addressing World Bank debarment issues from a completed 2022 Nigeria project.",
            "Sentiment": "negative",
            "PublishDate": 1763372658184,
            "Source": "earnings"
        },
        {
            "Title": "Transformers & Rectifiers Shares Hit Upper Circuit After World Bank Removes Company from Debarred List",
            "Summary": "Transformers & Rectifiers India shares locked in upper circuit with 9.99% gain after World Bank removed the company from its Debarred Firms and Individuals list and extended deadline for sanctions case explanation to Jan 12, 2026. The development is expected to restore foreign customer confidence and company reputation, though management stated no impact on orderbook regardless of the World Bank announcement.",
            "Sentiment": "positive",
            "PublishDate": 1763096801008,
            "Source": "stock"
        },
        {
            "Title": "Transformers and Rectifiers Shares Hit 10% Lower Circuit on Weak Quarterly Results",
            "Summary": "Transformers and Rectifiers India Ltd shares fell 10% to Rs 282.20, hitting the lower circuit limit after reporting weak quarterly results. The stock has declined for eight consecutive sessions, dropping nearly 40% over this period. For the quarter ended September 30, consolidated net profit fell 20% to Rs 37.45 crore from Rs 46 crore in the same quarter last year. Revenue remained flat at Rs 460 crore compared to Rs 461 crore previously. EBITDA declined 19% to Rs 65.44 crore from Rs 81 crore, with margins dropping 330 basis points to 13.81% from 17.1%. Despite weak results, the company maintains a healthy order book of Rs 5,472 crore and inquiries under negotiation of over Rs 18,700 crore. The company recorded order inflow of Rs 592 crore during the quarter. The stock is down over 50% year-to-date and about 36% in the last six months.",
            "Sentiment": "negative",
            "PublishDate": 1762839270191,
            "Source": "earnings"
        },
        {
            "Title": "Transformers & Rectifiers Projects FY26 Revenue of ₹2,600 Crore with 16% EBITDA Margin",
            "Summary": "Transformers & Rectifiers anticipates revenue of approximately ₹2,600 crore for FY26 with an EBITDA margin of around 16%. The company expects strong order inflow in the second half of FY26, supported by a pipeline exceeding ₹8,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762831846655,
            "Source": "stock"
        },
        {
            "Title": "Transformers and Rectifiers (India) Limited Receives World Bank Debarment Notice for Nigeria Project",
            "Summary": "Transformers and Rectifiers (India) Limited received a Notice of Uncontested Sanctions Proceedings from the World Bank regarding Sanctions Case No. 788 related to the Nigeria Electricity Transmission Project. The debarment stems from alleged irregularities concerning a past supply order executed for Transmission Company of Nigeria. The company had received a $24.74 million order in FY20 for supplying 70 transformers, which was executed in FY22 with 90% payment received. During shipment, 3 transformers were damaged in an accident, leading to insurance claims and replacement units supplied in FY25. The company states it had not received an earlier notice from July 2025 and plans to contest the matter by submitting a reply to the World Bank. The debarment is limited to participation in World Bank-funded projects only. The company maintains it has no ongoing or pending orders under such projects, stating this action has no material impact on business operations, financial performance, or future outlook. The company believes the findings are not conclusive and reaffirms its commitment to acting in good faith and compliance with applicable laws.",
            "Sentiment": "negative",
            "PublishDate": 1762826578924,
            "Source": "stock"
        },
        {
            "Title": "Transformers and Rectifiers (India) Limited Reports No Deviation in QIP Fund Utilization for Quarter Ended September 2025",
            "Summary": "Transformers and Rectifiers (India) Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding funds raised through Qualified Institutional Placement. India Ratings and Research Private Limited, the monitoring agency, reported no deviation from the stated objects of the QIP. The company raised funds through QIP of 75,18,796 equity shares at ₹665 per share during June 10-13, 2024. Out of total proceeds of ₹5,000 million, ₹2,343.65 million has been utilized across various objects including capital expenditure (₹1,450 million allocated), working capital requirements (₹857.82 million utilized out of ₹1,250 million), debt repayment (₹602.61 million utilized out of ₹613.80 million), and general corporate purposes (₹403.75 million utilized out of ₹1,574.35 million). Unutilized proceeds of ₹2,656.35 million are temporarily deployed in fixed deposits, mutual funds, and other investment instruments. Issue-related expenses were ₹141.78 million against the originally planned ₹111.85 million, which has been ratified by the Board of Directors. The completion timeline for all objects has been revised to July 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762804952186,
            "Source": "stock"
        },
        {
            "Title": "Transformers And Rectifiers (India) Secures ₹103.45 Crore Order from Gujarat Energy Transmission Corporation",
            "Summary": "Transformers And Rectifiers (India) has won a ₹103.45 crore order from Gujarat Energy Transmission Corporation for supplying 54 different types of transformers. The delivery is scheduled for the next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1762764859049,
            "Source": "order&deals"
        },
        {
            "Title": "Transformers and Rectifiers Reports Decline in Q2 Profitability Despite Stable Revenue",
            "Summary": "Transformers and Rectifiers reported Q2 consolidated net profit of 339.1 million rupees, down from 452.5 million rupees in the same period last year. Revenue remained relatively flat at 4.6 billion rupees compared to 4.61 billion rupees year-over-year. EBITDA decreased to 515 million rupees from 692 million rupees, while EBITDA margin compressed to 11.2% from 15% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762627051443,
            "Source": "earnings"
        },
        {
            "Title": "TARIL Reports 43% Revenue Growth in Q2 with Strong Order Book of ₹5,472 Crores",
            "Summary": "Transformers and Rectifiers (India) Limited (TARIL) reported consolidated revenue of ₹460.03 crores in quarterly results, marking a 43% year-over-year increase from ₹322.00 crores. The company's EBITDA margin improved to 19.74% compared to 8.81% in the same period last year. TARIL maintains an unexecuted order book of ₹5,472 crores with new order inflows of ₹592 crores during the quarter. The company has inquiries under negotiation worth ₹18,700 crores. TARIL operates as a prominent transformer manufacturer in India with an installed capacity of 40,000 MVA across its units and serves customers in 25+ countries. The company specializes in power transformers, distribution transformers, furnace transformers, rectifier transformers, special transformers, and reactors for various industries including power transmission, steel, petrochemical, and green energy sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762615100068,
            "Source": "earnings"
        },
        {
            "Title": "Transformers and Rectifiers (India) Limited Reports Quarterly Results and Key Board Appointments",
            "Summary": "Transformers and Rectifiers (India) Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board approved the appointment of Mr. Ajay Shriram Patil as an Independent Director for a five-year term effective November 8, 2025, subject to shareholder approval. Mr. Patil brings over 36 years of global finance experience and currently serves as Global CFO at RSB Transmission (India) Ltd. Additionally, Dr. Chanchal S.S. Rajora, who was serving as CFO Advisor to Board, has been elevated to the position of Director Finance with immediate effect while continuing as Chief Financial Officer and Advisor to the Board. During the quarter, the company granted 26,32,968 employee stock options under the TARIL Employee Stock Option Plan 2024, with most options carrying an exercise price of ₹372 per option. The company describes itself as the second largest transformer manufacturing company based on capacity in India, operating three plants around Ahmedabad with approximately 1200 employees.",
            "Sentiment": "positive",
            "PublishDate": 1762610648056,
            "Source": "earnings"
        },
        {
            "Title": "TARIL Clarifies Transformer Issue with TGV SRAAC Limited",
            "Summary": "Transformers and Rectifiers (India) Limited (TARIL) issued a clarification regarding a transformer problem reported by TGV SRAAC Limited. The transformer was supplied to TGV in August 2015 with an 18-month warranty and operated without issues for almost 10 years. TGV reported the problem on October 11, 2025, and TARIL's engineer visited the site the following morning. Since the transformer was out of warranty, TARIL submitted a rectification offer on October 13, 2025, but TGV has not yet responded to the quote. The cause of the problem will be determined once the transformer is taken for repair. TARIL stated this event is not considered material under SEBI regulations and emphasized their service-first policy in responding promptly to TGV's issue.",
            "Sentiment": "neutral",
            "PublishDate": 1761556240733,
            "Source": "stock"
        },
        {
            "Title": "Transformers and Rectifiers India Reports No Deviation in QIP Fund Utilization for Quarter Ended June 2025",
            "Summary": "Transformers and Rectifiers (India) Limited submitted its monitoring agency report for the quarter ended June 30, 2025, regarding funds raised through a Qualified Institutional Placement. The report, prepared by India Ratings and Research Private Limited, confirmed no deviation from the stated objects of the QIP. The company raised INR 5,000 million through the QIP conducted from June 10-13, 2024, issuing 75,18,796 equity shares at INR 665 per share. During the quarter, the company utilized INR 200.53 million, bringing total utilization to INR 1,939.90 million, with INR 3,060.10 million remaining unutilized. The funds were allocated for business expansion through capital expenditure (INR 1,450 million), working capital requirements (INR 1,250 million), debt repayment (INR 613.80 million), inorganic growth and general corporate purposes (INR 1,574.35 million), and issue expenses (INR 111.85 million). Issue expenses exceeded the planned amount by INR 29.93 million, totaling INR 141.78 million, which was ratified by the Board of Directors. Unutilized proceeds were temporarily deployed in fixed deposits, mutual funds, and other investment instruments. The monitoring agency noted delays in implementation of more than three months, with completion now estimated for July 2026 instead of Fiscal 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754451934843,
            "Source": "stock"
        },
        {
            "Title": "Transformers and Rectifiers India Reports 64% Revenue Growth in Q1 FY26 with Strong Order Book",
            "Summary": "Transformers and Rectifiers (India) Limited reported strong quarterly results with revenue from operations at INR 510 crores, marking 64% year-on-year growth. EBITDA increased 127% to INR 97 crores while profit after tax surged 227% to INR 60 crores. The company recorded total order inflow of INR 665 crores during the quarter and maintains an unexecuted order book of INR 5,246 crores as of June 30, 2025, providing revenue visibility for 15-18 months. A notable achievement was securing the company's largest export order worth USD 16.6 million from Botswana. The company is expanding manufacturing capacity by 22,000 MVA at its Moraiya facility, expected to be operational by end of Q2. Management maintains its target of reaching USD 1 billion revenue over the next 3 financial years and expects to close the year with INR 5,000-5,500 crores order book. Current capacity utilization stands at 65% with plans to reach 85-90% this year. The company has INR 18,000 crores worth of inquiries under negotiation.",
            "Sentiment": "positive",
            "PublishDate": 1754299454266,
            "Source": "earnings"
        },
        {
            "Title": "Transformers & Rectifiers Targets $1 Billion Revenue in Three Years with 17-18% EBITDA Margins",
            "Summary": "Transformers & Rectifiers has set an ambitious revenue target of $1 billion over the next three years, expecting EBITDA margins of 17-18%. The company projects an unexecuted order book of Rs 5,000-5,500 crore by the end of next year. Capacity utilization is expected to improve significantly to 85-90% this year, up from 65% last year. Export revenue is anticipated to remain steady at 10% of total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754278660191,
            "Source": "stock"
        },
        {
            "Title": "Transformers & Rectifiers Co-Chairman Sets $1 Billion Revenue Target",
            "Summary": "Transformers & Rectifiers Co-Chairman has confirmed the company's path towards achieving $1 billion in revenue within the next three financial years. The announcement outlines the company's ambitious growth trajectory over this timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1754037150672,
            "Source": "stock"
        },
        {
            "Title": "Transformers and Rectifiers (India) Reports 64% Jump in Quarterly Profit to Rs 67.46 Crore",
            "Summary": "Transformers and Rectifiers (India) Limited reported consolidated profit of Rs 67.46 crore for the quarter ended June 30, 2025, compared to Rs 20.83 crore in the same period last year. Revenue from operations increased to Rs 529.33 crore from Rs 322.00 crore year-on-year. On standalone basis, the company posted profit of Rs 60.15 crore versus Rs 18.37 crore in the previous year quarter, with revenue rising to Rs 510.53 crore from Rs 311.59 crore. Basic earnings per share improved to Rs 2.24 on consolidated basis and Rs 2.00 on standalone basis. The company operates as the second largest transformer manufacturing company based on capacity in India, with three plants around Ahmedabad and approximately 1,200 employees.",
            "Sentiment": "positive",
            "PublishDate": 1754037105312,
            "Source": "earnings"
        },
        {
            "Title": "Transformers and Rectifiers Reports Strong Q1 Growth with Net Profit Surging to 674M Rupees",
            "Summary": "Transformers and Rectifiers delivered robust quarterly results with consolidated net profit rising to 674 million rupees compared to 200.9 million rupees in the same period last year. The company's EBITDA increased to 882 million rupees from 421 million rupees year-over-year, while EBITDA margin improved to 16.7% from 13.1%. Revenue grew significantly to 5.3 billion rupees versus 3.2 billion rupees in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1754035973540,
            "Source": "earnings"
        },
        {
            "Title": "Transformers And Rectifiers India: Ambitious $1 Billion Revenue Target Set for FY28",
            "Summary": "Transformers and Rectifiers India Ltd. aims for $1 billion revenue by FY28, with FY26 target at Rs 3,500 crore. The company plans full backward integration by mid-next fiscal year, expecting to improve margins by 2-2.5%. Current order book stands at Rs 5,400 crore, with Rs 8,000 crore expected by fiscal year-end. Investing Rs 500 crore in backward integration and expanding extra-high voltage transformer capacity.",
            "Sentiment": "positive",
            "PublishDate": 1750912003000,
            "Source": "normal_news"
        },
        {
            "Title": "Transformers & Rectifiers (India): Multibagger Stock Soars on Strong Q4 Results",
            "Summary": "Transformers & Rectifiers (India) reported a 136% YoY increase in Q4 net profit to ₹94.20 crore. Revenue rose 33% to ₹683.42 crore. FY25 net profit jumped 360% to ₹216.44 crore. The company's order book stands at ₹5,132 crore, with a target of ₹8,000 crore for FY26. EBITDA margin expanded to 19.4%. The stock has surged 15,000% in the last five years.",
            "Sentiment": "positive",
            "PublishDate": 1744344010000,
            "Source": "earnings"
        },
        {
            "Title": "Transformers and Rectifiers India Ltd: Ambitious Revenue and Order Book Targets for FY26",
            "Summary": "TRIL aims for Rs 3,500 crore revenue and Rs 8,000 crore order book by FY26. Expects 15-16% margins, with potential 150-200 bps increase from FY27 due to backward integration. Plans significant capacity expansion, targeting 70,000-75,000 MVA by next year. Strong demand outlook based on government projections.",
            "Sentiment": "positive",
            "PublishDate": 1744333471000,
            "Source": "normal_news"
        },
        {
            "Title": "Transformers and Rectifiers India Ltd: Q4FY25 Profit Doubles, Stock Hits Upper Circuit",
            "Summary": "Transformers and Rectifiers India Ltd reported a 136% YoY increase in Q4FY25 net profit to ₹94.20 crore. Revenue rose 32.96% to ₹683.42 crore. FY25 order inflow reached ₹4,500 crore. The company aims for ₹8,000 crore order book in FY26 and $1 billion annual revenue in 3-4 years. Stock hit 5% upper circuit at ₹518.30.",
            "Sentiment": "positive",
            "PublishDate": 1744187932000,
            "Source": "earnings"
        },
        {
            "Title": "Transformers & Rectifiers (India) Ltd: Record Revenue and Profit Surge in FY25",
            "Summary": "TARIL reported annual revenue growth of 56% to ₹2,019 crore in FY25, surpassing its ₹2,000 crore guidance. Q4 revenue reached ₹676 crore, up 32% YoY. Net profit for FY25 increased 357% to ₹217 crore. The company has a strong order book of ₹5,132 crore and plans ₹550 crore capex over the next 15 months. Commercial production of expanded capacity to begin in May 2025.",
            "Sentiment": "positive",
            "PublishDate": 1744117544000,
            "Source": "earnings"
        },
        {
            "Title": "Transformers And Rectifiers India Ltd: Shares Surge on Rs 726 Crore Order Win",
            "Summary": "Transformers And Rectifiers India Ltd won a Rs 726 crore order from Gujarat Energy Transmission Corp for auto transformers and bus reactors. The project has an 18-month completion timeline. The company's shares rose over 8% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1742187140000,
            "Source": "order&deals"
        },
        {
            "Title": "Transformers and Rectifiers (India) Ltd: Secures ₹272 Crore Order from Adani Group",
            "Summary": "Transformers and Rectifiers (India) Ltd has received a ₹272 crore order from Adani Group for the supply of transformers and reactors. The order is to be delivered by the next financial year. This is part of a larger ₹350 crore domestic and export order secured by the company.",
            "Sentiment": "positive",
            "PublishDate": 1740973178000,
            "Source": "order&deals"
        },
        {
            "Title": "Transformers & Rectifiers India: Shares Surge on New Order Win",
            "Summary": "Transformers & Rectifiers India's stock hit 5% upper circuit for the second consecutive day, reaching ₹405 per share. The company secured a ₹166.45 crore order for transformer supply from Hyosung T&D India. This follows a ₹362 crore order received in January. The company's Q3FY25 saw a 52% YoY revenue increase to ₹559 crore and a 243% YoY net profit growth to ₹55 crore.",
            "Sentiment": "positive",
            "PublishDate": 1740031506000,
            "Source": "order&deals"
        },
        {
            "Title": "Transformers & Rectifiers India: Penny Stock Soars 11,725% in 5 Years",
            "Summary": "Transformers & Rectifiers India (TRIL) stock has surged from ₹8 to ₹946 in five years, driven by strong order wins, robust financial growth, and rising power demand. The company has an unexecuted order book of ₹3,686 crore and is implementing five key strategies for growth, including expansion in renewables and increased focus on exports.",
            "Sentiment": "positive",
            "PublishDate": 1737954443000,
            "Source": "normal_news"
        },
        {
            "Title": "Transformers And Rectifiers (India) Ltd.: Q3 Profit Triples, Announces Bonus Share",
            "Summary": "Transformers And Rectifiers (India) Ltd. reported a 253.50% YoY increase in Q3 net profit to Rs 55.5 crore. Revenue rose 51.4% to Rs 559 crore, and EBITDA doubled to Rs 84.7 crore. The company approved a 1:1 bonus share issue and plans to raise Rs 750 crore via QIP.",
            "Sentiment": "positive",
            "PublishDate": 1736327707000,
            "Source": "result"
        },
        {
            "Title": "Transformers and Rectifiers India: Board to Consider Bonus Share Issue",
            "Summary": "Transformers and Rectifiers India Ltd's share price hit a 5% upper circuit at ₹1195.95. The company's board will meet on January 8, 2024, to consider issuing bonus shares and review Q3 FY2024 financial results. The board will also consider increasing the authorized share capital to accommodate the potential bonus issue.",
            "Sentiment": "positive",
            "PublishDate": 1735722139000,
            "Source": "corporate_action"
        },
        {
            "Title": "Transformers And Rectifiers India: Margin Boost Expected from Acquisition",
            "Summary": "Transformers and Rectifiers India Ltd. anticipates a 30 basis points increase in margins following its acquisition of Posco Poggenamp Electrical Steel. The company aims to optimize supply chain management, improve operational efficiency, and expand market presence. They plan further inorganic growth to increase manufacturing capacities, targeting Rs 3,500-crore revenue by FY26 and $1-billion revenue in the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1732159831000,
            "Source": "corporate_action"
        },
        {
            "Title": "Transformers And Rectifiers: Promoter Sells Rs 211 Crore Stake Amid Stock Surge",
            "Summary": "<p><span class=\"neutral\">Jitendra Mamtora</span>, promoter of <b>Transformers And Rectifiers (India) Ltd.</b>, <span class=\"negative\">sold 27 lakh shares (1.79%)</span> at Rs 780.30 per share, totaling Rs 210.68 crore. Buyers include <span class=\"neutral\">Societe Generale</span> and <span class=\"neutral\">Stallion Asset</span>. The stock <span class=\"positive\">hit upper circuit</span> for the fifth consecutive session, <span class=\"positive\">rising 21.54% in five days</span> following a <span class=\"positive\">strong Q2 performance</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728924441000,
            "Source": "block_deals"
        }
    ]
}