{
    "Symbol": "TARMAT",
    "ISIN": "INE924H01018",
    "News": [
        {
            "Title": "Tarmat Limited Reports Strong Q3 FY26 Results",
            "Summary": "Tarmat Limited delivered robust Q3 FY26 performance with revenue of ₹2,731.08 lakhs and net profit of ₹112.66 lakhs, marking significant improvement over previous year's results.",
            "Sentiment": "positive",
            "PublishDate": 1770288113885,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Varghese Acquires Additional 0.08% Stake in Tarmat Limited",
            "Summary": "Dilip Varghese, a promoter of Tarmat Limited, acquired 19,000 equity shares representing 0.08% of the company through open market transactions on November 28, 2025. Following this acquisition, Varghese's total shareholding in the company increased from 5.23% to 5.31%, with the equity share capital remaining at INR 240,642,550.",
            "Sentiment": "neutral",
            "PublishDate": 1764574775556,
            "Source": "corporate_action"
        },
        {
            "Title": "Tarmat Limited Promoter Director Acquires Additional Equity Shares",
            "Summary": "Dilip Varghese, promoter director of Tarmat Limited, acquired 19,000 equity shares representing 0.08% of the company's paid-up equity share capital on November 28, 2025 through open market purchase. The acquisition increased his total shareholding from 5.23% to 5.31% in the infrastructure company listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764418981508,
            "Source": "corporate_action"
        },
        {
            "Title": "Tarmat Limited Promoter Director Dilip Varghese Acquires Additional Equity Shares",
            "Summary": "Dilip Varghese, promoter director of Tarmat Limited, acquired 9,000 equity shares representing 0.04% of the company's paid-up equity share capital on November 24, 2025, through open market purchase for Rs. 477,000. The acquisition increased his total shareholding from 5.19% to 5.23% of the company's equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764069769919,
            "Source": "corporate_action"
        },
        {
            "Title": "Tarmat Limited Promoter Director Dilip Varghese Acquires Additional Equity Shares",
            "Summary": "Dilip Varghese, promoter director of Tarmat Limited, acquired 16,922 equity shares representing 0.07% of the company's paid-up equity share capital on November 21, 2025, through open market purchase for INR 891,400.44. Following this acquisition, his total shareholding increased from 5.12% to 5.19% of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763809638351,
            "Source": "corporate_action"
        },
        {
            "Title": "Tarmat Limited Reports Quarterly Financial Results for Period Ending September 30, 2025",
            "Summary": "Tarmat Limited announced its unaudited financial results for the quarter and half-year ending September 30, 2025, with the Board of Directors approving the standalone and consolidated financial statements. The company operates in a single business segment and has submitted its results in compliance with SEBI listing regulations, with cash and cash equivalents reported at 275.36 for the current period compared to 695.29 in the previous period.",
            "Sentiment": "neutral",
            "PublishDate": 1763133835121,
            "Source": "earnings"
        },
        {
            "Title": "Arton Global Acquires 3.65% Additional Stake in Tarmat Limited",
            "Summary": "Arton Global has acquired 875,236 equity shares representing 3.65% of Tarmat Limited through open market purchases. The acquisition increased Arton Global's total shareholding in Tarmat from 2.02% to 5.67%. The share purchases were executed between October 13-20 and November 4, 2025. Arton Global is not part of Tarmat's promoter group. Tarmat's total equity share capital remains at 2.40 crore shares, and the company's shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762401878150,
            "Source": "corporate_action"
        },
        {
            "Title": "Arton Global Acquires 2.02% Stake in Tarmat Ltd Through Open Market Purchase",
            "Summary": "Arton Global has acquired 485,961 shares in Tarmat Ltd, representing 2.02% of the company's total share capital. The acquisition was completed through open market purchases on BSE and NSE stock exchanges between October 8-10, 2025. Prior to this acquisition, Arton Global held no shares in Tarmat Ltd. The transaction involved shares carrying voting rights, with Tarmat's total equity share capital remaining at 2.40 crore shares after the acquisition. Arton Global does not belong to the promoter or promoter group of Tarmat Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1760355123399,
            "Source": "stock"
        },
        {
            "Title": "Tarmat Ltd Reports Q1 FY2026 Results, Schedules 40th AGM for September 2025",
            "Summary": "Tarmat Ltd approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 2,493.56 lakhs compared to Rs 2,178.35 lakhs in the same quarter last year. Net profit increased to Rs 69.38 lakhs from Rs 55.28 lakhs year-over-year. Basic earnings per share stood at Rs 0.30 versus Rs 0.27 in the previous year quarter. The company scheduled its 40th Annual General Meeting for September 30, 2025, to be conducted virtually. The board appointed M/s. P. Diwan & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The auditors noted concerns regarding the company's investment in Backbone-Tarmat-Al Fara'a joint venture worth Rs 783.02 lakhs due to unavailable financial information. A BSE inspection that commenced on July 15, 2025, remains incomplete due to technical issues.",
            "Sentiment": "neutral",
            "PublishDate": 1755174570935,
            "Source": "earnings"
        },
        {
            "Title": "Tarmat Ltd Secures 33 Crore Rupee Contract",
            "Summary": "Tarmat Ltd has announced winning a new order worth 33 crore rupees (approximately $4 million USD). This represents a significant business development for the company, potentially boosting its project portfolio and revenue stream.",
            "Sentiment": "positive",
            "PublishDate": 1731047976000,
            "Source": "corporate_action"
        }
    ]
}