{
    "Symbol": "TARSONS",
    "ISIN": "INE144Z01023",
    "News": [
        {
            "Title": "Tarsons Products Reports Q3 FY26 Financial Results",
            "Summary": "Tarsons Products Limited announced Q3 FY26 results with standalone revenue of ₹937.01 crores and net profit of ₹70.94 crores for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770632328195,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tarsons Products Q3 Net Profit Drops to ₹50M",
            "Summary": "Tarsons Products reports consolidated net profit of ₹50 million in Q3, down from ₹53 million in the same quarter previous year, reflecting a year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1770361075627,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tarsons Products Q3FY26 Earnings Call on Feb 6",
            "Summary": "Tarsons Products Limited has scheduled an investor conference call for February 6, 2026, at 4:30 PM IST to discuss Q3FY26 financial and operational performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769772681174,
            "Source": "co_actions_results"
        },
        {
            "Title": "MUFG Reduces Stake in Tarsons Products to 1.43% Through Entity Sale",
            "Summary": "Mitsubishi UFJ Financial Group sold its indirect interest in Tarsons Products Ltd by divesting First Sentier Investors (Hong Kong) Limited on November 25, 2025, reducing its shareholding from 5.28% to 1.43%. The transaction involved the sale of 2,050,177 shares, leaving MUFG with 759,560 shares in the Indian company out of total voting capital of 53,206,281 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764308995696,
            "Source": "stock"
        },
        {
            "Title": "Tarsons Products Invests €3 Million in Singapore Subsidiary",
            "Summary": "Tarsons Products has invested €3 million in its Singapore subsidiary Tarsons Life Science Pte. Ltd. The investment is intended for loan payments and business operations of the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1764248764123,
            "Source": "corporate_action"
        },
        {
            "Title": "Tarsons Products Reports Mixed Q2 FY26 Results with Revenue Growth but Lower Profits",
            "Summary": "Tarsons Products Limited reported revenue growth to INR 81 crores in Q2 FY26 with EBITDA rising 11% year-on-year to INR 26 crores, but profit after tax declined to INR 6.5 crores from INR 12.9 crores due to higher depreciation from capacity expansion. The company expects its Panchla and Amta facilities to be fully operational by Q4 FY26, with peak revenue potential of INR 350-400 crores from the new capacity over the next 3-5 years.",
            "Sentiment": "neutral",
            "PublishDate": 1763558849744,
            "Source": "earnings"
        },
        {
            "Title": "MUFG Reduces Stake in Tarsons Products to 5.28% Through Entity Sale",
            "Summary": "Mitsubishi UFJ Financial Group sold its indirect interest in Tarsons Products Ltd by divesting First Sentier Investors (UK) IM Limited on November 12, 2025, reducing its shareholding from 7.33% to 5.28%. The transaction involved 1,092,519 shares worth 2.05% of the company's equity, with MUFG now holding 2,809,737 shares out of 53,206,281 total voting rights.",
            "Sentiment": "neutral",
            "PublishDate": 1763102482789,
            "Source": "stock"
        },
        {
            "Title": "Tarsons Products Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Tarsons Products Limited reported consolidated revenue of Rs 193.7 crore for H1FY26, reflecting 5.2% year-on-year growth. EBITDA grew 18.4% to Rs 52.1 crore compared to Rs 44.0 crore in H1FY25. However, profit after tax declined significantly due to accelerated depreciation and higher finance costs from the capitalization of new facility at Panchla. Cash PAT for H1FY26 stood at Rs 47.5 crore, representing 20.8% YoY growth. The company operates as a leading Indian labware manufacturer with 40 years of experience, offering over 2,000 SKUs across 350 product segments. Management expects revenue contribution from the new Panchla facility to commence in coming years, with swift ramp-up anticipated from FY27 onwards.",
            "Sentiment": "neutral",
            "PublishDate": 1762999498383,
            "Source": "earnings"
        },
        {
            "Title": "Tarsons Products Reports Mixed Q2 Results with Profit Drop and Margin Improvement",
            "Summary": "Tarsons Products reported Q2 net profit of 65 million rupees, down from 129 million rupees in the same period last year. However, the company's EBITDA increased to 261 million rupees from 235 million rupees year-over-year. EBITDA margin improved to 32.48% compared to 29.34% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762932591597,
            "Source": "earnings"
        },
        {
            "Title": "Tarsons Products Reports Mixed Q1 Results with 10% Revenue Growth but Lower Profits",
            "Summary": "Tarsons Products Limited reported quarterly results with standalone revenue of ₹71 crores, up 10% year-over-year, and consolidated revenue of ₹91 crores, up 8%. EBITDA margins improved to 31.2% on standalone basis and 27% on consolidated basis. However, profit after tax declined significantly to ₹3.6 crores standalone and ₹1.8 crores consolidated, compared to ₹6.5 crores and ₹4 crores respectively in the same quarter last year. Domestic revenue grew 12% to ₹48 crores while export revenue increased 3% to ₹43 crores. The company has started Phase 1 commercial production at its new Panchla facility, with Phase 2 expected in the second half of FY26. Initial revenue from cell culture products is anticipated in Q4 FY26. Management noted green shoots of recovery in the domestic market but highlighted challenges from subdued overseas demand and potential U.S. tariff impacts of up to 50% on Indian imports. The plastic labware industry has experienced moderation in growth momentum over the past 18-24 months.",
            "Sentiment": "neutral",
            "PublishDate": 1755597021427,
            "Source": "earnings"
        },
        {
            "Title": "Tarsons Products Reports Q1 FY2026 Results, Schedules 42nd AGM for September 22, 2025",
            "Summary": "Tarsons Products Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹913.64 million compared to ₹847.97 million in the same quarter last year. Net profit stood at ₹17.83 million versus ₹40.16 million in the previous year quarter. On a standalone basis, revenue from operations was ₹712.79 million compared to ₹648.49 million in the corresponding quarter last year, with net profit of ₹35.70 million versus ₹64.61 million. The company scheduled its 42nd Annual General Meeting for September 22, 2025, via video conferencing, with September 12, 2025 as the cut-off date for e-voting. The company manufactures plastic laboratory products and scientific instruments. During the previous financial year, the company paid excess remuneration of ₹9.38 million to its Managing Director and ₹4.3 million to its Whole Time Director, for which it is seeking approval for waiver through special resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1754985199101,
            "Source": "earnings"
        },
        {
            "Title": "Tarsons Products Announces Board Changes with Three Director Appointments",
            "Summary": "Tarsons Products Limited has made significant changes to its board composition effective August 4, 2025. The company appointed Dr. Monjori Mitra as Additional Director (Non-Executive Independent) for a five-year term, bringing 24 years of experience in infectious disease and pediatrics. Mr. Ramanathan Subramanian Arun Kumar was appointed as Additional Director (Non-Executive Nominee) representing Clear Vision Investment Holdings Pte Ltd, bringing nearly three decades of financial services experience. Additionally, Mr. Suresh Eshwara Prabhala resigned from his position as Non-Executive Nominee Director for personal reasons but was simultaneously reappointed as Additional Director (Non-Executive Non-Independent) for a five-year term. All appointments are subject to shareholder approval. The changes were recommended by the Nomination and Remuneration Committee and approved by the Board through circular resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1754309333575,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tarsons Products Appoints Divya Sameer Momaya as Independent Director for Five-Year Term",
            "Summary": "Tarsons Products Limited has appointed Mrs. Divya Sameer Momaya as a Non-Executive Independent Director for a five-year term effective May 24, 2025. The appointment was approved by shareholders through a postal ballot, with the resolution receiving requisite majority approval on July 21, 2025. Mrs. Momaya brings over 22 years of experience in corporate and secretarial laws, corporate governance, and business development. She holds a Bachelor's degree in Commerce from the University of Pune and has been an Associate Member of the Institute of Company Secretaries of India since 2003. She previously worked with BSE Limited and BSEL Infrastructure Realty Limited, and currently serves as a Partner at D.S. Momaya & Co. LLP and Founding Director of MMB Advisors Private Limited. She is not related to any existing director of the company and is not debarred from holding directorship by SEBI or other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1753274201632,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tarsons Products Reports Q4 Financial Results",
            "Summary": "Tarsons Products has released its Q4 financial results. The company's revenue increased to 930 million rupees from 866 million rupees year-over-year. EBITDA rose to 370 million rupees from 339 million rupees, with the EBITDA margin improving to 39.73% from 39.1%. However, the standalone net profit decreased to 157 million rupees from 188 million rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748420540000,
            "Source": "result"
        },
        {
            "Title": "Tarsons Products Discharges €15 Million Earn-Out Obligation",
            "Summary": "Tarsons Products has announced the discharge of a €15 million earn-out obligation. This financial development indicates the company has fulfilled a contingent payment agreement, potentially related to a previous acquisition or business transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1744206488000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tarsons Products Begins Commercial Production at New Panchla Plant",
            "Summary": "Tarsons Products has announced the commencement of commercial production at its newly established manufacturing facility in Panchla. This development marks a significant expansion of the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1731073816000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tarsons Products Reports Q2 EBITDA Decline",
            "Summary": "Tarsons Products announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 235 million rupees from 254 million rupees year-over-year. The EBITDA margin also declined to 29.34% from 38.27% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730982391000,
            "Source": "result"
        },
        {
            "Title": "Tarsons Products Reports Q2 Financial Results",
            "Summary": "Tarsons Products announced its Q2 financial results. The company's net profit reached 129 million rupees, showing a slight increase from 128 million rupees year-over-year (YoY) and a significant rise from 65 million rupees quarter-over-quarter (QoQ). Revenue for Q2 was 801 million rupees, up from 663 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730982322000,
            "Source": "result"
        }
    ]
}