{
    "Symbol": "TASTYBITE",
    "ISIN": "INE488B01017",
    "News": [
        {
            "Title": "Tasty Bite Chairman Pradeep Poddar Resigns",
            "Summary": "Tasty Bite Eatables announces resignation of Chairman and Independent Director Pradeep Poddar, effective March 31, 2026, after completing three years in the role since December 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1770899406186,
            "Source": "stocks"
        },
        {
            "Title": "Tasty Bite Eatables Director Abhash Nigam Resigns",
            "Summary": "Tasty Bite Eatables Limited announces resignation of Mr. Abhash Nigam, Director of TFS (Tasty Bite Food Service), effective December 31, 2025, citing new professional opportunity.",
            "Sentiment": "neutral",
            "PublishDate": 1767189416340,
            "Source": "stocks"
        },
        {
            "Title": "Tasty Bite Eatables Issues Postal Ballot Notice for Board Appointments",
            "Summary": "Tasty Bite Eatables Limited has published newspaper advertisements confirming the dispatch of postal ballot notices for shareholder approval of two board matters. The postal ballot seeks approval for appointing Hans Bakker as Non-Executive Non-Independent Director and approving remuneration for Rama Kannan as Non-Executive Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1764309690026,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tasty Bite Eatables Director Sukhdev David Dusangh Resigns Due to US Relocation",
            "Summary": "Sukhdev David Dusangh (DIN: 08944427) resigned as Non-Executive Non-Independent Director of Tasty Bite Eatables Limited effective from close of business on 25 November 2025. The resignation was due to his relocation to the United States, making it operationally challenging to accommodate significant time zone differences with the rest of the board.",
            "Sentiment": "neutral",
            "PublishDate": 1764132837436,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tasty Bite Eatables Seeks Shareholder Approval for Director Changes via Postal Ballot",
            "Summary": "Tasty Bite Eatables has issued a postal ballot notice seeking member approval for appointing Hans Bakker as Non-Executive Non-Independent Director and approving INR 10 lakh annual remuneration for Independent Director Rama Kannan. The e-voting period runs from November 26 to December 25, 2025, with results to be declared by December 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764071703763,
            "Source": "corporate_action"
        },
        {
            "Title": "Tasty Bite Eatables Reports 5% Revenue Growth and 85% Jump in Profit for H1 FY2026",
            "Summary": "Tasty Bite Eatables Limited announced its quarterly results for the quarter and half year ended September 2025. The company reported revenue growth of 5% year-on-year to ₹2,638 million for H1 FY2026. The Non-PBI Affiliate business grew 145% due to new launches, while PBI faced a temporary slowdown with 14% decline due to macroeconomic challenges in the US. The Food Service Business grew 16% in H1, marking the 8th consecutive quarter of growth. EBITDA margin improved to 13.0%, up 220 basis points year-on-year, driven by pricing and operational efficiencies. Profit after tax nearly doubled to ₹118 million, up 85% year-on-year. The company successfully launched Cheffin on Amazon and Amazon Fresh in August 2025. The company plans to prioritize hero SKUs such as Butter Chicken, Shahi Paneer, and Dal Makhani while accelerating digital and distribution strategy through enhanced e-commerce capabilities and Quick Commerce platforms.",
            "Sentiment": "positive",
            "PublishDate": 1762924098399,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Reports Quarterly Results and Key Board Appointments",
            "Summary": "Tasty Bite Eatables Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the financial statements during their meeting on November 10, 2025. Additionally, the company made two key appointments: Hans Bakker as Non-Executive Non-Independent Director and KPMG Assurance and Consulting Services LLP as internal auditor. The financial results were reviewed by auditors Kalyaniwalla & Mistry LLP, who issued an unmodified review report. The company operates primarily in the prepared foods segment, manufacturing and selling prepared food products to customers.",
            "Sentiment": "neutral",
            "PublishDate": 1762784091138,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Reports Sharp Decline in Q2 Profitability and Revenue",
            "Summary": "Tasty Bite Eatables reported significantly lower quarterly results with EBITDA falling to 88 million rupees from 227 million rupees year-over-year. The company's EBITDA margin compressed to 6.62% compared to 14.51% in the same period last year. Net profit declined to 36 million rupees from 101 million rupees year-over-year, while revenue dropped to 1.3 billion rupees from 1.56 billion rupees in the corresponding period.",
            "Sentiment": "negative",
            "PublishDate": 1762783704252,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Launches CHEFFIN Ready-to-Cook Meal Kits on Amazon",
            "Summary": "Tasty Bite Eatables Limited launched a new consumer brand called CHEFFIN on Amazon's e-commerce platform on August 25, 2025. The brand features five ready-to-cook meal kits inspired by North Indian cuisine: Dal Makhani Kit, Butter Chicken Kit, Chicken Tikka Masala Kit, Kadhai Veg Kit, and Shahi Paneer Kit. The launch targets the domestic Indian market and represents the company's expansion into the B2C segment and ready-to-cook category. The products are designed to deliver restaurant-style taste for urban working households seeking convenient, high-quality meals at home.",
            "Sentiment": "positive",
            "PublishDate": 1756125899561,
            "Source": "stock"
        },
        {
            "Title": "Tasty Bite Eatables Reports Strong Q1 Turnaround with 82M Rupees Net Profit",
            "Summary": "Tasty Bite Eatables reported a net profit of 82 million rupees in Q1, marking a significant turnaround from a loss of 37 million rupees in the same period last year. The company's revenue grew to 1.2 billion rupees compared to 850 million rupees year-over-year. EBITDA increased substantially to 158 million rupees from 17 million rupees, while EBITDA margin improved to 13.07% from 1.99% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754490834456,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Board Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Tasty Bite Eatables Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, along with a Limited Review Report. The board meeting was held on August 6, 2025, at the company's registered office in Pune, commencing at 2:00 p.m. and concluding at 5:30 p.m. The company has submitted these results to BSE and NSE exchanges as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754490712147,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Sets Record Date for Final Dividend and Announces 41st AGM",
            "Summary": "Tasty Bite Eatables Limited has set Friday, 01 August 2025 as the Record Date for determining shareholder eligibility for final dividend for the financial year ended 31 March 2025. The company's 41st Annual General Meeting is scheduled for Thursday, 07 August 2025 at 11:00 a.m. IST at Hotel Sheraton Grand Pune. The final dividend payment, as recommended by the Board of Directors, is subject to approval at the AGM and will be made after deduction of tax at source. Shareholders holding shares in both dematerialized and physical form as of the close of business hours on the Record Date will be eligible for the dividend payment.",
            "Sentiment": "neutral",
            "PublishDate": 1753439832723,
            "Source": "corporate_action"
        },
        {
            "Title": "Tasty Bite Eatables Appoints Shivhari Magar as Associate Director of Corporate Affairs",
            "Summary": "Tasty Bite Eatables Limited appointed Shivhari Magar as Associate Director of Corporate Affairs (SMP) effective July 21, 2025. Magar holds an MBA in HR and brings 14+ years of experience across diverse industry leaders including Sany Heavy Industry India, Cargill India, Hindustan Coca-Cola Beverages, and Toyota Kirloskar Motor. His expertise spans Corporate Affairs, Government Relations, Public Affairs, Stakeholder Management, Greenfield & Brownfield Projects, Crisis Management, and Compliance.",
            "Sentiment": "positive",
            "PublishDate": 1753158304145,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tasty Bite Eatables Reports Q4 Financial Results",
            "Summary": "Tasty Bite Eatables has announced its Q4 financial results. The company's EBITDA increased to 110 million rupees from 83 million rupees year-over-year. The EBITDA margin improved to 8.20% from 7.61% in the same period last year. Net profit rose to 62 million rupees from 25 million rupees year-over-year. Revenue for Q4 grew to 1.33 billion rupees from 1.09 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748396284000,
            "Source": "result"
        },
        {
            "Title": "Tasty Bite Eatables Reports Significant Profit Growth in Q3",
            "Summary": "Tasty Bite Eatables has announced its financial results for the third quarter. The company's net profit has more than doubled year-over-year, reaching 130 million rupees compared to 62.5 million rupees in the same quarter last year. This also represents a significant increase from the previous quarter's 101 million rupees. Revenue for Q3 has grown to 1.8 billion rupees, up from 1.3 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739146348000,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Tasty Bite Eatables has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 227 million rupees, compared to 130 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin increased to 12.70% from 9.80% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738939526000,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Reports Strong Q3 Financial Results",
            "Summary": "Tasty Bite Eatables has announced its Q3 financial results, showing significant growth. The company's net profit increased to 130 million rupees, up from 62.5 million rupees year-over-year and 101 million rupees quarter-over-quarter. Revenue also saw a substantial rise, reaching 1.8 billion rupees compared to 1.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738939451000,
            "Source": "earnings"
        },
        {
            "Title": "Tasty Bite Eatables Reports Q2 Financial Results",
            "Summary": "Tasty Bite Eatables has released its Q2 financial results. The company's EBITDA for the quarter was 227 million rupees, compared to 244 million rupees in the same quarter last year, representing a year-over-year decrease. The EBITDA margin also declined from 16.89% to 14.51% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731578775000,
            "Source": "result"
        },
        {
            "Title": "Tasty Bite Eatables Reports Q2 Revenue Growth",
            "Summary": "Tasty Bite Eatables, a food company, has announced its second quarter revenue for the current fiscal year. The company reported revenue of 1.56 billion rupees, compared to 1.45 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731578570000,
            "Source": "result"
        },
        {
            "Title": "Tasty Bite Eatables Reports Q2 Net Profit Decline",
            "Summary": "Tasty Bite Eatables, a food company, has reported a net profit of 101 million rupees for the second quarter, down from 114 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731578553000,
            "Source": "result"
        }
    ]
}