{
    "Symbol": "TATAINVEST",
    "ISIN": "INE672A01026",
    "News": [
        {
            "Title": "Tata Investment Corporation Q3FY26 Results Announced",
            "Summary": "Tata Investment Corporation Limited reported Q3FY26 financial results for quarter ended December 31, 2025. Board meeting held January 30, 2026 approved unaudited standalone and consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1769777886999,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Investment Corporation Board Meet on Jan 30",
            "Summary": "Tata Investment Corporation Limited has scheduled its board meeting for January 30, 2026, to consider Q3FY26 financial results. Trading window closed from Dec 25, 2025 to Feb 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768816564992,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Investment Corp Gets ESG Rating of 76",
            "Summary": "Tata Investment Corporation Limited receives an overall ESG rating of 76 for FY2025 from NSE Sustainability Ratings and Analytics Limited, placing it in the 'Leader' category.",
            "Sentiment": "positive",
            "PublishDate": 1765539204558,
            "Source": "stocks"
        },
        {
            "Title": "Tata Investment Corp Shares Fall 25% Post-Split Amid Group Leadership Crisis",
            "Summary": "Tata Investment Corporation shares have declined nearly 25% since the stock split on October 14, driven by profit-booking after a pre-record date rally. The company reported a 19.3% year-on-year rise in consolidated net profit to Rs 148 crore for the September quarter, with revenue growing 8.5% to Rs 154 crore. Technical analysts note the stock has retraced to the Rs 800 zone near its 20-day moving average, with key support at Rs 760 and resistance at Rs 860-900. The decline coincides with leadership turmoil within Tata Trusts, where Mehli Mistry was ousted from trust boards in a power struggle with chairman Noel Tata. This governance crisis has contributed to a reported $70 billion drop in collective market capitalization of Tata Group companies over the past year. The stock closed at Rs 801, extending losses for the fourth consecutive session.",
            "Sentiment": "negative",
            "PublishDate": 1761886878764,
            "Source": "stock"
        },
        {
            "Title": "Tata Investment Corp Reports Higher Q2 Profit and Revenue",
            "Summary": "Tata Investment Corp reported consolidated net profit of 1.48 billion rupees in Q2, up from 1.24 billion rupees in the same period last year. The company's Q2 revenue increased to 1.54 billion rupees compared to 1.42 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761553660893,
            "Source": "earnings"
        },
        {
            "Title": "Tata Investment Corporation to Release Q2 Results on October 27, Completes 1:10 Stock Split",
            "Summary": "Tata Investment Corporation Ltd. will announce its quarterly results for the quarter and half-year ended September 30, 2025, on Monday, October 27. The Tata Group subsidiary operates as a non-banking financial company, investing in long-term assets including equity shares and debt instruments. The company completed a 1:10 stock split on October 14, dividing each Rs 10 face value share into ten units of Rs 1 each to improve affordability and liquidity. In Q1FY26, consolidated revenue rose 2% to Rs 145.46 crore while profit after tax increased 11.6% to Rs 146.3 crore. The stock has gained 22.64% year-to-date and 28.75% over the past year, with shares closing at Rs 840 on Friday.",
            "Sentiment": "positive",
            "PublishDate": 1761373695245,
            "Source": "earnings"
        },
        {
            "Title": "Tata Investment Corp Shares Drop 12% in Two Days Following Stock Split",
            "Summary": "Tata Investment Corporation shares fell 3.5% to Rs 908 on October 16, bringing total losses to over 12% in two days following a 1:10 stock split with October 14 as the record date. The split subdivided each Rs 10 face value share into 10 shares of Re 1 each, creating an optical 90% price drop that doesn't affect market capitalization or investor holdings. The move aims to improve affordability and liquidity for retail investors. The stock later recovered, gaining over 7% to trade at Rs 1,069. Tata Investment holds 0.1% in Tata Sons and 2.1% in recently-listed Tata Capital. The company reported consolidated profit after tax of Rs 146.30 crore, up 11.6% year-on-year, while revenue from operations rose 2.1% to Rs 145.46 crore. On standalone basis, net profit surged 23.5% to Rs 139.22 crore with revenue growing 21% year-on-year.",
            "Sentiment": "neutral",
            "PublishDate": 1760591418445,
            "Source": "corporate_action"
        }
    ]
}