{
    "Symbol": "TATAPOWER",
    "ISIN": "INE245A01021",
    "News": [
        {
            "Title": "Tata Power Sets Financial Targets, Renewable Goals",
            "Summary": "Tata Power targets net debt-to-EBITDA ratio of 3.4 and debt-to-equity ratio of 1.2, plans 50-50 solar-wind capacity split by FY27 using own manufactured cells.",
            "Sentiment": "positive",
            "PublishDate": 1770261777180,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Eyes 2.6 GW Renewable Capacity in FY26",
            "Summary": "Tata Power targets 2.6 GW renewable capacity for FY26, with 2.3 GW achieved and 400-500 MW expected in Q4. Company anticipates power demand recovery to 270-280 GW due to warmer summer conditions.",
            "Sentiment": "positive",
            "PublishDate": 1770261727030,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Plans International Asset Divestment",
            "Summary": "Tata Power executive indicates company is exploring divestment of some international assets as part of strategic portfolio optimization.",
            "Sentiment": "neutral",
            "PublishDate": 1770209316776,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power's Indonesia Mine Gets Full Mining Quota",
            "Summary": "Tata Power executive confirms that Kaltim Prima Mine in Indonesia has received its complete mining quota allocation, marking a significant operational milestone for the company's international mining operations.",
            "Sentiment": "positive",
            "PublishDate": 1770209219889,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Nears Gujarat PPA for Mundra Plant",
            "Summary": "Tata Power executive announces final steps underway to sign power purchase agreement with Gujarat government for Mundra power plant operations.",
            "Sentiment": "positive",
            "PublishDate": 1770209191222,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Appoints BSR & Co. LLP as Statutory Auditors",
            "Summary": "Tata Power's Board approves appointment of BSR & Co. LLP as statutory auditors for five-year term from 108th to 113th AGM, replacing SRBC & Co. LLP, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770208897562,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Q3 Net Profit Drops 25% to ₹7.7B",
            "Summary": "Tata Power reports consolidated net profit of ₹7.7 billion for Q3, down from ₹10.3 billion year-on-year, missing analyst estimates of ₹9.2 billion. Revenue also declined to ₹139.5 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770207617891,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Launches 198 MW Solar Project in Tamil Nadu",
            "Summary": "Tata Power commences operations of its 198 MW group captive solar project in Karur, Tamil Nadu, expanding its renewable energy portfolio in South India.",
            "Sentiment": "positive",
            "PublishDate": 1770042319880,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Commissions 765 KV Transmission Lines",
            "Summary": "Tata Power successfully commissioned two major 765 KV transmission lines connecting Mainpuri-Bara and Mainpuri-Unnao, spanning a total circuit length of 574 kilometers.",
            "Sentiment": "positive",
            "PublishDate": 1769775079952,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Block Trade Worth Rs. 36.92 Crores",
            "Summary": "Tata Power witnessed a significant NSE block trade of Rs. 36.92 crores involving 1,048,023 shares at Rs. 352.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769572704813,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Schedules Q3FY26 Results Call on Feb 4",
            "Summary": "Tata Power announces analyst call on February 4, 2026 at 6:00 p.m. IST to discuss Q3FY26 financial results, providing multiple dial-in options for investors and general public participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769514714547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Hits 10 GW EPC Milestone, Q3 Up 139%",
            "Summary": "Tata Power achieves significant 10 GW EPC execution milestone with 1.88 GW renewable capacity commissioned in FY26, marking 33% YoY growth. Q3FY26 completion surged 139% to 941 MW.",
            "Sentiment": "positive",
            "PublishDate": 1769503099205,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Odisha discoms rank top in FY25 report",
            "Summary": "Tata Power-led Odisha distribution companies secured top rankings in Ministry of Power's FY25 assessment, with TPNODL ranking fifth nationally and receiving A+ grades for improved billing efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1769187243731,
            "Source": "stocks"
        },
        {
            "Title": "Tata's semiconductor bet transforms Assam investment map",
            "Summary": "Assam CM reveals Tata's semiconductor investment has triggered ₹5 lakh crore commitments, with ₹3 lakh crore already grounded. Follow-on Tata electronics investment expected in 1-2 years.",
            "Sentiment": "positive",
            "PublishDate": 1769186229132,
            "Source": "stocks"
        },
        {
            "Title": "Dholera Plant to Use ASML Tools for Chip Production",
            "Summary": "Tata Group's Rs 91,000 crore Dholera semiconductor facility will incorporate ASML lithographic equipment, marking a significant milestone for India's chip manufacturing ambitions with substantial government backing.",
            "Sentiment": "positive",
            "PublishDate": 1769180267523,
            "Source": "stocks"
        },
        {
            "Title": "World Bank Approves $815M Financing for Tata Power Bhutan Project",
            "Summary": "World Bank Group sanctions long-term financing package worth $815 million for 1,125 MW Dorjilung Hydropower Project in Bhutan, jointly owned by Tata Power (40%) and DGPC (60%), expected to generate 4,500 GWh annually.",
            "Sentiment": "positive",
            "PublishDate": 1769162516669,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "Tata Power announces board meeting scheduled for February 4, 2026, to consider Q3FY26 financial results for quarter ended December 31, 2025. Trading window closed from December 25.",
            "Sentiment": "neutral",
            "PublishDate": 1768392605708,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Sees ₹18.87 Cr NSE Block Trade at ₹367",
            "Summary": "Tata Power Co. Ltd. witnessed a significant block trade on NSE worth ₹18.87 crores involving 514,072 shares executed at ₹367.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768366664035,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Acquires 100% Stake in Transmission SPV",
            "Summary": "Tata Power completed acquisition of 100% equity stake in Jejuri Hinjewadi Power Transmission Limited for ₹2.42 crore to establish 115 km transmission line between Jejuri and Hinjewadi substations.",
            "Sentiment": "positive",
            "PublishDate": 1767973094424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Acquires Full Ownership of JHPTL",
            "Summary": "Tata Power has acquired complete ownership of JHPTL for ₹24.20 crores, strengthening its portfolio through strategic acquisition and expanding operational control.",
            "Sentiment": "positive",
            "PublishDate": 1767972563036,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power to invest ₹6,675 cr in 10 GW solar facility",
            "Summary": "Tata Power Renewable Energy will establish India's largest ingot and wafer manufacturing facility in Andhra Pradesh, creating 1,000 direct jobs and boosting domestic solar manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767941704405,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Opens New Transmission Infrastructure",
            "Summary": "Tata Power inaugurates new transmission line and substation in Greater Noida, adding 1,000 MVA capacity to address growing power demand in NCR region.",
            "Sentiment": "positive",
            "PublishDate": 1767939980277,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Commissions 1,000 MVA Transmission Infra",
            "Summary": "Tata Power successfully commissioned 400/220 kV Metro Depot Substation and transmission lines at Greater Noida, adding 1,000 MVA transformation capacity to strengthen Uttar Pradesh and Northern Grid infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1767936839784,
            "Source": "stocks"
        },
        {
            "Title": "Andhra Pradesh Approves ₹158 Billion Clean Energy Projects",
            "Summary": "Andhra Pradesh government clears renewable energy projects worth ₹158 billion, including Tata Power's ₹66.75 billion ingot and wafer plant and Websol Energy's ₹35.38 billion solar manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1767936666445,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power breaks descending trendline resistance",
            "Summary": "Tata Power stock forms double bottom pattern and breaks out from descending trendline resistance on daily charts. Experts suggest buying opportunity with target of ₹470.00 in next 3-4 months.",
            "Sentiment": "positive",
            "PublishDate": 1767932460943,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power's TP Solar Achieves 2.9 GW Module Production",
            "Summary": "TP Solar Limited produces 2.9 GW solar modules and 2.8 GW solar cells in 9 months of FY26, with Q3 cell production surging 5X year-over-year to 940 MW while module production grows 7% to 990 MW.",
            "Sentiment": "positive",
            "PublishDate": 1767763999613,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Gets Approval For ₹6,675 Cr Solar Plant",
            "Summary": "Tata Power Renewable Energy receives state approval for India's largest 10GW ingot and wafer manufacturing facility in Andhra Pradesh with ₹6,675 crore investment. Stock declines 1.22% despite announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1767756271185,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Hits 1 GWp Rooftop Solar Milestone",
            "Summary": "Tata Power Renewable Energy achieves 1 GWp rooftop solar capacity in 9 months of FY26, marking 127% YoY growth with 1.7 lakh new customers added across residential and C&I segments.",
            "Sentiment": "positive",
            "PublishDate": 1767609325316,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Sees ₹40.34 Cr NSE Block Trade",
            "Summary": "Tata Power recorded another NSE block trade worth ₹40.34 crores involving 1,032,752 shares at ₹390.60 per share, continuing institutional activity in the power sector stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767333162292,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Completes India's Largest 1 GW Solar Project",
            "Summary": "TPREL successfully commissioned a landmark 1 GW DCR-compliant solar project for SJVN, featuring 2.4 million domestically manufactured modules and expected to generate 2,454.84 million units annually.",
            "Sentiment": "positive",
            "PublishDate": 1767075781831,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Mundra Plant Restart Faces New Delays",
            "Summary": "Transfer of Gujarat officials may further delay Tata Power's 4GW Mundra plant restart beyond December 31 deadline, adding to existing operational challenges and ongoing power purchase agreement negotiations.",
            "Sentiment": "negative",
            "PublishDate": 1766566295630,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Launches Energy Insights Innovation Lab",
            "Summary": "Tata Power inaugurated Energy Insights Innovation Lab (EIIL) with LSE and IGC at Mumbai headquarters to accelerate India's clean energy transition using data analytics, behavioral science, and AI for smarter power solutions.",
            "Sentiment": "positive",
            "PublishDate": 1766138611155,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power EPS Hit by Indonesia Coal Tax - Morgan Stanley",
            "Summary": "Morgan Stanley projects Tata Power's FY27-28 earnings per share will face a 4-5% impact due to Indonesia's new coal tax policy affecting the power generation company's operations.",
            "Sentiment": "negative",
            "PublishDate": 1766037009077,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Allots ₹2,000 Cr NCDs at 7.05% & 7.25%",
            "Summary": "Tata Power completes allotment of ₹2,000 crore NCDs with coupon rates of 7.05% for 3-year Series I and 7.25% for 5-year Series II through private placement on December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765542885383,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC increases stake in Tata Power to 5.009%",
            "Summary": "Life Insurance Corporation of India acquired additional 4.50 lakh shares in Tata Power through market purchase on December 11, 2025, raising its total shareholding from 4.995% to 5.009%.",
            "Sentiment": "neutral",
            "PublishDate": 1765539530985,
            "Source": "stocks"
        },
        {
            "Title": "Tata Power Sees ₹46.09 Cr NSE Block Trade",
            "Summary": "Tata Power executed a significant block trade on NSE worth ₹46.09 crores involving 1,208,028 shares at ₹381.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765518802774,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Wins ₹155.78 Cr Transmission Project",
            "Summary": "Tata Power receives Letter of Intent from REC Power Development for acquiring Jejuri Hinjewadi Power Transmission Limited, a project SPV worth ₹155.78 crores for 400kV transmission line construction.",
            "Sentiment": "positive",
            "PublishDate": 1765449743432,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Wins ₹1.56 Billion Transmission Project",
            "Summary": "Tata Power receives Letter of Intent for major transmission project with annual charges of ₹1.56 billion, strengthening its position in India's power infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1765449651966,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Power Commissions 400kV Transmission Line Enabling 1,000MW Clean Hydropower Distribution",
            "Summary": "Tata Power commissioned the 400kV Koteshwar-Rishikesh transmission line that will evacuate 1,000MW of hydropower from Uttarakhand's Tehri-Koteshwar generation complex to 6 northern states and 3 union territories. The project was completed within one year despite challenging Himalayan terrain at altitudes exceeding 1,816 meters, expanding Tata Power's transmission network to 7,083 circuit kilometers across India.",
            "Sentiment": "positive",
            "PublishDate": 1765277662524,
            "Source": "stock"
        },
        {
            "Title": "Tata Power Temporarily Suspends Operations at Mundra Units",
            "Summary": "Tata Power has temporarily suspended operations at its units located in Mundra. The company expects to resume operations by December 31.",
            "Sentiment": "neutral",
            "PublishDate": 1764893288191,
            "Source": "stock"
        },
        {
            "Title": "Tata Power CEO Announces Upcoming PPA Signing With Gujarat Government for Mundra Plant",
            "Summary": "Tata Power's CEO Sinha announced that the company will sign a Power Purchase Agreement (PPA) with the Gujarat Government for its Mundra plant. This development affects Tata Power's operations and its relationship with the Gujarat Government regarding power supply arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1764823925673,
            "Source": "stock"
        },
        {
            "Title": "Tata Power's Multiple Disputes with State Power Companies Directed to Arbitration by CERC",
            "Summary": "The Central Electricity Regulatory Commission ruled that five separate disputes between Tata Power and state electricity companies (MSEDCL, PSPCL, GUVNL, HPPC, and Rajasthan Discoms) fall outside CERC's jurisdiction as they do not relate to tariff regulation. All five disputes have been directed to three-member arbitral tribunals for adjudication, moving the resolution process from regulatory oversight to private arbitration.",
            "Sentiment": "neutral",
            "PublishDate": 1764574169851,
            "Source": "stock"
        },
        {
            "Title": "Tata Power Mundra UMPP Set to Resume Operations in December 2025 Following Gujarat Agreement",
            "Summary": "Tata Power and the Gujarat State Government have reached an initial agreement on a supplementary power purchase deal for the Mundra Ultra Mega Power Project (UMPP). The agreement paves the way for the power plant to potentially restart operations in December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764217613322,
            "Source": "stock"
        },
        {
            "Title": "Tata Power in Talks with Odisha Government for ₹10,000 Crore Solar Manufacturing Facility",
            "Summary": "Tata Power is in discussions with the Odisha Government to establish a 10 GW ingots and wafers manufacturing facility with an investment of ₹10,000 crores. The facility will produce materials primarily used for solar cells and semiconductor chips, marking a significant expansion into renewable energy manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1764213772193,
            "Source": "stock"
        },
        {
            "Title": "Tata Power Signs Commercial Agreements for 1,125 MW Hydroelectric Project in Bhutan",
            "Summary": "Tata Power Company and Druk Green Power Corporation Limited have signed commercial agreements for the implementation of the 1,125 MW Dorjilung Hydroelectric Power Project in Bhutan. The company has committed an equity investment of 15.72 billion rupees for the project development.",
            "Sentiment": "positive",
            "PublishDate": 1763942762520,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Power Acquires 40% Stake in SPV for ₹13,100 Crore Bhutan Hydro Project",
            "Summary": "Tata Power executed a shareholders agreement with Druk Green Power Corporation Limited to acquire 40% equity stake in a Special Purpose Vehicle for developing the 1125 MW Dorjilung Hydro Power Project in Bhutan. The acquisition, valued at ₹13,100 crore through cash consideration in multiple tranches, aims to accelerate the company's clean and green energy transition with the first tranche expected to complete within 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1763726555636,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Power Renewable Energy Commissions 300 MW Solar Project for NHPC in Rajasthan",
            "Summary": "Tata Power Renewable Energy Limited successfully commissioned a 450 MWp(DC)/300MW(AC) DCR-compliant solar power project for NHPC at Bikaner, Rajasthan, featuring 775,000 modules and advanced bifacial technology. The project will supply clean power to Punjab State Power Corporation Limited, generate 17,230 million units of green electricity over its lifetime, and is expected to offset 13,826,400 tons of CO2 annually while providing employment to over 300 local workers.",
            "Sentiment": "positive",
            "PublishDate": 1763382688158,
            "Source": "stock"
        },
        {
            "Title": "Tata Power Reports 14% PAT Growth for 24th Consecutive Quarter Despite Mundra Plant Challenges",
            "Summary": "Tata Power achieved 14% profit growth in quarterly results with strong performance from Odisha Discoms (Rs. 174 crores PAT, 362% growth), solar manufacturing (Rs. 240 crores PAT, 262% growth), and rooftop business (Rs. 123 crores PAT, 390% growth), while crossing Rs. 4,000 crores EBITDA milestone. The company plans Rs. 25,000 crores CAPEX with 1.3 gigawatt renewable capacity addition expected in H2, and announced investment in 1,125-megawatt Bhutan hydro project alongside evaluating 10-gigawatt ingot-wafer manufacturing plant.",
            "Sentiment": "positive",
            "PublishDate": 1763291768446,
            "Source": "earnings"
        },
        {
            "Title": "Tata Power Plans Rs 25,000 Crore Capex With 2-2.5 GW Annual Renewable Capacity Addition",
            "Summary": "Tata Power plans to invest Rs 25,000 crore in capital expenditure this year, having already invested Rs 7,349 crore. The company aims to increase renewable capacity by 2-2.5 gigawatts annually while maintaining a net debt to EBITDA ratio of about 4x to preserve its AA rating. The company targets adding 700 MW in Q3 and 600 MW in Q4, aiming for nearly 7 GW of operational renewable assets by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1762918716408,
            "Source": "stock"
        },
        {
            "Title": "Tata Power Reports Q2FY26 Consolidated Net Profit of ₹1,245 Crore, Faces USD 490 Million Arbitration Award",
            "Summary": "Tata Power Company Limited reported consolidated net profit of ₹1,245.39 crore for the quarter ended September 30, 2025, compared to ₹1,093.08 crore in the same period last year. Revenue from operations stood at ₹15,548.91 crore versus ₹15,697.67 crore in Q2FY25. The company temporarily suspended operations at Mundra Power Plant from July 3, 2025, for overhauling activities. Tata Power received an unfavorable arbitration award directing payment of USD 490.32 million plus costs to Kleros Capital Partners Limited. The company has filed an appeal with Singapore International Commercial Court to set aside the award and has not recorded any provision in financial results. Delhi Electricity Regulatory Commission substantially completed prudence review for subsidiary TPDDL, leading to recognition of regulatory assets of ₹267 crore. The company granted 50,73,760 employee stock options at ₹395.85 per option and invested additional ₹60 crore in Khorlochhu Hydro Power Limited for Bhutan projects.",
            "Sentiment": "neutral",
            "PublishDate": 1762878741216,
            "Source": "earnings"
        }
    ]
}