{
    "Symbol": "TATACONSUM",
    "ISIN": "INE192A01025",
    "News": [
        {
            "Title": "Tata Consumer Targets Growth Across Tea & New Sectors",
            "Summary": "Tata Consumer aims for mid to high single-digit growth in India tea business with 4-5% volume growth, while growth sectors expected to increase 30% and reshape business mix.",
            "Sentiment": "positive",
            "PublishDate": 1769571439859,
            "Source": "stocks"
        },
        {
            "Title": "Tata Consumer Explores Property Sale via Subsidiary",
            "Summary": "Tata Consumer Products board considers potential sale of property held by subsidiary TRIL Constructions Limited, including stake divestment. No binding agreement finalized yet.",
            "Sentiment": "neutral",
            "PublishDate": 1769501143689,
            "Source": "stocks"
        },
        {
            "Title": "Tata Consumer Q3FY26 Revenue Grows 15% to ₹5,112 Cr",
            "Summary": "Tata Consumer Products reports 15% revenue growth to ₹5,112 crores in Q3FY26, with consolidated net profit rising 36% to ₹385 crores driven by strong performance across India and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1769500693611,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Consumer Gets ESG Ratings for FY24-25",
            "Summary": "Tata Consumer Products receives ESG ratings of 62/100 for FY2024-25 and 63/100 for FY2023-24 from NSE Sustainability Ratings & Analytics Limited, disclosed under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769059237400,
            "Source": "stocks"
        },
        {
            "Title": "Tata Consumer Board Meet Set for January 27, 2026",
            "Summary": "Tata Consumer Products Limited has scheduled a board meeting on January 27, 2026, to consider Q3FY26 financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768925208291,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Consumer Gets ₹269 Cr Tax Demand for FY19",
            "Summary": "Tata Consumer Products receives income tax demand of ₹269.29 crores for FY 2018-19, primarily due to non-grant of tax credits. Company files rectification request, expects demand deletion.",
            "Sentiment": "negative",
            "PublishDate": 1767693657192,
            "Source": "stocks"
        },
        {
            "Title": "Tata Consumer Products: ₹19.19 Cr Block Trade",
            "Summary": "Tata Consumer Products witnessed a significant block trade on NSE involving 162,016 shares worth ₹19.19 crores at ₹1,184.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767165061033,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Consumer Allots 1,736 Shares Under ESOP Scheme",
            "Summary": "Tata Consumer Products Limited allotted 1,736 equity shares under its ESOP scheme on December 22, 2025, increasing paid-up share capital to ₹98.95 crores from ₹98.95 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766396248698,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Consumer Plans Aggressive Product Expansion with 100 New Launches in FY26",
            "Summary": "Tata Consumer Products has announced plans to introduce almost 100 new products during FY26, with nearly 50 products scheduled for launch between October and March. The aggressive expansion strategy indicates the company's focus on diversifying its product portfolio and accelerating growth in the consumer goods segment.",
            "Sentiment": "positive",
            "PublishDate": 1763713459618,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Revises Starbucks Store Expansion Strategy as 1000-Store Target Falls Short",
            "Summary": "Tata Consumer plans to update its store expansion strategy for Tata Starbucks after the company's MD acknowledged that the previously set goal of 1000 stores will not be achieved. The strategic revision affects Tata Consumer's retail expansion plans and indicates a reassessment of growth targets for the Starbucks partnership in the market.",
            "Sentiment": "negative",
            "PublishDate": 1763712895872,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Relocates Registered Office Within Kolkata",
            "Summary": "Tata Consumer Products Limited announced it will shift its registered office within Kolkata city limits effective January 1, 2026. The new registered office will be located at Tata Centre, 1st Floor, 43, Jawaharlal Nehru Road, Kolkata-700071. All future communications and documents should be addressed to the company at its new address or to its Registrar and Transfer Agent, MUFG Intime India Private Limited in Mumbai. The company has updated its contact information and made this information available on its website.",
            "Sentiment": "neutral",
            "PublishDate": 1762799227317,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Consumer Sets Growth Targets Across Portfolio and Tea Business",
            "Summary": "Tata Consumer has outlined growth expectations for its business segments. The company expects 30% portfolio growth and aims for mid-single-digit volume growth in its tea business, with total revenue growth projected in the mid-to-high single digits. The company targets a 15% EBITDA margin by Q4, though the U.S. coffee business presents potential risks. Tea margins are expected to fall within a 34-36% gross range.",
            "Sentiment": "positive",
            "PublishDate": 1762226323456,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Reports Senior Management Changes and Strong Q2 Performance",
            "Summary": "Tata Consumer Products announced multiple senior management changes effective November and December 2025. Puneet Das resigned as President Packaged Beverages-India South Asia to pursue new opportunities, with Sharat Verma appointed as his replacement from December 1, 2025. Prashant Parameswaran resigned as President Soulfull Business for personal reasons, effective December 15, 2025. The company also reported strong quarterly results for the period ended September 30, 2025, with consolidated revenue growing 18% to Rs 4,966 crores and Group Net Profit increasing 11% to Rs 407 crores. India core business recorded its second consecutive quarter of double-digit growth in both tea and salt segments, while growth businesses expanded 27%. The company launched 25 new products during the quarter and continued expansion with Tata Starbucks adding 7 new stores.",
            "Sentiment": "positive",
            "PublishDate": 1762194130098,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Consumer Reports GST Rate Cut Transition Disrupted Sales of Three Key Brands",
            "Summary": "Tata Consumer Products managing director Sunil D'Souza reported that three brands - Capital Foods, Organic India and Tata Soulfull - experienced sales impact during the GST rate cut transition phase, with business disruption exceeding expectations. The company had been achieving decent double digit growth before the GST transition. New GST rates were implemented from September 22 following the August 15 announcement. Capital Foods sales were particularly affected in modern trade during September, while the ready-to-drink business remained unimpacted due to its impulse consumption nature. Capital Foods reported quarterly revenues of Rs 223 crore compared to Rs 206 crore a year back, while Organic India posted Rs 133 crore versus Rs 102 crore previously. The company announced standalone net profit grew 28% year-on-year to Rs 285 crore for the quarter ending September 30, with revenue from operations increasing 18% to Rs 3,595 crore. International business revenue grew 9% in constant currency terms, and Starbucks joint venture achieved 8% revenue growth with 492 stores across 80 cities.",
            "Sentiment": "neutral",
            "PublishDate": 1762189004297,
            "Source": "earnings"
        },
        {
            "Title": "P. B. Balaji Steps Down as Non-Executive Non-Independent Director at Tata Consumer",
            "Summary": "P. B. Balaji has stepped down from his position as Non-Executive Non-Independent Director at Tata Consumer Products.",
            "Sentiment": "neutral",
            "PublishDate": 1762177345604,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Consumer Products Reports Strong Growth Across All Business Segments, Exceeding Estimates",
            "Summary": "Tata Consumer Products delivered robust performance across its business segments. The Foods business recorded 19% growth, surpassing estimates of 12-14%. The International business grew 9%, driven by strong coffee sales in the USA, beating projections of 6-8%. The Beverages business achieved 12% revenue growth, also exceeding estimates of 6-8%.",
            "Sentiment": "positive",
            "PublishDate": 1762155484481,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Reports Higher Q2 Net Profit and Revenue Growth",
            "Summary": "Tata Consumer Products reported Q2 consolidated net profit of 4.04 billion rupees, up from 3.67 billion rupees in the same period last year. Revenue increased to 49.6 billion rupees from 42.14 billion rupees year-over-year. EBITDA rose to 6.72 billion rupees from 6.26 billion rupees, though EBITDA margin declined to 13.53% from 14.86% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762154330823,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Products: Multiple Corporate Actions and Regulatory Updates",
            "Summary": "Tata Consumer Products Limited has undertaken several corporate actions and regulatory updates. CARE Ratings reaffirmed the company's short-term instruments rating at CARE A1+ for Rs. 1,500 crores while withdrawing ratings for Rs. 3,500 crores worth of commercial papers. The company faced a Rs. 57,479 penalty for moving goods under an expired e-waybill. Key personnel changes included the resignation of Company Secretary Neelabja Chakrabarty and the re-appointment of independent directors Bharat Puri and Shikha Sharma for second five-year terms. The company allotted 4,450 equity shares under its employee stock option scheme, increasing paid-up capital to Rs. 98.94 crores. A rights issue of Rs. 2,997.77 crores was completed with proceeds used for repaying commercial papers and general corporate purposes. CRISIL assigned an ESG rating of 61 (Strong category) to the company based on FY 2024-25 public data.",
            "Sentiment": "neutral",
            "PublishDate": 1761658331774,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Shareholders Approve Rs 1,650 Crore Related Party Transactions with Capital Foods",
            "Summary": "Tata Consumer Products Limited shareholders approved an ordinary resolution for material related party transactions with Capital Foods Private Limited, a subsidiary, worth up to Rs 1,650 crores for FY 2025-26. The postal ballot voting concluded on October 23, 2025, with 99.9884% votes in favor and only 0.0116% against. The transactions include purchase of goods, intercorporate deposits/loans, contract manufacturing services, and reimbursement of expenses. Out of 9,00,381 total shareholders as of September 5, 2025, 4,575 members participated in the remote e-voting process. The promoter and promoter group abstained from voting as they were interested parties in the resolution.",
            "Sentiment": "positive",
            "PublishDate": 1761646276300,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Consumer Products Allots 2,576 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Tata Consumer Products Limited's Allotment Committee approved the allotment of 2,576 fully paid equity shares of face value Re. 1 each against the exercise of ESOPs under the TCPL-Share Based Long Term Incentive Scheme 2021. The company's paid-up equity share capital increased from Rs. 98,95,41,732 divided into 98,95,41,732 equity shares to Rs. 98,95,44,308 divided into 98,95,44,308 equity shares. The newly allotted equity shares will rank pari passu with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761567723012,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Increases Stake in Tata Consumer Products to 8.645% Through Market Purchases",
            "Summary": "Life Insurance Corporation of India has increased its shareholding in Tata Consumer Products Ltd to 8.645% from 6.633% through market purchases. LIC acquired 19,908,118 shares representing 2.012% of the company's total share capital. The acquisition period spanned from July 11, 2023 to October 23, 2025. Following this transaction, LIC's total holding stands at 85,544,526 shares. The company's total equity share capital remains unchanged at 98,95,41,732 shares. LIC disclosed this information under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761319709680,
            "Source": "corporate_action"
        },
        {
            "Title": "BigBasket Completes Dark Patterns Audit, Submits Compliance Declaration to Consumer Affairs Ministry",
            "Summary": "Tata Consumer Products shares traded at ₹1,135.50, down ₹6.60 or 0.58% on NSE Tuesday morning. BigBasket announced completion of a self-audit of its quick commerce platform for dark patterns and submitted compliance declaration to the Ministry of Consumer Affairs. The audit follows Central Consumer Protection Authority directives requiring e-commerce companies to conduct regular audits under guidelines issued in 2023 and 2025. The TATA Enterprise-owned platform conducted the audit to ensure operations align with regulations preventing misleading digital practices that compromise consumer choice. Dark patterns are deceptive design elements that trick users into unintended actions. BigBasket serves over 10 million customers across 60-plus cities through 700-plus dark stores, offering 10-minute delivery on more than 20,000 products including groceries, fresh produce, medicines, fashion, electronics, and beauty items.",
            "Sentiment": "neutral",
            "PublishDate": 1759814261011,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Signs ₹2000 Crore Investment Agreement With Food Processing Ministry",
            "Summary": "Tata Consumer Products has signed an agreement with the Food Processing Ministry to invest up to ₹2000 crores over a 5-year period. The investment is subject to pending financial assessments.",
            "Sentiment": "positive",
            "PublishDate": 1758879004501,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Seeks Shareholder Approval for ₹1,650 Crore Related Party Transactions with Capital Foods",
            "Summary": "Tata Consumer Products Limited has issued a postal ballot notice seeking shareholder approval for material related party transactions with its subsidiary Capital Foods Private Limited, valued up to ₹1,650 crores for FY 2025-26. The transactions include purchase of goods (₹1,300 crores), inter-corporate deposits/loans (₹350 crores), contract manufacturing services, and reimbursement of expenses. TCPL holds 75% equity in Capital Foods, which manufactures packaged food and condiments under brands like 'Ching's Secret' and 'Smith & Jones'. The Audit Committee has approved these transactions as arm's length and in ordinary course of business. Remote e-voting will be conducted from September 24 to October 23, 2025, with results to be announced by October 27, 2025. The transactions represent 9.37% of TCPL's annual consolidated turnover and 221.66% of Capital Foods' standalone annual turnover for FY 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758541675837,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Consumers Partners with Girijan Cooperative to Expand Araku Coffee Distribution to Starbucks",
            "Summary": "Tata Consumers signed a Memorandum of Understanding with Girijan Cooperative Corporation to expand the organic Araku Coffee brand to wider domestic and global markets. The tribal-produced coffee from Andhra Pradesh's Araku Valley will be served at Starbucks coffee chains. The agreement was part of 21 MoUs signed during World Tribal Day to develop tribal communities and improve livelihoods. Mission for Elimination of Poverty in Municipal Areas will establish Araku Coffee kiosks across the state. Additional partnerships include ITC committing to add 1,600 hectares to its existing 4,010 hectares of coffee plantations in Paderu, and Subko working with tribal farmers in Chintapalli for red cherry processing. The Coffee Board signed agreements to expand coffee cultivation in tribal areas, while other MoUs covered tourism development, turmeric cultivation, and marketing support for tribal products.",
            "Sentiment": "positive",
            "PublishDate": 1754758767676,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Consumer Products Expects Margin Recovery After Missing Q1 Earnings Estimates",
            "Summary": "Tata Consumer Products reported quarterly results that missed analyst expectations, with net profit rising 15% to Rs 334 crore against estimates of Rs 355 crore. Revenue increased 9.8% to Rs 4,779 crore, while margins compressed to 12.7% from 15.3% in the previous year, falling short of the 13.4% estimate. The margin pressure was attributed to volatile tea and coffee prices, with the company only able to pass on 70% of tea price inflation to consumers following three droughts that drove up costs. Managing Director Sunil D'Souza expressed confidence that margins will recover as tea crop conditions normalize and coffee prices stabilize, with forecasts pointing to normal crop conditions ahead. Company shares declined 0.6% following the results.",
            "Sentiment": "neutral",
            "PublishDate": 1753498873414,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Products Maintains UK Tea Market Position, Plans Growth Investments",
            "Summary": "Tata Consumer Products maintains a 20% market share in the UK tea business and is approaching double-digit share in fruit and herbal teas. The company expects 6-8% total growth in its tea business with mid-single digit volume increases. Management plans to increase advertising and promotion spending from 6.8-6.9% to 7.5% of sales. The company anticipates over 30% growth from Q2/Q3 for expanding businesses including NourishCo.",
            "Sentiment": "positive",
            "PublishDate": 1753328579645,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Expects Tea Business Margin Recovery by December Quarter",
            "Summary": "Tata Consumer Products expects its branded tea margins to recover by the December quarter due to lower auction prices and improved cost pass-through. In the June quarter, the company's branded tea business revenue grew 12%, but margins declined by 10 percentage points as only 70% of cost inflation was passed to consumers. CEO Sunil D'Souza indicated one more quarter of margin pressure before returning to historical margins of 34-37%. Tea auction prices are currently 13% lower year-on-year, and the company expects price increases in mid to high single digits this year compared to 30% last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753289636861,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Targets FMCG Growth Through Premium Products and Channel Expansion",
            "Summary": "Tata Consumer is pursuing broad-based FMCG growth through multiple strategic initiatives including premiumisation of products, omnichannel expansion, and innovation-led product launches. The company is focusing on scaling high-growth verticals such as Sampann, ready-to-drink beverages, Organic India, and international coffee operations to drive overall business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1753281849989,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Reports Double-Digit Growth in India with Strong Performance Across Tea, Salt, and Coffee Segments",
            "Summary": "Tata Consumer Products achieved double-digit growth in India, primarily driven by strong sales performance in tea and salt segments along with volume gains. The company's coffee business showed particularly robust performance with 67% revenue growth during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753276259437,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Reports Strong Q1 Growth Despite Weather Impact on Ready-To-Drink Sales",
            "Summary": "Tata Consumer reported Q1 consolidated net profit of 3.34 billion rupees compared to 2.9 billion rupees in the same period last year. Revenue increased to 47.78 billion rupees from 43.52 billion rupees year-over-year. The company noted that weather issues affected ready-to-drink sales growth during the quarter. Tea prices are performing well, though the company maintains a cautiously positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1753272650979,
            "Source": "stock"
        },
        {
            "Title": "Tata Consumer Products Reports Strong Q1 Results with 10% Revenue Growth and 286% Jump in Net Profit",
            "Summary": "Tata Consumer Products announced its quarterly results for the quarter ended June 30, 2025. Revenue from operations increased 10% to Rs 3,529 crores compared to the same quarter previous year, driven by growth in both branded and non-branded business. Net profit after tax surged significantly to Rs 714 crores from Rs 185 crores in the corresponding quarter of the previous year. The strong profit growth was primarily attributed to dividend income of Rs 464 crores received from overseas subsidiaries, which was included in other income of Rs 478 crores. On a consolidated basis, revenue grew 10% to Rs 4,779 crores with group consolidated net profit rising 15% to Rs 332 crores. The company noted that operating performance of branded business was impacted by tea cost inflation. The results were approved by the Board of Directors on July 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753271969343,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Products Announces Q1FY26 Results Date and Earnings Call Schedule",
            "Summary": "Tata Consumer Products has scheduled a Board of Directors meeting on July 23 to approve Q1FY26 financial results for the quarter ended June 2025. The company will host an earnings call at 6:30 p.m. on the same day. The trading window for designated persons has been closed since June 24 until 48 hours after results declaration. In Q4FY25, the company reported a 52% increase in consolidated net profit to Rs 407.07 crore and total income growth of 17.64% to Rs 4,664.73 crore. Tata Consumer Products shares have gained 0.48% over the past five trading sessions and are up 17.65% year-to-date, though down 10.13% over the past year. The stock was trading 0.70% lower at Rs 1,082.70 on Tuesday morning.",
            "Sentiment": "neutral",
            "PublishDate": 1753161424130,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Products: Urban Convenience Driving Next-Gen Brand Growth",
            "Summary": "Tata Consumer Products Ltd. reports rising urban demand for convenience products like snacks, cooking aids, and ready-to-drink beverages. The company's ready-to-drink portfolio has recovered from competitive pressure. Recent acquisitions of Capital Foods and Organic India have expanded their product range. TCPL is focusing on premiumization, health-conscious offerings, and digital marketing strategies. The company launched over 150 products in the last five years, with innovation contributing 5.2% to sales in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1750265698000,
            "Source": "normal_news"
        },
        {
            "Title": "Tata Consumer Products: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "May 27 is the last day to buy Tata Consumer Products shares to qualify for the Rs 8.25 per share dividend for FY2025. The record date is set for May 29, with payment scheduled from June 21. The company's Q4 FY2025 results showed a 17% revenue increase to Rs 4,608 crore and a 59% surge in net profit to Rs 345 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748411599000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Starbucks: Loss Widens to Rs 135.7 Crore in FY25, Revenue Up 5%",
            "Summary": "Tata Starbucks reported a loss of Rs 135.7 crore in FY25, up from Rs 82.16 crore in FY24. Revenue increased by 5% to Rs 1,277 crore. The company opened 58 new stores, reaching 479 stores across 80 cities. Tata Starbucks aims for 1,000 outlets by FY28 despite current demand softness in the QSR space.",
            "Sentiment": "neutral",
            "PublishDate": 1748255164000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Maintains EBITDA Margin Guidance and Projects Double-Digit Revenue Growth",
            "Summary": "Tata Consumer has reaffirmed its guidance for an EBITDA margin improvement of 50-80 basis points. The company also expects to achieve double-digit revenue growth in the fiscal year 2026 (FY26).",
            "Sentiment": "positive",
            "PublishDate": 1745471642000,
            "Source": "default"
        },
        {
            "Title": "Tata Consumer Products: Q4 Results Trigger Stock Decline",
            "Summary": "Tata Consumer Products shares fell up to 5% following Q4 results. Sales increased 17.3% YoY to ₹4,608 crore, but EBITDA margin narrowed 250 bps to 13.5%. Analysts have mixed views, with price targets ranging from ₹1,033 to ₹1,360. Margin recovery expected in H2FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1745470246000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Products Maintains Growth Guidance for Sampann and Core Products",
            "Summary": "Tata Consumer Products has reaffirmed its growth guidance for its Sampann brand, aiming for aggressive top-line growth while maintaining decent margins. The company also maintains its forecast for tea and salt products, expecting mid-single-digit volume growth and a slight increase in pricing for both in the short to medium term.",
            "Sentiment": "positive",
            "PublishDate": 1745465482000,
            "Source": "default"
        },
        {
            "Title": "Tata Consumer Products: Q4 Profit Soars 59%, Beats Estimates",
            "Summary": "Tata Consumer Products reported a 59% YoY increase in Q4FY25 consolidated net profit to Rs 345 crore, surpassing Street expectations. Revenue rose 17% YoY to Rs 4,608 crore. The board recommended a dividend of Rs 8.25 per equity share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1745464810000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Products: Tea Volume Growth Expected by Q2 as Input Costs Ease",
            "Summary": "Tata Consumer Products anticipates tea volume growth by Q2 and margin expansion due to softening input costs. Tea prices in North India fell 30% in Q4. The company expects margins to normalize to 15-16% by end of Q2 or early Q3. Tea volumes rose 2% in Q4, while revenue increased 9%. The company aims for 30% top-line growth despite recent market share loss.",
            "Sentiment": "positive",
            "PublishDate": 1745457048000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Consumer Products Reports Strong Q4 Results",
            "Summary": "Tata Consumer Products announced its Q4 financial results, with consolidated net profit rising to 3.45 billion rupees, up from 2.17 billion rupees year-over-year, exceeding estimates of 3.05 billion rupees. Revenue increased to 46.1 billion rupees from 39.27 billion rupees in the previous year. The company recommended a dividend of 8.25 rupees per equity share and reported an exceptional item of 453.2 million rupees. However, Q4 profit before tax (PBT) slightly decreased to 4.84 billion rupees from 5.09 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745453518000,
            "Source": "default"
        },
        {
            "Title": "Tata Consumer Products Ltd: Trump Tariffs May Boost US Coffee Business",
            "Summary": "CEO Sunil D'Souza suggests Trump's tariffs could give Tata Consumer Products an advantage in the US coffee market due to onshore manufacturing. The company plans a price hike in June for its US coffee business to improve margins. US tea business grew 15% in Q4, while coffee grew 3%. Overall US revenue increased 2% in FY2025, with EBIT up 11%.",
            "Sentiment": "positive",
            "PublishDate": 1745433445000,
            "Source": "normal_news"
        },
        {
            "Title": "Tata Consumer Products Reports Decline in EBITDA Due to Input Cost Pressure",
            "Summary": "Tata Consumer Products has reported a decline in consolidated EBITDA due to input cost pressure in tea and coffee. The company expects margins to normalize and volumes to recover if tea inflation decreases and prices are maintained.",
            "Sentiment": "neutral",
            "PublishDate": 1745424741000,
            "Source": "default"
        },
        {
            "Title": "Tata Consumer Products' Growth Businesses Fall Short of Target",
            "Summary": "Tata Consumer Products reported that its growth businesses account for 28% of its total India business, slightly below the company's target of 30%. This indicates that while the company's growth initiatives are significant, they have not quite reached the desired level of contribution to the overall business in India.",
            "Sentiment": "neutral",
            "PublishDate": 1745423841000,
            "Source": "default"
        },
        {
            "Title": "Tata Consumer Products: US Tariffs May Boost Coffee Advantage",
            "Summary": "Tata Consumer Products expects proposed US tariffs to give it a competitive advantage in coffee, as the US imports all coffee. The company's salt and supplements brands imported from India may face pressure. The impact will depend on final tariff rates. Tata Consumer derives 29% of revenue from international markets.",
            "Sentiment": "positive",
            "PublishDate": 1745422225000,
            "Source": "normal_news"
        },
        {
            "Title": "Tata Consumer Products Reports Strong Growth in International and India Beverages Segments",
            "Summary": "Tata Consumer Products announced robust performance in its international and India beverages segments. The international business grew by 5% (2% in constant currency) for the quarter and 7% (5% in constant currency) for FY25. The India beverages segment showed impressive growth of 17% (+9% organic) for the quarter, contributing to a 10% (+3% organic) growth for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1745409233000,
            "Source": "default"
        },
        {
            "Title": "Tata Consumer Products Reports 5.9% Volume Growth in India",
            "Summary": "Tata Consumer Products announced that its underlying volume growth (UVG) for the India branded business, excluding acquisitions, was 5.9% for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745408918000,
            "Source": "default"
        },
        {
            "Title": "Tata Consumer Products: Rs 8.25 Per Share Dividend Announced",
            "Summary": "Tata Consumer Products Ltd. has proposed a dividend of Rs 8.25 per share for the financial year 2024-25, to be paid on or after June 21, 2025, subject to shareholder approval at the annual general meeting.",
            "Sentiment": "positive",
            "PublishDate": 1745405711000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Consumer Products: Q4 Profit Surges 59%, Dividend Declared",
            "Summary": "Tata Consumer Products reported a 59% YoY increase in Q4 consolidated net profit to ₹345 crore. The company also declared a dividend.",
            "Sentiment": "positive",
            "PublishDate": 1745404828000,
            "Source": "result"
        }
    ]
}