{
    "Symbol": "TATACHEM",
    "ISIN": "INE092A01019",
    "News": [
        {
            "Title": "Fitch Affirms Tata Chemicals BB+ Credit Rating",
            "Summary": "Fitch Ratings has affirmed Tata Chemicals Limited's Long Term Foreign Currency Issuer Default Rating at BB+ with a stable outlook following an update of its Corporate Rating Criteria on February 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770379155984,
            "Source": "stocks"
        },
        {
            "Title": "Tata Chemicals UK Operations to Break-Even by Q4 FY26",
            "Summary": "Tata Chemicals expects UK operations to nearly break-even by Q4 FY26 despite six-month delay, while Kenya's 50 KT electric calciner soda ash plant targets full stabilization by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770089027194,
            "Source": "stocks"
        },
        {
            "Title": "Tata Chemicals Sees Slow Soda Ash Demand Growth",
            "Summary": "Tata Chemicals expects medium-term soda ash demand growth driven by solar glass expansion, but warns of short-term supply-demand imbalances creating pricing pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1770088994359,
            "Source": "stocks"
        },
        {
            "Title": "Tata Chemicals Approves ₹5.15 Billion Salt Facility",
            "Summary": "Tata Chemicals has approved a significant ₹5.15 billion investment for establishing a new greenfield manufacturing facility dedicated to iodised vacuum salt production.",
            "Sentiment": "positive",
            "PublishDate": 1770034870061,
            "Source": "stocks"
        },
        {
            "Title": "Tata Chemicals Q3 Loss Widens to ₹690M",
            "Summary": "Tata Chemicals reports consolidated net loss of ₹690 million in Q3 compared to ₹210 million loss in previous year, while revenue declined to ₹35.5 billion from ₹35.9 billion year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770031312506,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Chemicals Q3 FY26 Earnings Call on Feb 2",
            "Summary": "Tata Chemicals Limited announces analysts and investors call scheduled for February 2, 2026 at 7:00 PM IST to discuss Q3 and 9M FY26 financial results under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769000718507,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Chemicals announces senior management changes",
            "Summary": "Tata Chemicals Limited announces key senior management personnel changes effective February 1, 2026, including new appointments for Chief Commercial Officer and other leadership positions.",
            "Sentiment": "neutral",
            "PublishDate": 1768367962838,
            "Source": "stocks"
        },
        {
            "Title": "Tata Chemicals Acquires Novabay for EUR 25 Million",
            "Summary": "Tata Chemicals International signs agreement to acquire 100% stake in Singapore-based premium sodium bicarbonate manufacturer Novabay Pte. Limited for EUR 25 million to strengthen specialty chemicals portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1766143311246,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Chemicals Finalises ₹1,500 Cr NCD Terms",
            "Summary": "Tata Chemicals' Internal Committee finalises terms for ₹1,500 crore NCD issue on private placement basis with deemed allotment date of December 17, 2025 and 3-year tenure.",
            "Sentiment": "positive",
            "PublishDate": 1765382113089,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Chemicals Receives Credit Rating Assignment and Re-affirmation from Crisil",
            "Summary": "Crisil Ratings Limited assigned a CrisilAA-/Stable rating to Tata Chemicals' Rs 1,200 crore Non-Convertible Debentures and re-affirmed existing ratings on other NCDs and Commercial Paper with CrisilA1+ rating. The rating actions affect the company's debt instruments and provide updated credit assessment for investors and stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1764998509730,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals Announces Major Capacity Expansion with 9.1 Billion Rupees Investment",
            "Summary": "Tata Chemicals plans to invest 1.35 billion rupees in soda ash expansion and 7.75 billion rupees in silica expansion, totaling 9.1 billion rupees in capital expenditure. The investments signal the company's strategy to expand manufacturing capacity across two key chemical product lines.",
            "Sentiment": "positive",
            "PublishDate": 1763942805538,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals Announces 9.1 Billion Rupee Capital Investment in Manufacturing Expansion",
            "Summary": "Tata Chemicals plans to invest 1.35 billion rupees in soda ash expansion and 7.75 billion rupees in silica expansion projects. The combined 9.1 billion rupee investment represents a significant capacity expansion initiative across the company's key manufacturing segments.",
            "Sentiment": "positive",
            "PublishDate": 1763732379310,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Chemicals US Subsidiary Fined $20,400 by Wyoming Department",
            "Summary": "Tata Chemicals' US subsidiary has been fined $20,400 by the Wyoming Department.",
            "Sentiment": "negative",
            "PublishDate": 1762868345838,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals Reports Mixed Q2 Results, Approves ₹1,500 Crore Fund Raising",
            "Summary": "Tata Chemicals approved unaudited consolidated and audited standalone financial results for the second quarter and half year ended September 30, 2025. The Board approved raising funds up to ₹1,500 crores through Non-Convertible Debentures on private placement basis and authorized an internal committee to finalize terms of issuance and allotment. Consolidated revenue from operations was ₹3,877 crores for Q2 2025 compared to ₹3,999 crores in Q2 2024. Consolidated profit for Q2 2025 was ₹154 crores versus ₹267 crores in Q2 2024. The company recorded additional expenses of ₹65 crores related to closure of Lostock operations in the UK. Standalone revenue was ₹1,204 crores in Q2 2025 against ₹1,009 crores in Q2 2024, with profit of ₹178 crores compared to ₹99 crores in the previous year quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761998246761,
            "Source": "earnings"
        },
        {
            "Title": "ICICI Prudential Mutual Fund Crosses 5% Stake in Tata Chemicals",
            "Summary": "ICICI Prudential Mutual Fund acquired 1,46,782 shares of Tata Chemicals on October 29, 2025, through secondary market purchases. This acquisition increased the fund's holding from 4.95% to 5.01% of the company's paid-up capital, crossing the 5% threshold that triggers disclosure requirements. The fund's total shareholding now stands at 1,27,53,028 shares. The acquisition was made for investment purposes and not with the objective of seeking controlling interest in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761889399669,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals Subsidiary Wins Court Appeal Against ₹783 Crore Land Revenue Demand in Kenya",
            "Summary": "The Court of Appeal in Nairobi ruled in favor of Tata Chemicals Magadi Ltd (TCML), a subsidiary of Tata Chemicals Limited, in a litigation case against the County Government of Kajiado, Kenya. The court declared the County Government's demand for ₹783 crore (Kenyan Shillings 11.84 billion) in land rates as arbitrary and illegal. The court ordered that TCML is not obligated to pay the land revenue arrears due to the absence of an open and accountable framework for determining land rates. The disputed amount is currently recorded as contingent liabilities in the company's books. Management will decide on the contingent liabilities based on this judgment after taking appropriate legal advice.",
            "Sentiment": "positive",
            "PublishDate": 1761568973525,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals Schedules Q2 & H1 FY26 Earnings Call for November 3, 2025",
            "Summary": "Tata Chemicals Limited will hold an analysts' and investors' conference call on November 3, 2025, at 4:30 PM IST to discuss the company's Q2 and H1 FY26 financial performance. The call will be led by R Mukundan, Managing Director & CEO, and Nandakumar Tirumalai, Chief Financial Officer. The session will begin with management commentary followed by a Q&A segment. The company operates in Basic Chemistry and Specialty Products globally. Multiple international dial-in numbers have been provided for participants from Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1761309142761,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Chief Human Resource Officer Rahul Pinjarkar Resigns",
            "Summary": "Tata Chemicals announced the resignation of Rahul Pinjarkar, Chief Human Resource Officer and Senior Management Personnel. Pinjarkar was relieved from his services effective August 9, 2025. In his resignation letter, Pinjarkar described his time at Tata Chemicals as a wonderful journey and expressed gratitude for the opportunities, support, and experiences gained during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1755025533470,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Chemicals Chief Human Resource Officer Rahul Pinjarkar Resigns",
            "Summary": "Tata Chemicals announced the resignation of Rahul Pinjarkar, Chief Human Resource Officer and Senior Management Personnel. Pinjarkar was relieved from his services effective August 9, 2025. In his resignation letter, Pinjarkar described his time at Tata Chemicals as a wonderful journey and expressed gratitude for the opportunities, support, and experiences gained during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1754804993269,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Chemicals Reports Q1FY26 Results with Revenue of INR 3,719 Crores, Expects INR 600 Crore Annual Improvement",
            "Summary": "Tata Chemicals reported consolidated revenue of INR 3,719 crores, EBITDA of INR 649 crores, and PAT of INR 316 crores for the first quarter ended June 30, 2025. The company's standalone revenue was INR 1,169 crores with EBITDA of INR 270 crores and PAT of INR 307 crores. India operations showed higher performance due to increased volumes and operational efficiencies, despite minor drops in soda ash and bicarbonate realizations. The U.S. business saw marginally lower export sales and prices, while U.K. operations improved after cessation of Lostock facility. Rallis achieved 22% overall growth with 9% volume growth and 13% price growth. Management expects INR 600 crore structural EBITDA improvement through U.K. asset shutdown, volume ramp-up in India and Kenya, and cost efficiency initiatives. Global soda ash markets remain oversupplied with high inventory levels, particularly in China at $1.8 billion. The company commissioned a 50-kiloton calciner in Kenya and is progressing on pharmaceutical grade salt plant in U.K. Management anticipates prices to remain range-bound for the next 6-9 months and expects to achieve breakeven at PAT level for U.K. operations by year-end.",
            "Sentiment": "neutral",
            "PublishDate": 1754036318065,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Expects Margin Recovery in Q3-Q4 Driven by Volume Growth",
            "Summary": "Tata Chemicals anticipates margin fluctuations through FY26, with Q2 expected to be softer due to monsoon season impacting construction work and detergent demand in India and Southeast Asia. MD and CEO R Mukundan stated margins should rebound in Q3 and Q4 as volumes recover. The company expects its UK pharma plant commissioned in Q1 to contribute in Q2, while additional storage capacity at Mitapur, Gujarat is expected to become operational by end of Q3. Tata Chemicals projects Rs 600 crore in benefits this year, split equally between UK operations cessation (Rs 200 crore), new capacity additions in India (Rs 200 crore), and cost reductions (Rs 200 crore). The company targets debt reduction of Rs 500-600 crore this fiscal, with Rs 1,500 crore over two years. Growth is expected mainly in India, South America, and Southeast Asia, while China shows slowdown. In Q1FY26, consolidated revenue was Rs 3,719 crore versus Rs 3,789 crore in Q1FY25, while EBITDA improved 13% to Rs 649 crore. Margins increased to 17% from 15% year-over-year, and profit after tax jumped 80% to Rs 316 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753752810947,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals Reports 68% Jump in Q1 Net Profit to 2.52 Billion Rupees",
            "Summary": "Tata Chemicals delivered strong quarterly results with consolidated net profit rising to 2.52 billion rupees from 1.5 billion rupees year-on-year, significantly exceeding analyst estimates of 1.83 billion rupees. Revenue declined slightly to 37.2 billion rupees compared to 37.89 billion rupees in the same period last year, falling short of the estimated 39.86 billion rupees. EBITDA improved to 6.5 billion rupees from 5.74 billion rupees year-on-year, surpassing estimates of 5.71 billion rupees. The company's EBITDA margin expanded to 17.45% from 15.15% in the previous year, well above the estimated 14%.",
            "Sentiment": "positive",
            "PublishDate": 1753662653907,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals and Cyient Report Quarterly Financial Results",
            "Summary": "Tata Chemicals Limited announced its unaudited consolidated and audited standalone financial results for the quarter ended June 30, 2025. The Board of Directors approved these results on July 25, 2025, and published them in newspapers including Business Standard, The Free Press Journal, and Navshakti on July 26, 2025. Separately, Cyient Limited reported its quarterly results with consolidated revenue of ₹3,719 crore for the quarter ended June 30, 2025, compared to ₹3,509 crore in the previous quarter and ₹3,789 crore in the same quarter last year. Cyient's consolidated profit from continuing operations after tax was ₹316 crore for the quarter. The company's earnings per share for continuing operations was ₹9.89. Cyient's results were approved by the Board of Directors on July 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753516008334,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Shares Audio Recording Link for Q1 FY2026 Results Analyst Call",
            "Summary": "Tata Chemicals Limited has provided an audio recording link for its analysts and investors call discussing the company's Q1 FY2026 financial results. The call was held on July 25, 2025, covering the unaudited consolidated and audited standalone financial results for the quarter ended June 30, 2025. The results were approved by the Board at its meeting on the same day. The company has made the audio recording available through a link on its website for stakeholders to access.",
            "Sentiment": "neutral",
            "PublishDate": 1753460475161,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Anticipates Growth from Green Technology Despite Margin Pressures",
            "Summary": "Tata Chemicals expects growth driven by demand for green technology products, even as the company faces current margin challenges. The company is focusing on product optimization, increasing production capacities, and pursuing sustainable expansion strategies to capitalize on emerging opportunities in the green technology sector.",
            "Sentiment": "neutral",
            "PublishDate": 1753449865503,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals Reports 68% Jump in Q1 Net Profit, Beats Estimates",
            "Summary": "Tata Chemicals reported consolidated net profit of 2.52 billion rupees in Q1, significantly higher than 1.5 billion rupees in the same period last year and above analyst estimates of 1.83 billion rupees. Revenue declined to 37.2 billion rupees from 37.89 billion rupees year-on-year, falling short of estimates of 39.86 billion rupees. EBITDA increased to 6.5 billion rupees from 5.74 billion rupees, surpassing estimates of 5.71 billion rupees. EBITDA margin improved to 17.45% from 15.15% in the previous year, well above the estimated 14%.",
            "Sentiment": "positive",
            "PublishDate": 1753445757534,
            "Source": "earnings"
        },
        {
            "Title": "NSE Removes Tata Chemicals from Futures and Options Trading",
            "Summary": "NSE announced that Tata Chemicals will be excluded from the futures and options segment starting October 1. Existing unexpired contracts for July 2025, August 2025, and September 2025 will remain available for trading until their respective expiry dates, and new strikes will continue to be introduced in these existing contract months.",
            "Sentiment": "neutral",
            "PublishDate": 1753317994455,
            "Source": "stock"
        },
        {
            "Title": "Tata Chemicals: Last Day to Buy Shares for Rs 11 Dividend",
            "Summary": "June 11 is the last day to buy Tata Chemicals shares to qualify for the Rs 11 per share final dividend for FY2025. The record date is June 12, with the total dividend payout amounting to Rs 382 crore. The company's Q4 FY2025 results showed a narrowed net loss of Rs 56 crore, missing analyst estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1749614633000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Chemicals: S Padmanabhan Appointed as New Chairman",
            "Summary": "S Padmanabhan will become the new chairperson of Tata Chemicals Ltd. on May 30, replacing N Chandrasekaran who stepped down. Padmanabhan has a long history with Tata Group companies, including roles at TCS, Tata Power, and Tata Sons.",
            "Sentiment": "neutral",
            "PublishDate": 1748485800000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Chemicals: N Chandrasekaran Steps Down, New Chairman Appointed",
            "Summary": "N Chandrasekaran will resign as director and chairman of Tata Chemicals Ltd. on May 29, 2025. S Padmanabhan will succeed him as the new chairman effective May 30.",
            "Sentiment": "neutral",
            "PublishDate": 1748433512000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Chemicals: Q4 Net Loss Narrows, Revenue Rises Marginally",
            "Summary": "Tata Chemicals reported a consolidated net loss of Rs 56 crore for Q4, down from Rs 850 crore loss last year. Revenue increased 1% YoY to Rs 3,509 crore. EBITDA declined 26% YoY to Rs 327 crore. The board recommended a dividend of Rs 11 per share and approved raising up to Rs 200 crore through loans or NCDs.",
            "Sentiment": "neutral",
            "PublishDate": 1746675304000,
            "Source": "result"
        },
        {
            "Title": "Tata Chemicals Outlines Growth Strategies and Market Outlook",
            "Summary": "Tata Chemicals aims to improve margins in the US by focusing on volume and market mix. The company expects to transition its UK operations from negative margins to profitability next year. In China, Tata Chemicals anticipates 6% growth, lower than last year, and remains positive about its medium-term outlook despite potential negative growth in the Chinese market.",
            "Sentiment": "positive",
            "PublishDate": 1746674493000,
            "Source": "default"
        },
        {
            "Title": "Tata Chemicals Reports Q4 Net Loss, Announces Dividend and Fundraising",
            "Summary": "Tata Chemicals reported a consolidated net loss of 560 million rupees in Q4, compared to a loss of 8.5 billion rupees year-over-year. Revenue increased slightly to 35.09 billion rupees from 34.75 billion rupees. The company recorded an exceptional loss of 550 million rupees. A dividend of 11 rupees per share was recommended, and the company plans to raise 2 billion rupees in funds.",
            "Sentiment": "neutral",
            "PublishDate": 1746663174000,
            "Source": "default"
        },
        {
            "Title": "Tata Chemicals Reports Q4 Results and Announces Dividend",
            "Summary": "Tata Chemicals reported its Q4 financial results, showing a decrease in EBITDA and a net loss. The company announced a dividend of 11 rupees per share and plans to raise 2 billion rupees in funds. Q4 revenue slightly increased year-over-year, while EBITDA and EBITDA margin declined. The company reported an exceptional loss item of 550 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1746619561000,
            "Source": "default"
        },
        {
            "Title": "Tata Chemicals: Q4 Loss Narrows, Misses Profit Estimates, Declares Dividend",
            "Summary": "Tata Chemicals reported a narrowed Q4 FY25 consolidated net loss of Rs 56 crore, missing analyst expectations of a profit. Revenue increased 1% to Rs 3,509 crore. The company declared a dividend of Rs 11 per share for FY 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1746618956000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Board Meeting Scheduled for Q4 Results and Fund Raising",
            "Summary": "Tata Chemicals has announced a board meeting on May 7 to consider the Q4 results. The board will also discuss potential fund raising options through term loans or debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1746021998000,
            "Source": "default"
        },
        {
            "Title": "Tata Chemicals to Consider Q4 Results on May 7",
            "Summary": "Tata Chemicals has announced that it will consider its fourth quarter (Q4) financial results on May 7. This is a routine announcement regarding the company's upcoming earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1746021241000,
            "Source": "default"
        },
        {
            "Title": "Tata Chemicals to Meet with Morgan Stanley Research",
            "Summary": "Tata Chemicals has scheduled a meeting with Morgan Stanley Research on March 19. This meeting likely involves discussions about the company's financial performance, strategy, or market outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1741879751000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fitch Affirms Tata Chemicals' Credit Rating at 'BB+' with Stable Outlook",
            "Summary": "Fitch Ratings has reaffirmed Tata Chemicals' long-term credit rating at 'BB+' with a stable outlook. This rating action suggests that Fitch maintains a positive view on Tata Chemicals' financial stability and creditworthiness. The stable outlook indicates that Fitch does not anticipate significant changes in the company's credit profile in the near term.",
            "Sentiment": "positive",
            "PublishDate": 1740634690000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Chemicals Reports Q3 Net Loss of 530 Million Rupees",
            "Summary": "Tata Chemicals has reported a consolidated net loss of 530 million rupees for the third quarter, compared to a profit of 1.58 billion rupees in the same period last year. The company's revenue decreased to 35.9 billion rupees from 37.3 billion rupees year-over-year. An exceptional item of 700 million rupees was recorded. The profit before tax (PBT) declined to 340 million rupees from 2.02 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738628045000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Reports Increase in Gross and Net Debt",
            "Summary": "Tata Chemicals disclosed in an investor presentation that as of December 31, 2024, its gross debt stood at ₹6,722 crore, an increase of ₹810 crore compared to the previous year. The company's net debt also rose by ₹952 crore to ₹5,329 crore. These increases are attributed to lower EBITDA and higher working capital requirements in the US, Kenya, and India operations.",
            "Sentiment": "negative",
            "PublishDate": 1738592895000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Reports Significant Drop in Q3 Profit",
            "Summary": "Tata Chemicals has reported a substantial decrease in its third-quarter profit before tax (PBT). The company's Q3 PBT stood at 340 million rupees, compared to 2.02 billion rupees in the same period last year, marking a significant year-over-year decline. Additionally, the company has reported an exceptional item of 700 million rupees, which likely impacted the overall financial results.",
            "Sentiment": "negative",
            "PublishDate": 1738588343000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Tata Chemicals has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 fell to 4.34 billion rupees from 5.42 billion rupees in the same period last year. Additionally, the EBITDA margin decreased to 12.09% from 14.53% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738588336000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals Reports Q3 Net Loss of 530 Million Rupees",
            "Summary": "Tata Chemicals has reported a consolidated net loss of 530 million rupees for the third quarter, compared to a profit of 1.58 billion rupees in the same period last year. The company's revenue also decreased to 35.9 billion rupees from 37.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738588329000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Chemicals to Consider Q3 Results on February 3",
            "Summary": "Tata Chemicals has announced that it will consider its third quarter (Q3) financial results on February 3. This indicates that the company is preparing to disclose its performance for the latest fiscal quarter to investors and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737989342000,
            "Source": "earnings"
        },
        {
            "Title": "Government Imposes Minimum Import Price on Soda Ash",
            "Summary": "The Indian government has implemented a minimum import price on soda ash, according to a government source. This measure is likely to affect Tata Chemicals, a major player in the soda ash industry.",
            "Sentiment": "neutral",
            "PublishDate": 1735629990000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Chemicals: Optimistic Growth Outlook for India and US Markets",
            "Summary": "Tata Chemicals is bullish on India and US markets, planning to add 1 million tonnes of soda ash capacity across India, Kenya, and US. The company sees growth driven by sustainability trends, particularly in solar energy. However, they face margin compression due to global market conditions, especially issues in China and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1734505622000,
            "Source": "normal_news"
        },
        {
            "Title": "Tata Chemicals: Share Price Rebounds Following RBI's RTI Response",
            "Summary": "Tata Chemicals share price increased by 2.5% to ₹1,134.00 on BSE after RBI responded to Tata Sons' application for IPO exemption.",
            "Sentiment": "positive",
            "PublishDate": 1733809564000,
            "Source": "normal_news"
        },
        {
            "Title": "Tata Chemicals Unit Approves £60m Investment for New UK Plant",
            "Summary": "A unit of Tata Chemicals has approved a capital investment of £60 million (approximately 6.55 billion rupees) to construct a new plant in the UK. Additionally, the company has decided to cease chemical production at its Lostock plant by the end of January 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1731455616000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Chemicals: Q2 Results Show Sequential Recovery",
            "Summary": "Tata Chemicals' Q2 results indicate a sequential recovery, potentially improving prospects for the second half of the fiscal year, according to a report by Motilal Oswal.",
            "Sentiment": "positive",
            "PublishDate": 1729226406000,
            "Source": "result"
        }
    ]
}