{
    "Symbol": "TATASTEEL",
    "ISIN": "INE081A01020",
    "News": [
        {
            "Title": "Tata Steel Q3FY26 Earnings Call Recording Available",
            "Summary": "Tata Steel has made the audio-video recording of its Q3FY26 earnings discussion available on its website following the board approval of financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770734830440,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Block Trade Worth Rs. 28.78 Crores",
            "Summary": "Tata Steel witnessed a significant NSE block trade involving 1,475,021 shares valued at Rs. 28.78 crores, executed at Rs. 195.11 per share, indicating institutional interest in the steel major.",
            "Sentiment": "neutral",
            "PublishDate": 1770270893290,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Q3FY26 Earnings Call Set for Feb 6",
            "Summary": "Tata Steel announces Q3FY26 earnings discussion scheduled for February 6, 2026, via YouTube live telecast and Webex platform with interactive Q&A session from 6:00-7:30 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1770042869415,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Acquires $625.75M Stake in TSHP",
            "Summary": "Tata Steel has made a significant investment by purchasing shares worth USD 625.75 million in TSHP, marking a major corporate acquisition for the steel giant.",
            "Sentiment": "positive",
            "PublishDate": 1770040004718,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Completes ₹635.13 Cr Acquisition Deal",
            "Summary": "Tata Steel Limited successfully acquired 50.01% equity stake in Thriveni Pellets Private Limited for ₹635.13 crore following Competition Commission approval, gaining indirect control of pellet operations.",
            "Sentiment": "positive",
            "PublishDate": 1769778470304,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Gets Court Protection Until Feb 2026",
            "Summary": "High Court extends interim protection for Tata Steel until the next scheduled hearing on February 2, 2026, providing continued legal safeguards for the steel major.",
            "Sentiment": "positive",
            "PublishDate": 1769704310685,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel hits all-time high of Rs 192.40, up 2.44%",
            "Summary": "Tata Steel shares reached a new all-time high of Rs 192.40 on BSE with 2.44% gains. Q2 FY26 revenue rose 8.87% YoY to Rs 58,689.29 crore while net profit surged to Rs 3,132.34 crore from Rs 784.32 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769510267477,
            "Source": "co_actions_results"
        },
        {
            "Title": "EU-India Zero Tariff Proposal for Iron & Steel Products",
            "Summary": "European Union and India propose elimination of tariffs on iron and steel products, potentially benefiting major steel manufacturers like Tata Steel operating in both regions.",
            "Sentiment": "positive",
            "PublishDate": 1769498421327,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Board Meet Set for Feb 6 for Q3FY26 Results",
            "Summary": "Tata Steel Limited has scheduled its Board of Directors meeting for February 6, 2026, to consider Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769153777190,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Gets Extended Court Protection in Mining Dispute",
            "Summary": "Tata Steel secures extended interim protection from Orissa High Court till January 29, 2026, in two writ petitions challenging mining authority demands totaling ₹4,313.62 crores for Sukinda Chromite Block.",
            "Sentiment": "neutral",
            "PublishDate": 1769000542475,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Block Trade Worth ₹58.04 Crores on NSE",
            "Summary": "Tata Steel witnessed a significant block trade on NSE involving 31.60 lakh shares valued at ₹58.04 crores, executed at ₹183.67 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768971710128,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Raises Tata Steel Target to ₹215",
            "Summary": "Morgan Stanley maintains Overweight rating on Tata Steel and raises target price to ₹215 per share, reflecting positive outlook on the steel major's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768968127497,
            "Source": "stocks"
        },
        {
            "Title": "CCI Approves Tata Steel's Thriveni Pellets Stake Buy",
            "Summary": "Competition Commission of India has granted approval for Tata Steel's acquisition of a 50.01% controlling stake in Thriveni Pellets, marking a significant expansion move for the steel major.",
            "Sentiment": "positive",
            "PublishDate": 1768915859989,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Gets Court Relief Extension Till Jan 19",
            "Summary": "Orissa High Court extends interim protection for Tata Steel in two writ petitions against ₹1,902.72 crore and ₹2,410.89 crore demand notices related to Sukinda chromite block operations.",
            "Sentiment": "positive",
            "PublishDate": 1768235888257,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Gets Court Protection Extension in Mining Case",
            "Summary": "Orissa High Court extends interim protection for Tata Steel till January 19, 2026, in two writ petitions challenging mining authority demands totaling ₹4,313.62 crores for Sukinda Chromite Block shortfall disputes.",
            "Sentiment": "neutral",
            "PublishDate": 1768234233572,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Files Q3 FY26 Dematerialization Certificate",
            "Summary": "Tata Steel Limited submitted its quarterly certificate under SEBI Regulation 74(5) for Q3 FY26, confirming compliance with securities dematerialization reporting requirements to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1767796062688,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel gets 'Buy' rating despite underperformance",
            "Summary": "HSBC maintains 'Buy' rating on Tata Steel with ₹215 target despite stock underperformance. India operations show strong 11.4% production growth while European operations face pressure.",
            "Sentiment": "positive",
            "PublishDate": 1767789354507,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCI Finds Steel Giants Used WhatsApp for Price Fixing",
            "Summary": "Competition Commission investigation reveals Tata Steel, JSW Steel, SAIL and 25 other firms colluded on steel prices via WhatsApp messages between 2015-2023, with 56 executives held liable including top industry leaders.",
            "Sentiment": "negative",
            "PublishDate": 1767688674091,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel emerges as top Tata Group performer in 2025",
            "Summary": "Tata Steel gained 30.4% in 2025, adding ₹52,368 crore in market value. Analysts see 31% upside potential driven by capacity expansion, government tariff protection, and improving India business mix.",
            "Sentiment": "positive",
            "PublishDate": 1767678274556,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel surges 10.5% in six days near 52-week high",
            "Summary": "Tata Steel shares rally 10.5% over six trading sessions to ₹186.90, driven by management's expansion roadmap and policy support from extended safeguard duties on steel imports.",
            "Sentiment": "positive",
            "PublishDate": 1767593594198,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel shares in focus as CEO flags 5-year low prices",
            "Summary": "T V Narendran reveals steel prices hit 5-year lows in 2025 despite strong domestic demand, citing global trade disruptions and Chinese exports. Company continues expansion with Rs 4,000 crore investments.",
            "Sentiment": "neutral",
            "PublishDate": 1767282301034,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Acquires BlueScope Stake for ₹1,100 Cr",
            "Summary": "Tata Steel completes acquisition of 43.3 crore shares in joint venture Tata BlueScope Steel for ₹1,099.97 crore from BlueScope Steel Asia Holdings on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767233430933,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Completes ₹1,100 Cr TBSPL Acquisition",
            "Summary": "Tata Steel acquired 43.3 crore equity shares in Tata BlueScope Steel for ₹1,099.97 crore, increasing its stake to 99.99% and making TBSPL an indirect subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1767190026966,
            "Source": "co_actions_results"
        },
        {
            "Title": "Five Top Stock Picks: NTPC, Tata Steel Lead Buys",
            "Summary": "Market analysts recommend buying NTPC at ₹325 targeting ₹338, Tata Steel at ₹172 with ₹180 target, AU Small Finance Bank at ₹986 for ₹1,050, plus Tata Consumer and Bharti Hexacom picks.",
            "Sentiment": "positive",
            "PublishDate": 1767060862842,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Faces ₹890.52 Cr GST Demand Order",
            "Summary": "Tata Steel receives GST demand order of ₹890.52 crores plus penalty and interest for alleged irregular Input Tax Credit claims during FY2018-19 to FY2020-21. Company plans to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1766920020539,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel faces $1.6bn Dutch lawsuit over emissions",
            "Summary": "Dutch NGO Stichting Frisse Wind.nu seeks €1.4 billion compensation from Tata Steel's Netherlands units, alleging harmful emissions caused health damage and environmental harm to residents near Velsen-Noord operations.",
            "Sentiment": "negative",
            "PublishDate": 1766734913837,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Credit Rating Affirmed at BBB by S&P",
            "Summary": "S&P Global Ratings affirmed Tata Steel's issuer credit rating at BBB with stable outlook on December 24, 2025, citing higher volumes and cost-reduction initiatives balancing growth project impacts.",
            "Sentiment": "neutral",
            "PublishDate": 1766578122434,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Gets Court Relief in Sukinda Mining Dispute",
            "Summary": "Orissa High Court extends interim protection for Tata Steel till January 8, 2026, in two writ petitions challenging mining authority demands totaling ₹4,313.62 crores for alleged shortfall in chromite dispatch from Sukinda block.",
            "Sentiment": "neutral",
            "PublishDate": 1766492423260,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Completes ₹1,100 Cr BlueScope Acquisition",
            "Summary": "Tata Steel completed acquisition of 99.99% stake in Tata BlueScope Steel for ₹1,099.97 crore on December 31, 2025, making it an indirect subsidiary after regulatory approval.",
            "Sentiment": "positive",
            "PublishDate": 1766491790895,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Wins GST Case, ₹161.52 Cr Demand Dropped",
            "Summary": "Tata Steel receives favourable order from GST authorities, with entire tax demand of ₹161.52 crores set aside and no penalty imposed in compensation cess case.",
            "Sentiment": "positive",
            "PublishDate": 1766427124550,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Faces ₹11.32 Cr Tax Demand & Penalty",
            "Summary": "Tata Steel confronts significant tax demand of ₹4.93 billion along with penalty of ₹6.39 billion from tax authorities, totaling ₹11.32 billion in financial obligations.",
            "Sentiment": "negative",
            "PublishDate": 1766151765104,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Acquires ₹1,355 Cr Stake in T Steel Holdings",
            "Summary": "Tata Steel acquired 148.81 crore equity shares in T Steel Holdings for USD 150 million (₹1,354.94 crore) on December 19, 2025, maintaining its wholly owned subsidiary status.",
            "Sentiment": "neutral",
            "PublishDate": 1766147897518,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Gets Court Relief in Sukinda Mine Dispute",
            "Summary": "Orissa High Court extends interim protection for Tata Steel until December 19, 2025, in two writ petitions challenging demand letters totaling ₹4,313.39 crores for alleged mining shortfalls at Sukinda Chromite Block.",
            "Sentiment": "neutral",
            "PublishDate": 1765555883076,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Sets Buy Rating on Tata Steel with ₹215 Target",
            "Summary": "HSBC maintains a Buy recommendation on Tata Steel shares with a target price of ₹215, indicating positive analyst sentiment for the steel major.",
            "Sentiment": "positive",
            "PublishDate": 1765511025351,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Sets ₹200 Target for Tata Steel",
            "Summary": "Morgan Stanley maintains Overweight rating on Tata Steel with target price of ₹200, signaling positive outlook for the steel major's prospects in current market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1765510778480,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Sees Steel Prices Bottoming Out",
            "Summary": "Tata Steel executives believe steel prices have reached their lowest point and expect margin improvements ahead. Company anticipates stable Chinese exports with weaker rupee offsetting import costs.",
            "Sentiment": "positive",
            "PublishDate": 1765457682088,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Growth Plans Update Expected by March 2026",
            "Summary": "Tata Steel executive indicates more details about company's growth strategy will be disclosed by March 2026, though specific information remains limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765455702251,
            "Source": "stocks"
        },
        {
            "Title": "JPMorgan Maintains Overweight Rating on Tata Steel",
            "Summary": "JPMorgan continues its 'Overweight' rating on Tata Steel with a price target of ₹193.00, indicating positive analyst sentiment for the steel major.",
            "Sentiment": "positive",
            "PublishDate": 1765424963797,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Gets Nod for 1 MTPA Demo Plant Engineering",
            "Summary": "Tata Steel receives approval to commence engineering work for a 1 million tonnes per annum demonstration plant in Jamshedpur, marking a significant development in the company's expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1765381527303,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Approves ₹0.7 MTPA Galvanizing Project",
            "Summary": "Tata Steel has approved a new 0.7 MTPA hot rolled pickling and galvanizing line project at its Tarapur Cold Rolling Complex to expand manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765381497410,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Approves ₹X Cr for 2.5MT Meramandali Plant",
            "Summary": "Tata Steel board approves funding for new 2.5 million tonne thin slab caster and rolling mill facilities at Meramandali, expanding production capacity in strategic location.",
            "Sentiment": "positive",
            "PublishDate": 1765381468120,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Approves 4.8 MTPA Capacity Expansion",
            "Summary": "Tata Steel has approved the expansion of 4.8 million tonnes per annum (MTPA) capacity at Neelachal Ispat Nigam Limited, marking a significant step in the company's growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1765377721419,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Secures $6.36B Pellet Facility Deal",
            "Summary": "Tata Steel announces major $6.36 billion acquisition of pellet facility to strengthen iron ore supply chain operations in India, marking significant expansion in raw materials infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1765377476612,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Steel Acquires Majority Stake in Thriveni Pellets",
            "Summary": "Tata Steel Board approves acquisition of 50.01% stake in Thriveni Pellets Private Limited for up to ₹636 crores, securing control of 4 MTPA pellet plant operations.",
            "Sentiment": "positive",
            "PublishDate": 1765377452149,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jefferies Issues Buy Rating on Tata Steel at ₹200",
            "Summary": "Global brokerage firm Jefferies has issued a Buy recommendation for Tata Steel with a target price of ₹200, indicating positive outlook for the steel major's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765375525271,
            "Source": "stocks"
        },
        {
            "Title": "Tata Steel Sees Large Block Trade Worth Rs. 274.92 Crores on NSE",
            "Summary": "Tata Steel witnessed a significant block trade on NSE involving 16,595,350 shares valued at Rs. 274.92 crores, executed at Rs. 165.66 per share. The large-volume transaction indicates substantial institutional or bulk investor activity in the steel major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764907790197,
            "Source": "order&deals"
        },
        {
            "Title": "TATA Steel Receives Extended Interim Protection from High Court Until December 12",
            "Summary": "The High Court has extended interim protection for TATA Steel, with the protection period now lasting until December 12. This legal development provides the steel company with continued judicial safeguards during what appears to be ongoing legal proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1764860717626,
            "Source": "stock"
        },
        {
            "Title": "Tata Steel Gets Extended Court Protection in ₹1,902 Crore Mining Dispute",
            "Summary": "The Orissa High Court extended interim protection for Tata Steel until December 3, 2025, preventing authorities from taking coercive action in a ₹1,902.72 crore demand related to alleged mineral dispatch shortfall from its Sukinda Chromite Block. The dispute stems from a July 2025 demand letter regarding revised assessment of mining operations for the period July 2023 to July 2024, with Tata Steel challenging the demand through a writ petition filed in August 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764140078970,
            "Source": "stock"
        },
        {
            "Title": "Tata Steel Receives High Court Temporary Protection Until December",
            "Summary": "The High Court has granted temporary protection to Tata Steel, extending coverage until December. This legal protection provides the steel company with interim relief during ongoing proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1763967903321,
            "Source": "stock"
        },
        {
            "Title": "Tata Steel Receives Interim Court Protection in ₹241 Crore Mining Dispute",
            "Summary": "Tata Steel secured interim protection from the Orissa High Court against a ₹241 crore demand raised by mining authorities for alleged shortfall in Chrome Ore dispatch from its Sukinda Chromite Block. The court restrained authorities from taking coercive action against the company until the next hearing scheduled for December 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763814624362,
            "Source": "stock"
        }
    ]
}