{
    "Symbol": "TATACOMM",
    "ISIN": "INE151A01013",
    "News": [
        {
            "Title": "Tata Communications Appoints Siddhartha Mundra as CFO",
            "Summary": "Tata Communications appointed Siddhartha Mundra as Chief Financial Officer-Designate effective February 23, 2026, with full CFO responsibilities beginning May 1, 2026, replacing Kabir Ahmed Shakir.",
            "Sentiment": "positive",
            "PublishDate": 1770735466756,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications CFO Kabir Ahmed Shakir Resigns",
            "Summary": "Tata Communications announces the resignation of Chief Financial Officer Kabir Ahmed Shakir from his position at the telecommunications company.",
            "Sentiment": "neutral",
            "PublishDate": 1770120361735,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Launches AI-Ready Business Tools",
            "Summary": "Tata Communications introduces comprehensive AI-ready solutions including IZO+™ Multi-Cloud Network, Edge Distribution Platform, and ThreadSpan™ to enhance digital operations for businesses.",
            "Sentiment": "positive",
            "PublishDate": 1769769067197,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Board Approves Business Split",
            "Summary": "Tata Communications board approves strategic plan to split non-licensed business operations and merge fully owned subsidiaries in major corporate restructuring initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1769094512259,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Eyes 20%+ Growth in Key Segments",
            "Summary": "Management targets 20%+ growth in NextGen connectivity, cloud security, CIS, and media segments while MOVE and IoT divisions will focus on profitability over expansion during recent concall guidance.",
            "Sentiment": "positive",
            "PublishDate": 1769051967668,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Sets Growth Targets for TCTS",
            "Summary": "Tata Communications provides guidance on TCR margin stabilization in mid-50s and sets high-growth targets for TCTS business with strong pipeline visibility during recent concall.",
            "Sentiment": "positive",
            "PublishDate": 1769051935171,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Eyes Digital Portfolio Breakeven",
            "Summary": "Tata Communications management outlined strategic guidance during concall, targeting digital portfolio breakeven in near to medium term with destination margin achievement within ambition timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1769051891868,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Sets EBITDA Margin Target of 23-25%",
            "Summary": "Management maintains ambitious EBITDA margin targets of 23% to 25% and expects gradual ROCE recovery over the next few quarters during recent conference call discussions.",
            "Sentiment": "positive",
            "PublishDate": 1769051807162,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Q3 Net Profit Jumps 50% YoY",
            "Summary": "Tata Communications reported consolidated net profit of ₹3.60 billion for Q3, marking a significant 50% increase from ₹2.40 billion in the same quarter last year, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1768985566943,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Names New MD & CEO",
            "Summary": "Tata Communications appoints Ganesh Lakshminarayanan as new Managing Director & CEO, set to take over from A. S. Lakshminarayanan on April 13, 2026, pending regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1768984420891,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Launches ₹3,000 Cr Commercial Paper",
            "Summary": "Tata Communications has launched a commercial paper worth ₹3,000 crores to raise short-term funds for business operations and working capital requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768568667520,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Issues ₹300 Cr Commercial Paper",
            "Summary": "Tata Communications Limited has issued and allotted commercial paper worth ₹300 crore with a discount rate of 6.60% per annum, maturing in April 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768563828266,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Dissolves Canadian Subsidiary",
            "Summary": "Tata Communications announces dissolution of wholly owned indirect subsidiary Campaign Registry Inc., a non-operating entity domiciled in Canada, effective January 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768470441353,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Q3FY26 Earnings Call on Jan 21",
            "Summary": "Tata Communications has scheduled its Q3FY26 earnings call for January 21, 2026 at 5:30 PM IST via Zoom webinar to discuss quarterly results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768224683058,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Board Meet on Jan 21 for Q3FY26",
            "Summary": "Tata Communications has scheduled a board meeting on January 21, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768224133039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Issues ₹600 Cr Commercial Paper",
            "Summary": "Tata Communications Limited has issued and allotted commercial paper worth ₹600 crore with a discount rate of 6.14% per annum, maturing in March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766754890468,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Communications Gets ESG Rating of 72 from NSE",
            "Summary": "NSE Sustainability Ratings Analytics Limited has assigned an ESG rating of 72 to Tata Communications Limited, based on publicly available data without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1765382596707,
            "Source": "stocks"
        },
        {
            "Title": "Tata Communications Acquires Majority Stake in Commotion Inc. for AI Transformation",
            "Summary": "Tata Communications has acquired a majority stake in Commotion Inc. as part of its strategy to accelerate AI-led transformation initiatives. The acquisition is aimed at enhancing the company's digital fabric capabilities through artificial intelligence integration.",
            "Sentiment": "positive",
            "PublishDate": 1764893188497,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Communications Unit Acquires Majority Stake in US-Based Commotion Inc",
            "Summary": "Tata Communications' subsidiary acquired a 51% stake in US company Commotion Inc for $25.5 million (227 crore rupees). The acquisition gives Tata Communications controlling interest in the American firm through its unit.",
            "Sentiment": "positive",
            "PublishDate": 1764644339150,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Communications Partners With Real Madrid CF To Launch Premium Loyalty Program In India",
            "Summary": "Tata Communications has partnered with Real Madrid CF and Footballerista to introduce the Madridista Premium Loyalty Program in India. The program targets 22 million fans and 11 official fan clubs in the country.",
            "Sentiment": "positive",
            "PublishDate": 1762233617938,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications to Liquidate Subsidiary Mgage SA De CV",
            "Summary": "Tata Communications will liquidate its subsidiary Mgage SA De CV, with the liquidation process set to begin on October 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761827015503,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Partners With Nice to Enhance AI-Powered Contact Centers",
            "Summary": "Tata Communications has formed a strategic alliance with Nice to enhance global contact centers through AI-powered customer engagement solutions. The partnership involves merging Tata's Kalyera platform with Nice's CXone Mpowe platforms to improve customer experience delivery.",
            "Sentiment": "positive",
            "PublishDate": 1761802373435,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Communications Revives Tamil Nadu Lake, Triples Water Storage Capacity",
            "Summary": "Tata Communications successfully restored Nagan Thangal Lake in Tamil Nadu's Upparapalayam village, increasing water storage capacity from 2.6 million litres to 8.5 million litres. The Project Nanneer initiative, launched in 2022 in partnership with Pitchandikulam Forest, transformed the 15.01-acre lake that serves nearly 12,000 people, with 60% from marginalised communities. The restoration involved desilting four acres to 1.5 meters depth and planting over 4,000 native species. The lake now supports 14 fish species, 56 bird species, and 33 butterfly species, while attracting over 11,500 annual visitors. Groundwater recharge increased threefold and barren land in the catchment area decreased by 15%. Tata Communications shares were trading down 2.67% at ₹1,864.20 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1761208491175,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Issues ₹500 Crore Commercial Paper with 6.09% Discount Rate",
            "Summary": "Tata Communications Limited issued and allotted Commercial Paper worth ₹500 crore. The securities have a face value of ₹5,00,000 per unit and carry a discount rate of 6.09% per annum. The Commercial Paper was issued on October 16, 2025, with redemption scheduled for January 15, 2026. The securities have been assigned ISIN INE151A14214 and were listed on the National Stock Exchange of India Limited on October 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760702523709,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Communications Develops AI-Powered Multi-Channel Communication Solutions",
            "Summary": "Tata Communications is developing multi-channel orchestration capabilities that include AI-powered options for switching between communication channels. This development was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1760585720286,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Targets Cloud Growth and Data Revenue Doubling by FY'28",
            "Summary": "Tata Communications expects cloud and security segments to grow in the mid to high teens for the year. The company plans capital expenditure of 11-12% of sales and expects strategic investments to contribute at least 10% to incremental digital revenues. The company aims to double data revenue by FY'28, which is one year later than originally planned. Key financial targets include reducing net debt/EBITDA ratio below 2x, improving return on capital employed within a year, and enhancing EBITDA margins a year later.",
            "Sentiment": "positive",
            "PublishDate": 1760585335649,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Reports Mixed Q2 Results with Strategic Focus on H2 Profitability",
            "Summary": "Tata Communications reported Q2 EBITDA of 11.73 billion rupees, up from 11.3 billion rupees year-over-year. However, EBITDA margin declined to 19.4% from 19.72% in the same period last year. Consolidated net profit fell to 1.83 billion rupees compared to 2.3 billion rupees year-over-year. The company expects strategic moves to boost profitability and margins in the second half of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1760516859887,
            "Source": "stock"
        },
        {
            "Title": "Angel One, Axis Bank, HDFC Life Among Companies Reporting Q2 Results",
            "Summary": "Several major companies are scheduled to announce their quarterly earnings results. Angel One is expected to report a 17.8% rise in net profit to Rs 215 crore and revenue of Rs 1,208.4 crore. Axis Bank is projected to show a profit decline of 15.6% to Rs 5,838 crore with net interest income falling 1.9% to Rs 13,228.81 crore. The bank's provisions are expected to increase 14.4% to Rs 2,515.63 crore, while gross NPA may rise to 1.62% from 1.57%. Net interest margins are anticipated to moderate to 3.6% from 3.8%. The broader banking sector is expected to report softer earnings due to narrowing net interest margins and weak trading gains, though loan growth remained strong across most lenders during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760488506498,
            "Source": "earnings"
        },
        {
            "Title": "Tata Communications Shares Surge 15% on AI Data Center Synergy Expectations",
            "Summary": "Tata Communications shares jumped 14.8% to Rs 1,948, marking a 21% gain over six sessions. The rally was driven by heavy trading volumes with 35.86 lakh shares traded on NSE, generating Rs 657.42 crore turnover. The surge follows TCS's announcement to develop 1 GW of AI-driven data center capacity over five to seven years. Market experts believe Tata Communications could benefit significantly due to its data connectivity and cloud infrastructure network, particularly in DC-to-DC connectivity business. Technical indicators show the stock trading above all key moving averages with RSI at 62.9 and positive MACD signals. TCS management indicated potential synergies with other Tata Group companies during earnings calls, reinforcing expectations of Tata Communications' role in AI and data center ecosystem. The company's market capitalization reached Rs 53,722.50 crore.",
            "Sentiment": "positive",
            "PublishDate": 1760082477443,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Launches Voice AI Platform for BFSI Sector",
            "Summary": "Tata Communications has unveiled a Voice AI platform designed to enhance customer experiences in the Banking, Financial Services, and Insurance (BFSI) sector. The platform supports over 40 languages and offers instant decision-making capabilities with less than 500ms latency.",
            "Sentiment": "positive",
            "PublishDate": 1759741732401,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Launches eSIM Services for BSNL Across India",
            "Summary": "Tata Communications has introduced eSIM services across India for BSNL using a GSMA-approved platform. The service aims to provide connectivity solutions for millions of users.",
            "Sentiment": "positive",
            "PublishDate": 1759301369389,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Wins GST Appellate Tribunal Digital Infrastructure Project",
            "Summary": "Tata Communications has secured a project to provide digital infrastructure for the GST Appellate Tribunal. The project aims to automate tribunal functions and improve transparency in the system. The initiative aligns with the government's Digital India objectives.",
            "Sentiment": "positive",
            "PublishDate": 1759127936111,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Raises ₹600 Crore Through Commercial Paper Issuance",
            "Summary": "Tata Communications Limited issued and allotted Commercial Paper worth ₹600 crore on September 24, 2025. The securities carry a face value of ₹5,00,000 per unit with a discount rate of 5.85% per annum and will mature on December 24, 2025. The Commercial Paper was listed on the National Stock Exchange of India Limited on September 25, 2025, with ISIN INE151A14206.",
            "Sentiment": "neutral",
            "PublishDate": 1758805469171,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Communications Completes Liquidation of Netherlands Subsidiary MuCoSo B.V.",
            "Summary": "Tata Communications Limited has completed the winding up and liquidation of MuCoSo B.V., a non-operating wholly owned indirect subsidiary based in the Netherlands. The liquidation became effective on September 16, 2025. MuCoSo B.V. had minimal financial impact on the parent company, with a turnover of €1,26,466 and negative net worth of €(6,167) for FY 2024-25, both representing 0% of Tata Communications' operations. Since MuCoSo was an indirect subsidiary, no proceeds were received by Tata Communications from the liquidation process.",
            "Sentiment": "neutral",
            "PublishDate": 1758029563139,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Communications Partners with Cisco for eSIM and IoT Connectivity Solutions",
            "Summary": "Tata Communications has formed a partnership with Cisco to develop solutions for eSIM and IoT connectivity services. The collaboration aims to advance connectivity capabilities in the emerging technology sectors.",
            "Sentiment": "positive",
            "PublishDate": 1757503534311,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Partners With Cisco to Enhance eSIM and IoT Connectivity Across 200+ Countries",
            "Summary": "Tata Communications has formed a partnership with Cisco to improve eSIM and IoT connectivity services. The collaboration aims to enhance device management capabilities across more than 200 countries, with the partnership covering 270 million SIM devices.",
            "Sentiment": "positive",
            "PublishDate": 1757307802024,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Issues 7 Billion Rupees in Commercial Paper",
            "Summary": "Tata Communications has issued commercial paper worth 7 billion rupees. Commercial paper represents short-term debt instruments that companies use to meet immediate funding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1756122493932,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Communications Sees Block Trade Worth Rs. 118.16 Crores on NSE",
            "Summary": "Tata Communications executed a block trade on the National Stock Exchange involving 741,547 shares at a price of Rs. 1593.40 per share, totaling Rs. 118.16 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1756104439204,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Communications Block Trade Worth Rs. 127.21 Crores Executed on NSE",
            "Summary": "Tata Communications executed a block trade on the National Stock Exchange involving approximately 796,361 shares at a price of Rs. 1,597.40 per share. The total transaction value amounted to Rs. 127.21 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1756102405866,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Communications Sees Rs. 176.38 Crore Block Trade on NSE",
            "Summary": "Tata Communications executed a block trade worth Rs. 176.38 crores on the NSE involving approximately 1,109,631 shares at a price of Rs. 1,589.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755767233746,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Communications Raises ₹1,000 Crore Through 3-Year NCDs at 6.77%",
            "Summary": "Tata Communications has successfully raised ₹1,000 crore through the issuance of 3-year Non-Convertible Debentures (NCDs) at an interest rate of 6.77%. This debt fundraising provides the company with capital for its business operations and growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754573446739,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Raises ₹1,000 Crore Through 3-Year NCDs at 6.77% Coupon Rate",
            "Summary": "Tata Communications has issued and allotted 100,000 non-convertible debentures worth ₹1,000 crore on a private placement basis. The NCDs carry a face value of ₹1,00,000 each with a fixed coupon rate of 6.77% and have a 3-year tenure. The debentures are rated, unsecured, listed, and redeemable, issued to identified investors through multiple yield allotment method. The NCDs will be listed on the National Stock Exchange's Wholesale Debt Market Segment. The allotment was approved by the Financial Resource Raising Committee on August 7, 2025, with the same date serving as the deemed date of allotment. Interest payments will be made annually, and the debentures will be redeemed at maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1754570676283,
            "Source": "corporate_action"
        },
        {
            "Title": "DoT Issues ₹7,800 Crore AGR Demand Notice to Tata Communications",
            "Summary": "The Department of Telecom has issued a demand notice of approximately ₹7,800 crore to Tata Communications for adjusted gross revenue dues covering financial years 2005-06 to 2023-24. The demand includes ₹276.68 crore for disallowed deductions under ISP and NLD licenses. Tata Communications has existing appeals pending at the Supreme Court and telecom tribunal TDSAT related to its ILD, NLD, and ISP licenses. The company's Managing Director stated that their appeals are not covered by the Supreme Court's October 2019 AGR judgment on UASL licenses, and believes the company can defend its position based on legal assessments. The government's initial calculations showed total AGR liability of around ₹1.65 lakh crore for all telecom operators, though Tata Communications was not included in the March 2022 liability calculations for other major operators.",
            "Sentiment": "negative",
            "PublishDate": 1753624591523,
            "Source": "stock"
        },
        {
            "Title": "ED Conducts Searches at Reliance Communications Navi Mumbai Office",
            "Summary": "The Enforcement Directorate conducted searches, seizures and freezing actions at Reliance Communications Ltd.'s office in Dhirubhai Ambani Knowledge City, Navi Mumbai. The company stated it continues to operate normally without any impact on business activities. The ED previously searched properties linked to Anil Ambani in Mumbai and Delhi over alleged money laundering. The agency conducted operations at more than 35 premises connected to Reliance Home Finance Ltd., covering around 50 companies and 25 individuals under the Prevention of Money Laundering Act. The ED is examining potential bribes paid to bank officials, including Yes Bank founders, and investigating whether promoters received money before loans were granted. The agency is also reviewing a significant rise in corporate loan disbursals by RHFL between April 2017 and March 2019, with allegations that funds from Yes Bank loans were diverted to group and shell firms.",
            "Sentiment": "negative",
            "PublishDate": 1753466726499,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Partners with Amazon Web Services to Launch AI-Enhanced Network in India",
            "Summary": "Tata Communications has entered into a partnership with Amazon Web Services to develop a new AI-enhanced network infrastructure in India. The collaboration aims to leverage AWS's cloud capabilities combined with Tata Communications' network expertise to create an advanced networking solution incorporating artificial intelligence technologies.",
            "Sentiment": "positive",
            "PublishDate": 1753161374189,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Communications Delays EBITDA Margin Target to FY28, Reports Mixed Q1 Results",
            "Summary": "Tata Communications has pushed back its target of achieving 23-25% EBITDA margin from FY27 to FY28, delayed by four to five quarters according to CFO Kabir Ahmed Shakir. The company's revenue target of Rs 28,000 crore by FY27 may also be deferred. In Q1FY26, the data business grew 9.4% year-on-year, while EBITDA margin declined to 19.1% from 20.3% in the previous year. Profit after tax dropped 34.9% to Rs 232 crore from Rs 357 crore. The CFO noted the company has transitioned from low single-digit growth five years ago to consistent double-digit growth, with expectations that the digital portfolio will contribute 25-30% growth. The company signed a healthy order book in Q1, with financial impact expected from Q3 onwards. Shares traded 1.87% higher at Rs 1,764.",
            "Sentiment": "neutral",
            "PublishDate": 1752894388719,
            "Source": "stock"
        },
        {
            "Title": "Tata Communications Issues ₹500 Crore Commercial Paper",
            "Summary": "Tata Communications has issued commercial paper worth ₹500 crore. Commercial paper is a short-term debt instrument used by companies for financing.",
            "Sentiment": "neutral",
            "PublishDate": 1752844441000,
            "Source": "default"
        },
        {
            "Title": "Tata Communications: Board Approves Rs 1,000 Crore NCD Issuance",
            "Summary": "Tata Communications' board approved raising up to Rs 1,000 crore through non-convertible debentures on private placement basis. The company also agreed to acquire Solutions Infini Technologies for Rs 123.6 crore from Kaleyra SPA. Q1 profit reported at Rs 189.98 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752763160000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Communications: Q1 Profit Plunges 82%, Missing Estimates",
            "Summary": "Tata Communications reported a consolidated net profit of Rs 189.98 crore for Q1, an 82% decline from the previous quarter and below analyst estimates of Rs 351.1 crore. Revenue decreased 0.5% to Rs 5,959.85 crore. EBITDA rose 1% to Rs 1,136.81 crore with margins expanding to 19.1%.",
            "Sentiment": "negative",
            "PublishDate": 1752759175000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Communications Reports Q1 EBITDA and Margin",
            "Summary": "Tata Communications has reported its Q1 EBITDA as 11.4 billion rupees, which is unchanged from the same period last year. The company's Q1 EBITDA margin has decreased to 19.09% from 20.31% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1752758960000,
            "Source": "result"
        }
    ]
}