{
    "Symbol": "TATAELXSI",
    "ISIN": "INE670A01012",
    "News": [
        {
            "Title": "Tata Elxsi Q3 PAT drops 45% YoY on exceptional charges",
            "Summary": "Tata Elxsi's Q3 net profit fell 45.3% YoY to ₹1.09 billion due to ₹956.9 million exceptional charge from labour law changes. Brokerages cite valuation concerns with downside targets up to 22%.",
            "Sentiment": "negative",
            "PublishDate": 1768373768854,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Gets 'Sell' Rating After Q3 Results",
            "Summary": "Motilal Oswal assigns 'Sell' rating to Tata Elxsi following Q3 FY26 results showing $107M revenue with 3.2% QoQ growth, led by transportation segment while other divisions declined.",
            "Sentiment": "negative",
            "PublishDate": 1768373361474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Shares Drop 2.5% Despite Strong Q3 Results",
            "Summary": "Tata Elxsi shares fell 2.5% to ₹5,649 despite reporting strong Q3 results with revenue growth and margin expansion. High valuations at 52x PE ratio weigh on investor sentiment despite positive fundamentals.",
            "Sentiment": "neutral",
            "PublishDate": 1768366052611,
            "Source": "co_actions_results"
        },
        {
            "Title": "Labour Codes Hit IT Sector: TCS, HCLTech Face Q3 Profit Impact",
            "Summary": "New labour codes cause one-time charges for IT majors - TCS books ₹2,128 cr provision, HCLTech takes ₹956 cr hit. Infosys, Wipro, Tech Mahindra may face similar impact in upcoming results.",
            "Sentiment": "negative",
            "PublishDate": 1768364654521,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Expects Sector Recovery in Q4 FY26",
            "Summary": "Tata Elxsi anticipates recovery in media, communications, and healthcare sectors by Q4 FY26, with optimistic growth outlook for the following financial year.",
            "Sentiment": "positive",
            "PublishDate": 1768359664336,
            "Source": "stocks"
        },
        {
            "Title": "Tata Elxsi Plans Capacity Optimization Strategy",
            "Summary": "Tata Elxsi aims to increase utilization rates from 75% to 80-85% before expanding capacity, with plans to restore previous margin levels by next year end.",
            "Sentiment": "positive",
            "PublishDate": 1768359643594,
            "Source": "stocks"
        },
        {
            "Title": "Tata Elxsi Expects Steady Transportation Growth",
            "Summary": "Tata Elxsi anticipates steady growth in transportation sector with faster expansion expected in next financial year, targeting growth beyond Q3 FY26 performance levels.",
            "Sentiment": "positive",
            "PublishDate": 1768359391268,
            "Source": "stocks"
        },
        {
            "Title": "Tata Elxsi Targets Double-Digit Growth by FY27",
            "Summary": "Tata Elxsi aims for double-digit growth in transportation and healthcare sectors by FY27, according to recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1768359343223,
            "Source": "stocks"
        },
        {
            "Title": "Tata Elxsi Q3 results mixed, Motilal sees downside",
            "Summary": "Tata Elxsi reported Q3FY26 revenue of ₹953.5 crore with improved margins, but exceptional charges hit profitability. Motilal Oswal maintains 'Sell' rating citing expensive valuations at 43x P/E.",
            "Sentiment": "neutral",
            "PublishDate": 1768354483188,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Q3 Net Profit Drops 30% Despite Revenue Growth",
            "Summary": "Tata Elxsi reports mixed Q3 results with net profit declining to ₹109 crores from ₹155 crores quarter-on-quarter, while revenue grew 3.5% to ₹950 crores and EBIT margin improved to 20.92%.",
            "Sentiment": "neutral",
            "PublishDate": 1768349921683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Q3 FY26 Earnings Call Recording Available",
            "Summary": "Tata Elxsi has made available the audio recording of its Q3 FY26 earnings conference call held on January 13, 2026, discussing financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768317846593,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Management Optimistic on Growth Pipeline",
            "Summary": "Tata Elxsi management expresses confidence in future growth prospects, citing strong deal pipeline, AI innovations, and positive customer progress as key drivers for the technology services company.",
            "Sentiment": "positive",
            "PublishDate": 1768313866669,
            "Source": "stocks"
        },
        {
            "Title": "Tata Elxsi Q3 FY26: Revenue grows 3.9% QoQ to ₹953.5 cr",
            "Summary": "Tata Elxsi reported revenue of ₹953.5 crores in Q3 FY26, up 3.9% QoQ and 1.5% YoY. EBITDA margin improved 220 bps QoQ to 23.3%. Transportation segment led growth with 7.7% QoQ increase.",
            "Sentiment": "positive",
            "PublishDate": 1768309723404,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Q3 FY26: Revenue up 3.9% QoQ to ₹953.5 cr",
            "Summary": "Tata Elxsi reported Q3 FY26 revenue of ₹953.5 crores, up 3.9% QoQ, with EBITDA margin improving 220 bps to 23.3%. Growth led by transportation business and strategic deal wins.",
            "Sentiment": "positive",
            "PublishDate": 1768309632295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Q3 EBIT Jumps 17% to ₹1.99 Billion",
            "Summary": "Tata Elxsi reports strong quarterly performance with EBIT rising to ₹1.99 billion from ₹1.70 billion, while EBIT margin expands to 20.92% from 18.5% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768308780140,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Q3FY26 Net Profit Drops 45.3% YoY",
            "Summary": "Tata Elxsi reported Q3FY26 net profit of ₹108.89 cr, down 45.3% YoY, impacted by ₹95.69 cr exceptional charge from New Labour Codes implementation.",
            "Sentiment": "negative",
            "PublishDate": 1768308595139,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Q3 Revenue Up 3.5% QoQ Despite Profit Drop",
            "Summary": "Tata Elxsi reports mixed Q3 results with revenue rising to ₹9.50 billion from ₹9.18 billion quarter-on-quarter, while net profit declined to ₹1.09 billion from ₹1.55 billion in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1768308380174,
            "Source": "co_actions_results"
        },
        {
            "Title": "Centre Plans Vehicle-To-Vehicle Communication Tech",
            "Summary": "Government announces plans to launch vehicle-to-vehicle communication technology to share real-time data on speed, braking, and location to reduce road accidents, according to Gadkari.",
            "Sentiment": "positive",
            "PublishDate": 1767947137766,
            "Source": "stocks"
        },
        {
            "Title": "Tata Elxsi Block Trade Worth ₹16.98 Crores on NSE",
            "Summary": "Tata Elxsi witnessed a block trade on NSE involving 28,946 shares valued at ₹16.98 crores, executed at ₹5,865.00 per share, indicating institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767776100161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Q3 FY26 Earnings Call on Jan 13, 2026",
            "Summary": "Tata Elxsi announces investor conference call scheduled for January 13, 2026 at 19:00 IST to discuss Q3 FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767699853193,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Clarifies No Material Events Behind Volume Spike",
            "Summary": "Tata Elxsi responds to BSE inquiry on volume movement, stating no pending material information or undisclosed events impacting stock price, attributing activity to market dynamics.",
            "Sentiment": "neutral",
            "PublishDate": 1766387335160,
            "Source": "stocks"
        },
        {
            "Title": "Tata Elxsi Partners for Kavach 4.0 Development",
            "Summary": "Tata Elxsi collaborates with Nova Control Tecnologix to develop India's next-generation automatic train protection system, Kavach 4.0, with Phase-I expected to generate ₹50,000 crore in orders over six to seven years.",
            "Sentiment": "positive",
            "PublishDate": 1765770465814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Elxsi Allots 1,471 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Tata Elxsi allotted 1,471 equity shares on December 3, 2025, following the exercise of performance stock options by eligible employees under the Tata Elxsi Limited Performance Stock Option Plan 2023. The company's paid-up equity share capital increased to Rs. 62,29,52,290 divided into 6,22,95,229 equity shares of Rs. 10 each from the previous Rs. 62,29,37,580 divided into 6,22,93,758 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1764757509796,
            "Source": "stock"
        },
        {
            "Title": "Tata Elxsi Partners with Druid Software to Expand Enterprise 5G Ecosystem Through xG-Force Lab Platform",
            "Summary": "Tata Elxsi announced a strategic partnership with Druid Software to integrate 4G/5G core network functionality and IMS architecture through its xG-Force Lab-as-a-Service platform. The collaboration enables enterprises and CSPs to validate, test, and deploy integrated cellular solutions across manufacturing, logistics, utilities, healthcare, transportation, and smart campuses while reducing time-to-market.",
            "Sentiment": "positive",
            "PublishDate": 1764234575070,
            "Source": "stock"
        },
        {
            "Title": "Tata Elxsi Joins GSMA to Enhance Network Monetization for Automotive and Drone Sectors",
            "Summary": "Tata Elxsi has joined GSMA with the objective of boosting network monetization and API utilization specifically for automotive and drone industries. The partnership aims to assist operators in discovering new revenue sources through enhanced network capabilities and API integration.",
            "Sentiment": "positive",
            "PublishDate": 1762409160282,
            "Source": "stock"
        },
        {
            "Title": "Tata Elxsi Reports 2.9% Revenue Growth in Q2 FY26, Expects Double-Digit Growth in Transportation and Healthcare for FY27",
            "Summary": "Tata Elxsi reported operating revenue of INR 918.1 crores for Q2 FY26, representing 2.9% growth in actual currencies and 1% in constant currencies quarter-on-quarter. The company achieved EBITDA of INR 193.3 crores with a 21.1% margin and PBT of INR 214.7 crores at 22.2% margin. The US market grew 7.9% quarter-on-quarter, while the Media & Communication business showed 6.8% sequential growth driven by large deal ramp-ups. The transportation business, accounting for over 53% of revenues, registered 0.7% growth and opened a second engineering center with Suzuki focusing on cloud hardware and simulation. Healthcare and Life Sciences declined 2.3% due to conclusion of large regulatory programs, while system integration business grew 20.5%. The company launched a Dedicated Technology Center for Bayer devices and received an award from Dell Technologies. Management expects H2 to perform better than H1, with double-digit growth targeted for transportation and healthcare businesses in FY27. A cybersecurity incident at a top automotive client impacted project starts in September, though the company would have shown positive constant currency growth without this incident.",
            "Sentiment": "positive",
            "PublishDate": 1760519043911,
            "Source": "earnings"
        },
        {
            "Title": "Tata Elxsi Reports Sequential Recovery in September Quarter, but Analysts Maintain Cautious Outlook on Valuations",
            "Summary": "Tata Elxsi reported September quarter results that were largely in-line with expectations, showing constant currency revenue growth after two quarters of decline. EBIT margins expanded by 30 basis points compared to the June quarter. The Media vertical led growth at 3.7% quarter-over-quarter, while Transportation declined 0.5% and Healthcare fell 4.6%. Employee headcount decreased 1.5% from last quarter and 6.6% year-over-year. Despite the sequential recovery, major brokerages maintained negative ratings. Avendus kept a 'Sell' rating with ₹4,690 price target, trimming revenue estimates by 2% for current and next financial years. Kotak maintained 'Sell' at ₹4,000, forecasting 5.4% constant currency revenue decline for FY26. JPMorgan retained 'Underweight' at ₹4,000, noting revenue beat expectations but margins fell short. Motilal Oswal kept 'Sell' at ₹4,400, citing steep valuations at 52 times forward earnings. Among 18 analysts covering the stock, 15 have 'sell' ratings, two have 'buy', and one has 'sell'. Shares closed 2.2% higher at ₹5,580, but remain down over 40% from record highs and 18% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1760067469436,
            "Source": "stock"
        },
        {
            "Title": "Tata Elxsi Develops Growth Strategy Through AI Solutions and Strategic Partnerships",
            "Summary": "Tata Elxsi is building a multi-year growth pipeline through three key initiatives: AI-first offerings, software-defined vehicle partnerships with Suzuki, and healthcare innovation collaborations with Bayer. The company is positioning itself across technology sectors through these strategic partnerships and AI-focused solutions.",
            "Sentiment": "positive",
            "PublishDate": 1760027845955,
            "Source": "stock"
        },
        {
            "Title": "Tata Elxsi Reports Higher Quarterly Net Profit and Revenue",
            "Summary": "Tata Elxsi reported net profit of 1.55 billion rupees compared to 1.44 billion rupees in the previous quarter. The company's revenue increased to 9.18 billion rupees from 8.92 billion rupees quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760009722595,
            "Source": "earnings"
        },
        {
            "Title": "Tata Elxsi Stock Rises 2% Ahead of Quarterly Results Amid Revenue Growth Expectations",
            "Summary": "Tata Elxsi shares traded nearly 2% higher ahead of quarterly earnings results. Analysts estimate a 2.2% sequential revenue increase to ₹912 crore and a 5.3% rise in profit after tax to ₹152 crore. The company expects growth driven by deal ramp-ups in transportation and media communications verticals, though healthcare and medical devices face regulatory challenges. The stock has declined over 18% this year and trades at 42 times estimated price-to-earnings ratio. Previous quarter showed 3.9% sequential revenue decline, with media communications down 5.5% and healthcare declining 6.7%. Jaguar Land Rover accounts for 23% of the company's revenue. Shares were trading 1.4% higher at ₹5,535.5, significantly below the 52-week high of ₹8,027.",
            "Sentiment": "neutral",
            "PublishDate": 1759989758842,
            "Source": "earnings"
        },
        {
            "Title": "Tata Elxsi Partners with Bayer to Launch Global Medical Device Technology Center",
            "Summary": "Tata Elxsi and Bayer have announced a partnership to establish a global technology center specializing in medical devices for radiology applications.",
            "Sentiment": "positive",
            "PublishDate": 1757491335922,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Elxsi Launches Subscription Hub Platform with Evergent for Media and Telecom Operators",
            "Summary": "Tata Elxsi has launched a new Subscription Hub platform in partnership with Evergent, targeting media and telecom operators. The platform features smart bundling capabilities and is designed to deliver a 20-30% increase in Average Revenue Per User (ARPU) for operators using the service.",
            "Sentiment": "positive",
            "PublishDate": 1756973019918,
            "Source": "stock"
        },
        {
            "Title": "Tata Elxsi Opens First Full-Vehicle Cloud Validation Center With Suzuki",
            "Summary": "Tata Elxsi has opened its first full-vehicle cloud validation center in partnership with Suzuki. The facility is designed to boost software-defined vehicle projects between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1755760086328,
            "Source": "stock"
        },
        {
            "Title": "Tata Elxsi Forms Strategic Partnership with Kavia AI",
            "Summary": "Tata Elxsi has entered into a strategic partnership with Kavia AI. No additional details about the nature, scope, or objectives of this partnership were provided.",
            "Sentiment": "positive",
            "PublishDate": 1753768412272,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Elxsi Partners with Synopsys for Software-Defined Vehicle Development",
            "Summary": "Tata Elxsi has announced a collaboration with Synopsys to enhance the development of software-defined vehicles. The partnership will utilize advanced ECU (Electronic Control Unit) virtualization technology. This collaboration aims to boost the capabilities in creating innovative automotive software solutions.",
            "Sentiment": "positive",
            "PublishDate": 1752212512000,
            "Source": "default"
        },
        {
            "Title": "Tata Elxsi Expects Revenue Stability and Growth in Digital Deals",
            "Summary": "Tata Elxsi anticipates stable revenue from its largest customer for the rest of the year. The company is targeting growth in the digital deal sector during Q2, supported by an increase in deals and a robust deal pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1752202918000,
            "Source": "default"
        },
        {
            "Title": "Tata Elxsi: Q1 Profit Drops 22% YoY Amid Macro Headwinds",
            "Summary": "Tata Elxsi reported a 22% YoY decline in Q1FY26 consolidated net profit to Rs 144 crore. Revenue fell 3.7% to Rs 892 crore due to macroeconomic uncertainties and client-specific challenges. EBITDA decreased 26% to Rs 187 crore. The company secured strategic deals in technology and medical device sectors despite market difficulties.",
            "Sentiment": "negative",
            "PublishDate": 1752202303000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Elxsi Reports Decrease in Q1 Net Profit and Revenue",
            "Summary": "Tata Elxsi has reported its quarterly results. The company's net profit for Q1 was 1.44 billion rupees, down from 1.84 billion rupees in the same quarter last year. Revenue also decreased to 8.92 billion rupees from 9.26 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752192400000,
            "Source": "default"
        },
        {
            "Title": "Tata Elxsi Reports Q1 FY24 Financial Results with Segment-wise Performance",
            "Summary": "Tata Elxsi reported its Q1 financial results. Net profit decreased to 1.44 billion rupees from 1.72 billion rupees quarter-over-quarter. Revenue slightly declined to 8.92 billion rupees from 9 billion rupees quarter-over-quarter. The healthcare and lifesciences segment saw a 6.7% quarterly decline due to US tariffs, with recovery expected in the second half. The media & communication segment dropped 5.5% quarter-over-quarter due to deal changes, with recovery anticipated in Q2. The transportation business, accounting for over 50% of total revenues, grew 3.7% quarter-over-quarter, while constant currency figures remained stable.",
            "Sentiment": "neutral",
            "PublishDate": 1752150689000,
            "Source": "result"
        },
        {
            "Title": "Tata Elxsi: Q1 Profit Falls 16%, Misses Estimates",
            "Summary": "Tata Elxsi's Q1 FY2026 net profit declined 16% to Rs 144.4 crore, below analyst estimates. Revenue decreased 1.8% to Rs 892.10 crore. EBIT fell 11% to Rs 162.4 crore with margin at 18.2%. Transportation segment grew 3.3%, while media and healthcare segments declined.",
            "Sentiment": "negative",
            "PublishDate": 1752148967000,
            "Source": "earnings"
        },
        {
            "Title": "TCS, Tata Elxsi, IREDA: Q1 Results Preview and Expectations",
            "Summary": "TCS is expected to report Q1 net profit of Rs 12,251 crore and revenue of Rs 64,628 crore. Tata Elxsi's Q1 estimates show net profit of Rs 170 crore and revenue of Rs 914 crore. Analysts anticipate modest growth for TCS and weakness across segments for Tata Elxsi. IREDA will also report Q1 results on July 10.",
            "Sentiment": "neutral",
            "PublishDate": 1752110577000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Elxsi: Strategic EV Partnership with Infineon for Indian Market",
            "Summary": "Tata Elxsi and Infineon Technologies have formed a strategic partnership to develop EV solutions for the Indian market. They will focus on creating ready-to-deploy systems for various vehicle types using Infineon's semiconductor technologies. The collaboration aims to produce automotive-grade, cost-efficient, and safety-compliant EV subsystems, including high-voltage inverters, battery management systems, and onboard chargers.",
            "Sentiment": "positive",
            "PublishDate": 1750304987000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Elxsi Ltd.: Last Day to Buy Shares for Record Dividend",
            "Summary": "June 10 is the last day to buy Tata Elxsi shares to qualify for the final dividend of Rs 75 per share for FY2025, the company's highest ever. The record date is June 11, with a total dividend payout of Rs 467 crore, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1749523291000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Elxsi: Partners with Mercedes-Benz R&D India for Vehicle Software Development",
            "Summary": "Tata Elxsi has partnered with Mercedes-Benz Research and Development India for vehicle software engineering and software-defined vehicle development. This expands their decade-long engagement and aims to scale next-generation automotive software development from India. Tata Elxsi's stock rose 2.5% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747209660000,
            "Source": "order&deals"
        },
        {
            "Title": "Tata Elxsi Collaborates with Mercedes-Benz for Vehicle Engineering and SDV Development",
            "Summary": "Tata Elxsi has announced a collaboration with Mercedes-Benz Research and Development India (MBRDI) for vehicle engineering and Software Defined Vehicle (SDV) development. The partnership aims to scale next-generation automotive development and innovation from India.",
            "Sentiment": "positive",
            "PublishDate": 1747195490000,
            "Source": "default"
        },
        {
            "Title": "Tata Elxsi: AI Partnership with European Sports Medicine College",
            "Summary": "Tata Elxsi and the European College of Sport and Exercise Physicians (ECOSEP) have partnered to advance sports and exercise medicine using AI. The collaboration aims to develop AI-driven solutions for diagnostics, personalized treatment, injury prevention, and athlete monitoring.",
            "Sentiment": "positive",
            "PublishDate": 1746610872000,
            "Source": "normal_news"
        },
        {
            "Title": "Tata Elxsi and Ecosep Partner to Advance Sports Medicine with AI",
            "Summary": "Tata Elxsi and Ecosep have formed a strategic partnership aimed at revolutionizing sports medicine through the application of artificial intelligence. This collaboration is expected to bring innovative solutions to the field of sports-related medical care and treatment.",
            "Sentiment": "positive",
            "PublishDate": 1746593875000,
            "Source": "default"
        },
        {
            "Title": "Tata Elxsi: Q4 Results Reflect Near-Term Challenges, Strategic Wins Offer Hope",
            "Summary": "Tata Elxsi faces near-term growth challenges due to global headwinds, project delays, and client spending cuts. DRChoksey reduces FY26E/FY27E EPS estimates by 4% each to Rs 142.3 and Rs 169.8 respectively. Strategic deal wins may partially offset these challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1745242502000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Elxsi: Share Price Jumps 5% on Q4 Results and Dividend Announcement",
            "Summary": "Tata Elxsi's share price increased by 5% following the announcement of Q4 results and a ₹75 per share dividend. The company reported a 13.4% quarterly drop in net profit to ₹172.4 crore, attributed to ongoing challenges in its transportation sector.",
            "Sentiment": "neutral",
            "PublishDate": 1745211148000,
            "Source": "result"
        },
        {
            "Title": "Tata Elxsi: Q4 Performance Disappoints, Brokerages Lower Targets",
            "Summary": "Tata Elxsi's Q4 FY2025 results fell short of expectations. Morgan Stanley and JPMorgan maintain Underweight ratings and lower target prices. Auto revenues declined 9.7% QoQ, media and telecom dropped 6.3% QoQ. Management is optimistic about FY2026 recovery, but brokerages remain cautious. New deal wins include a €50 mn auto deal and a $100 mn media deal.",
            "Sentiment": "negative",
            "PublishDate": 1745204675000,
            "Source": "earnings"
        }
    ]
}