{
    "Symbol": "TATACAP",
    "ISIN": "INE976I01016",
    "News": [
        {
            "Title": "Tata Capital Makes Q3 FY26 Earnings Call Available",
            "Summary": "Tata Capital Limited has made the audio recording of its earnings conference call for Q3 FY26 available on its website, covering financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768842459774,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Reports Q3 FY26 IPO Proceeds Utilization",
            "Summary": "Tata Capital Limited submitted its monitoring agency report for Q3 FY26, showing 98% utilization of ₹6,846 crore fresh issue proceeds with no deviations from stated objectives.",
            "Sentiment": "positive",
            "PublishDate": 1768842373927,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Q3FY26 Consolidated Net Profit Rises 16.9%",
            "Summary": "Tata Capital's Q3FY26 consolidated net profit increased 16.9% YoY to ₹1,260.00 crore, while consolidated revenue grew 12.3% to ₹7,975.00 crore, demonstrating strong group-wide performance.",
            "Sentiment": "positive",
            "PublishDate": 1768823645921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Q3FY26: AUM grows 7% QoQ to ₹2.61 lakh cr",
            "Summary": "Tata Capital reports strong Q3FY26 performance with AUM of ₹2,60,698 crores (up 7% QoQ) and PAT of ₹1,290 crores (up 18% QoQ). Motor Finance business achieves PAT breakeven during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768822172699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Q3 Profit Surges 20% QoQ to ₹790 Crore",
            "Summary": "Tata Capital reported strong Q3 results with net profit rising 19.7% QoQ to ₹790 crore. Net interest income surged 44% QoQ to ₹2,541 crore, driven by robust lending growth across segments.",
            "Sentiment": "positive",
            "PublishDate": 1768821957514,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Q3FY26 Net Profit Surges 9.9% to ₹789.86 Cr",
            "Summary": "Tata Capital Limited reported strong Q3FY26 results with net profit rising 9.9% YoY to ₹789.86 crores. Total income grew 7.6% to ₹5,786.08 crores driven by higher interest income of ₹5,219.64 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768821638358,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Q3FY26 earnings call on Jan 19, 2026",
            "Summary": "Tata Capital Limited announces earnings conference call scheduled for January 19, 2026 at 5:15 PM IST to discuss Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768221300320,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital shares rise 3% on Societe Generale deal",
            "Summary": "Tata Capital stock gained 3% after Societe Generale acquired 14.33 lakh shares worth ₹50.82 crore via block deal at ₹354.50 per share, signaling rising institutional interest.",
            "Sentiment": "positive",
            "PublishDate": 1768214506092,
            "Source": "co_actions_results"
        },
        {
            "Title": "Societe Generale buys additional Tata Capital stake",
            "Summary": "French bank Societe Generale acquired 14,33,651 additional equity shares in Tata Capital through a block deal worth ₹51.00 crores at ₹354.50 per share on Friday.",
            "Sentiment": "positive",
            "PublishDate": 1768022199263,
            "Source": "co_actions_results"
        },
        {
            "Title": "Societe Generale buys Rs 51 cr Tata Capital stake",
            "Summary": "French bank Societe Generale acquired additional 14.33 lakh shares in Tata Capital for Rs 51 crore at Rs 354.5 per share, while Marshall Wace sold equivalent stake post anchor lock-in expiry.",
            "Sentiment": "neutral",
            "PublishDate": 1767974187649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Societe Generale Acquires Tata Capital Shares",
            "Summary": "French banking giant Societe Generale has acquired 14.33 lakh shares of Tata Capital at ₹354.50 per share, marking a significant institutional investment in the Indian financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1767973918812,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital shares worth ₹2,573 cr unlock today",
            "Summary": "71.2 million shares of Tata Capital become tradeable as three-month lock-in period ends. Stock up 11% from issue price with positive analyst sentiment.",
            "Sentiment": "positive",
            "PublishDate": 1767752108248,
            "Source": "stocks"
        },
        {
            "Title": "Tata Capital Board Meet Set for Jan 19 for Q3FY26 Results",
            "Summary": "Tata Capital Limited has scheduled its board meeting for January 19, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767599921882,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Settles SEBI Case for ₹32 Lakh",
            "Summary": "Tata Capital Limited paid ₹32 lakh settlement amount to SEBI for violations related to NCD issuances by erstwhile Tata Motors Finance Limited, which merged with the company in May 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766505507268,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Transfers Tata Capital Stake via Scheme",
            "Summary": "Tata Motors Passenger Vehicles Limited transferred 43,26,651 equity shares (0.10%) in Tata Capital Limited to Tata Motors Limited through composite scheme of arrangement on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766146816109,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Capital Settles SEBI Case for Rs 14.4 Lakh Over Preference Share Violations",
            "Summary": "Tata Capital Limited received a settlement order from SEBI after filing a suo-motu settlement application for violations related to unlisted Cumulative Redeemable Preference Shares issued in 2015 and 2017. The company violated applicable provisions by downselling CRPSs to more than 200 investors within six months of allotment, making them deemed public issues, and has paid a settlement amount of Rs 14,40,000.",
            "Sentiment": "negative",
            "PublishDate": 1764766513123,
            "Source": "corporate_governance"
        },
        {
            "Title": "TATA Capital Settles with SEBI on Compliance Issues",
            "Summary": "TATA Capital has reached a settlement with SEBI regarding compliance-related matters. The settlement resolves regulatory issues between the financial services company and the securities market regulator.",
            "Sentiment": "neutral",
            "PublishDate": 1764761826827,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Capital Allots Rs 1,550 Crore Secured NCDs Through Private Placement",
            "Summary": "Tata Capital Limited allotted 1,55,000 secured redeemable non-convertible debentures worth Rs 1,550 crore on November 14, 2025, comprising two series with tenors of 3 and 5 years respectively. The NCDs carry CRISIL AAA/Stable rating and are secured by pari-passu charge on the company's moveable properties including receivables and book debts.",
            "Sentiment": "neutral",
            "PublishDate": 1763136151289,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Capital Shareholders Approve Board Appointments Through Postal Ballot",
            "Summary": "Tata Capital Limited shareholders approved two board appointments through postal ballot voting. The company appointed Ms. Geetha Ravichandran as an Independent Director through a special resolution and Mr. Ankur Verma as a Non-Executive (Non-Independent) Director through an ordinary resolution. The remote e-voting process ran from October 10, 2025, to November 8, 2025, with the cut-off date set as October 3, 2025. Both resolutions received overwhelming support, with 365,78,47,940 valid votes cast in favor and minimal opposition. P.N. Parikh of Parikh Associates served as the scrutinizer for the postal ballot process. The voting results showed 99.9999% votes in favor for both appointments, with 90.656% of total votes polled.",
            "Sentiment": "positive",
            "PublishDate": 1762772987193,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Capital Reports 33% Profit Growth in First Earnings Call Post-IPO",
            "Summary": "Tata Capital Limited reported quarterly results with AUM of INR 2.16 lakh crores, reflecting 22% year-over-year growth and 4.1% sequential growth. Profit after tax reached INR 1,128 crores, marking 33% growth excluding non-recurring income. Credit costs improved by 30 basis points to 1.1% compared to the previous quarter, while Net NPA remained stable at 0.6%. Return on assets stood at 2.2%, showing 20 basis points improvement year-over-year. The company provided guidance for full-year AUM growth of 22-25% excluding Motor Finance business and 18-20% on merged basis. Management expects credit costs to moderate further, targeting 1-1.1% for the year excluding Motor Finance. The housing finance subsidiary showed strong performance with 30% AUM growth and 28% profit growth. Cost of funds decreased by 47 basis points to 7.4% from the previous year. The company maintains a diversified portfolio across 254 lending products with strong capital adequacy ratio of 17.3%.",
            "Sentiment": "positive",
            "PublishDate": 1762204443330,
            "Source": "earnings"
        },
        {
            "Title": "Tata Capital Receives USD 16 Million GCF Fund for Green Start-up Ecosystem",
            "Summary": "Tata Capital Limited has partnered with the Green Climate Fund under the BEACON INDIA Programme to support early-stage climate-tech start-ups across India. The company will receive a revolving facility of USD 15.85 million from GCF, plus an additional USD 3 million grant to make financing more affordable for climate-focused start-ups. Tata Capital will contribute USD 47.6 million of its own funds to the initiative. The programme is implemented in collaboration with Small Industries Development Bank of India and TREC-STEP. The initiative is expected to reduce over 1.1 million tonnes of CO2 emissions and benefit nearly 2.9 million people through climate adaptation and mitigation efforts. This marks Tata Capital as the first Indian entity to collaborate with GCF on two distinct climate programmes, following their initial partnership in 2019 for rooftop solar financing.",
            "Sentiment": "positive",
            "PublishDate": 1762150854778,
            "Source": "stock"
        },
        {
            "Title": "Tata Capital Plans Double-Digit AUM Growth and ₹7 Lakh Crore Balance Sheet Target by FY28",
            "Summary": "Tata Capital has announced expansion plans targeting double-digit Assets Under Management (AUM) growth across retail and infrastructure segments for FY26. The company aims to build a ₹7 lakh crore balance sheet by FY28 through strengthening its digital lending, housing finance, and wealth management platforms. The strategy focuses on technology integration and cross-sell synergies to drive long-term profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761667791938,
            "Source": "stock"
        },
        {
            "Title": "Tata Capital Reports 33% PAT Growth and 22% AUM Increase in Q2FY26",
            "Summary": "Tata Capital Limited reported strong quarterly results with profit after tax growing 33% year-on-year to ₹1,128 crore in Q2FY26, excluding non-recurring income. Assets under management increased 22% year-on-year to ₹2,15,574 crore as of September 30, 2025, excluding Motor Finance business. Net total income rose 28% to ₹3,330 crore compared to the same quarter last year. The company's annualized credit cost improved to 1.1% from 1.4% in the previous quarter, representing a 30 basis points sequential decline. Cost to income ratio improved to 36.6% from 40.1% in the prior year. The Motor Finance business acquisition was completed on May 8, 2025, and the company expects to return this segment to profitability by Q4FY26. Material subsidiary Tata Capital Housing Finance Limited showed strong performance with 30% AUM growth and 28% PAT increase. The company maintains AAA credit ratings from CRISIL, ICRA, CARE and India Ratings, with S&P Global Ratings upgrading the long-term rating to BBB/Stable.",
            "Sentiment": "positive",
            "PublishDate": 1761650308299,
            "Source": "earnings"
        },
        {
            "Title": "Tata Capital Reports Growth in Q2 Net Profit and Revenue",
            "Summary": "Tata Capital reported quarterly net profit of 10.97 billion rupees compared to 10.76 billion rupees in the same period last year. Revenue increased to 77.37 billion rupees from 71.85 billion rupees year-over-year. EBITDA rose to 56 billion rupees from 52.7 billion rupees, while EBITDA margin declined to 72.40% from 73.35% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761648307011,
            "Source": "earnings"
        },
        {
            "Title": "Tata Capital to Announce First Post-IPO Quarterly Results on October 28",
            "Summary": "Tata Capital Ltd., the financial services arm of Tata Group, will release its second quarter financial results on October 28, marking its first quarterly earnings report since going public. The company's Board of Directors will meet to approve unaudited standalone and consolidated financial results for the quarter and half-year ended September 30. Tata Capital made its stock market debut on October 13 at Rs 330 per share, representing a 1.2% premium to its IPO price of Rs 326. The Rs 15,512-crore IPO was subscribed nearly two times. In the first quarter, the company reported standalone revenue of Rs 5,574 crore, up 3% year-on-year, and net profit of Rs 568 crore, an 11% increase from the previous year. An earnings conference call is scheduled for 5 p.m. on October 28 with senior management including MD & CEO Rajiv Sabharwal and CFO Rakesh Bhatia.",
            "Sentiment": "neutral",
            "PublishDate": 1761541021248,
            "Source": "earnings"
        },
        {
            "Title": "India Ratings Withdraws All Credit Ratings for Tata Capital Limited",
            "Summary": "India Ratings and Research has withdrawn credit ratings for Tata Capital Limited's debt instruments at the company's request. The withdrawn ratings covered commercial paper worth Rs 80 billion, bank loan facilities of Rs 10 billion, and non-convertible debentures of Rs 2.50 billion. All instruments previously held IND AAA/Stable ratings for long-term debt and IND A1+ for short-term commercial paper. The rating withdrawal follows Ind-Ra's policy as the rating was unutilized and no longer required to be maintained. Tata Capital ceased to be a core investment company from January 1, 2024, and now holds an NBFC Investment Credit Company license. The company was recently listed on October 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761238052570,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Capital Shares Rise 1.4% on Debut; Brokerages Set Rs 360 Target Price",
            "Summary": "Tata Capital made its stock market debut, listing at Rs 330, which was 1.23% above its IPO price, and closed 1.4% higher on its first trading day. Emkay Global and JM Financial initiated coverage with buy ratings and target prices of Rs 360, indicating potential 10% upside from the IPO price. The brokerages cited Tata Group parentage, AAA credit rating, and strong credit profile as key positives. Emkay expects 30% earnings per share CAGR during FY25-28, driven by vehicle finance segment turnaround and higher secured loans share. Assets under management are projected to grow at 24% CAGR over the same period. The IPO was subscribed 1.95 times, with qualified institutional buyers oversubscribing 3.42 times. Tata Capital raised Rs 4,642 crore from anchor investors, led by LIC which acquired shares worth nearly Rs 700 crore. The company is India's third-largest diversified NBFC with total assets of Rs 2.52 lakh crore and maintains a gross NPA ratio of 2.1%. Between FY23 and FY25, revenue rose 56% while profit after tax increased 10% to Rs 3,655 crore.",
            "Sentiment": "positive",
            "PublishDate": 1760415142655,
            "Source": "stock"
        }
    ]
}