{
    "Symbol": "TATVA",
    "ISIN": "INE0GK401011",
    "News": [
        {
            "Title": "Tatva Chintan Pharma Files Insider Trading Disclosure",
            "Summary": "Tatva Chintan Pharma Chem Limited files insider trading disclosure under SEBI regulations following inter-se transfer of 7,15,345 equity shares between promoter entities.",
            "Sentiment": "neutral",
            "PublishDate": 1770639268665,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ajay Patel to Acquire 3.06% Stake in Tatva Chintan",
            "Summary": "Ajay Mansukhlal Patel proposes to acquire 7,15,345 equity shares (3.06%) in Tatva Chintan Pharma Chem through inter-se transfer from HUF dissolution, scheduled for February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769682179662,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tatva Chintan Sets ₹200-250 Cr Revenue Target",
            "Summary": "Tatva Chintan Pharma Chem projects new agro and pharma intermediates to generate ₹200-250 crores revenue by calendar year 2027, indicating strong growth trajectory in specialty chemicals segment.",
            "Sentiment": "positive",
            "PublishDate": 1769051773545,
            "Source": "stocks"
        },
        {
            "Title": "Tatva Chintan Plans ₹250-275 Cr Jolva Plant",
            "Summary": "Tatva Chintan Pharma Chem announces new greenfield facility at Jolva with CapEx of ₹250-275 crores, 18-month execution timeline, and groundbreaking in current quarter.",
            "Sentiment": "positive",
            "PublishDate": 1769051743436,
            "Source": "stocks"
        },
        {
            "Title": "Tatva Chintan Eyes 20-22% EBITDA Margins by FY27",
            "Summary": "Tatva Chintan Pharma Chem expects EBITDA margins to stabilize between 20-22% by FY27, driven by increased plant occupancy and utilization of new manufacturing blocks during conference call guidance.",
            "Sentiment": "positive",
            "PublishDate": 1769051715455,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tatva Chintan Projects 20-30% Revenue Growth",
            "Summary": "Tatva Chintan Pharma Chem provides guidance for FY26 and FY27, targeting revenue growth of 20% to 30% year-on-year during conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1769051683008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tatva Chintan Pharma Sets ₹850-900 Cr Revenue Target",
            "Summary": "Tatva Chintan Pharma Chem management projects achieving ₹850-900 crores revenue from current capacity within 2.5-3 years, indicating significant growth potential from existing operations.",
            "Sentiment": "positive",
            "PublishDate": 1769051654577,
            "Source": "stocks"
        },
        {
            "Title": "Tatva Chintan Eyes 7-8% Revenue from Electrolytes",
            "Summary": "Tatva Chintan Pharma Chem projects electrolyte salts to contribute 7-8% of revenue by calendar year 2026, up from current 1%, indicating significant business expansion in battery materials segment.",
            "Sentiment": "positive",
            "PublishDate": 1769051563740,
            "Source": "stocks"
        },
        {
            "Title": "Tatva Chintan Q3 FY26 Profit Surges 10,900% YoY",
            "Summary": "Tatva Chintan Pharma Chem reports exceptional Q3 FY26 performance with revenue rising 52.9% YoY to ₹1,313.34 million and net profit jumping to ₹151.65 million from ₹1.38 million in Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768992217530,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tatva Chintan schedules Q3FY26 earnings call",
            "Summary": "Tatva Chintan Pharma Chem Limited announces earnings call for January 21, 2026, to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768209050786,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Strong Q2 Turnaround with 99.2 Million Rupees Net Profit",
            "Summary": "Tatva Chintan Pharma Chem delivered a significant turnaround in Q2 performance, reporting a consolidated net profit of 99.2 million rupees compared to a loss of 6.64 million rupees in the same period last year. The company's revenue grew substantially to 1.24 billion rupees from 835 million rupees year-over-year. EBITDA increased to 222 million rupees from 56 million rupees, while EBITDA margin expanded to 17.99% from 6.69% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762129241012,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Strong Q2 Turnaround with 99.2M Rupees Net Profit",
            "Summary": "Tatva Chintan Pharma Chem delivered a significant turnaround in its quarterly performance, posting a net profit of 99.2 million rupees compared to a loss of 6.64 million rupees in the same period last year. Revenue grew substantially to 1.24 billion rupees from 835 million rupees year-over-year. The company's EBITDA surged to 222 million rupees from 56 million rupees, while EBITDA margin expanded to 17.99% from 6.69% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761906267572,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Clarifies Price Movement to Stock Exchanges",
            "Summary": "Tatva Chintan Pharma Chem Limited responded to inquiries from NSE and BSE regarding price movement in its equity shares. The company stated it has been complying with disclosure requirements and has not withheld any material information that would affect share price or volume behavior. The company attributed the price movement to market conditions and stated it is market driven.",
            "Sentiment": "neutral",
            "PublishDate": 1761286596811,
            "Source": "stock"
        },
        {
            "Title": "Ratan Tata's Rs 1 Lakh Car Vision Shocked Team, Singur Plant Choice Had Strategic and Political Reasons",
            "Summary": "Ratan Tata's ambitious plan to build a Rs 1 lakh car for the common man initially shocked his team, according to his former associate Niira Radia. The Tata Nano was unveiled in 2008 and gained global attention as the 'people's car.' Tata strategically chose Singur, West Bengal for manufacturing to help the industrially stagnant region and because it was represented by opposition leader Rabindranath Bhattacharya. However, the project faced protests from farmers who accused Tata Group of unfairly taking their land, with politician Mamata Banerjee supporting the farmers. The protests escalated, forcing Tata Group to withdraw from Singur in 2008 and move operations to Sanand, Gujarat. Radia noted that Tata believed the Singur project would have developed the Kolkata-Singur corridor similar to how Sanand has now developed into a manufacturing hub.",
            "Sentiment": "neutral",
            "PublishDate": 1760010731489,
            "Source": "stock"
        },
        {
            "Title": "Tata Group Sources Deny Internal Power Struggle Claims",
            "Summary": "Sources close to the Tata Group have rejected reports suggesting an internal power struggle within Tata Trusts. The sources dismissed claims that Mehli Mistry, first cousin of Cyrus Mistry and close associate of Ratan Tata, attempted to gain control within the organization, calling these reports a 'false narrative'.",
            "Sentiment": "neutral",
            "PublishDate": 1759906054316,
            "Source": "corporate_governance"
        },
        {
            "Title": "Government to Meet Tata Group Leadership Over Internal Board Dispute",
            "Summary": "Tata Group representatives led by Noel Tata will meet with senior central ministers to address an ongoing boardroom struggle within the organization. The leadership is divided into two camps - one led by Noel Tata and another by Mehli Mistry. The Mistry camp claims it has been excluded from key strategic decisions at Tata Sons, while the Tata camp maintains its decisions benefit all shareholders. The conflict escalated after a contentious Tata Trusts meeting that resulted in Vijay Singh's exit from the Tata Sons board. The government is intervening due to concerns that Tata Group distress could impact the broader corporate sector. Discussions will also cover Tata Sons' mandatory listing under RBI guidelines. Tata Trusts owns 66% of Tata Sons, the group's primary investment arm. Tata Sons has applied to cancel its core investment company registration to avoid mandatory listing by September 2025 and has become net zero debt. The RBI is still considering the cancellation request.",
            "Sentiment": "negative",
            "PublishDate": 1759774072271,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Group to Manufacture Airbus H125 Helicopters in Karnataka with 2027 Delivery Target",
            "Summary": "Tata Group will manufacture Airbus H125 helicopters in Karnataka. The first deliveries are expected in 2027.",
            "Sentiment": "positive",
            "PublishDate": 1759322692024,
            "Source": "stock"
        },
        {
            "Title": "Tata Group Stocks Underperform While One Stock Records Best Month in 16 Years",
            "Summary": "Tata Group stocks have experienced poor performance recently. TCS shares reached a 52-week low, Titan declined over 7% this month, and Tata Elxsi and Tata Technologies showed minimal movement. Despite the overall underperformance across the group, one Tata Group stock achieved its best monthly performance in over 16 years, though the specific company was not identified in the available information.",
            "Sentiment": "neutral",
            "PublishDate": 1759233240437,
            "Source": "stock"
        },
        {
            "Title": "Tatva Chintan Reports Sharp Decline in Chemical Exports",
            "Summary": "Tatva Chintan reported an 86% year-over-year decline in chemical exports and a 91% month-over-month decline. The company experienced significant drops in export performance across both comparative periods.",
            "Sentiment": "negative",
            "PublishDate": 1754976449310,
            "Source": "stock"
        },
        {
            "Title": "Tatva Chintan Pharma Shares Surge 20% Following Strong Quarterly Results and New Investor Interest",
            "Summary": "Tatva Chintan Pharma Chem Ltd. shares jumped nearly 20% to reach a 52-week high of ₹1,218.5 following strong quarterly performance. The company reported a 27.7% increase in profit after tax to ₹6.7 crore, while revenue grew 10.8% to ₹117 crore. EBITDA expanded 37.4% to ₹17 crore, with operating margins improving to 14.8% from 12% in the previous year. The stock also gained momentum after Mukul Agrawal acquired a 1.28% stake in the company. Promoters hold 72% of the company at the end of the June quarter. The stock has gained 27% in the past month and 39.11% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1753422760618,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Reports Strong Growth Driven by Green Chemistry and Expanded Manufacturing",
            "Summary": "Tatva Chintan is experiencing strong growth supported by its leadership in green chemistry, expanded manufacturing capacity, and increasing global demand for specialty chemicals. The company operates across three key segments: PTC (Phase Transfer Catalysts), SDA (Structural Directing Agents), and battery materials, all of which are benefiting from rising international demand for niche specialty chemicals.",
            "Sentiment": "positive",
            "PublishDate": 1753369583367,
            "Source": "stock"
        },
        {
            "Title": "Tatva Chintan Reports Q1 FY2026 Results, Approves Director Reappointments and CFO Resignation",
            "Summary": "Tatva Chintan Pharma Chem Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 1,168.64 million and net profit of Rs 57.13 million for the quarter. The board approved reappointments of three key directors - Managing Director Chintan Nitinkumar Shah, and Whole-time Directors Ajaykumar Mansukhlal Patel and Shekhar Rasiklal Somani - for one-year terms from February 1, 2026 to January 31, 2027. Additionally, three Independent Directors - Subhash Ambubhai Patel, Manher Chimanlal Desai, and Avani Rajesh Umatt - were reappointed for five-year terms from February 27, 2026 to February 26, 2031. All reappointments are subject to shareholder approval at the upcoming Annual General Meeting. The company also announced the resignation of Chief Financial Officer Ashok Bothra, effective August 30, 2025, citing personal and professional goals as reasons for his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1753352669050,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Pharma Chem: Mukul Agrawal's 1.28% Stake Acquisition Sparks 14% Stock Surge",
            "Summary": "Prominent investor Mukul Agrawal acquired a 1.28% stake (3 lakh shares) in Tatva Chintan Pharma Chem, driving the stock up 13.6% to Rs 1,062.70. The company's shares, previously down 65% from peak, have rallied 21.4% year-to-date. Domestic mutual funds slightly reduced their stake to 5.07%, while Goldman Sachs maintained a 2.59% stake.",
            "Sentiment": "positive",
            "PublishDate": 1752818233000,
            "Source": "block_deals"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Ltd: Mukul Agrawal's Stake Acquisition Boosts Stock",
            "Summary": "Veteran investor Mukul Agrawal acquired a 1.28% stake in Tatva Chintan Pharma Chem Ltd during Q2 2025. The stock surged 12% on July 18, 2025, following this disclosure. Promoters hold 72% stake, while mutual funds slightly reduced their holdings. The stock remains below its IPO price of ₹1,083 despite a 23% year-to-date increase.",
            "Sentiment": "positive",
            "PublishDate": 1752811734000,
            "Source": "normal_news"
        },
        {
            "Title": "Mukul Mahavir Agrawal Acquires 1.28% Stake in Tatva Chintan Pharma Chem",
            "Summary": "Investor Mukul Mahavir Agrawal's name has appeared in the shareholding pattern of Tatva Chintan Pharma Chem with a 1.28% stake during the latest quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752801155000,
            "Source": "default"
        },
        {
            "Title": "Mukul Mahavir Agrawal Acquires 1.28% Stake in Tatva Chintan Pharma Chem",
            "Summary": "Mukul Mahavir Agrawal has been listed as a shareholder in Tatva Chintan Pharma Chem, holding a 1.28% stake in the company as of the first quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752760115000,
            "Source": "default"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Ltd: CRISIL Downgrades Ratings on Bank Facilities",
            "Summary": "CRISIL has downgraded Tatva Chintan Pharma Chem Ltd's long-term rating to BBB+ (stable) from A- (negative) and short-term rating to A2 from A2+ on bank facilities worth ₹245 crore. The downgrade is due to moderation in the company's business risk profile, with FY2025 revenue declining to ₹385 crore and operating profit margins dropping to 9.49% from 18.43% last year.",
            "Sentiment": "negative",
            "PublishDate": 1750214352000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Secures ₹30 Crore Order",
            "Summary": "Tatva Chintan Pharma Chem has won a new order worth 30 crore rupees. This represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1746436922000,
            "Source": "default"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Q4 Results and Dividend",
            "Summary": "Tatva Chintan Pharma Chem announced its Q4 consolidated net profit of 10.3 million rupees, down from 96 million rupees year-over-year but up from 1.38 million rupees quarter-over-quarter. Q4 revenue increased to 1.1 billion rupees from 983 million rupees year-over-year. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746403609000,
            "Source": "default"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Q4 Results and Dividend",
            "Summary": "Tatva Chintan Pharma Chem announced its Q4 financial results, showing mixed performance. The company's revenue increased to 1.1 billion rupees from 983 million rupees year-over-year. However, EBITDA decreased to 89.5 million rupees from 156 million rupees, with EBITDA margin falling to 8.3% from 15.9%. Net profit declined significantly to 10.3 million rupees from 96 million rupees year-over-year. Despite the profit decline, the company recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746188015000,
            "Source": "result"
        },
        {
            "Title": "Tatva Chintan Pharma Chem: Q3 Profit Plunges 95.94% Despite Revenue Growth",
            "Summary": "Tatva Chintan Pharma Chem reported Q3 FY25 results with profit falling 95.94% YoY to ₹0.14 crore, despite a 2.01% increase in revenue to ₹85.9 crore. Operating income dropped 96.83% YoY but rose 111.38% QoQ. EPS decreased to ₹0.06, down 95.95% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1738217089000,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Q3 Financial Results",
            "Summary": "Tatva Chintan Pharma Chem has released its Q3 consolidated financial results. The company reported a net profit of 1.4 million rupees, down from 35 million rupees in the same quarter last year. Revenue for Q3 stood at 859 million rupees, slightly up from 842 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738109780000,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Tatva Chintan Pharma Chem has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 70 million rupees, down from 110 million rupees in the same quarter last year. The EBITDA margin also decreased to 8.17% from 13.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738077995000,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Q3 Financial Results",
            "Summary": "Tatva Chintan Pharma Chem has announced its Q3 consolidated financial results. The company reported a net profit of 1.4 million rupees, which is a significant decrease from 35 million rupees in the same quarter last year. Revenue for Q3 stood at 859 million rupees, showing a slight increase from 842 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738077937000,
            "Source": "earnings"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Significant Drop in Q2 EBITDA",
            "Summary": "Tatva Chintan Pharma Chem's Q2 EBITDA decreased to 56 million rupees from 203 million rupees year-over-year. The company's EBITDA margin also fell to 6.69% from 21.00% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729852326000,
            "Source": "result"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Q2 Revenue Decline",
            "Summary": "Tatva Chintan Pharma Chem has reported a revenue of 835 million rupees for the second quarter, down from 967 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729852316000,
            "Source": "result"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Reports Q2 Loss",
            "Summary": "Tatva Chintan Pharma Chem reported a consolidated net loss of 6.64 million rupees in Q2, compared to a profit of 78 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter (Q1) when the company posted a profit of 52 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1729852306000,
            "Source": "result"
        },
        {
            "Title": "Tatva Chintan Pharma Chem Resumes Operations After Pollution Board Revokes Closure",
            "Summary": "<p><span class='neutral'>Tatva Chintan Pharma Chem</span> announced that the <span class='positive'>Gujarat Pollution Control Board has revoked its closure direction</span> for the company's plant in Gujarat. The company is now in the process of <span class='positive'>resuming operations</span> at the facility.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728309330000,
            "Source": "corporate_action"
        }
    ]
}