{
    "Symbol": "TBOTEK",
    "ISIN": "INE673O01025",
    "News": [
        {
            "Title": "TBO Tek schedules Q3 FY2026 earnings call for Feb 11",
            "Summary": "TBO Tek Limited announces earnings conference call on February 11, 2026 at 17:00 hrs IST to discuss Q3 and nine months performance ended December 31, 2025. Senior management including co-founders will participate.",
            "Sentiment": "neutral",
            "PublishDate": 1770271995457,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldman Sachs Issues Buy Rating for TBO Tek",
            "Summary": "Goldman Sachs has issued a buy recommendation for TBO Tek with a target price of ₹1,710.00, indicating positive analyst sentiment for the e-commerce aggregator stock.",
            "Sentiment": "positive",
            "PublishDate": 1765770414455,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Maintains Buy Rating on TBO Tek at ₹1,950",
            "Summary": "Jefferies continues its positive outlook on TBO Tek with a 'Buy' recommendation and price target of ₹1,950, reflecting confidence in the travel technology company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765770191810,
            "Source": "stocks"
        },
        {
            "Title": "TBO Tek Hosts Investor Meet, Reveals H1 FY26 Growth",
            "Summary": "TBO Tek conducted investor conference on December 12, 2025, showcasing H1 FY26 performance with 30,116 monthly transacting buyers, ₹17,020 crores GTV, and strong growth across luxury travel segments.",
            "Sentiment": "positive",
            "PublishDate": 1765445685984,
            "Source": "stocks"
        },
        {
            "Title": "TBO Tek Limited Modifies ESOP Trust Deed with New Trustee Appointments",
            "Summary": "TBO Tek Limited has modified its Employee Benefit Trust deed to change the composition of trustees, with Mr. Pramendra Tomar and Mr. Vineet Maheshwary replacing the existing trustees effective November 30, 2025. The reconstitution was approved by the company's Nomination and Remuneration Committee and affects the administration of the employee stock option scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1764739747139,
            "Source": "corporate_action"
        },
        {
            "Title": "TBO Tek Acquires Classic Vacations for $125 Million, Expands into US Luxury Travel Market",
            "Summary": "TBO Tek Limited completed the acquisition of Classic Vacations, a premium B2B2C luxury travel company focused on US travel advisors, for $125 million including closing adjustments on October 1, 2025. The acquisition expands TBO's global reach into North America's luxury travel segment, adding Classic Vacations' $475.71 million gross bookings and 1,500+ direct hotel inventory to TBO's existing platform serving 50,000 transacting agents across 140 source markets.",
            "Sentiment": "positive",
            "PublishDate": 1763058797846,
            "Source": "stock"
        },
        {
            "Title": "TBO Tek Reports $4.5B Gross Booking Value, Targets 25-30% Annual Revenue Growth From FY26",
            "Summary": "TBO Tek achieved $4.5 billion in gross booking value with double-digit growth in both supplier and buyer base while expanding its B2B travel-tech platform across 150+ countries. The company is investing in AI-powered dynamic packaging and API integrations, targeting 25-30% annual revenue growth with strong margins from FY26 onward.",
            "Sentiment": "positive",
            "PublishDate": 1763056049867,
            "Source": "stock"
        },
        {
            "Title": "TBO Tek Shareholders Approve Asset Security Creation and Subsidiary Shareholding Reduction",
            "Summary": "TBO Tek Limited shareholders approved a special resolution through postal ballot allowing the company to create and enforce security on disposal of more than 20% of assets of material subsidiaries and possible reduction of shareholding in material subsidiaries to 50% or below. The remote e-voting process concluded on November 8, 2025, with 99.91% of votes cast in favor of the resolution. The voting period ran from October 10 to November 8, 2025, with the cut-off date for eligible shareholders set as October 3, 2025. Shirin Bhatt served as the scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1762884544160,
            "Source": "corporate_action"
        },
        {
            "Title": "TBO Tek Reports 12% GTV Growth and Completes Classic Vacations Acquisition",
            "Summary": "TBO Tek Limited reported quarterly results with Gross Transaction Value (GTV) growing 12%, driven by nearly 20% growth in the hotels business. Gross Profit increased 19% and adjusted EBITDA reached Rs. 104 crores, representing 16% growth compared to the same quarter last year. The company completed the acquisition of Classic Vacations on October 1st, which will be consolidated starting from the third quarter. Classic Vacations operates at a 22% take rate and 11% gross profit margin, contributing roughly $500 million in GTV to TBO's total base of approximately $3.5 billion. The company expects operating leverage to improve as SG&A growth slows down on a year-over-year basis. International markets showed strong performance with active agent growth across regions, particularly in Europe and Middle East. India business showed signs of stabilization after previous challenges. The hotels business maintained gross margins in the mid-60s range, with approximately 35% of GTV coming from commission-based models.",
            "Sentiment": "positive",
            "PublishDate": 1762753307747,
            "Source": "earnings"
        },
        {
            "Title": "TBO Tek Limited Reports No Deviations in IPO Proceeds Utilization for September Quarter",
            "Summary": "TBO Tek Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviations from stated IPO objectives. The company raised Rs. 400 crore through its IPO in May 2024. Out of total proceeds, Rs. 214.79 crore has been utilized across various objectives including Rs. 126.14 crore for technology and data solutions, Rs. 50.86 crore for subsidiary investment, and Rs. 17.89 crore for issue-related expenses. Rs. 152.21 crore remains unutilized and is deployed in fixed deposits and bank accounts. The company faces ongoing adjudication proceedings with RBI regarding alleged FEMA violations worth Rs. 71.23 crore, with the next hearing scheduled for November 3, 2025. CARE Ratings Limited, serving as the monitoring agency, confirmed all IPO proceeds have been utilized appropriately according to offer document objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762189734738,
            "Source": "corporate_action"
        },
        {
            "Title": "TBO Tek Reports 26% Revenue Growth in Q2 with Strong International Performance",
            "Summary": "TBO Tek Limited announced its quarterly results showing revenue growth of 26% year-over-year to ₹568 crores. The company's Gross Transaction Value (GTV) increased 12% to ₹8,901 crores, driven by strong performance in APAC, MEA, and Europe markets. Monthly Transacting Buyers reached 30,662, up 8% year-over-year, with international buyers growing 23.6%. The company's Hotels & Ancillaries segment grew 20.4% and now accounts for 64% of GTV and 87% of Gross Profit. Adjusted EBITDA before acquisition costs reached ₹104 crores versus ₹90 crores, with margins improving to 18.32% from 16.56% in the previous quarter. Profit after tax increased 12.4% to ₹68 crores. The company completed the acquisition of Classic Vacations for $125 million and recorded one-time acquisition costs of ₹13.15 crores. Management highlighted broad-based growth across regions and early signs of stabilization in the India business after previous headwinds.",
            "Sentiment": "positive",
            "PublishDate": 1762184145191,
            "Source": "earnings"
        },
        {
            "Title": "TBO TEK Reports Strong Growth in Europe, MEA, and APAC Markets",
            "Summary": "TBO TEK reported strong growth across its Europe, Middle East and Africa (MEA), and Asia-Pacific (APAC) regions. The company's India operations have stabilized and achieved positive Gross Transaction Value (GTV) growth.",
            "Sentiment": "positive",
            "PublishDate": 1762183019017,
            "Source": "stock"
        },
        {
            "Title": "TBO TEK Reports 12.6% Growth in Q2 Net Profit to ₹675.5 Million",
            "Summary": "TBO TEK reported quarterly consolidated net profit of ₹675.5 million compared to ₹600.1 million in the same period last year. Revenue increased to ₹5.68 billion from ₹4.5 billion year-over-year. EBITDA rose to ₹880 million from ₹753.5 million, though EBITDA margin declined to 15.52% from 16.72% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762164840586,
            "Source": "earnings"
        },
        {
            "Title": "TBO Tek Completes $125 Million Acquisition of Classic Vacations to Strengthen US Luxury Travel Presence",
            "Summary": "TBO Tek Limited has completed the acquisition of 100% ownership in Classic Vacations, LLC for USD 125 million through its wholly owned subsidiary TBO LLC. The acquisition was funded through inter-corporate loans, internal accruals, and credit facilities backed by corporate guarantees. Classic Vacations will continue operating as an independent brand under CEO Melissa Krueger and its existing leadership team, maintaining its five-decade legacy in the US luxury travel market. The company serves over 10,000 travel advisors and specializes in premium white-glove service across hotels, air, experiences, car rentals, and travel protection. TBO operates as a global travel distribution platform connecting over 159,000 travel buyers and 1 million travel suppliers across more than 100 countries. The acquisition supports TBO's strategic vision of becoming one of the largest global travel-tech platforms and expands its presence in the premium outbound travel market.",
            "Sentiment": "positive",
            "PublishDate": 1759375558826,
            "Source": "order&deals"
        },
        {
            "Title": "TBO Tek Limited's President-Strategy Anil Berera Retires",
            "Summary": "Anil Berera, President-Strategy and Senior Management Personnel at TBO Tek Limited, retired from the company on September 30, 2025. The company acknowledged his valuable contributions during his tenure. Following his retirement, TBO Tek's senior management team now consists of eight members, including Chief Financial Officer Vikas Jain, Company Secretary Neera Chandak, and other key executives across various departments. The company had previously announced that Chief Human Resource Officer Ankush Arora had tendered his resignation on September 17, 2025, with his final working day to be determined.",
            "Sentiment": "neutral",
            "PublishDate": 1759284340662,
            "Source": "corporate_governance"
        },
        {
            "Title": "TBO Tek Partners with Amadeus South Asia for Travel Marketplace Platform",
            "Summary": "TBO Tek Ltd has signed up with Amadeus South Asia for its Travel Marketplace, an AI-driven platform that connects travel sellers and providers through a single ecosystem. The partnership will allow travel sellers to access new travel content and services on the marketplace, helping TBO Tek enhance its offerings to travel agents and partners across South Asia. The collaboration aims to provide travel agents with more efficient and personalized experiences. Co-Founder Ankush Nijhawan stated the partnership will empower travel seller partners with greater flexibility, speed, and choice. Amadeus Managing Director Sandeep Dwivedi emphasized the partnership's role in supporting the region's travel sector with technology that drives collaboration and innovation.",
            "Sentiment": "positive",
            "PublishDate": 1758719064230,
            "Source": "stock"
        },
        {
            "Title": "TBO Tek's Chief Human Resource Officer Ankush Arora Resigns Due to Personal Reasons",
            "Summary": "Ankush Arora, Chief Human Resource Officer and member of Senior Management at TBO Tek Limited, has resigned due to personal reasons. He submitted his resignation letter on September 17, 2025. His last working day will be finalized and communicated later. The company has notified stock exchanges BSE and NSE about this senior management change.",
            "Sentiment": "neutral",
            "PublishDate": 1758123064350,
            "Source": "corporate_governance"
        },
        {
            "Title": "TBO Tek Acquires Classic Vacations for $125 Million to Expand US Luxury Travel Market",
            "Summary": "TBO Tek Ltd. acquired Classic Vacations for $125 million to strengthen its presence in North America's luxury travel market. The acquisition of the nearly 50-year-old company provides TBO Tek faster entry into the mature, competitive North American travel market with established synergies. Co-Founder Ankush Nijhawan emphasized integrating Classic Vacations' expertise in luxury travel globally into TBO's core business. The deal is marginally dilutive initially from an EBITDA perspective but accretive at the GMV-to-EBITDA level, with Classic Vacations generating over $11 million EBITDA in the trailing 12 months, representing an acquisition multiple of slightly over 11 times EBITDA. TBO Tek plans to focus expansion efforts on Europe, North America, and eventually Asia Pacific, while India and Middle East markets are considered mature. No immediate acquisitions are planned for FY26 as the company focuses on integrating Classic Vacations. TBO Tek shares closed up 1.63% at Rs 1,580.",
            "Sentiment": "positive",
            "PublishDate": 1758014022362,
            "Source": "stock"
        },
        {
            "Title": "TBO Tek Limited Announces Investor Presentation at Jefferies 4th India Forum",
            "Summary": "TBO Tek Limited submitted an investor presentation to stock exchanges for discussion at the Jefferies 4th India Forum on September 16, 2025. The presentation highlights TBO's position among the top four global B2B travel distributors, serving over 50,000 transacting agents across 140 source markets with 30,000+ destinations sold. The company reported quarterly results showing GTV of ₹8,119 crores (2% YoY growth), revenue of ₹511 crores (22% YoY growth), and 50,369 active bookers (12% YoY growth). TBO operates a global travel distribution platform connecting buyers and suppliers across hotels, airlines, and ancillary services, with presence in Europe, North America, APAC, Latin America, and Africa. The company achieved a $1 billion GTV milestone and went public in 2024, with recent acquisitions including Bookabed AG and agreements to acquire Classic Vacations.",
            "Sentiment": "positive",
            "PublishDate": 1757950457504,
            "Source": "stock"
        },
        {
            "Title": "TBO Tek Shares Surge 8% Following Jefferies Target Price Hike After US Acquisition",
            "Summary": "TBO Tek shares reached an intraday high of Rs 1,687, gaining over 8% in Monday's trading session. The rally follows the company's acquisition of US-based Classic Vacations for $125 million, completed on September 3. The stock has gained 20% over recent days. Jefferies issued a bullish note, viewing the acquisition as part of TBO Tek's roll-up strategy to expand its North American footprint. Classic Vacations operates as a premium B2B and B2C luxury travel company with a network of 10,000 travel advisors. Jefferies believes the acquisition will strengthen TBO Tek's presence in the premium outbound market. Recent GST changes may positively impact the company's revenue through increased consumption and travel activity. TBO Tek trades with an RSI of 65, indicating it's not overbought. Among eight analysts tracking the stock, seven recommend 'buy' and one suggests 'hold', with no 'sell' ratings.",
            "Sentiment": "positive",
            "PublishDate": 1757314468264,
            "Source": "stock"
        },
        {
            "Title": "TBO Tek Acquires Classic Vacations for $125 Million to Expand US Luxury Travel Market",
            "Summary": "TBO Tek Limited has acquired 100% ownership of Classic Vacations, a luxury travel company serving US travel advisors, for $125 million. The acquisition is funded through internal cash reserves and $70 million term debt from Standard Chartered Bank. Classic Vacations operates with over 135,000 registered advisors and generated $475.71 million in gross bookings with $11.2 million operating EBITDA. The company specializes in luxury travel to Hawaii, Mexico, Caribbean Islands, and Europe through both FIT business (66%) and Groups business (34%). The deal is expected to close in the first week of October 2025. The acquisition provides TBO access to the North American luxury travel market and consortia relationships, while Classic Vacations will benefit from TBO's technology platform and hotel supply network. The combined entity will have over $600 million in US business from approximately 12,000 buyers.",
            "Sentiment": "positive",
            "PublishDate": 1757072247219,
            "Source": "order&deals"
        },
        {
            "Title": "TBO Tek Receives RBI Notice Refusing Post-Facto Approval for ₹712.25 Million Third-Party Payments",
            "Summary": "TBO Tek received a notice from the Reserve Bank of India refusing post-facto approval for payments totaling ₹712.25 million made through third parties. The company is currently evaluating compliance options and determining its next steps in response to the RBI's decision.",
            "Sentiment": "negative",
            "PublishDate": 1756968400118,
            "Source": "stock"
        },
        {
            "Title": "TBO Tek Acquires US-Based Classic Vacations for $125 Million to Expand Premium Travel Market",
            "Summary": "TBO Tek Ltd., a Gurugram-based travel market services provider, signed an agreement to acquire US-based Classic Vacations from The Najafi Companies for up to $125 million. The acquisition combines TBO's technology platform and global inventory with Classic Vacations' luxury travel advisor network. Classic Vacations generated $111 million in revenue and $11.2 million in operating EBITDA in the fiscal year ending December 31, 2024. The deal is expected to complete by the first week of October 2025 and requires no regulatory approvals. TBO Tek's board approved an inter-corporate loan of over ₹350 crore to subsidiary Tek Travels DMCC to fund the acquisition. Additionally, Tek Travels DMCC will secure $70 million in credit facilities from Standard Chartered Bank for TBO LLC. TBO Tek shares have declined 22% year-to-date and closed 1% higher at ₹1,376.5, remaining 31% below their 52-week high of ₹2,001.",
            "Sentiment": "neutral",
            "PublishDate": 1756856515933,
            "Source": "order&deals"
        },
        {
            "Title": "TBO Tek Reports Mixed Q1 FY26 Results Amid Travel Industry Headwinds",
            "Summary": "TBO Tek Limited reported quarterly results showing resilience despite significant industry challenges. The company faced disruptions from India-Pakistan conflict, Iran-Israel conflict, and an Air India crash during the peak summer travel season. Despite these headwinds, monthly transacting buyers grew 5% to over 29,500, GTV increased 2%, revenue grew 22%, and gross profit rose 19%. The faster growth in revenue and GP was driven by increased contribution from hotels and ancillary business. EBITDA remained flat on a like-to-like basis with marginal PAT growth. The company continued heavy investments in international markets, particularly in hiring key account managers, which showed early positive results with monthly active agents growing from 8,600-9,000 range to nearly 11,000 in June. New customer addition rate increased 69% year-over-year, with 4.2% of international GTV contributed by travel agents added in the same quarter. Management expects the investment phase to complete by Q4, anticipating operating leverage to improve in the latter half of the year. July showed quick recovery in Europe and Middle East markets, with demand normalizing to expected levels.",
            "Sentiment": "neutral",
            "PublishDate": 1754567738339,
            "Source": "earnings"
        },
        {
            "Title": "TBO Tek Limited Makes Earnings Conference Call Recording Available Online",
            "Summary": "TBO Tek Limited has made the audio/video recording of their earnings conference call available on their website. The call was held on August 4, 2025, and discussed the company's unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The recording can be accessed through a specific link on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754327049886,
            "Source": "earnings"
        },
        {
            "Title": "TBO TEK Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "TBO TEK reported quarterly net profit of 630 million rupees compared to 609 million rupees in the same period last year. The company's revenue increased to 5.1 billion rupees from 4.18 billion rupees year-over-year. However, EBITDA declined to 740 million rupees from 786 million rupees, while EBITDA margin compressed to 14.5% from 18.8% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754300436851,
            "Source": "earnings"
        },
        {
            "Title": "TBO Tek Ltd. Block Trade: 188,674 Shares at Rs. 1411.00",
            "Summary": "A block trade of approximately 188,674 shares of TBO Tek Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1411.00 per share. The total value of the transaction was Rs. 26.62 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1752646658000,
            "Source": "block_details"
        },
        {
            "Title": "TBO Tek Establishes Unit in Poland for European Expansion",
            "Summary": "TBO Tek has established a new unit in Poland as part of its strategy to expand into the European market.",
            "Sentiment": "positive",
            "PublishDate": 1752203965000,
            "Source": "default"
        },
        {
            "Title": "TBO Tek: Q4 Profit Surges 26% YoY, Shares Rally 10%",
            "Summary": "TBO Tek reported a 26% YoY increase in Q4FY25 consolidated net profit to Rs 59 crore. Revenue from operations grew 21% to Rs 446 crore. FY25 GTV crossed Rs 30,000 crore, with 43% YoY growth in international markets. The company expanded its global footprint to 15 new countries.",
            "Sentiment": "positive",
            "PublishDate": 1747989966000,
            "Source": "earnings"
        },
        {
            "Title": "TBO TEK Reports Q4 Financial Results",
            "Summary": "TBO TEK has released its Q4 financial results. The company's EBITDA for Q4 was 648 million rupees, compared to 645 million rupees in the same quarter last year. The EBITDA margin decreased to 14.53% from 17.48% year-over-year. Consolidated net profit for Q4 was 589 million rupees, up from 466.3 million rupees year-over-year and 500 million rupees quarter-over-quarter. Q4 revenue increased to 4.5 billion rupees from 3.7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747919639000,
            "Source": "result"
        },
        {
            "Title": "RBI Denies Post-facto Approval for TBO Tek's International Payments",
            "Summary": "TBO Tek has received a letter from the Reserve Bank of India (RBI) denying post-facto approval for receiving payments of ₹712.25 million through third parties or an Indian-registered company on behalf of entities outside India. The company is now evaluating its options and seeking further guidance from the RBI to determine the appropriate course of action.",
            "Sentiment": "negative",
            "PublishDate": 1744157390000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TBO Tek Seeks RBI Guidance on Available Options",
            "Summary": "TBO Tek Limited is currently evaluating various options in consultation with its advisors. The company is also in the process of seeking guidance from the Reserve Bank of India (RBI) to determine the most appropriate course of action for its situation.",
            "Sentiment": "neutral",
            "PublishDate": 1744121105000,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBI Rejects TBO TEK's Application for Post-Facto Approval of Foreign Payments",
            "Summary": "TBO TEK has received a letter from the Reserve Bank of India (RBI) regarding its application for post-facto approval of payments totaling ₹712.25 million. These payments were received through third parties or an Indian-registered company on behalf of entities outside India. The RBI has advised that this application could not be approved.",
            "Sentiment": "negative",
            "PublishDate": 1744121043000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TBO Tek: Augusta TBO and Korea Holdings Launch Block Deal to Sell 3.1% Stake",
            "Summary": "Augusta TBO Singapore Pte Ltd and TBO Korea Holdings Ltd are offering to sell up to a 3.1% stake in TBO Tek through a Rs 400 crore block deal. The offer floor price is set at Rs 1,180 per share, a 7% discount to the current market price. TBO Tek is focusing on expanding ancillary services to align with shifting consumer travel behavior towards experience-driven spending.",
            "Sentiment": "neutral",
            "PublishDate": 1742528626000,
            "Source": "block_deals"
        },
        {
            "Title": "TBO Tek Ltd: Overseas Entities to Sell 3.1% Stake via Block Deal",
            "Summary": "Augusta TBO Singapore Pte Ltd. and TBO Korea Holdings Ltd. plan to sell up to 3.4 million shares (3.1% stake) in TBO Tek Ltd. for approximately Rs 400 crore ($46.3 million). The floor price is set at Rs 1,180 per share, 6% below the latest closing price. A 30-day lock-up period applies to the sellers' remaining stakes.",
            "Sentiment": "neutral",
            "PublishDate": 1742481091000,
            "Source": "block_deals"
        },
        {
            "Title": "TBO Tek Launches TravelBytes News App for Travel Agents",
            "Summary": "TBO Tek has announced the launch of TravelBytes, a new mobile application designed specifically for travel agents. The app aims to provide travel industry news and updates to help agents stay informed about the latest developments in their field.",
            "Sentiment": "positive",
            "PublishDate": 1739956656000,
            "Source": "corporate_action"
        },
        {
            "Title": "TBO Tek Reports Q3 EBITDA and Margin Decline",
            "Summary": "TBO Tek's Q3 EBITDA decreased to 553 million rupees from 561 million rupees year-over-year. The company's EBITDA margin also declined to 13.10% from 17.16% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739356047000,
            "Source": "earnings"
        },
        {
            "Title": "TBO Tek Reports Q3 Financial Results",
            "Summary": "TBO Tek announced its Q3 financial results. The company reported a consolidated net profit of 500 million rupees, slightly down from 514 million rupees in the same quarter last year. However, revenue increased to 4 billion rupees from 3.3 billion rupees year-over-year, indicating strong top-line growth.",
            "Sentiment": "neutral",
            "PublishDate": 1739356041000,
            "Source": "earnings"
        },
        {
            "Title": "TBO Tek's Subsidiary Establishes New Entity in Israel",
            "Summary": "TBO Tek Limited has announced that its subsidiary, TEK Travels DMCC, has incorporated a wholly owned subsidiary in Israel named TBO TEK Israel Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1734530709000,
            "Source": "corporate_action"
        },
        {
            "Title": "TBO Tek: Betting on Shift Towards Experience-Driven Travel",
            "Summary": "TBO Tek anticipates a major shift in travel trends, focusing on experiences over traditional components like flights and hotels. The company is expanding its ancillary services to capitalize on this trend. Recent stake sales by private equity investors and a positive market reaction were noted. Jefferies initiated coverage with a buy recommendation and a ₹2,000 price target.",
            "Sentiment": "positive",
            "PublishDate": 1733302934000,
            "Source": "normal_news"
        },
        {
            "Title": "TBO Tek Ltd Sees Major Block Trade on BSE",
            "Summary": "A significant block trade occurred for TBO Tek Ltd on the Bombay Stock Exchange (BSE). Approximately 6,387,535 shares were traded at a price of Rs. 1477.55 per share, totaling Rs. 943.79 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1733197646000,
            "Source": "block_deals"
        },
        {
            "Title": "TBO TEK Reports Q2 EBITDA Growth",
            "Summary": "TBO TEK announced its Q2 financial results. The company's EBITDA increased to 829 million rupees from 697 million rupees in the same quarter last year. However, the EBITDA margin decreased to 18.39% from 19.78% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731404999000,
            "Source": "result"
        },
        {
            "Title": "TBO Tek Reports Q2 Profit Increase",
            "Summary": "TBO Tek Limited has reported a consolidated net profit of 600 million rupees for the second quarter, showing an increase from 564 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731404742000,
            "Source": "result"
        }
    ]
}