{
    "Symbol": "TBZ",
    "ISIN": "INE760L01018",
    "News": [
        {
            "Title": "TBZ Reports 168% PAT Growth in Q3 FY26",
            "Summary": "Tribhovandas Bhimji Zaveri delivers strong Q3 FY26 results with revenue up 14.40% YoY to ₹10,614.23 million and PAT surging 168.26% to ₹817.67 million. EBITDA margin expands 592 bps to 12.44%.",
            "Sentiment": "positive",
            "PublishDate": 1768908018868,
            "Source": "co_actions_results"
        },
        {
            "Title": "Malabar Gold sells 0.8% TBZ stake for ₹8.75 cr",
            "Summary": "Malabar Gold and Diamonds offloaded 5.28 lakh shares in Tribhovandas Bhimji Zaveri at ₹165.54 per share on January 19. TBZ shares gained 0.88% despite the stake sale by the Kerala-based jewellery group.",
            "Sentiment": "neutral",
            "PublishDate": 1768843200975,
            "Source": "co_actions_results"
        },
        {
            "Title": "TBZ CMD Shrikant Zaveri Wins Visionary Leader Award",
            "Summary": "Shrikant Zaveri, Chairman & Managing Director of TBZ Limited, has been honored with the 'Visionary Leader of the Year' award at Retail Jeweller MD & CEO Awards 2026, recognizing his outstanding leadership in the jewellery industry.",
            "Sentiment": "positive",
            "PublishDate": 1767956690636,
            "Source": "stocks"
        },
        {
            "Title": "TBZ Reports Strong Q2 FY26 Results with 21% Revenue Growth and 132% PAT Surge",
            "Summary": "Tribhovandas Bhimji Zaveri Limited achieved revenue of ₹6,878.28 million in Q2 FY26, marking 21.30% YoY growth, while PAT surged 132.23% to ₹307 million with improved margins across all key metrics. The jewelry retailer expanded its footprint to 37 stores across 27 cities with new flagship showrooms in Ahmedabad and Hyderabad, benefiting from strong festive campaigns and enhanced operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1763390602746,
            "Source": "earnings"
        },
        {
            "Title": "TBZ Reports 21% Revenue Growth and 132% PAT Jump in Q2FY26 with Record Margins",
            "Summary": "Tribhovandas Bhimji Zaveri Limited delivered strong quarterly results with revenue growing 21.30% YoY to Rs 6,878.28 million and profit after tax surging 132.23% to Rs 307 million, driven by improved gross margins expanding 318 basis points to 16.87%. The jewelry retailer also appointed Kapil Budukh as Head-Advertising Marketing in senior management and expanded its network to 37 stores across 27 cities with new showrooms in Ahmedabad and Hyderabad.",
            "Sentiment": "positive",
            "PublishDate": 1763138015607,
            "Source": "earnings"
        },
        {
            "Title": "TBZ Targets Retail Expansion and Product Diversification to Tap India's Growing Middle-Class Market",
            "Summary": "TBZ is focusing on retail growth and expanding product variety to capitalize on India's rising middle-class demographic. The company is leveraging its 160-year legacy as part of its strategy to maintain profitability while working to improve margins.",
            "Sentiment": "positive",
            "PublishDate": 1754577853394,
            "Source": "stock"
        },
        {
            "Title": "TBZ Ltd Reports Strong Q1 Performance with 13.4% PAT Growth and Board Approves Key Corporate Decisions",
            "Summary": "TBZ Ltd announced its quarterly results with revenue from operations growing 4.66% year-on-year to ₹6,240.07 million. The company reported profit after tax of ₹209.44 million, up 13.4% from the previous year, with PAT margin improving to 3.37%. EBITDA grew 20.69% to ₹514.08 million, while gross margin expanded 176 basis points to 16.16%. The company opened two flagship stores in Ahmedabad and Hyderabad, expanding its network to 37 stores across 27 cities. The board approved book closure from September 3-9, 2025, and scheduled the 18th AGM for September 9, 2025. Key appointments were approved including re-appointment of Mr. Shrikant Zaveri as Chairman & Managing Director for five years from January 2026, along with re-appointments of Ms. Binaisha Zaveri and Ms. Raashi Zaveri as Whole-time Directors, and Mrs. Sudha Pravin Navandar as Independent Director. The board also approved re-appointment of statutory auditors M/s. Chaturvedi & Shah LLP and appointment of M/s. Pramod S. Shah & Associates as secretarial auditors.",
            "Sentiment": "positive",
            "PublishDate": 1754480641460,
            "Source": "corporate_action"
        },
        {
            "Title": "Tribhovandas Bhimji Zaveri Reports Mixed Q1 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Tribhovandas Bhimji Zaveri reported Q1 revenue of 6.2 billion rupees, up from 5.96 billion rupees year-over-year. Net profit increased to 209 million rupees from 184.7 million rupees in the same period last year. However, EBITDA declined to 354 million rupees from 426 million rupees year-over-year, while EBITDA margin compressed to 5.67% from 7.14% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754478919318,
            "Source": "earnings"
        },
        {
            "Title": "Tribhovandas Bhimji Zaveri Announces Dividend and Q4 Results",
            "Summary": "Tribhovandas Bhimji Zaveri has recommended a final dividend of 2.25 rupees per equity share. The company's Q4 EBITDA increased to 367 million rupees from 310.7 million rupees year-over-year. The Q4 EBITDA margin improved to 6.94% from 6.13% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747914844000,
            "Source": "result"
        },
        {
            "Title": "Tribhovandas Bhimji Zaveri Reports Q4 Financial Results",
            "Summary": "Tribhovandas Bhimji Zaveri announced its Q4 financial results. The company reported a net profit of 102 million rupees, compared to 125 million rupees year-over-year and 305 million rupees quarter-over-quarter. Revenue for Q4 was 5.3 billion rupees, up from 5.07 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747914704000,
            "Source": "result"
        },
        {
            "Title": "Tribhovandas Bhimji Zaveri Reports Strong Q3 Financial Results",
            "Summary": "Tribhovandas Bhimji Zaveri, a prominent jewelry retailer, has announced its financial results for the third quarter. The company's net profit increased to 305 million rupees, up from 210 million rupees in the same period last year. Revenue also saw significant growth, reaching 9.3 billion rupees compared to 7.41 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739320570000,
            "Source": "earnings"
        },
        {
            "Title": "Tribhovandas Bhimji Zaveri Reports Improved Q3 EBITDA and Margin",
            "Summary": "Tribhovandas Bhimji Zaveri, a jewelry company, has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 605 million rupees, up from 452 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 6.52% from 6.10% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739271395000,
            "Source": "earnings"
        },
        {
            "Title": "Tribhovandas Bhimji Zaveri Reports Strong Q3 Financial Results",
            "Summary": "Tribhovandas Bhimji Zaveri, a prominent jewelry retailer, has announced its financial results for the third quarter. The company reported a net profit of 305 million rupees, up from 210 million rupees in the same period last year, marking a significant year-over-year increase. Additionally, the company's revenue rose to 9.3 billion rupees from 7.41 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739271390000,
            "Source": "earnings"
        },
        {
            "Title": "Tribhovandas Bhimji Zaveri Reports Q2 Financial Results",
            "Summary": "Tribhovandas Bhimji Zaveri, a jewelry company, has announced its financial results for the second quarter. The company's net profit increased to 132 million rupees, up from 92 million rupees in the same quarter last year and 185 million rupees in the previous quarter. Revenue for Q2 rose to 5.7 billion rupees, compared to 4.8 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731455812000,
            "Source": "result"
        }
    ]
}