{
    "Symbol": "TCI",
    "ISIN": "INE688A01022",
    "News": [
        {
            "Title": "TCI seeks shareholder approval for Rs 5000 Million RPT",
            "Summary": "Transport Corporation of India issues postal ballot notice seeking member approval for material related party transactions worth up to Rs 5000 Million between subsidiary TCI-CONCOR and Container Corporation of India.",
            "Sentiment": "neutral",
            "PublishDate": 1770878934423,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Updates Q3FY26 Investor Presentation",
            "Summary": "Transport Corporation of India submits revised investor presentation for Q3 and nine months ended December 31, 2025, addressing minor errors in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770836657995,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Declares ₹9 Interim Dividend for FY26",
            "Summary": "Transport Corporation of India announces first interim dividend of ₹9 per share for FY26, marking significant shareholder return initiative.",
            "Sentiment": "positive",
            "PublishDate": 1770214670182,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Reports 15% Jump in Q3 Net Profit to ₹1.15B",
            "Summary": "Transport Corporation of India posted strong Q3 performance with consolidated net profit rising 15% YoY to ₹1.15 billion, while revenue grew 9.6% to ₹12.5 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770214628235,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Board to Consider 1st Interim Dividend FY26",
            "Summary": "Transport Corporation of India's board meeting on February 04, 2026 may consider and recommend payment of 1st interim dividend for FY26. Trading window closed from January 01 to February 06, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769603136777,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Completes Sale of Singapore Subsidiary to TCI Express",
            "Summary": "Transport Corporation of India has completed the sale of 100% equity shares of TCI Global (Singapore) Pte. Ltd. to TCI Express Pte. Ltd. for SGD 18,000 through a Share Purchase Agreement dated January 26, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769517563691,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI's ₹200 Cr Loan Rating Withdrawn After Reaffirmation",
            "Summary": "Transport Corporation of India's ₹200 crore long-term loan rating was withdrawn by ICRA after being reaffirmed at [ICRA]AA with stable outlook, following company's request and bank approval.",
            "Sentiment": "neutral",
            "PublishDate": 1766744463513,
            "Source": "stocks"
        },
        {
            "Title": "TCI Promoter Group Acquires Additional 3,390 Shares",
            "Summary": "Bhoruka Supply Chain Solutions Holdings Limited acquired 3,390 equity shares of Transport Corporation of India through open market purchase on December 17, 2025, marginally increasing promoter group stake to 44.12%.",
            "Sentiment": "neutral",
            "PublishDate": 1765379028509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhoruka Supply Chain Solutions Acquires Additional Shares in Transport Corporation of India",
            "Summary": "Bhoruka Supply Chain Solutions Holdings Limited acquired 4,913 equity shares of Transport Corporation of India Limited through open market transactions on December 08, 2025. The acquisition increased Bhoruka's shareholding from 44.0955% to 44.1019% in the target company, with the acquirer being part of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1765271008059,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhoruka Supply Chain Solutions Acquires Additional Shares in Transport Corporation of India",
            "Summary": "Bhoruka Supply Chain Solutions Holdings Limited acquired 638 equity shares of Transport Corporation of India Limited on December 05, 2025, through open market transactions. The acquisition increased Bhoruka's shareholding from 44.0947% to 44.0955% in the target company, representing a marginal increase of 0.0008% in their existing stake.",
            "Sentiment": "neutral",
            "PublishDate": 1765179518259,
            "Source": "corporate_action"
        },
        {
            "Title": "Transport Corporation of India Gets Credit Rating Reaffirmation and Withdraws Commercial Paper Rating",
            "Summary": "ICRA Limited reaffirmed Transport Corporation of India Limited's credit rating for long-term fund-based term loans of Rs. 200 crore at [ICRA]AA (Stable). The rating covers facilities from ICICI Bank Limited (Rs. 50 crore), State Bank of India (Rs. 50 crore), and a proposed term loan (Rs. 100 crore). Additionally, ICRA withdrew the credit rating for the company's Commercial Paper issuance of Rs. 150 crore, which previously held an [ICRA]A1+ rating. The withdrawal was made at the company's request. The reaffirmed ratings will be due for surveillance within one year from the rating communication date.",
            "Sentiment": "neutral",
            "PublishDate": 1761920017004,
            "Source": "stock"
        },
        {
            "Title": "Transport Corporation of India Reports Mixed Performance in Q2 FY26 with 8% Consolidated Revenue Growth",
            "Summary": "Transport Corporation of India Limited submitted its investor presentation for the second quarter and half year ended September 30, 2025. The company reported consolidated revenue of Rs 23,680 million for the six-month period, representing 8% growth compared to the previous year. The freight division experienced flat revenue growth at Rs 8,364 million due to softness in infrastructure and capital goods sectors, with some contracts transferred during slump sale to TCI ChemLog. The supply chain division showed strong momentum with 14% revenue growth to Rs 9,179 million, driven by new contracts and expansion in existing ones. The seaways division faced challenges with revenue declining 2% to Rs 2,824 million, impacted by two ships being dry-docked and favorable fuel prices. The company maintained its revenue and profit growth outlook at 10-12% and continued investments in strategic asset classes worth Rs 170 crore. TCI operates across multiple logistics segments including freight, supply chain, and coastal shipping, with a diversified service portfolio spanning various industries.",
            "Sentiment": "neutral",
            "PublishDate": 1761858192178,
            "Source": "earnings"
        },
        {
            "Title": "Transport Corporation Of India Board Approves Sale of TCI Global Singapore Stake to TCI Express Subsidiary",
            "Summary": "Transport Corporation Of India's board has approved a restructuring plan to sell its entire 100% stake in TCI Global Singapore to a subsidiary of TCI Express. The transaction involves the complete divestment of the Singapore-based entity as part of the company's restructuring strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1761735928125,
            "Source": "corporate_action"
        },
        {
            "Title": "Transport Corporation of India Reports Growth in Q2 Financial Results",
            "Summary": "Transport Corporation of India reported Q2 EBITDA of 1.27 billion rupees compared to 1.17 billion rupees in the previous year. The EBITDA margin improved to 10.52% from 10.45% year-over-year. The company's consolidated net profit increased to 1.13 billion rupees from 1.06 billion rupees, while revenue grew to 12.05 billion rupees from 11.21 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1761734165766,
            "Source": "earnings"
        },
        {
            "Title": "Transport Corporation of India Reports Strong Q1 Growth with 18% Jump in Net Profit",
            "Summary": "Transport Corporation of India delivered robust quarterly results with consolidated net profit rising to 1.07 billion rupees from 910 million rupees year-over-year. Revenue increased to 11.39 billion rupees compared to 10.54 billion rupees in the same period last year. The company's EBITDA grew to 1.2 billion rupees from 1.04 billion rupees, while EBITDA margin improved to 10.62% from 9.9% year-over-year, indicating enhanced operational efficiency alongside top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1753691755695,
            "Source": "earnings"
        },
        {
            "Title": "Transport Corporation of India: Q4 Profit Rises 12%, Revenue Up 9%",
            "Summary": "Transport Corporation of India Ltd reported Q4 FY2025 net profit of ₹114 crore, up 11.8% YoY. Revenue increased 9.35% to ₹1,179 crore. EBITDA rose 11.1% to ₹121.7 crore with a margin of 10.3%. The company achieved zero net borrowing and an additional cash surplus of ₹235 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747244876000,
            "Source": "earnings"
        },
        {
            "Title": "Transport Corporation of India Reports Q4 EBITDA and Margin Decline",
            "Summary": "Transport Corporation of India has reported its Q4 financial results. The company's EBITDA decreased to 1.2 billion rupees from 1.3 billion rupees year-over-year. Additionally, the EBITDA margin declined to 10.32% from 12% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747228175000,
            "Source": "result"
        },
        {
            "Title": "Transport Corporation of India Reports Q4 Financial Results",
            "Summary": "Transport Corporation of India has announced its Q4 consolidated financial results. The company's net profit increased to 1.14 billion rupees, up from 1.02 billion rupees year-over-year and 1 billion rupees quarter-over-quarter. Revenue for Q4 rose to 11.8 billion rupees from 10.8 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747228110000,
            "Source": "result"
        },
        {
            "Title": "Transport Corporation to Consider Private Placement of NCDs/Bonds",
            "Summary": "Transport Corporation has scheduled a board meeting on May 14 to consider the issuance of non-convertible debentures (NCDs), bonds, or other instruments through private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1746704886000,
            "Source": "default"
        },
        {
            "Title": "Transport Corporation of India Reports Q3 Revenue Growth",
            "Summary": "Transport Corporation of India has announced its third-quarter financial results, reporting revenue of 11.4 billion rupees. This represents a significant increase from the 10 billion rupees reported in the same quarter of the previous year, indicating year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737947145000,
            "Source": "earnings"
        },
        {
            "Title": "Transport Corporation of India Reports 26% Increase in Q3 Net Profit",
            "Summary": "Transport Corporation of India has announced its Q3 consolidated net profit, which rose to 1 billion rupees from 794 million rupees in the same period last year, representing a 26% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737947136000,
            "Source": "earnings"
        },
        {
            "Title": "Transport Corporation of India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Transport Corporation of India has announced its Q3 financial results. The company's EBITDA increased to 1.19 billion rupees, up from 999 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 10.33% from 9.97% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737947127000,
            "Source": "earnings"
        },
        {
            "Title": "Transport Corporation of India to Sell Chemical Logistics Business",
            "Summary": "Transport Corporation of India has announced the sale of its chemical logistics business through a slump sale valued at 450 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1735040867000,
            "Source": "corporate_action"
        },
        {
            "Title": "Transport Corp. of India: MD Forecasts Stronger H2 Growth, Especially in Freight",
            "Summary": "TCI's MD Vineet Agarwal expects better growth in H2 FY24, particularly in the freight division. Q2 saw 12.6% YoY revenue growth to Rs 1,131 crore and 22.2% profit increase to Rs 107.3 crore. Freight division growth was muted at 6% YoY. Agarwal anticipates freight revenue growth to reach 10% and bottom line to improve in H2. Geopolitical risks and high interest rates are potential headwinds.",
            "Sentiment": "positive",
            "PublishDate": 1730086688000,
            "Source": "normal_news"
        },
        {
            "Title": "Transport Corporation of India Declares Dividend",
            "Summary": "Transport Corporation of India has announced a dividend of 3.5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729760370000,
            "Source": "corporate_action"
        },
        {
            "Title": "Transport Corporation of India Reports Strong Q2 Financial Performance",
            "Summary": "Transport Corporation of India has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.4 billion rupees, up from 1 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 12.6% from 10.11% in the previous year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1729760193000,
            "Source": "result"
        },
        {
            "Title": "Transport Corporation of India Reports Q2 Revenue Growth",
            "Summary": "Transport Corporation of India has announced its second quarter revenue results. The company reported revenue of 11.2 billion rupees, compared to 9.94 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729760163000,
            "Source": "result"
        },
        {
            "Title": "Transport Corporation of India Reports Q2 Profit Increase",
            "Summary": "Transport Corporation of India has reported a consolidated net profit of 1.06 billion rupees for the second quarter, compared to 870 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729760139000,
            "Source": "result"
        }
    ]
}