{
    "Symbol": "TCIEXP",
    "ISIN": "INE586V01016",
    "News": [
        {
            "Title": "TCI Express Q3 Net Profit Rises 11.11% to ₹230M",
            "Summary": "TCI Express reported a net profit of ₹230 million in Q3, marking an 11.11% year-on-year increase from ₹207 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770112936701,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Express Board Meeting Set for Feb 3, 2026",
            "Summary": "TCI Express Limited has scheduled a board meeting for February 3, 2026, to consider Q3 FY26 results and potential interim dividend declaration with record date of February 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769450968160,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Express Completes Singapore Acquisition Deal",
            "Summary": "TCI Express Limited successfully acquired 100% equity shares of TCI Global (Singapore) Pte. Ltd. for SGD 18,000, expanding its presence in the Singapore logistics market through its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1769448209843,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Express Faces ₹51.36 Cr GST Demand Order",
            "Summary": "TCI Express receives confirmation that GST demand order of ₹51.36 crores for FY2017-22 remains in force. Company plans to file appeal with GST authorities, citing strong case on merits.",
            "Sentiment": "negative",
            "PublishDate": 1768576901129,
            "Source": "stocks"
        },
        {
            "Title": "TCI Express Board Meet Set for Feb 3 for Q3FY26 Results",
            "Summary": "TCI Express Limited has scheduled its board meeting for February 3, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025. Trading window closed from January 1.",
            "Sentiment": "neutral",
            "PublishDate": 1768034390023,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Express Board Meet Set for Feb 3 for Q3FY26 Results",
            "Summary": "TCI Express Limited has scheduled its board meeting for February 3, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768034363028,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Express Reports Flat Revenue Growth in Q2 FY26 Amid GST Impact and Manufacturing Slowdown",
            "Summary": "TCI Express reported revenue of Rs. 312 crores for Q2 FY26 compared to Rs. 314 crores in the same quarter last year, with EBITDA at Rs. 39 crores (12.4% margin) and profit after tax of Rs. 25 crores (8.1% margin). For H1 FY26, total income was Rs. 602 crores versus Rs. 609 crores in the previous year. The company handled 2.5 lakh tons of cargo in Q2, with volumes remaining flat due to GST rate cuts causing supply chain disruptions and continued challenges in the MSME segment. Surface Express division, the largest revenue contributor, faced headwinds from reduced manufacturing activity in paper and plastic industries. However, other segments showed strong growth - Rail Express grew 25% year-on-year, International Air Express expanded 40%, and C2C Express recorded 15% growth. The company opened 35 new branches during the quarter and leased a larger sorting center in Mumbai. Management expects volume growth of 8% and revenue growth of 10% for the full year, with margins targeting 12.5% plus. TCI Express maintains a debt-free status with liquid assets of Rs. 150 crores and spent Rs. 28 crores on capex in H1 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1762945115327,
            "Source": "earnings"
        },
        {
            "Title": "TCI Express Plans Network Expansion with AI-Enabled Sorting Centers and 100+ New Branches",
            "Summary": "TCI Express is expanding its logistics network through automation and infrastructure development. The company is implementing AI-enabled sorting centers at Gurugram and Pune facilities, which are expected to improve throughput by 40%. The expansion strategy includes adding over 100 branches and growing pharma cold-chain services. TCI Express operates with a fully containerized fleet and digital tracking systems to support faster delivery and cost efficiency in B2B logistics operations.",
            "Sentiment": "positive",
            "PublishDate": 1762438404618,
            "Source": "stock"
        },
        {
            "Title": "TCI Express Reports Quarterly Results and Approves Singapore Subsidiary Acquisition",
            "Summary": "TCI Express Limited announced its unaudited financial results for the quarter ended September 30, 2025. The company reported net sales of Rs 308.53 crores for the quarter, with net profit after tax of Rs 25.15 crores. The Board approved the acquisition of 100% equity shares of TCI Global (Singapore) Pte. Ltd. for up to SGD 18,000 through its wholly owned subsidiary TCI Express Pte. Ltd. This strategic acquisition aims to enhance the company's regional presence and strengthen global logistics operations. Additionally, the Board approved issuing a corporate guarantee of up to SGD 5 million to DBS Bank Limited on behalf of TCI Express Pte. Ltd. to secure banking facilities. The acquired Singapore entity, incorporated in 2006, operates in transport and logistics services but has recorded no turnover in the last three financial years.",
            "Sentiment": "positive",
            "PublishDate": 1762438309134,
            "Source": "earnings"
        },
        {
            "Title": "TCI Express Reports Decline in Q2 Profitability Metrics",
            "Summary": "TCI Express reported Q2 EBITDA of 354 million rupees compared to 381 million rupees in the same period last year. The company's EBITDA margin decreased to 11.47% from 12.23% year-over-year. Net profit for the quarter stood at 251 million rupees versus 263 million rupees in the previous year. Revenue remained flat at 3.1 billion rupees compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1762423251441,
            "Source": "earnings"
        },
        {
            "Title": "TCI Express Schedules Q2/H1 FY25-26 Earnings Conference Call",
            "Summary": "TCI Express Limited has announced an earnings conference call to discuss its operations and un-audited financial results for Q2/H1 FY25-26. The call is organized by ICICI Securities Limited and scheduled for Thursday, November 6, 2025 at 17:00 IST. The company will be represented by Managing Director Chander Agarwal, Executive Director & CFO Mukti Lal, and Chief Business Officer Pabitra Mohan Panda. The call will address analyst and investor queries regarding the quarterly results. Registration details and toll-free numbers for various countries including Singapore, Hong Kong, UK, and USA have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1761900282753,
            "Source": "earnings"
        },
        {
            "Title": "TCI Express Board Approves Acquisition of TCI Global Singapore",
            "Summary": "The Board of Directors of Transport Corporation of India Limited has approved the sale of 100% equity shares of TCI Global (Singapore) Pte. Ltd. to TCI Express Pte. Ltd., a wholly owned subsidiary of TCI Express Limited. The transaction involves TCI Holdings Asia Pacific Pte. Ltd. selling its stake to facilitate TCI Express's expansion in the Singapore region. TCI Global Singapore operates in the logistics industry and has reported nil turnover for the last 3 years. The acquisition is structured as a related party transaction with Chander Agarwal serving as Managing Director of TCI Express Limited and Director of TCI Global Singapore. The transaction will be conducted on an arm's length basis through cash consideration. TCI Express management will present the proposal to their Board of Directors for approval at a meeting scheduled for November 6, 2025. The cost of acquisition and percentage of shareholding details will be disclosed following the board meeting outcome.",
            "Sentiment": "neutral",
            "PublishDate": 1761855855377,
            "Source": "order&deals"
        },
        {
            "Title": "TCI Express Targets 8-10% Volume Growth in FY26, Expects Strong H2 Recovery",
            "Summary": "TCI Express anticipates a significant rebound in the second half of the financial year, driven by recent GST cuts and enhanced income tax limits. Executive Director and CFO Mukti Lal expects strong performance from small and medium enterprises benefiting from these government measures. The logistics firm is targeting 8-10% volume growth in FY26, accompanied by price increases that customers have accepted well. To reduce business concentration risk, TCI Express is expanding into multimodal services including rail, air, and customer-to-customer logistics. The company is focusing on high-potential sectors like solar, defense, bathware, and kitchenware, while capitalizing on the quick commerce trend by servicing dark stores for FMCG, footwear, and lifestyle products in the B2B segment. Lal emphasized the company's focus on sustainable, profitable growth over rapid expansion, distinguishing TCI Express's B2B approach from newer tech-driven logistics firms that primarily serve the B2C market.",
            "Sentiment": "positive",
            "PublishDate": 1758264878835,
            "Source": "stock"
        },
        {
            "Title": "TCI Express Reports Senior Management Changes and Q1 FY26 Results",
            "Summary": "TCI Express Limited announced multiple senior management changes effective August 14, 2025. The company appointed Mr. Shivi Suri as Chief Operating Officer-Air Cargo (International & Domestic), bringing over 26 years of logistics industry experience. Mr. Pabitra Mohan Panda's designation changed from Sr. Chief Sales & Marketing Officer to Chief Business Officer, while Mr. Ashok Kumar Pandey was redesignated from Chief Operating Officer (Multimodal Express) to Regional Express Manager. The company also reconstituted its Board committees following the appointment of Mr. Phool Chand Sharma as Independent Director and the demise of Mr. Ashok Kumar Ladha on June 27, 2025. For the quarter ended June 30, 2025, TCI Express reported standalone net sales of Rs 286.75 crores compared to Rs 292.98 crores in the same period last year. Net profit for the quarter was Rs 21.04 crores versus Rs 20.67 crores in the previous year. Basic earnings per share stood at Rs 5.55 compared to Rs 5.38 in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755160106105,
            "Source": "corporate_governance"
        },
        {
            "Title": "TCI Express Reports Decline in Q1 Profitability and Margins",
            "Summary": "TCI Express reported quarterly results showing a decline in key financial metrics. EBITDA decreased to 415 million rupees from 452 million rupees year-over-year, while EBITDA margin contracted to 14.5% from 15.4%. Net profit fell to 210 million rupees compared to 231 million rupees in the same period last year. Revenue also declined slightly to 2.9 billion rupees from 2.93 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755159595543,
            "Source": "earnings"
        },
        {
            "Title": "TCI Express Postpones Q1 FY 2025-26 Results Conference Call to August 14",
            "Summary": "TCI Express Limited has rescheduled its analysts' and investors' conference call to discuss Q1 FY 2025-26 unaudited financial results. The call, originally planned for an earlier date, has been moved to August 14, 2025, due to the postponement of the company's board meeting. The conference call was intended to discuss both standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company stated that relevant details about the conference call will be shared in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1753776421975,
            "Source": "corporate_action"
        },
        {
            "Title": "TCI Express Declares Dividend of Rs 2 Per Share",
            "Summary": "TCI EXPRESS has announced a dividend of 2 rupees per share. No additional details about the dividend, such as the fiscal period or payment date, were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748605478000,
            "Source": "result"
        },
        {
            "Title": "TCI Express Reports Q4 Financial Results",
            "Summary": "TCI Express has released its Q4 financial results. The company's EBITDA for Q4 was 265 million rupees, compared to 448 million rupees in the same quarter last year. The EBITDA margin decreased to 8.63% from 14.05% year-over-year. Net profit for Q4 was 194 million rupees, down from 316 million rupees year-over-year and 192 million rupees quarter-over-quarter. The company's Q4 revenue was reported against 3.2 billion rupees in the previous year, but the current quarter's revenue figure was not provided.",
            "Sentiment": "negative",
            "PublishDate": 1748605346000,
            "Source": "result"
        },
        {
            "Title": "TCI Express: Q3 Results Prompt Motilal Oswal to Maintain 'Neutral' Rating",
            "Summary": "TCI Express faces challenges in volume growth, impacting overall growth and margins. Motilal Oswal reiterates a 'Neutral' stance on the stock and revises the target price, citing expectations of muted volume growth in the near to medium term.",
            "Sentiment": "neutral",
            "PublishDate": 1738915750000,
            "Source": "earnings"
        },
        {
            "Title": "TCI Express Reports Decline in Q3 FY24 Financial Results",
            "Summary": "TCI Express, a logistics company, has reported its financial results for the third quarter. The company's net profit decreased to 207 million rupees from 321 million rupees in the same quarter last year. Revenue also declined to 2.96 billion rupees from 3.12 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738832277000,
            "Source": "earnings"
        },
        {
            "Title": "TCI Express Anticipates Demand Recovery in Festive Season",
            "Summary": "TCI Express expects a rebound in demand during the upcoming festive season. The company plans to support this growth through customer-focused strategies and strategic initiatives, as outlined in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730290698000,
            "Source": "normal_news"
        },
        {
            "Title": "TCI Express Aims to Expand Multimodal Express Services",
            "Summary": "TCI Express has announced plans to grow its multimodal express services, focusing on rail and air solutions. The company aims to increase the contribution of these services to 20-22% of total revenue within the next 2-3 years. This strategic move is intended to enhance the company's service offerings and strengthen its competitive position in the market.",
            "Sentiment": "positive",
            "PublishDate": 1730290571000,
            "Source": "corporate_action"
        },
        {
            "Title": "TCI Express Declares Interim Dividend",
            "Summary": "TCI Express has announced an interim dividend of 3 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730283265000,
            "Source": "corporate_action"
        },
        {
            "Title": "TCI Express Reports Q2 EBITDA Decline",
            "Summary": "TCI Express has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 381 million rupees, down from 504 million rupees in the same quarter last year. The EBITDA margin also decreased to 12.23% from 15.77% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730283255000,
            "Source": "result"
        },
        {
            "Title": "TCI Express Reports Q2 Revenue Decline",
            "Summary": "TCI Express, a logistics company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 3.1 billion rupees, showing a slight decrease from 3.2 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1730283243000,
            "Source": "result"
        },
        {
            "Title": "TCI Express Q2 Net Profit Declines Year-over-Year",
            "Summary": "TCI Express reported a net profit of 263 million rupees for the second quarter, showing a decrease from 356 million rupees in the same quarter last year. However, it represents an increase from 231 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730283230000,
            "Source": "result"
        }
    ]
}