{
    "Symbol": "TCIFINANCE",
    "ISIN": "INE911B01018",
    "News": [
        {
            "Title": "TCI Finance Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "TCI Finance Limited has scheduled a board meeting on February 10, 2026, to consider and approve unaudited standalone financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770201702803,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCI Finance hits lower circuit for 6th straight day",
            "Summary": "TCI Finance shares locked at 5% lower circuit for sixth consecutive session at ₹26.95, despite remarkable 130% surge in three months and 670% gain over three years.",
            "Sentiment": "neutral",
            "PublishDate": 1768834744091,
            "Source": "stocks"
        },
        {
            "Title": "TCI Finance clarifies price movement to exchanges",
            "Summary": "TCI Finance Limited responds to BSE and NSE queries regarding recent price movements, stating no material information was withheld and attributing changes to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1766208826519,
            "Source": "stocks"
        },
        {
            "Title": "TCI Finance Schedules Board Meeting for October 29 to Approve Quarterly Results",
            "Summary": "TCI Finance Limited has scheduled a Board of Directors meeting for October 29, 2025 to consider and approve the unaudited standalone financial results for the quarter ended September 30, 2025. The company has also closed the trading window for insiders from October 1, 2025 until 48 hours after the results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1761113554140,
            "Source": "corporate_action"
        },
        {
            "Title": "TCI Finance Appoints D N V Sai Anusha as Chief Financial Officer",
            "Summary": "TCI Finance Limited appointed Ms. D N V Sai Anusha as Chief Financial Officer effective August 6, 2025. The appointment was approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee. Ms. Anusha is a Commerce Graduate pursuing CA (Final) with over 4 years of experience in Accounts and Finance.",
            "Sentiment": "neutral",
            "PublishDate": 1754480709675,
            "Source": "corporate_governance"
        },
        {
            "Title": "TCI Finance Approves Quarterly Results and Appoints New CFO",
            "Summary": "TCI Finance Limited's Board of Directors approved the unaudited standalone financial results for the quarter ended June 30, 2025. The board also appointed Ms. D N V Sai Anusha as Chief Financial Officer effective August 6, 2025. The board meeting was held on August 6, 2025, commencing at 3:00 PM and concluding at 3:30 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1754477887412,
            "Source": "corporate_action"
        }
    ]
}