{
    "Symbol": "TCPLPACK",
    "ISIN": "INE822C01015",
    "News": [
        {
            "Title": "TCPL Packaging Q3 FY26 EBITDA Surges 14.7% YoY",
            "Summary": "TCPL Packaging reported consolidated EBITDA growth of 14.7% YoY to Rs. 81.0 crore in Q3 FY26, with margins expanding to 17.2%. Revenue declined 1.8% to Rs. 471.2 crore amid export challenges.",
            "Sentiment": "positive",
            "PublishDate": 1770643762718,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCPL Packaging Board Meet Set for Feb 9, 2026",
            "Summary": "TCPL Packaging Limited schedules board meeting on February 9, 2026 to approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769593888605,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCPL Packaging ESOP Trust Transfers 548 Shares",
            "Summary": "TCPL Packaging Limited announces transfer of 548 equity shares by TCPL ESOP Trust to stock option grantee following exercise of employee stock options under company's stock option plan.",
            "Sentiment": "neutral",
            "PublishDate": 1766146874489,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCPL Packaging Invests ₹3.49 Cr in Subsidiaries",
            "Summary": "TCPL Packaging Limited invested ₹3.49 crores through rights issues in two wholly-owned subsidiaries - Creative Offset Printers and Accura Technik, maintaining 100% shareholding in both entities.",
            "Sentiment": "positive",
            "PublishDate": 1765793215659,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCPL Packaging Reports Stable Performance Amid GST Disruption and Export Challenges",
            "Summary": "TCPL Packaging delivered consolidated revenue of INR 461 crore for Q2 FY26 with EBITDA margins of 15%, while facing temporary disruptions from GST slab revisions that affected domestic demand and ongoing export market volatility. The company's Chennai Greenfield plant continues ramping up with 40-50% utilization, and management expects normalized demand conditions following the GST transition period.",
            "Sentiment": "neutral",
            "PublishDate": 1763632133973,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Reports Quarterly Financial Results for September 2025",
            "Summary": "TCPL Packaging Limited published its unaudited financial results for the quarter ended September 30, 2025, which were approved by the Board of Directors on November 14, 2025. The company operates in a single packaging segment and has filed the detailed results with stock exchanges BSE and NSE as per regulatory requirements.",
            "Sentiment": "negative",
            "PublishDate": 1763215820383,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Appoints Amit Kar as New ESOP Trust Trustee",
            "Summary": "TCPL Packaging Limited appointed Mr. Amit Kar as a new Trustee for the TCPL ESOP Trust, replacing Mr. Vivek Poddar. The Trust Deed has been modified to reflect this trustee change, with no other alterations made to the document. The appointment was communicated to the Bombay Stock Exchange and National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1757668926929,
            "Source": "corporate_governance"
        },
        {
            "Title": "TCPL Packaging Reports 5% Revenue Growth to Rs 424.7 Crore in Q1 FY26, Chennai Plant Achieves Production Stability",
            "Summary": "TCPL Packaging Limited delivered consolidated revenues of Rs 424.7 crore in Q1 FY26, reflecting almost 5% year-on-year growth despite subdued domestic demand and international market uncertainty. EBITDA remained steady at Rs 72.6 crore with margins of 17.1%, down 50 basis points due to higher costs and lower revenue growth. PBT was impacted by a Rs 10 crore forex loss from mark-to-market adjustments on Euro-denominated term loans. The company successfully operationalized its new Chennai manufacturing facility, which achieved production stability and is seeing encouraging customer engagement across South India. Management reported good domestic demand growth entering the festive season, while exports experienced some weakness due to economic factors at end consumers. The company maintains mid-teens to high-teens growth rate targets and continues exploring new market opportunities and diversification strategies.",
            "Sentiment": "neutral",
            "PublishDate": 1754393131717,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Declares Rs 30 Per Share Dividend for FY 2024-25",
            "Summary": "TCPL Packaging Limited announced a dividend payment of Rs 30.00 per equity share for Financial Year 2024-25. The dividend was approved by members at the company's 37th Annual General Meeting held on July 31, 2025. The dividend will be paid on or after August 5, 2025, through electronic mode to shareholders whose bank account details are registered with the company or depository participant.",
            "Sentiment": "positive",
            "PublishDate": 1754051502727,
            "Source": "corporate_action"
        },
        {
            "Title": "TCPL Packaging Plans Nationwide Expansion Despite Currency-Related Margin Pressures",
            "Summary": "TCPL Packaging is pursuing nationwide growth through new facilities and customer diversification, capitalizing on strong demand for sustainable packaging solutions. The company faces short-term margin challenges due to currency fluctuations affecting its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753972185325,
            "Source": "stock"
        },
        {
            "Title": "TCPL Packaging Reports 29% Drop in Quarterly Profit Despite Revenue Growth",
            "Summary": "TCPL Packaging Limited reported standalone profit after tax of Rs. 2,273.38 lakhs for the quarter ended June 30, 2025, compared to Rs. 3,194.55 lakhs in the same quarter last year. Revenue from operations increased to Rs. 40,333.54 lakhs from Rs. 38,392.95 lakhs year-over-year. On a consolidated basis, profit after tax declined to Rs. 2,231.65 lakhs from Rs. 3,172.10 lakhs in the previous year quarter, while consolidated revenue grew to Rs. 41,827.06 lakhs from Rs. 39,861.49 lakhs. Basic earnings per share decreased to Rs. 24.98 from Rs. 35.10 on standalone basis and to Rs. 24.52 from Rs. 34.86 on consolidated basis. The company acquired 100% stake in Accura Technik Private Limited during the quarter for cylinder manufacturing activities, though commercial production has not yet commenced. The Board approved both standalone and consolidated unaudited financial results following Audit Committee recommendation.",
            "Sentiment": "negative",
            "PublishDate": 1753959321789,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Reports Q4 Results and Declares Dividend",
            "Summary": "TCPL Packaging announced its Q4 financial results. The company's EBITDA for Q4 was 721 million rupees, compared to 704 million rupees in the same quarter last year. The EBITDA margin for Q4 was 17.1%, down from 17.9% in the previous year. The consolidated net profit for Q4 increased to 380 million rupees from 290 million rupees year-over-year. Additionally, TCPL Packaging declared a dividend of 30 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748597693000,
            "Source": "result"
        },
        {
            "Title": "TCPL Packaging to Establish Gravure Cylinder Manufacturing Facility",
            "Summary": "TCPL Packaging has announced plans to set up a new gravure cylinder manufacturing facility. The company expects the facility to be commissioned by the third quarter of fiscal year 2026. Once operational, the facility will have an installed capacity to produce 12,000 cylinders per annum.",
            "Sentiment": "positive",
            "PublishDate": 1746576763000,
            "Source": "default"
        },
        {
            "Title": "TCPL Packaging to Establish Gravure Cylinder Manufacturing Facility",
            "Summary": "TCPL Packaging has announced plans to set up a new gravure cylinder manufacturing facility. The facility is expected to be commissioned by the third quarter of fiscal year 2026. Once operational, it will have an installed capacity to produce 12,000 cylinders per annum.",
            "Sentiment": "positive",
            "PublishDate": 1746531676000,
            "Source": "default"
        },
        {
            "Title": "TCPL Packaging: Aims for 15-20% Long-Term Growth",
            "Summary": "TCPL Packaging's Executive Director Akshay Kanoria expresses confidence in maintaining a 15-20% long-term growth rate. The company recently opened its ninth manufacturing facility in Chennai, focusing on domestic growth and exploring new geographies for exports. Industry trends include premiumisation, sustainability, and packaging quality upgrades.",
            "Sentiment": "positive",
            "PublishDate": 1742105917000,
            "Source": "normal_news"
        },
        {
            "Title": "TCPL Packaging: Penny Stock Surges from ₹8 to ₹4365 in 22 Years",
            "Summary": "TCPL Packaging shares have risen from ₹7.95 in March 2002 to ₹4,365 currently, representing a 54,500% increase over 22 years. The stock has shown significant growth in various timeframes, with a 15% rise in the last month and a 90% increase over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1742017198000,
            "Source": "normal_news"
        },
        {
            "Title": "TCPL Packaging Ltd: Penny Stock Surges 19,471% in 16 Years",
            "Summary": "TCPL Packaging's stock price has risen from ₹21 to ₹4,110 over 16 years, yielding a 19,471% return. In Q3FY25, the company's net profit doubled to ₹37.7 crore, with revenue up 32% to ₹479.7 crore. EBITDA increased 29% year-on-year, driven by product mix and customer base expansion.",
            "Sentiment": "positive",
            "PublishDate": 1740467951000,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Reports Strong Q3 Financial Results",
            "Summary": "TCPL Packaging has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit doubled to 377 million rupees, up from 188 million rupees in the same quarter last year. Revenue also saw a substantial increase, rising to 4.7 billion rupees from 3.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739492210000,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Reports Q3 EBITDA Growth",
            "Summary": "TCPL Packaging has reported its Q3 financial results. The company's EBITDA increased to 706 million rupees, up from 545.6 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 14.95% from 15.29% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739457397000,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "TCPL Packaging has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit doubled to 377 million rupees, up from 188 million rupees in the same quarter last year. Revenue also saw a significant increase, reaching 4.7 billion rupees compared to 3.5 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739457391000,
            "Source": "earnings"
        },
        {
            "Title": "TCPL Packaging Invests 10 Million Rupees in Creative Offset Printers Rights Issue",
            "Summary": "TCPL Packaging has made an additional investment of 10 million rupees in the rights issue of Creative Offset Printers. This move suggests TCPL Packaging is increasing its stake in Creative Offset Printers, potentially strengthening its position in the packaging industry.",
            "Sentiment": "positive",
            "PublishDate": 1735908212000,
            "Source": "corporate_action"
        },
        {
            "Title": "TCPL Packaging Reports Q2 FY2024 Financial Results",
            "Summary": "TCPL Packaging Limited announced its Q2 financial results. The company reported a net profit of 358 million rupees, up from 288 million rupees year-over-year and 319 million rupees quarter-over-quarter. Revenue for Q2 stood at 4.3 billion rupees, compared to 3.82 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731327792000,
            "Source": "result"
        },
        {
            "Title": "InCred Capital Initiates Coverage on TCPL Packaging with Add Rating",
            "Summary": "<p><span class=\"positive\">InCred Capital</span> has <span class=\"positive\">initiated coverage</span> on <b>TCPL Packaging</b> with a <span class=\"positive\">high conviction Add rating</span>. The financial services firm has set a <span class=\"neutral\">target price</span> of <span class=\"positive\">₹4,250</span> per share for TCPL Packaging.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728272736000,
            "Source": "normal_news"
        }
    ]
}