{
    "Symbol": "TCS",
    "ISIN": "INE467B01029",
    "News": [
        {
            "Title": "TCS Hosts AI Hackathon for 10,000 Non-Engineering Students",
            "Summary": "TCS conducted world's first large-scale AI hackathon for non-engineering students across 22 colleges in 10 states. The flagship Tata Bharat YUVAI Hackathon will train 2,000 more students at India AI Impact Summit 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770894986874,
            "Source": "stocks"
        },
        {
            "Title": "TCS Partners with Flight Centre for Tech Transformation",
            "Summary": "Tata Consultancy Services announces strategic partnership with Flight Centre Travel Group to modernize technology platforms, strengthen resilience, and enhance global operations experience.",
            "Sentiment": "positive",
            "PublishDate": 1770617386544,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Block Trade Worth Rs. 23.41 Crores on NSE",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE involving 76,586 shares valued at Rs. 23.41 crores, executed at Rs. 3056.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770176966890,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Bancs™ Selected by Janata Sahakari Bank",
            "Summary": "Janata Sahakari Bank has chosen TCS Bancs™ for implementing advanced banking solutions, marking another client win for TCS's banking technology platform.",
            "Sentiment": "positive",
            "PublishDate": 1770012369875,
            "Source": "stocks"
        },
        {
            "Title": "TCS Block Trade Worth Rs. 15.62 Crores on NSE",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE involving 50,002 shares valued at Rs. 15.62 crores, executed at Rs. 3123.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769761976117,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Study Reveals Critical AI Adoption Gaps in Retail",
            "Summary": "TCS Global Retail Outlook 2026 finds 85% of retailers haven't implemented multi-agent AI systems, with only 24% using AI for autonomous decisions despite recognizing AI as top enabler.",
            "Sentiment": "neutral",
            "PublishDate": 1769666925241,
            "Source": "stocks"
        },
        {
            "Title": "TCS invests USD 37M in new Brazil campus for 1,600 jobs",
            "Summary": "Tata Consultancy Services announces construction of largest delivery centre in Londrina, Brazil with USD 37 million investment, creating 1,600 jobs by 2027.",
            "Sentiment": "positive",
            "PublishDate": 1769517116930,
            "Source": "stocks"
        },
        {
            "Title": "TCS shares drop 0.65% with 31L+ shares traded",
            "Summary": "Tata Consultancy Services stock declined 0.65% to Rs 3,141.90 on NSE with over 31.1 lakh shares traded. Company shows strong annual growth with revenue rising to Rs 255,324 crore in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769506629954,
            "Source": "stocks"
        },
        {
            "Title": "TCS Sees Rs. 63.10 Crore NSE Block Trade",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE worth Rs. 63.10 crores involving approximately 200,994 shares at Rs. 3139.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769500959235,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Partners with Kalmar for AI-Driven IT Upgrade",
            "Summary": "Tata Consultancy Services announces strategic partnership with Kalmar to modernize IT infrastructure using artificial intelligence, creating unified service model for enhanced efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1769065702464,
            "Source": "stocks"
        },
        {
            "Title": "TCS in talks with AWS, OpenAI for Navi Mumbai data centre",
            "Summary": "Tata Consultancy Services is negotiating with hyperscalers including Amazon Web Services and OpenAI as anchor customers for its first data centre in Navi Mumbai, developed jointly with TPG.",
            "Sentiment": "positive",
            "PublishDate": 1769005183008,
            "Source": "stocks"
        },
        {
            "Title": "TCS Partners with Rajarambapu Bank for Treasury Tech",
            "Summary": "Tata Consultancy Services announces partnership with Rajarambapu Sahakari Bank to integrate TCS BaNCS Treasury solution, enhancing the bank's treasury operations and digital transformation journey.",
            "Sentiment": "positive",
            "PublishDate": 1768975994754,
            "Source": "stocks"
        },
        {
            "Title": "TCS CEO outlines AI-first strategy at Davos 2026",
            "Summary": "K Krithivasan emphasizes capability building over immediate revenue gains, announces continued hiring and reskilling initiatives while positioning TCS as world's largest AI-led services company.",
            "Sentiment": "positive",
            "PublishDate": 1768908585697,
            "Source": "stocks"
        },
        {
            "Title": "TCS Sees ₹52.44 Cr Block Trade on NSE",
            "Summary": "Tata Consultancy Services witnessed a significant block trade worth ₹52.44 crores on NSE, involving 167,028 shares at ₹3,139.50 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768888737958,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Sees ₹41.15 Cr NSE Block Trade at ₹3,132.40",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE involving 131,360 shares worth ₹41.15 crores at ₹3,132.40 per share, indicating institutional activity in the IT major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768887977245,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Block Trade Worth ₹81.56 Crores on NSE",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE involving 259,397 shares worth ₹81.56 crores at ₹3,144.10 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768884467692,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Sees ₹27.11 Cr NSE Block Trade at ₹3145.70",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE worth ₹27.11 crores involving approximately 86,170 shares at ₹3145.70 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768882369001,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Block Trade Worth ₹74.77 Crores on NSE",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE involving 237,680 shares valued at ₹74.77 crores, executed at ₹3,145.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1768882341530,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Forms Saudi Arabia Regional Headquarters",
            "Summary": "Tata Consultancy Services establishes wholly owned subsidiary in Saudi Arabia through TCS Netherlands B.V. with initial capital of 1.65 million Saudi Riyals to comply with KSA Vision 2030 requirements.",
            "Sentiment": "positive",
            "PublishDate": 1768807773300,
            "Source": "stocks"
        },
        {
            "Title": "TCS Q3FY26 Revenue Grows 4.9% YoY to ₹67,087 Crores",
            "Summary": "TCS reported strong Q3FY26 results with revenue of ₹67,087 crores, up 4.9% YoY and 2.0% sequentially. AI services revenue reached $1.8 billion annualized, growing 17.3% QoQ, while operating margins remained stable at 25.2%.",
            "Sentiment": "positive",
            "PublishDate": 1768563538310,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Block Trade Worth ₹32.17 Crores on NSE",
            "Summary": "Tata Consultancy Services witnessed a significant block trade on NSE involving 100,360 shares valued at ₹32.17 crores, executed at ₹3,205.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1768535854478,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Completes Coastal Cloud Acquisition on Jan 14, 2026",
            "Summary": "Tata Consultancy Services successfully completed its acquisition of 100% equity interest in Coastal Cloud Holdings, LLC through a structured transaction involving merger and subsidiary acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1768407192288,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Completes Coastal Cloud Acquisition on Jan 14",
            "Summary": "Tata Consultancy Services successfully completed its acquisition of 100% equity interest in Coastal Cloud Holdings, LLC through a structured transaction involving merger and subsidiary acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1768406517829,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Completes Coastal Cloud Acquisition on Jan 14",
            "Summary": "Tata Consultancy Services successfully completed the acquisition of 100% equity interest in Coastal Cloud Holdings, LLC through a structured transaction involving subsidiary mergers.",
            "Sentiment": "positive",
            "PublishDate": 1768406380231,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Partners with AMD to Scale Enterprise AI Solutions",
            "Summary": "Tata Consultancy Services announces strategic partnership with AMD to help enterprises scale AI from pilot projects to production, combining TCS's domain expertise with AMD's high-performance computing portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768375389159,
            "Source": "stocks"
        },
        {
            "Title": "TCS shares in focus for Rs 57/share dividend eligibility",
            "Summary": "TCS announces Rs 57 per share dividend (Rs 11 interim + Rs 46 special) with January 14 as last purchase date for eligibility. Record date set for January 17, 2026, with payment on February 3, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768362724128,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Q3 FY26: AI services drive growth despite profit drop",
            "Summary": "TCS reported 14% decline in net profit for Q3 FY26, but AI services generated $1.8 billion annually, comprising 5.8% of total revenue and fueling growth in traditionally weak quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1768292591845,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS maintains 25.2% EBIT margin despite exceptional costs",
            "Summary": "Tata Consultancy Services held EBIT margins steady at 25.2% in Q3 through productivity gains and operational efficiencies, while absorbing ₹3,300 crore in exceptional costs from labour code implementation and workforce rationalisation.",
            "Sentiment": "neutral",
            "PublishDate": 1768292403008,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS sees AI-led demand uptick, client ROI focus",
            "Summary": "Tata Consultancy Services reports gradual improvement in demand with clients increasingly spending on projects delivering clear ROI. AI portfolio valued at $1.8 billion with 20% QoQ growth.",
            "Sentiment": "positive",
            "PublishDate": 1768288750011,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS sees AI-led demand growth with $1.8B portfolio",
            "Summary": "Tata Consultancy Services reports improving client demand conditions with AI portfolio valued at $1.8 billion showing 20% quarter-on-quarter growth as 54 of top 60 clients run AI-embedded projects.",
            "Sentiment": "positive",
            "PublishDate": 1768288721660,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Expects Employee Terminations to Continue in Q4",
            "Summary": "Tata Consultancy Services indicates that employee terminations will persist through the fourth quarter without setting specific targets for workforce reduction.",
            "Sentiment": "negative",
            "PublishDate": 1768288047008,
            "Source": "stocks"
        },
        {
            "Title": "TCS Q3 Revenue Rises 0.8% QoQ to $7.5 Billion",
            "Summary": "Tata Consultancy Services reported Q3 FY26 revenue of $7.5 billion, growing 0.8% quarter-on-quarter in constant currency terms, exceeding analyst estimates of 0.5% growth.",
            "Sentiment": "positive",
            "PublishDate": 1768285907869,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Q3 Results: Cautious Clients, Growing AI Revenue",
            "Summary": "TCS reports Q3 revenue of ₹67,087 cr with net profit of ₹10,657 cr. AI revenue grows to $1.8 billion annualized as clients adopt quarterly budget approach amid uncertainty.",
            "Sentiment": "neutral",
            "PublishDate": 1768285750726,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS, HCL Tech Q3 results spark IT sector debate",
            "Summary": "Mixed Q3 results from TCS and HCL Tech highlight divergent paths in IT sector amid ₹75,000 crore FII selloff. HCL Tech outperforms with 4.2% QoQ revenue growth and strong AI traction, while TCS faces growth headwinds despite healthy deal bookings.",
            "Sentiment": "neutral",
            "PublishDate": 1768284908963,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Q3FY26 Results Beat Estimates, Gets Buy Rating",
            "Summary": "TCS reported strong Q3FY26 results with revenue of $7.50 billion, up 0.8% QoQ, and adjusted PAT of ₹141.00 billion, beating analyst estimates. Motilal Oswal maintains buy rating with target price of ₹4,400.",
            "Sentiment": "positive",
            "PublishDate": 1768283045068,
            "Source": "co_actions_results"
        },
        {
            "Title": "Choice Equities Sets ₹3,950 Target for TCS",
            "Summary": "Choice Institutional Equities maintains BUY rating on TCS with ₹3,950 target price, citing AI-driven growth and business transformation initiatives driving revenue expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768283013872,
            "Source": "stocks"
        },
        {
            "Title": "TCS Q3 Results: Revenue Up 0.8% QoQ, Margins Stable",
            "Summary": "TCS reported modest revenue growth of 0.8% quarter-on-quarter in constant currency terms during Q3, while maintaining stable operating margins at 25.20% through productivity gains that offset wage increases and AI investments.",
            "Sentiment": "neutral",
            "PublishDate": 1768282876199,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prabhudas Lilladher Sets ₹4,040 Target for TCS",
            "Summary": "Brokerage maintains BUY rating on TCS with ₹4,040 target price, citing strong Q3 revenue growth of 0.8% QoQ and AI revenue run-rate of $1.8 billion growing 17.3% QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1768281420289,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Shares Rise on Q3 Results, Bumper Dividend",
            "Summary": "TCS shares gained 0.86% following Q3 results and announcement of ₹57 per share dividend. Mixed analyst reactions with price targets ranging from ₹3,020 to ₹4,810.",
            "Sentiment": "positive",
            "PublishDate": 1768279846540,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Q3 net profit drops 14% YoY to ₹10,657 crore",
            "Summary": "Tata Consultancy Services reported a 14% year-on-year decline in net profit to ₹10,657 crore for Q3, prompting varied brokerage recommendations on the IT major's stock.",
            "Sentiment": "negative",
            "PublishDate": 1768277688702,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS AI Revenue Surges to $1.8 Billion in Q3 FY25",
            "Summary": "Tata Consultancy Services reports significant growth in AI-focused revenue, reaching $1.8 billion annualised from $1.5 billion, while expanding AI-skilled workforce to 217,000 employees as clients accelerate AI adoption.",
            "Sentiment": "positive",
            "PublishDate": 1768277615712,
            "Source": "stocks"
        },
        {
            "Title": "TCS Shares Decline After Q3 Results, Cautious Outlook",
            "Summary": "TCS shares fell 0.6% in early trade following Q3 FY26 results. Net profit dropped 14% YoY due to exceptional charges, though operational performance remained stable with 8.5% growth excluding one-offs.",
            "Sentiment": "negative",
            "PublishDate": 1768277552129,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brokerages Bullish on TCS, HDFC Bank Post Results",
            "Summary": "Leading brokerages including Nuvama and CLSA maintain positive outlook on select large-cap stocks, citing improved fundamentals and growth visibility across sectors.",
            "Sentiment": "positive",
            "PublishDate": 1768277033695,
            "Source": "stocks"
        },
        {
            "Title": "TCS shares trade flat post Q3 results announcement",
            "Summary": "Tata Consultancy Services shares remained range-bound on Tuesday, January 13, following the release of third quarter earnings for the current financial year, showing muted market reaction.",
            "Sentiment": "neutral",
            "PublishDate": 1768276952070,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Gets 'Buy' Rating from Yes Securities Post Q3",
            "Summary": "Yes Securities maintains 'Buy' rating on TCS following Q3 results, citing disciplined execution, strong order book, and comprehensive service offerings as key competitive advantages.",
            "Sentiment": "positive",
            "PublishDate": 1768276899754,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS Q3 net profit drops 14% YoY to ₹10,657 crore",
            "Summary": "Tata Consultancy Services reported a 14% decline in Q3 net profit to ₹10,657 crore despite 5% revenue growth. The company announced interim dividend of ₹57 per share including special dividend.",
            "Sentiment": "negative",
            "PublishDate": 1768276106668,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on TCS at ₹3,540",
            "Summary": "Morgan Stanley reaffirms its 'Overweight' rating on Tata Consultancy Services with a price target of ₹3,540, reflecting continued confidence in the IT major's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768275968517,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets Outperform Rating on TCS with ₹3,593 Target",
            "Summary": "CLSA maintains an Outperform rating on Tata Consultancy Services with a target price of ₹3,593, indicating positive analyst sentiment for the IT services major.",
            "Sentiment": "positive",
            "PublishDate": 1768275948370,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Sets Hold Rating on TCS with ₹3,450 Target",
            "Summary": "HSBC maintains Hold rating on Tata Consultancy Services with target price of ₹3,450, reflecting cautious outlook on India's largest IT services company amid current market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1768275926923,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Sets Neutral Rating on TCS at ₹3,300",
            "Summary": "Nomura maintains neutral stance on Tata Consultancy Services with target price of ₹3,300, reflecting cautious outlook on India's largest IT services company.",
            "Sentiment": "neutral",
            "PublishDate": 1768275903225,
            "Source": "stocks"
        }
    ]
}