{
    "Symbol": "TDPOWERSYS",
    "ISIN": "INE419M01027",
    "News": [
        {
            "Title": "TD Power Systems redesignates Ms. Ramya Ramesh",
            "Summary": "TD Power Systems Limited announced the redesignation of Ms. Ramya Ramesh as Head – Sales and Project Execution (Motors) and Head of IT, effective February 1, 2026, expanding her current role.",
            "Sentiment": "neutral",
            "PublishDate": 1769688980779,
            "Source": "stocks"
        },
        {
            "Title": "TD Power Systems Q3FY26 Revenue Jumps 33.6%",
            "Summary": "TD Power Systems reported Q3FY26 standalone revenue of ₹42,885.45 lakhs, up 33.6% YoY. Net profit surged 48.1% to ₹5,503.94 lakhs with strong operational performance across segments.",
            "Sentiment": "positive",
            "PublishDate": 1769685718931,
            "Source": "co_actions_results"
        },
        {
            "Title": "TD Power Systems Board Meet Set for Jan 29, 2026",
            "Summary": "TD Power Systems Limited has scheduled a board meeting on January 29, 2026, to review Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768885621758,
            "Source": "co_actions_results"
        },
        {
            "Title": "TD Power Systems Eyes ₹6L Cr AI Data Centre Market",
            "Summary": "TD Power Systems targets global AI data centre power infrastructure boom, with revenue projected to grow from ₹1,279 cr in FY25 to ₹2,000 cr in FY27 amid surging demand for backup generators.",
            "Sentiment": "positive",
            "PublishDate": 1768264427709,
            "Source": "stocks"
        },
        {
            "Title": "TD Power Systems Starts Unit 3 Operations",
            "Summary": "TD Power Systems Limited announces commencement of commercial operations at its newly established Unit 3 factory in Tumkur District, marking a significant expansion milestone for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1766077661369,
            "Source": "stocks"
        },
        {
            "Title": "TD Power Systems Receives Extended Court Injunction Against Workers Union Strike",
            "Summary": "TD Power Systems Limited obtained an extended temporary injunction from Nagamangala Court that restrains the Workers Union from obstructing company operations and restricts union activities beyond 25 meters from factory gates until suit disposal. The court order dated November 18, 2025 provides the company relief from union disruptions and ensures uninterrupted business operations during the ongoing legal proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1763621128288,
            "Source": "stock"
        },
        {
            "Title": "TD Power Systems Allots 22,526 Equity Shares Under Employee Stock Plan",
            "Summary": "TD Power Systems Limited allotted 22,526 equity shares of Rs. 2 each at par value following exercise of employee stock appreciation rights under its 2019 compensation plan. The allotment increased the company's paid-up share capital from Rs. 31,23,84,608 to Rs. 31,24,29,660, with the company stating this is not material in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1763457984230,
            "Source": "corporate_action"
        },
        {
            "Title": "TD Power Systems Reports 33% Revenue Growth, Raises FY26 Guidance to INR 18 Billion",
            "Summary": "TD Power Systems reported strong quarterly results with total income rising 33% to INR 7.64 billion for the six-month period ended September 30, 2025, compared to INR 5.77 billion in the previous year. Profit after tax increased 37% to INR 989 million versus INR 720 million previously. The company raised its revenue guidance for the current financial year to INR 18 billion and provided initial guidance of over INR 20 billion for next year. Order inflow for the half-year was INR 9.16 billion, up 39% from INR 6.58 billion previously, with 76% coming from exports. The manufacturing segment order book stands at INR 15.87 billion. Managing Director Nikhil Kumar highlighted extremely high demand in gas turbine and gas engine business, particularly from US and European markets. The company expects to commission its third plant fully by end of December 2025. EBITDA for the half-year was 18.42% including other income. The company maintains a strong cash balance of INR 1.93 billion.",
            "Sentiment": "positive",
            "PublishDate": 1762338708588,
            "Source": "earnings"
        },
        {
            "Title": "TD Power Systems Hits Record High After Strong Quarterly Results, Up 2,700% Since 2018",
            "Summary": "TD Power Systems shares surged over 7% following their September quarter results, with the stock gaining every day this week for a 15% weekly increase. The company revised its full-year revenue guidance upward to ₹1,800 crore from ₹1,500 crore, citing steady order inflows from domestic and international markets with a current order book of ₹1,587 crore. For the September quarter, revenue increased by ₹457 crore, EBITDA grew nearly 40% to ₹87 crore, and net profit rose 46% year-over-year, while margins remained steady at 19%. The company expects continued strength in Gas engine and Gas turbine segments. The stock has gained 64% year-to-date and has delivered positive returns annually since 2019, rising from ₹26 at end-2018 to current levels of ₹737.25, representing a gain of over 2,700%.",
            "Sentiment": "positive",
            "PublishDate": 1761891715080,
            "Source": "stock"
        },
        {
            "Title": "TD Power Targets 20%+ Revenue Growth in FY26-27 with Record Export Orders",
            "Summary": "TD Power expects revenue growth exceeding 20% in FY26-27, driven by record export orders and expanding market share in rotating electrical equipment. The company anticipates benefits from domestic infrastructure revival and global OEM partnerships, which are expected to support steady margin improvement and enhanced cash flows.",
            "Sentiment": "positive",
            "PublishDate": 1761835236279,
            "Source": "stock"
        },
        {
            "Title": "TD Power Systems Recommends Interim Dividend of ₹1 Per Share",
            "Summary": "TD Power Systems has recommended an interim dividend of ₹1 per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1761824843985,
            "Source": "corporate_action"
        },
        {
            "Title": "TD Power Systems Reports Strong Q2 Growth with 46% Jump in Net Profit",
            "Summary": "TD Power Systems delivered robust quarterly performance with consolidated net profit rising to 601.9 million rupees from 412.7 million rupees year-over-year. Revenue increased significantly to 4.52 billion rupees compared to 3.06 billion rupees in the same period last year. EBITDA grew to 826 million rupees from 556 million rupees, while EBITDA margin improved marginally to 18.26% from 18.15%.",
            "Sentiment": "positive",
            "PublishDate": 1761823715334,
            "Source": "earnings"
        },
        {
            "Title": "TD Power Systems Schedules Q2FY26 Earnings Conference Call for October 31, 2025",
            "Summary": "TD Power Systems Limited has scheduled a conference call for analysts and investors on October 31, 2025, at 11:30 AM IST to discuss the company's unaudited financial results for the quarter ended September 30, 2025. The earnings call will cover financial and operational performance for Q2FY26. Key participants include Managing Director Nikhil Kumar, Chief Financial Officer M N Varalakshmi, and the senior management team. The company has provided access numbers for various countries including India, USA, UK, Singapore, and Hong Kong, with pre-registration required for participation.",
            "Sentiment": "neutral",
            "PublishDate": 1760765995729,
            "Source": "earnings"
        },
        {
            "Title": "TD Power Raises Financial Forecasts for Fiscal Years 2026 and 2027",
            "Summary": "TD Power has increased its financial forecasts for fiscal years 2026 and 2027. The company has revised its projections upward for these future periods.",
            "Sentiment": "positive",
            "PublishDate": 1756888314062,
            "Source": "stock"
        },
        {
            "Title": "TD Power Systems Obtains Court Injunction to Prevent Union Strike Disruptions",
            "Summary": "TD Power Systems has secured a court injunction against workers' union strike disruptions. The company's operations will continue without interruption until the next court hearing scheduled for September 24.",
            "Sentiment": "positive",
            "PublishDate": 1756744429344,
            "Source": "stock"
        },
        {
            "Title": "TD Power Systems Faces Strike Notice from Workers' Union Over Reinstatement Demands",
            "Summary": "TD Power Systems is dealing with labor disputes as the workers' union has issued a strike notice regarding reinstatement requests. In response to the potential strike action, the company is pursuing a legal injunction to address the situation.",
            "Sentiment": "negative",
            "PublishDate": 1755846849836,
            "Source": "stock"
        },
        {
            "Title": "TD Power Systems Secures ₹48 Crore Order for US Data Center Generators",
            "Summary": "TD Power Systems Limited received an order worth approximately ₹48 crores through its subsidiary TDPS USA. The order comes from a leading multinational company for supplying generators for gas turbine applications in a data center in the United States. Deliveries are scheduled between February 2026 and August 2027. The company confirmed that none of its promoters, promoter group, or group companies have any interest in the multinational company that awarded the order, and it does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1755153530580,
            "Source": "order&deals"
        },
        {
            "Title": "TD Power Systems Reports 36% Revenue Growth in Q1 FY2026 with Strong Order Book of INR 14.68 Billion",
            "Summary": "TD Power Systems Limited, a manufacturer of AC generators and electric motors, reported consolidated revenue of INR 3.76 billion in Q1 FY2026, marking 36% year-over-year growth. The company's consolidated profit after tax increased 40% to INR 500 million, while maintaining an EBITDA margin of 18.7%. The total order book stands at INR 14.68 billion, with quarterly order inflow of INR 3.92 billion, up 32% year-over-year. Export orders comprised 66% of the quarterly inflow at INR 2.57 billion. The company maintains revenue guidance of INR 15 billion for FY2026 and INR 18 billion for FY2027. Management highlighted strong demand from US and Europe for gas engine and gas turbine generators, driven by data center and AI requirements. To address new US tariffs totaling 50%, the company plans to expand Turkey operations and route 75% of US exports through European OEMs. The generator and motor business holds an order book of INR 10.8 billion, while railways segment has INR 3.48 billion. The company expects strong growth in hydro segment orders and aims to achieve INR 1.5 billion in motor business revenue for FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1754918522281,
            "Source": "earnings"
        },
        {
            "Title": "HBL Power Systems Reports 75% Jump in Q1 Net Profit to 1.4 Billion Rupees",
            "Summary": "HBL Power Systems posted a consolidated net profit of 1.4 billion rupees in Q1, marking a significant increase from 801 million rupees in the same period last year. The company's revenue also grew to 6.02 billion rupees compared to 5.2 billion rupees year-over-year, representing approximately 16% growth.",
            "Sentiment": "positive",
            "PublishDate": 1754832774891,
            "Source": "earnings"
        },
        {
            "Title": "TD Power Systems Plans Global Expansion and Diversification Strategy",
            "Summary": "TD Power Systems has outlined its growth strategy focusing on global expansion in generator exports, capacity optimization, and high-profit custom projects. The company is also making strategic moves into new renewable and industrial areas as part of its expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1754486667570,
            "Source": "stock"
        },
        {
            "Title": "TD Power Systems Reports Strong Q1 Growth with Net Profit Rising 42% to 501M Rupees",
            "Summary": "TD Power Systems delivered robust quarterly performance with consolidated net profit increasing to 501 million rupees from 353 million rupees year-over-year. The company's revenue grew significantly to 3.7 billion rupees compared to 2.7 billion rupees in the same period last year. EBITDA rose to 688 million rupees from 484 million rupees, while EBITDA margin improved to 18.5% from 17.68% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754468132260,
            "Source": "earnings"
        },
        {
            "Title": "TD Power Systems Schedules Q1FY26 Earnings Conference Call for August 7, 2025",
            "Summary": "TD Power Systems Limited has scheduled a conference call on August 7, 2025, at 11:30 AM IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The earnings call will be attended by Managing Director Nikhil Kumar, Chief Financial Officer M N Varalakshmi, and the senior management team. The call is open to analysts and investors, with multiple access numbers provided including primary numbers for India, and international toll-free numbers for USA, UK, Singapore, and Hong Kong. Pre-registration is required for participation in the conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1753434644287,
            "Source": "earnings"
        },
        {
            "Title": "TD Power Systems: Secures ₹67 Crore Export Order for Traction Motor Components",
            "Summary": "TD Power Systems has received an export order worth ₹67 crore from a multinational corporation for traction motor components. Deliveries are scheduled between January 2026 and December 2027. The company emphasized that this is not a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1750355612000,
            "Source": "order&deals"
        },
        {
            "Title": "TD Power Systems Secures 670 Million Rupee Export Contract",
            "Summary": "TD Power Systems has obtained an export contract worth 670 million rupees for traction motor components.",
            "Sentiment": "positive",
            "PublishDate": 1750345844000,
            "Source": "default"
        },
        {
            "Title": "TD Power Systems: Goldman Sachs Acquires Rs 50 Crore Stake via Block Deal",
            "Summary": "Goldman Sachs purchased nearly 11 lakh shares of TD Power Systems at Rs 460 per share, totaling Rs 50.30 crore. The transaction was executed through Goldman Sachs India Equity Portfolio at a 7% discount to the previous closing price.",
            "Sentiment": "positive",
            "PublishDate": 1747971299000,
            "Source": "block_deals"
        },
        {
            "Title": "TD Power Systems: Goldman Sachs Acquires Rs 50 Crore Stake",
            "Summary": "Goldman Sachs purchased nearly 11 lakh shares of TD Power Systems via block deals at Rs 460 per share, totaling Rs 50.30 crore. The acquisition was made through Goldman Sachs India Equity Portfolio at a 7% discount from the previous closing price.",
            "Sentiment": "positive",
            "PublishDate": 1747931627000,
            "Source": "block_deals"
        },
        {
            "Title": "TD Power Systems: Large Block Deal Triggers 8% Share Price Drop",
            "Summary": "TD Power Systems shares fell nearly 8% after 1.3 crore shares (8.1% equity) changed hands in block deals. The buyers, sellers, and transaction price are unknown. The stock hit an intraday low of ₹455 and was trading at ₹471.3 at 10 am, down 4.55%.",
            "Sentiment": "negative",
            "PublishDate": 1747888343000,
            "Source": "block_deals"
        },
        {
            "Title": "TD Power Systems Reports Strong Q4 Financial Results",
            "Summary": "TD Power Systems has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 530 million rupees, up from 290 million rupees in the same quarter last year and 449 million rupees in the previous quarter. Revenue also increased to 3.48 billion rupees from 2.64 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747095790000,
            "Source": "default"
        },
        {
            "Title": "TD Power Systems Reports Strong Q4 Financial Results",
            "Summary": "TD Power Systems has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 655 million rupees from 418 million rupees in the previous year, with the EBITDA margin rising to 18.24% from 15.85%. Consolidated net profit grew to 530 million rupees from 290 million rupees year-over-year and 449 million rupees quarter-over-quarter. Revenue for Q4 reached 3.48 billion rupees, up from 2.64 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747052985000,
            "Source": "result"
        },
        {
            "Title": "TD Power Systems: Ambitious Revenue Target of Rs 1,500 Crore by FY26",
            "Summary": "TD Power Systems aims to achieve Rs 1,275 crore revenue in FY25 and Rs 1,500 crore by FY26. Growth driven by AI data centers in the US, Europe's energy transition, and increased oil and gas exploration. Company reports 88% increase in export order inflow over the last 9 months. Targeting 17.5% EBITDA margins with a focus on exports. No plans to raise capital, expecting to reach Rs 2,400 crore in resources through improved productivity.",
            "Sentiment": "positive",
            "PublishDate": 1741186957000,
            "Source": "normal_news"
        },
        {
            "Title": "T D Power Systems Reports Strong Q3 EBITDA Growth",
            "Summary": "T D Power Systems has reported a significant increase in its Q3 EBITDA, rising from 397 million rupees to 613 million rupees year-over-year. The company's EBITDA margin also improved, increasing from 16.36% to 17.49% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738846903000,
            "Source": "earnings"
        },
        {
            "Title": "T D Power Systems Reports Strong Q3 Financial Results",
            "Summary": "T D Power Systems has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 449 million rupees from 300 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 3.5 billion rupees compared to 2.4 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738846898000,
            "Source": "earnings"
        },
        {
            "Title": "TD Power Systems Secures 570M Rupee Order from Nuclear Power Corporation of India",
            "Summary": "TD Power Systems has won a significant order worth 570 million rupees from the Nuclear Power Corporation of India (NPCIL) for the supply of induction motors. This order represents a substantial business opportunity for the company in the nuclear power sector.",
            "Sentiment": "positive",
            "PublishDate": 1737188093000,
            "Source": "order&deals"
        },
        {
            "Title": "TD Power Systems Revokes Partial Lockout for 36 Workmen",
            "Summary": "TD Power Systems has lifted a partial lockout that was previously imposed on 36 of its workers. This action suggests a resolution to a labor dispute or operational issue within the company.",
            "Sentiment": "positive",
            "PublishDate": 1731501058000,
            "Source": "corporate_action"
        },
        {
            "Title": "TD Power Systems Revises Annual Revenue Guidance Upward",
            "Summary": "TD Power Systems has updated its revenue forecast for the current financial year. The company now expects top-line figures between INR 1,250-1,275 crores, up from the previous estimate of INR 1,200 crores. This new guidance represents a year-over-year growth of 25-27.5% compared to the previous financial year.",
            "Sentiment": "positive",
            "PublishDate": 1730345153000,
            "Source": "corporate_action"
        },
        {
            "Title": "T D Power Systems Reports Improved Q2 Financial Performance",
            "Summary": "T D Power Systems has announced its Q2 financial results, showing an increase in EBITDA from 472 million rupees to 556 million rupees year-over-year. The company's EBITDA margin also improved, rising from 17.24% to 18.15% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730200339000,
            "Source": "result"
        },
        {
            "Title": "T D Power Systems Reports Q2 Revenue Growth",
            "Summary": "T D Power Systems has announced its second quarter revenue, which stands at 3 billion rupees, compared to 2.7 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730200328000,
            "Source": "result"
        },
        {
            "Title": "T D Power Systems Reports Q2 Profit Increase",
            "Summary": "T D Power Systems has reported a consolidated net profit of 412.7 million rupees for the second quarter, showing an increase from 328 million rupees year-over-year and 353 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730200318000,
            "Source": "result"
        },
        {
            "Title": "TD Power Systems: Secures €300 Million European Traction Motor Deal",
            "Summary": "TD Power Systems signed a five-year contract to supply traction motors to the European market, with an initial order of ₹18 crore for April 2025 delivery. The total contract value is expected to reach ₹300 crore over five years. This is the company's third major order in a week, following two contracts worth ₹142 crore for gas engine generators.",
            "Sentiment": "positive",
            "PublishDate": 1729503454000,
            "Source": "corporate_action"
        },
        {
            "Title": "TD Power Systems: Order Book Set to Exceed ₹1,200 Crore Target",
            "Summary": "TD Power Systems anticipates surpassing its ₹1,200 crore order guidance due to strong market demand. The company is experiencing robust growth in its order book.",
            "Sentiment": "positive",
            "PublishDate": 1729060534000,
            "Source": "normal_news"
        },
        {
            "Title": "TD Power Systems: Secures Rs 142 Crore Export Orders for Gas Engine Generators",
            "Summary": "<p><span class='positive'>TD Power Systems</span> has received <span class='positive'>two orders</span> worth <span class='positive'>Rs 142 crore</span> from <b>international gas engine OEMs</b> for supplying <b>gas engine generators</b>. The orders are for <span class='neutral'>export markets</span>, with partial delivery in the current and next financial year. The company <span class='positive'>anticipates more orders</span> in this segment in the coming quarters.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728967560000,
            "Source": "normal_news"
        },
        {
            "Title": "TD Power Systems Secures 142 Crore Rupee Order",
            "Summary": "<p>TD Power Systems has won a <span class='positive'>new order</span> worth <span class='positive'>142 crore rupees</span> (approximately $17.1 million USD). This represents a <span class='positive'>significant business development</span> for the company, potentially <span class='positive'>boosting</span> its <b>revenue</b> and <b>order book</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728967076000,
            "Source": "corporate_action"
        }
    ]
}