{
    "Symbol": "TEAMGTY",
    "ISIN": "INE289C01025",
    "News": [
        {
            "Title": "Team India Guaranty Board Meet on Feb 13 for Q3FY26",
            "Summary": "Team India Guaranty Limited has scheduled its board meeting for February 13, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770371042759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Team India Guaranty Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "Team India Guaranty Limited announced its unaudited standalone financial results for the quarter ended September 30, 2025, with the board meeting concluding the approval process. The Non-Banking Financial Company submitted comprehensive financial statements including profit and loss, balance sheet, and cash flow statements to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763131306104,
            "Source": "earnings"
        },
        {
            "Title": "Team India Guaranty Limited Approves Preferential Issue of 22.48 Lakh Equity Shares to 25 Investors",
            "Summary": "Team India Guaranty Limited shareholders approved the issuance of 22,48,270 equity shares on a preferential basis for consideration other than cash at their Annual General Meeting held on September 12, 2025. The shares, with a face value of INR 10 each, will be issued at INR 285 per share (including a premium of INR 275) to 25 investors including individuals and Curesense Therapeutics Private Ltd. Post-allotment, these investors will collectively hold 20% shareholding in the company. The issue price was determined based on volume weighted average prices, with a floor price of INR 277.04 per equity share. Major allocations include Curesense Therapeutics Private Ltd (6.42%), Amit Tewary (5.85%), and Ajit Sinha (4.84%).",
            "Sentiment": "neutral",
            "PublishDate": 1757684077116,
            "Source": "corporate_action"
        },
        {
            "Title": "Team India Guaranty Ltd Reports 78.5% Revenue Decline and Swings to Loss in Q1 FY2026",
            "Summary": "Team India Guaranty Limited reported total income of Rs. 6.84 crore for Q1 FY2026, down 78.5% from Rs. 31.85 crore in Q1 FY2025. The company swung to a net loss of Rs. 3.99 crore compared to a net profit of Rs. 28.70 crore in the same quarter last year. Earnings per share declined to Rs. 0.04 from Rs. 0.26, representing an 84.6% decrease. On a sequential basis, revenue improved from Rs. 1.54 crore in Q4 FY2025, and net losses reduced from Rs. 23.29 crore in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755254962659,
            "Source": "earnings"
        },
        {
            "Title": "Team India Guaranty Limited Approves Acquisition of 4A Financial Technologies Through Preferential Issue",
            "Summary": "Team India Guaranty Limited's Board approved unaudited standalone financial results for the quarter ended June 30, 2025, and scheduled its 35th Annual General Meeting for September 12, 2025, via video conferencing. The company approved a preferential issue of 22,48,270 equity shares at ₹285 per share to acquire up to 100% shareholding in 4A Financial Technologies Private Limited, a fintech company engaged in digital payment solutions and short-term credit facilities. The acquisition cost is ₹3,605.16 per equity share of the target company. 4A Financial Technologies reported revenue of ₹45.23 lakh (standalone) and ₹3.52 crore (consolidated) for FY 2024-25. The transaction involves 25 investors and will give them a combined 20% shareholding in Team India Guaranty Limited. The acquisition is expected to be completed by September 26, 2025, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1755100534712,
            "Source": "corporate_action"
        }
    ]
}