{
    "Symbol": "TEAMLEASE",
    "ISIN": "INE985S01024",
    "News": [
        {
            "Title": "TeamLease Services Q3 Net Profit Surges 50% YoY",
            "Summary": "TeamLease Services reports consolidated net profit of 420 million rupees in Q3, marking a significant 50% increase from 280 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770196784050,
            "Source": "co_actions_results"
        },
        {
            "Title": "TeamLease Board Meeting Set for February 4, 2026",
            "Summary": "TeamLease Services Limited announces board meeting scheduled for February 4, 2026, to review Q3 FY26 unaudited financial results. Trading window closed from January 1-February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769072634962,
            "Source": "co_actions_results"
        },
        {
            "Title": "TeamLease Services Appoints New Chief Digital Officer",
            "Summary": "TeamLease Services Limited has appointed Mr. Vamsikrishna Ithamraju as Chief Digital and Information Officer effective January 07, 2026, to lead digital transformation and technology initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767801312130,
            "Source": "stocks"
        },
        {
            "Title": "TeamLease Services faces ₹19.65 lakh GST penalty",
            "Summary": "TeamLease Services receives assessment order under Karnataka GST Act with penalty of ₹19,65,215 for FY 2021-22 farm labour supply exemption dispute. Company plans to file appeal within three months.",
            "Sentiment": "negative",
            "PublishDate": 1767086835700,
            "Source": "stocks"
        },
        {
            "Title": "TeamLease Services Appoints Suparna Mitra as New MD & CEO, Co-Founders Transition to Non-Executive Roles",
            "Summary": "TeamLease Services Limited appointed Suparna Mitra, former CEO of Titan's Watches & Wearables Division, as Managing Director & CEO effective February 02, 2026, succeeding Ashok Reddy who becomes Executive Vice Chairman while Manish Sabharwal transitions to Non-Executive Director. The leadership transition is part of the company's long-term succession planning strategy, with Mitra bringing over three decades of experience in technology transformation, retail, and organizational scaling to lead India's largest staffing company serving 4000+ employers.",
            "Sentiment": "positive",
            "PublishDate": 1764819513456,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nippon India Mutual Fund Increases Stake in TeamLease Services to 7.95%",
            "Summary": "Nippon India Mutual Fund acquired 2,47,063 shares of TeamLease Services through open market purchases, increasing its total shareholding from 6.47% to 7.95%. The acquisition involved purchase transactions conducted between March 7, 2025 and November 24, 2025, with the fund now holding 13,32,589 shares in the human resources services company.",
            "Sentiment": "neutral",
            "PublishDate": 1764307625583,
            "Source": "corporate_action"
        },
        {
            "Title": "TeamLease Services Reports 24% EBITDA Growth in Q2 FY26 with Net Addition of 7,000+ Headcount",
            "Summary": "TeamLease Services delivered consistent quarterly results with net addition of over 7,000 headcount across all three employment business units. The company achieved 3% quarter-on-quarter headcount growth, 5% revenue growth, 24% EBITDA growth, and 10% PBT growth. The staffing business added over 8,000 net headcount with 23% coming from new client acquisitions, while adding 140+ new logos in the quarter. BFSI sector showed early signs of stabilization with banks and NBFCs resuming controlled hiring in Tier 2 and 3 locations. Consumer business remained resilient despite urban demand pressure, with GST 2.0 rollout expected to drive medium to long-term benefits. Specialized staffing added 300 hires with 18% sequential growth, led by GCCs contributing 62% of net revenue. Degree apprenticeship added 2,600 apprentices with 19 new logos. The company maintained stable balance sheet metrics with DSO at 7 days for staffing business and free cash balance of Rs. 320 crores. Management expects continued momentum in client acquisitions and revenue growth, with over 20,000 open positions currently available.",
            "Sentiment": "positive",
            "PublishDate": 1762592127283,
            "Source": "earnings"
        },
        {
            "Title": "TeamLease Completes Full Acquisition of TSR Darashaw HR Services",
            "Summary": "TeamLease Services Limited has acquired an additional 10% stake in TSR Darashaw HR Services Private Limited on November 7, 2025, making it a wholly owned subsidiary. The company previously acquired 90% stake in TSR Darashaw on December 20, 2024, through a Share Purchase Agreement. TSR Darashaw operates in managed payroll services, providing HR services including payroll processing, reimbursement processing, and employee services. The company serves 70 enterprises with over 1.65 lakh records and reported revenue of Rs. 10.1 crores with a normalized operating PBT margin of 20% in FY25. The acquisition was made at 1.9x of revenue through cash consideration. TSR Darashaw, incorporated on April 23, 2018, has shown consistent revenue growth from Rs. 9.20 crores in 2022-23 to Rs. 10.10 crores in 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1762511766994,
            "Source": "order&deals"
        },
        {
            "Title": "TeamLease Services Reports 11.9% Growth in Q2 Net Profit to 275.2 Million Rupees",
            "Summary": "TeamLease Services posted a net profit of 275.2 million rupees in Q2, up from 246 million rupees in the same period last year. Revenue increased to 30.32 billion rupees compared to 27.97 billion rupees year-over-year. EBITDA rose to 383 million rupees from 334.5 million rupees, while EBITDA margin improved to 1.26% from 1.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762337968651,
            "Source": "earnings"
        },
        {
            "Title": "TeamLease Services Expands Singapore Operations with New Subsidiary, Promoter Releases Share Pledge",
            "Summary": "TeamLease Digital Singapore Pte. Ltd., a step-down subsidiary of TeamLease Services Limited, incorporated a new wholly-owned subsidiary called TeamLease Digital Solutions Pte. Ltd. in Singapore on September 1, 2025. The new entity has an authorized and paid-up capital of S$50,000 and operates in the staffing industry to enhance TeamLease's global footprint. Separately, promoter Hansini Management Consultant Private Limited released a pledge on 84,050 equity shares (0.50% of total share capital) that were previously pledged to Kotak Mahindra Bank Limited as security for a loan against property worth Rs 22 crores. The pledge release was executed on August 12, 2025, with revised disclosures submitted to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1756984078434,
            "Source": "corporate_action"
        },
        {
            "Title": "Singapore PM Wong Pledges Support for India's Skill Development Centers",
            "Summary": "Singapore Prime Minister Wong announced support for India's skill development initiatives and the establishment of state-level centers. The announcement relates to Teamlease Services, a company involved in the skill development sector.",
            "Sentiment": "positive",
            "PublishDate": 1756972342122,
            "Source": "stock"
        },
        {
            "Title": "TeamLease Services Reports 39% EBITDA Growth in Q1 FY26 Despite BFSI and IT Headwinds",
            "Summary": "TeamLease Services delivered strong quarterly results with 39% year-on-year EBITDA growth and added 5,000 headcount across all three business segments. The company onboarded 110+ new client logos despite persistent challenges in BFSI and IT services sectors. General staffing business grew 11% year-on-year in revenue with net headcount addition of 3,000+. Specialized staffing added 115 resources and achieved positive EBITDA from global operations contributing Rs. 14 crores in gross revenue. The degree apprenticeship segment added 1,700 apprenticeships with 14 new client acquisitions. Management expects 30% EBITDA growth for remaining quarters and sees green shoots of recovery in BFSI and consumer sectors entering Q2. The company maintains 20,000+ open positions and projects steady profit expansion trajectory for the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1754291853103,
            "Source": "earnings"
        },
        {
            "Title": "TeamLease Aims to Become World's Largest Staffing Company by Workforce",
            "Summary": "TeamLease has announced its ambition to become the biggest staffing company globally by workforce. The company is focusing its growth strategy on three key areas: GCC-supported specialized staffing, degree apprenticeships, and digital HR technology. TeamLease positions itself as having a strong and scalable cash-loaded platform designed for profitable growth.",
            "Sentiment": "positive",
            "PublishDate": 1753960299539,
            "Source": "stock"
        },
        {
            "Title": "TeamLease Services CEO-Staffing Kartik Narayan Resigns; Ramani Dathi Promoted to COO & CFO",
            "Summary": "TeamLease Services Limited announced leadership changes with Kartik Narayan resigning from his position as Chief Executive Officer - Staffing to pursue new opportunities outside the company. His resignation will be effective from end of business hours on September 11, 2025. Simultaneously, Ramani Dathi's designation has changed to Chief Operating Officer & Chief Financial Officer, taking over the COO role from August 1, 2025, while continuing as CFO. Dathi has been with TeamLease for over 11 years, led the company's IPO process, and played a key role in business expansion through M&As. She is a qualified Chartered Accountant and Cost Accountant with over 19 years of experience, having previously worked at Deloitte and PricewaterhouseCoopers before joining TeamLease in 2014.",
            "Sentiment": "neutral",
            "PublishDate": 1753960273736,
            "Source": "corporate_governance"
        },
        {
            "Title": "TeamLease Services Reports Q1FY26 Results with 39% YoY EBITDA Growth Despite Sector Headwinds",
            "Summary": "TeamLease Services Limited announced its Q1FY26 financial results with consolidated revenue of Rs. 2,904 crores, up 12% year-on-year. The company reported EBITDA of Rs. 31 crores, marking a 39% YoY growth, though down 35% quarter-on-quarter. Profit after tax stood at Rs. 25 crores, up 29% YoY but down 34% QoQ. The company's total headcount reached 351,000, adding approximately 5,000 employees during the quarter and 19,000 year-on-year despite challenges in BFSI and IT services sectors. General Staffing contributed 295,270 headcount with 11% revenue growth YoY, while Specialized Staffing added 110 net employees. The company added 118 new client logos during the quarter and maintains net free cash of Rs. 300 crores. Management highlighted resilient demand from enterprise clients and Global Capability Centers, expressing confidence in steady profit expansion for the remainder of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1753958334643,
            "Source": "earnings"
        },
        {
            "Title": "TeamLease Services to Review Q1 Results on July 31",
            "Summary": "TeamLease Services has announced that it will review its first quarter (Q1) results on July 31. This brief announcement indicates the company's scheduled date for examining and potentially releasing its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751977139000,
            "Source": "default"
        },
        {
            "Title": "TeamLease Services Projects Increased Headcount Addition for FY26",
            "Summary": "TeamLease Services anticipates adding 40,000 to 45,000 employees to its headcount in FY26, compared to 27,000 in FY25. This projection indicates significant growth in the company's workforce planning.",
            "Sentiment": "positive",
            "PublishDate": 1747895007000,
            "Source": "default"
        },
        {
            "Title": "TeamLease Services Reports Q4 Financial Results",
            "Summary": "TeamLease Services has announced its Q4 financial results. The company's EBITDA increased to 474.8 million rupees from 366.5 million rupees year-over-year. The EBITDA margin improved to 1.66% from 1.51% in the same period. Revenue grew to 28.58 billion rupees from 24.32 billion rupees year-over-year. The consolidated net profit rose to 349.6 million rupees, up from 275 million rupees year-over-year and 284.3 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747827163000,
            "Source": "result"
        },
        {
            "Title": "TeamLease Services: Q4 Profit Surges 35% on Improved Efficiency",
            "Summary": "TeamLease Services reported a 35% YoY increase in Q4 FY25 net profit to ₹38 crore. Revenue rose 18% YoY to ₹2,858 crore. EBITDA margin improved to 1.7%. The company completed an 80% acquisition in Singapore-based Ikigai Enablers Pte Ltd. Annual revenue for FY25 grew 20% to ₹11,201 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747826602000,
            "Source": "earnings"
        },
        {
            "Title": "TeamLease Services Reports Decline in Q3 EBITDA and Margin",
            "Summary": "TeamLease Services has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 350 million rupees, down from 360 million rupees in the same quarter last year. The EBITDA margin also decreased to 1.20% from 1.47% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738140420000,
            "Source": "earnings"
        },
        {
            "Title": "TeamLease Services: IT Hiring Recovery Expected by Mid-2025",
            "Summary": "TeamLease CFO anticipates a recovery in IT sector hiring by mid-2025, indicating a potential turnaround in the technology job market.",
            "Sentiment": "positive",
            "PublishDate": 1735041126000,
            "Source": "normal_news"
        },
        {
            "Title": "TeamLease Services Announces Strategic Acquisitions",
            "Summary": "TeamLease Services has approved two significant acquisitions. The company plans to acquire a 90% stake in TSR Darashaw and a 30% stake in Crystal HR and Security Solutions. These moves are likely aimed at expanding TeamLease's service offerings and market presence in the human resources and staffing sector.",
            "Sentiment": "positive",
            "PublishDate": 1734696898000,
            "Source": "corporate_action"
        },
        {
            "Title": "TeamLease Services Block Trade on NSE",
            "Summary": "A block trade of approximately 60,320 shares of TeamLease Services occurred on the National Stock Exchange (NSE) for a total value of Rs 17.23 crore. The trade was executed at a price of Rs 2,856.65 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1734067269000,
            "Source": "block_deals"
        },
        {
            "Title": "TeamLease: BFSI Segment Expected to Recover in Q4",
            "Summary": "TeamLease Services CFO Ramani Dathi anticipates recovery in the BFSI segment by Q4 FY24. Despite Q3 pressures, the company expects 8,000-10,000 net headcount growth. TeamLease aims for 20-25% revenue growth in 3-5 years, with a focus on margin expansion. IT staffing and HR services are expected to contribute to higher margins.",
            "Sentiment": "positive",
            "PublishDate": 1730993133000,
            "Source": "normal_news"
        },
        {
            "Title": "TeamLease: BFSI Segment Expected to Remain Muted in Q3",
            "Summary": "TeamLease anticipates subdued performance in the Banking, Financial Services, and Insurance (BFSI) segment for the third quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730973325000,
            "Source": "normal_news"
        },
        {
            "Title": "TeamLease Services Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for TeamLease Services Ltd on the National Stock Exchange (NSE). Approximately 81,297 shares were traded at a price of Rs. 2,808.55 per share, totaling Rs. 22.83 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1730953288000,
            "Source": "block_deals"
        },
        {
            "Title": "TeamLease Services Aims to Become Largest Private Sector Employer in India",
            "Summary": "TeamLease Services has announced its ambitious goal to become the largest private sector employer in India and the largest staffing company in the world by headcount. This information was shared in an investor presentation, indicating the company's strategic vision for significant growth and market dominance in the staffing industry.",
            "Sentiment": "positive",
            "PublishDate": 1730900646000,
            "Source": "corporate_action"
        },
        {
            "Title": "TeamLease Services Reports Q2 Revenue Growth",
            "Summary": "TeamLease Services, an Indian staffing and human resource company, has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 27.97 billion rupees, up from 22.7 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730887021000,
            "Source": "result"
        },
        {
            "Title": "TeamLease Services Reports Q2 FY2024 Financial Results",
            "Summary": "TeamLease Services has announced its financial results for the second quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 330 million rupees, up from 314 million rupees in the same quarter last year. However, the EBITDA margin decreased to 1.18% from 1.38% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730887009000,
            "Source": "result"
        },
        {
            "Title": "TeamLease Services Reports Q2 FY24 Financial Results",
            "Summary": "TeamLease Services, an Indian staffing and human resource services company, has announced its consolidated net profit for the second quarter of the fiscal year 2024. The company reported a net profit of 246 million rupees, which is a decrease from 273 million rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1730886972000,
            "Source": "result"
        },
        {
            "Title": "TeamLease Services Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class='neutral'>TeamLease Services</span> has announced a <b>board meeting</b> to be held on <span class='neutral'>November 6</span> to <span class='neutral'>consider and approve</span> the company's <b>financial results</b> for the <span class='neutral'>second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728469885000,
            "Source": "corporate_action"
        }
    ]
}