{
    "Symbol": "TECHERA",
    "ISIN": "INE0JQS01019",
    "News": [
        {
            "Title": "Ashish Kacholia Invests ₹14.3 Cr in TechEra Engineering",
            "Summary": "Prominent investor Ashish Kacholia acquired a 4.8% stake in TechEra Engineering for ₹14.3 crore. The aerospace and defense company reported 38% revenue growth and turned profitable in recent quarters.",
            "Sentiment": "positive",
            "PublishDate": 1769089211295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Techera Engineering Reports H1 Net Profit of 14M Rupees, Reversing Previous Year Loss",
            "Summary": "Techera Engineering posted a net profit of 14 million rupees in the first half, compared to a loss of 12 million rupees in the same period of the previous year. This represents a turnaround from losses to profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1762853973718,
            "Source": "earnings"
        },
        {
            "Title": "Tech Era Secures ₹6 Crore Order, Market Cap at ₹430 Crores",
            "Summary": "Tech Era has secured a new order worth ₹6 crores. The company's market capitalization currently stands at ₹430 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762412835199,
            "Source": "stock"
        },
        {
            "Title": "TechEra Engineering Participates in HAL's New Defense Production Facility Opening in Nashik",
            "Summary": "TechEra Engineering (India) participated in the opening of HAL's new production facility in Nashik for LCA MK1A and HTT-40 aircraft. The company highlighted its position as a key partner in India's local defense manufacturing sector during the facility inauguration.",
            "Sentiment": "positive",
            "PublishDate": 1760595036919,
            "Source": "stock"
        },
        {
            "Title": "Ashish Kacholia Acquires Shares in TechEra Engineering Through Open Market Purchase",
            "Summary": "Ashish Kacholia, associated with Bengal Finance & Investment, has acquired shares in TechEra Engineering through open market transactions. The article mentions two different share quantities - 1.12 lakh shares and 200,000 shares - though the exact number is unclear from the provided information.",
            "Sentiment": "positive",
            "PublishDate": 1760066228998,
            "Source": "stock"
        },
        {
            "Title": "TechEra Engineering Sees Share Purchases by Bengal Finance and Surya Vanshi Commotrade",
            "Summary": "TechEra Engineering experienced notable share acquisitions through open market transactions. Bengal Finance & Investment Pvt Ltd purchased 4.22 lakh shares, while Surya Vanshi Commotrade, associated with Ashish Kacholia, acquired 4.49 lakh shares. Both transactions were conducted through open market purchases.",
            "Sentiment": "positive",
            "PublishDate": 1759116067201,
            "Source": "order&deals"
        }
    ]
}