{
    "Symbol": "TECHM",
    "ISIN": "INE669C01036",
    "News": [
        {
            "Title": "Tech Mahindra schedules investor meets for Feb 10-11",
            "Summary": "Tech Mahindra announces investor interactions at Nuvama India Conference on February 10, 2026 and Axis Capital's Flagship India Conference on February 11, 2026, both in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1770202651368,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Q3FY26: Strong Growth & Record Deal Wins",
            "Summary": "Tech Mahindra delivered robust Q3FY26 performance with 2.7% YoY revenue growth, 290 bps margin expansion to 13.1%, and record quarterly deal bookings of $1,096 million including a $500 million European telecom mega deal.",
            "Sentiment": "positive",
            "PublishDate": 1768912817329,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Allots 21,712 Equity Shares via ESOP",
            "Summary": "Tech Mahindra allotted 21,712 equity shares on January 19, 2026, through employee stock option exercises under ESOP-2014 and ESOP-2018 schemes, increasing total issued shares to 97.97 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1768833633552,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra concludes Q3FY26 earnings call",
            "Summary": "Tech Mahindra successfully concluded its quarterly earnings conference call on January 16, 2026, discussing Q3FY26 financial results with analysts and investors, with audio recording now available online.",
            "Sentiment": "neutral",
            "PublishDate": 1767689888400,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra's MEI Subsidiary Ceases Operations",
            "Summary": "Tech Mahindra's wholly-owned subsidiary Mahindra Educational Institutions ceased operations on December 26, 2025, following equity dilution from 100% to 0.6% after MKT's ₹1.65 crore investment.",
            "Sentiment": "neutral",
            "PublishDate": 1766752418423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Incorporates Step-Down Subsidiary in Uganda",
            "Summary": "Tech Mahindra announces incorporation of Yabx Technologies Uganda Limited through its Netherlands subsidiary on December 22, 2025, with share capital of UGX 1,700,000 to provide software and analytics services.",
            "Sentiment": "positive",
            "PublishDate": 1766428040366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Receives ₹1,287.44 Cr PF Order",
            "Summary": "Tech Mahindra received order from Regional Provident Fund Commissioner demanding ₹1,287.44 crores for alleged non-remittance of PF contributions for period May 2014 to March 2016. Company plans appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766150733517,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Forms Chess Events Subsidiary CWPL",
            "Summary": "Tech Mahindra's subsidiary Allyis India incorporates Chessworks Private Limited with ₹1.00 lakh capital to organize chess events and leagues globally on December 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765783685457,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Incorporates New Subsidiary in Tanzania",
            "Summary": "Tech Mahindra announces incorporation of Yabx Technologies Tanzania Limited as step-down subsidiary through Netherlands entity with TZS 2.42 million share capital for software services.",
            "Sentiment": "positive",
            "PublishDate": 1765385762498,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Receives ESG Rating of 77 from NSE Sustainability",
            "Summary": "NSE Sustainability Ratings and Analytics Ltd., a SEBI registered ESG Rating Provider, independently assigned an ESG rating of 77 to Tech Mahindra based on the company's fiscal 2025 disclosures and publicly available data. Tech Mahindra clarified that it did not engage NSE Sustainability for this rating, which was prepared and issued voluntarily by the rating provider.",
            "Sentiment": "neutral",
            "PublishDate": 1765302825587,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra's Yabx Technologies Netherlands Expands Operations to Rwanda",
            "Summary": "Tech Mahindra's subsidiary Yabx Technologies Netherlands has launched Yabx Rwanda, marking the company's expansion into the Rwandan market. This geographic expansion represents Tech Mahindra's continued growth strategy in emerging African markets through its technology subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1764949090043,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Approves Merger of Fully-Owned Subsidiaries",
            "Summary": "Tech Mahindra has approved the merger of its fully-owned subsidiaries. The consolidation move affects the company's organizational structure and subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1764596842955,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Shares Worth Rs. 53.28 Crores Traded in NSE Block Deal",
            "Summary": "Tech Mahindra witnessed a block trade on NSE involving 353,284 shares valued at Rs. 53.28 crores at a price of Rs. 1,508.10 per share. The transaction represents a significant institutional or bulk trading activity in the IT services company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763959907201,
            "Source": "order&deals"
        },
        {
            "Title": "Tech Mahindra Presents Turnaround Strategy at Mahindra Group Investor Day",
            "Summary": "Tech Mahindra shared its presentation at the Mahindra Group Investor Day in Mumbai, outlining its turnaround strategy to be completed by FY27. The company aims to drive profitable and sustainable growth higher than peer average through AI initiatives, operational improvements, and organizational transformation strategies.",
            "Sentiment": "positive",
            "PublishDate": 1763609481174,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Sees Rs. 334.64 Crore Block Trade on NSE",
            "Summary": "Tech Mahindra witnessed a significant block trade worth Rs. 334.64 crores involving approximately 2,335,071 shares at Rs. 1,433.10 per share on the NSE. The large-volume transaction indicates substantial institutional or bulk investor activity in the IT services company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763546477649,
            "Source": "order&deals"
        },
        {
            "Title": "Tech Mahindra Sells Mahindra Racing UK to Promoter Group Company for Rs 14 Crores",
            "Summary": "Tech Mahindra's UK subsidiary has agreed to sell its entire stake in Mahindra Racing UK Limited to Mahindra Overseas Investment Company (Mauritius) Limited for GBP 1.20 million (approximately Rs 14 crores). The transaction will result in Mahindra Racing UK ceasing to be a wholly-owned step-down subsidiary of Tech Mahindra, with the racing unit contributing revenue of Rs 106.05 crores and net worth of Rs 25.31 crores to consolidated financials as of September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763055062887,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Allots 45,105 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Tech Mahindra's Securities Allotment Committee approved the allotment of 45,105 equity shares of ₹5 each to eligible employees upon exercise of stock options on November 12, 2025. The allotment includes 30,405 shares under the Employee Stock Option Plan-2014 and 14,700 shares under the Employee Stock Option Scheme-2018. The newly issued shares rank pari passu and are identical to existing equity shares of the company. The allotment was made in compliance with SEBI regulations and both stock option schemes had received prior approvals from BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762936653923,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Reports 1.6% Sequential Growth in Q2 FY26 with Margins Rising to 12.1%",
            "Summary": "Tech Mahindra reported revenue of $1,586 million for the quarter ended September 30, 2025, marking 1.6% sequential constant currency growth and the strongest quarterly growth in 10 quarters. EBIT margin expanded to 12.1%, continuing eight consecutive quarters of margin improvement. The company secured $816 million in net new deal wins, representing 57% increase on last 12 months basis. Growth was broad-based across manufacturing (5.2% YoY), BFSI (6.2% YoY), and retail, transport & logistics (7.2% YoY). Communications vertical declined 2.2% year-on-year but remained stable. The $20 million plus client bucket delivered above-company average growth with contributions surpassing $1 billion. Tech Mahindra added 21 new must-have accounts in the first two quarters, with 17 already generating over $1 million revenue each. The company launched TechM Orion, an agentic AI platform, and was recognized as leader in Gartner's Gen AI Consulting services quadrant. Free cash flow stood at $237 million with 120.8% free cash flow to PAT ratio year-to-date. The Board recommended dividend of Rs. 15 per share.",
            "Sentiment": "positive",
            "PublishDate": 1760715718906,
            "Source": "earnings"
        },
        {
            "Title": "Tech Mahindra Targets USD 1 Billion Quarterly Deal Wins, Maintains 15% Margin Goal",
            "Summary": "Tech Mahindra aims to increase quarterly deal wins to USD 1 billion from the current USD 800 million. The company expects a normalized effective tax rate of approximately 27% for the full year. Tech Mahindra remains focused on achieving its 15% margin goal, with future improvements expected to come primarily from gross margins rather than SG&A. The company anticipates better performance in H2 FY26 compared to H1, driven by seasonal and economic factors. For FY27, growth is expected to be better than FY26, though less optimistic than initially projected.",
            "Sentiment": "positive",
            "PublishDate": 1760498880158,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Reports Eight Consecutive Quarters of Margin Growth and 57% Jump in Contract Value",
            "Summary": "Tech Mahindra is pursuing faster growth through AI transformation and platform expansion. The company has achieved eight consecutive quarters of margin increases and reported a 57% year-over-year rise in total contract value, signaling a positive business shift.",
            "Sentiment": "positive",
            "PublishDate": 1760456104098,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Executive Highlights Low H1B Dependency and Revenue Growth Outlook",
            "Summary": "Tech Mahindra executive stated that the company has low reliance on H1B visas as most of its US employees are citizens or green card holders. The executive also expressed expectations for continued revenue growth in the second half of FY26, noting macro stabilization in certain areas.",
            "Sentiment": "positive",
            "PublishDate": 1760448575783,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Secures $816 Million in New Deals Despite U.S. Revenue Decline",
            "Summary": "Tech Mahindra secured $816 million in new deals during the second quarter. However, the company experienced a drop in U.S. revenue, which executives attributed to challenging economic conditions in the region.",
            "Sentiment": "neutral",
            "PublishDate": 1760447724900,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Reports Strong Quarterly Revenue Growth Across Key Sectors",
            "Summary": "Tech Mahindra reported significant growth across manufacturing, BFSI, and healthcare sectors. The company achieved its highest quarterly revenue growth in 10 quarters when adjusted for constant currency.",
            "Sentiment": "positive",
            "PublishDate": 1760447363188,
            "Source": "earnings"
        },
        {
            "Title": "Tech Mahindra Declares Rs 15 Interim Dividend, Reports Improved Q2 Profitability",
            "Summary": "Tech Mahindra announced an interim dividend of Rs 15 per share. The company reported Q2 EBIT of Rs 16.99 billion, up from Rs 14.77 billion in the previous quarter. EBIT margin improved to 12.14% from 11.06% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760446881619,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Reports Quarterly Growth in Net Profit and Revenue",
            "Summary": "Tech Mahindra reported consolidated net profit of 11.95 billion rupees in Q2, up from 11.41 billion rupees in the previous quarter. The company's revenue increased to 139.95 billion rupees from 133.5 billion rupees quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760446397247,
            "Source": "earnings"
        },
        {
            "Title": "Tech Mahindra Partners With Abacus Insights For U.S. Healthcare Payer Compliance",
            "Summary": "Tech Mahindra has formed a partnership with Abacus Insights focused on improving CMS interoperability compliance for U.S. healthcare payers. The collaboration aims to enhance compliance capabilities in the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1759457093170,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Partners With AMD for Hybrid Multi-Cloud Solutions",
            "Summary": "Tech Mahindra has entered into a partnership with AMD to develop hybrid multi-cloud solutions for businesses globally. The collaboration aims to innovate cloud-based offerings for companies worldwide.",
            "Sentiment": "positive",
            "PublishDate": 1758789730704,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra UK Unit Divests 26.42% Stake in Surance Limited for $1",
            "Summary": "Tech Mahindra London Limited, a wholly-owned subsidiary of Tech Mahindra, has divested its entire 26.42% stake in Surance Limited through a Share Transfer Agreement executed on September 23rd, 2025. The transaction was completed for a cash consideration of USD 1. Following this divestment, Surance Limited and its US subsidiary Surance US Holdings Inc. will no longer be associate companies of Tech Mahindra. The buyer is an existing shareholder of Surance Limited holding 60.73% stake and is not related to Tech Mahindra's promoter group. For the year ended March 31st, 2025, Surance Limited reported nil revenue and nil net worth. The transaction is expected to be completed by September 30th, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758628773370,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Increases Stake in Tech Mahindra to 10.84% Through Market Purchases",
            "Summary": "Life Insurance Corporation of India (LIC) has raised its stake in Tech Mahindra to 10.84% through market purchases. The insurance giant acquired additional shares of the IT services company via open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1758020683939,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Announces Voluntary Liquidation of Subsidiary CTDEV LLC",
            "Summary": "Tech Mahindra has announced the voluntary liquidation of CTDEV LLC, which is a wholly-owned step-down subsidiary of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1757344796962,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Incorporates Wholly-Owned Subsidiary in Saudi Arabia",
            "Summary": "Tech Mahindra has incorporated a wholly-owned subsidiary in Saudi Arabia.",
            "Sentiment": "positive",
            "PublishDate": 1755706890134,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra's Pininfarina Increases Stake in Signature S.r.l from 24% to 84%",
            "Summary": "Tech Mahindra's step-down subsidiary Pininfarina S.p.A. has acquired an additional 60% stake in Signature S.r.l, increasing its shareholding from 24% to 84%. The acquisition was completed on August 14, 2025, for EUR 134,375 through cash consideration. Signature, incorporated in December 2017, operates in the stationery business from Italy with a turnover of EUR 2.9 million as of December 31, 2024. Following this transaction, Signature has become a subsidiary of Pininfarina and a step-down subsidiary of Tech Mahindra. The acquisition aims to strengthen Pininfarina's presence in the consumer channel while enhancing the Pininfarina brand. The transaction is classified as a related party transaction conducted on an arm's length basis.",
            "Sentiment": "positive",
            "PublishDate": 1755223272229,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra Plans UK EV Exports via Trade Deal, Targets 30% EV Sales by 2030",
            "Summary": "Mahindra & Mahindra plans to export electric vehicles to the UK following the India-UK free trade agreement finalization. Group CEO Anish Shah stated the company aims for EVs to comprise 30% of overall sales by 2030. The automaker operates Mahindra Advanced Design Europe facility in Banbury, Oxfordshire, serving as a design center for electric products. Shah expressed optimism about global EV players Tesla and Vinfast entering India, citing past successful competition with Ford, Hyundai, and Kia. Mahindra's SUV market share has grown from 11% to 27% over time, with 5.7 percentage point growth in the latest quarter. The company sees India's potential as a global automobile manufacturing hub and plans to expand product range across domestic and international markets. Shah mentioned working on alternatives for rare earth magnet shortage issues affecting the EV sector.",
            "Sentiment": "positive",
            "PublishDate": 1755086723756,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Opens Special Window for Re-lodgement of Physical Share Transfer Requests",
            "Summary": "Tech Mahindra has announced a special six-month window from July 7, 2025 to January 6, 2026 for shareholders to re-lodge transfer requests for physical shares. This facility applies specifically to transfer deeds that were lodged before April 1, 2019 and were previously rejected, returned, or not processed due to document deficiencies. Shares that are re-lodged during this period will be issued in demat mode only through a transfer-cum-demat process. The company encourages shareholders who missed the earlier March 31, 2021 deadline to utilize this opportunity by submitting necessary documents to the registrar MUFG Intime India Private Limited. Transfer requests submitted after January 6, 2026 will not be accepted unless SEBI grants an extension.",
            "Sentiment": "neutral",
            "PublishDate": 1754389814697,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Issues €67.67 Million Guarantee for Step-Down Subsidiary Pininfarina",
            "Summary": "Tech Mahindra has issued a guarantee on behalf of its step-down subsidiary Pininfarina S.p.A., Italy, for a sum not exceeding Euro 67.67 million. The guarantee supports a supply agreement between Pininfarina and Rolls-Royce Motor Cars Limited. The transaction was approved by Tech Mahindra's Audit Committee as a related party transaction conducted on an arm's length basis in the ordinary course of business. The guaranteed obligations will be treated as contingent liability for Tech Mahindra, though the company states there is presently no impact from this guarantee.",
            "Sentiment": "neutral",
            "PublishDate": 1754386664021,
            "Source": "corporate_action"
        },
        {
            "Title": "Tech Mahindra Sees Block Trade Worth Rs. 195.91 Crores on NSE",
            "Summary": "Tech Mahindra witnessed a block trade on the National Stock Exchange involving approximately 1,265,967 shares at a price of Rs. 1,547.50 per share. The total transaction value amounted to Rs. 195.91 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1753249185795,
            "Source": "order&deals"
        },
        {
            "Title": "Tech Mahindra Receives ESG Rating of 'Crisil ESG 75' in Leadership Category",
            "Summary": "Tech Mahindra Limited received an ESG rating of 'Crisil ESG 75' in the leadership category and a Core ESG rating of 'Crisil Core ESG 66' from Crisil ESG Ratings & Analytics Limited, a SEBI registered ESG Rating Provider. The rating was independently assigned without the company's engagement, based solely on Tech Mahindra's fiscal 2025 disclosures and publicly available data. The company received communication from CRISIL on July 21, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753197514177,
            "Source": "stock"
        },
        {
            "Title": "Tech Mahindra Reports Q1 FY26 Results with Seventh Consecutive Quarter of Margin Expansion",
            "Summary": "Tech Mahindra reported quarterly revenues of $1,564 million, reflecting 0.4% growth year-on-year and 1.0% decline on constant currency basis. The company achieved its seventh consecutive quarter of margin expansion with EBIT margin at 11.1% versus 10.5% last quarter. Communications vertical grew 2.5% year-on-year, while Manufacturing declined 4% due to automotive sector softness. BFSI vertical reported 4.7% growth and Hi-Tech declined 3.3%. Total Contract Value for the quarter stood at $809 million, a 44% increase year-on-year on LTM basis. The company added 2 clients in the $50 million bucket and 15 new must-have accounts. Americas declined 5.9% while Europe grew 11.7% year-on-year. Profit after tax increased 30% to $133 million with PAT margin expanding 200 basis points to 8.5%. Free cash flow was $86 million, impacted by seasonal factors and timing-related collection delays. The company continues progress toward its stated FY27 margin targets while expecting FY26 performance to be better than FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1753155418858,
            "Source": "earnings"
        },
        {
            "Title": "Tech Mahindra: Q1 Results Miss Expectations, Stock Faces Valuation Concerns",
            "Summary": "Tech Mahindra's stock dropped 2.7% after Q1 results fell short of expectations. Analysts are divided on the stock's prospects due to rich valuations, with JP Morgan rating it 'neutral' at a target price of ₹1,550. Management expects FY27 revenue growth above peers and a pickup from next quarter.",
            "Sentiment": "negative",
            "PublishDate": 1752797278000,
            "Source": "earnings"
        },
        {
            "Title": "Tech Mahindra: Anand Mahindra Outlines AI-Driven Future at AGM",
            "Summary": "At Tech Mahindra's AGM, Chairperson Anand Mahindra emphasized trust and responsible AI as key pillars for the company's future. He highlighted the 'AI Delivered Right' strategy, which is showing positive results in consulting services, GCC practices, and customer experience offerings. The company's 'FY27 Scale at Speed' plan is gaining traction with clients globally, with improvements in CXO and employee satisfaction.",
            "Sentiment": "positive",
            "PublishDate": 1752749547000,
            "Source": "normal_news"
        },
        {
            "Title": "Tech Mahindra Block Trade: 249,940 Shares Sold for Rs. 39.81 Crores",
            "Summary": "A block trade of approximately 249,940 shares of Tech Mahindra Ltd. was reported on the National Stock Exchange (NSE). The transaction was valued at Rs. 39.81 Crores, with shares priced at Rs. 1592.80 each.",
            "Sentiment": "neutral",
            "PublishDate": 1752724613000,
            "Source": "block_details"
        },
        {
            "Title": "Tech Mahindra Block Trade: 240,830 Shares at Rs. 1590.40",
            "Summary": "A block trade of approximately 240,830 shares of Tech Mahindra Ltd. occurred on the National Stock Exchange (NSE). The total value of the trade was Rs. 38.30 Crores, with shares priced at Rs. 1590.40 each.",
            "Sentiment": "neutral",
            "PublishDate": 1752724161000,
            "Source": "block_details"
        },
        {
            "Title": "Tech Mahindra: Q1 Profit Rises 34% YoY, Misses Estimates",
            "Summary": "Tech Mahindra reported a 34% YoY increase in Q1FY26 net profit to Rs 1,141 crore, below estimates of Rs 1,211 crore. Revenue grew 2.7% YoY to Rs 13,351 crore. EBIT rose 34% YoY to Rs 1,477 crore. The company secured new deals with TCV of $809 million. IT headcount decreased by 622 QoQ to 79,987.",
            "Sentiment": "neutral",
            "PublishDate": 1752723576000,
            "Source": "earnings"
        },
        {
            "Title": "Tech Mahindra: Mixed Q1 Results Spark Divergent Analyst Views",
            "Summary": "Tech Mahindra reported Q1 FY26 results with in-line EBIT margins, strong deal wins, but slower revenue growth. CLSA, Nomura, and HSBC maintain positive outlook, citing expected growth pickup and strategic focus. Jefferies and Citi remain bearish, citing challenging margin targets and rich valuations. The company expects growth to improve from Q2, aiming for 15% margins by FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1752721455000,
            "Source": "earnings"
        },
        {
            "Title": "Tech Mahindra Develops AI Solutions and Targets Growth Acceleration",
            "Summary": "Tech Mahindra is creating AI 'cartridges' customized for various business needs and industries. The company views FY26 as a year to close the growth gap with competitors rather than surpassing their growth rates. Tech Mahindra expects revenue growth to accelerate from Q2 FY26, attributed to previously secured contracts.",
            "Sentiment": "positive",
            "PublishDate": 1752721374000,
            "Source": "default"
        },
        {
            "Title": "Tech Mahindra Expects Improved Performance in FY26 and Higher Growth in FY27",
            "Summary": "Tech Mahindra anticipates better performance in FY26 compared to FY25, though specific figures were not disclosed due to market uncertainty. For FY27, the company aims to outperform industry peers in terms of growth and meet its margin objectives. This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1752721136000,
            "Source": "default"
        },
        {
            "Title": "Tech Mahindra Reports Q1 Financial Results",
            "Summary": "Tech Mahindra has released its quarterly financial results. The company reported a consolidated net profit of 11.41 billion rupees, down from 11.67 billion rupees in the previous quarter. Revenue decreased slightly to 133.5 billion rupees from 133.84 billion rupees. However, EBIT (Earnings Before Interest and Taxes) increased to 14.77 billion rupees from 13.78 billion rupees. The EBIT margin improved to 11.06% from 10.3% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752711118000,
            "Source": "default"
        },
        {
            "Title": "Tech Mahindra Reports Mixed Results: Strong Deal Momentum Amid Manufacturing Sector Challenges",
            "Summary": "Tech Mahindra executives report strong momentum in deal wins, expecting growth to appear in the next quarter. However, the company also notes a drop in the manufacturing sector due to weakness in discretionary spending in the automotive industry. This decrease in automotive sector spending has affected the company's year-on-year revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1752666499000,
            "Source": "default"
        },
        {
            "Title": "Tech Mahindra Secures $809 Million in New Contracts for Q1",
            "Summary": "Tech Mahindra has reported new contract wins totaling $809 million for the first quarter. The company has successfully acquired these new deals, indicating potential growth in their business operations.",
            "Sentiment": "positive",
            "PublishDate": 1752666352000,
            "Source": "default"
        },
        {
            "Title": "Tech Mahindra: Q1 Attrition Rate Rises, Headcount Grows",
            "Summary": "Tech Mahindra's Q1FY26 results show attrition rate increased to 12.8% from 11.8% in Q4FY25. Total employee headcount reached 1,48,517, up by 897 compared to the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1752663721000,
            "Source": "earnings"
        }
    ]
}