{
    "Symbol": "TECHNOE",
    "ISIN": "INE285K01026",
    "News": [
        {
            "Title": "Techno Electric Q3FY26 Results Show Strong Growth",
            "Summary": "Techno Electric & Engineering reported robust Q3FY26 performance with standalone revenue of ₹8,569.79 millions and profit after tax of ₹1,517.79 millions for quarter ended 31 December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770727955611,
            "Source": "co_actions_results"
        },
        {
            "Title": "Techno Electric Board Meet Set for Feb 10, 2026",
            "Summary": "Techno Electric & Engineering Company Limited has scheduled a board meeting for February 10, 2026, to consider Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770047825712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Techno Electric Announces Postal Ballot for Director Appointment",
            "Summary": "Techno Electric & Engineering Company Limited has issued a postal ballot notice dated January 9, 2026, seeking shareholder approval for the appointment of Mr. Shailesh Kumar Mishra as Non-Executive Independent Director for five years.",
            "Sentiment": "neutral",
            "PublishDate": 1768902597164,
            "Source": "stocks"
        },
        {
            "Title": "Techno Electric Independent Director Resigns",
            "Summary": "Arun Duggal steps down as Independent Director of Techno Electric & Engineering Company Ltd effective December 15, 2025, citing business and personal commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1765878821468,
            "Source": "stocks"
        },
        {
            "Title": "Techno Electric Engineering Company Independent Director Krishna Murari Poddar Resigns",
            "Summary": "Krishna Murari Poddar resigned from his position as Independent Director of Techno Electric Engineering Company Limited effective November 19, 2025, citing age-related ailments and other managerial and social commitments. His resignation also ended his roles as Chairman of the Corporate Social Responsibility Committee and Member of the Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1763717952925,
            "Source": "corporate_governance"
        },
        {
            "Title": "Techno Electric Revises Financial Guidance, Lowers Order Inflow Expectations",
            "Summary": "Techno Electric revised its order inflow guidance downward to INR 3,000 crores from INR 3,500 crores, while projecting EPS of INR 50 for FY26 and INR 75 for FY27 from continuing operations excluding data center business. The company expects EBITDA margins of 13.5-14% for H2 FY26, data center revenue of INR 125 crores for FY27, and plans to maintain an effective tax rate around 20%.",
            "Sentiment": "neutral",
            "PublishDate": 1763092657946,
            "Source": "stock"
        },
        {
            "Title": "Techno Electric & Engineering Reports Strong Q2 Revenue Growth Despite Margin Decline",
            "Summary": "Techno Electric & Engineering reported quarterly net profit of 1.04 billion rupees compared to 942 million rupees in the same period last year. Revenue increased significantly to 8.4 billion rupees from 4.41 billion rupees year-over-year. EBITDA rose to 1.1 billion rupees from 702 million rupees, though EBITDA margin decreased to 13.20% from 15.9% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762958768984,
            "Source": "earnings"
        },
        {
            "Title": "Techno Electric & Engineering Sees Rs. 50.63 Crore Block Trade on NSE",
            "Summary": "Techno Electric & Engineering Company Ltd. witnessed a block trade worth Rs. 50.63 crores on the NSE. The transaction involved approximately 380,708 shares executed at Rs. 1,330.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759209243927,
            "Source": "order&deals"
        },
        {
            "Title": "Techno Electric Reports No Fund Utilization in Q1 from Rs 1,250 Crore QIP, Awaits Government Approvals",
            "Summary": "Techno Electric & Engineering Company submitted its monitoring agency report for the quarter ended June 30, 2025, regarding the utilization of proceeds from its Rs 1,250 crore Qualified Institutional Placement. The company did not utilize any funds during the quarter. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from the stated objects of the issue. The QIP was conducted from July 16-19, 2024, with proceeds allocated for investments in subsidiaries including NERES XVI Power Transmission Limited, NERGS-I Power Transmission Limited, Techno AMI Solutions subsidiaries, and Techno Infra Developers Private Limited. Out of the total proceeds, Rs 831.89 crore has been utilized as of the quarter end, leaving Rs 393.04 crore unutilized. The unutilized funds are invested in mutual funds earning returns between 7.33% to 7.51%. The company lacks government approvals for NERGS-1 license and is still acquiring land in North-Eastern States for NERES XVI project. Rs 6.96 crore has been utilized for TBCB projects against the allocated Rs 400 crore, while investments in AMI solutions subsidiaries (Rs 200 crore) and data center subsidiary (Rs 350 crore) were fully completed by March 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755177666928,
            "Source": "corporate_action"
        },
        {
            "Title": "Techno Electric Projects ₹3,500 Crore Revenue for FY26 with Strong Growth Outlook",
            "Summary": "Techno Electric has projected revenue of ₹3,500 crores for FY26, with 25% growth expected for FY27. The company forecasts earnings per share of ₹50 for FY26 and ₹75 for FY27. Management anticipates 40-50% CAGR growth over the next two years, supported by a strong order book. The company aims to achieve monthly revenue of ₹300 crore this year, compared to ₹200 crore in FY25. Data center revenue is expected to reach ₹25-30 crore in FY26, with this segment gaining importance in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1755142049625,
            "Source": "stock"
        },
        {
            "Title": "Techno Electric & Engineering Reconstitutes Audit Committee and Approves Q1 2025 Financial Results",
            "Summary": "Techno Electric & Engineering Company Ltd held a board meeting on August 12, 2025, addressing key governance and financial matters. The company reconstituted its Audit Committee following the completion of tenure of Mr. K.K. Rai as Independent Director and Chairman. Mr. Arun Duggal was appointed as the new Chairman and Member of the Audit Committee, joining existing members Mr. Samarendra Nath Roy and Mr. Anjan Dasgupta, both Independent Directors. The board also approved and recorded the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with the review report issued by statutory auditors Walker Chandiok & Co. LLP, Chartered Accountants. The board meeting was conducted from 4:30 p.m. to 5:30 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1755004795570,
            "Source": "corporate_action"
        },
        {
            "Title": "Techno Electric & Engineering Reports Strong Q1 Growth with 77% Jump in Net Profit",
            "Summary": "Techno Electric & Engineering delivered robust quarterly results with net profit surging to 982 million rupees from 556 million rupees year-over-year. Revenue grew to 5.1 billion rupees compared to 4.1 billion rupees in the same period last year. EBITDA increased to 791 million rupees from 565 million rupees, while EBITDA margin improved to 15.40% from 13.66% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755002946779,
            "Source": "earnings"
        },
        {
            "Title": "Techno Electric: Wins RailTel Contract for 10MW Data Centre in Noida",
            "Summary": "Techno Electric & Engineering Company Ltd has been selected by RailTel Corporation of India Ltd to develop a 10MW data centre in Noida. The project will be executed over 30 years on a revenue-sharing basis, with a 24-month implementation timeline. The contract is subject to conditions in the Letter of Intent and signing of the final agreement.",
            "Sentiment": "positive",
            "PublishDate": 1748953405000,
            "Source": "order&deals"
        },
        {
            "Title": "Techno Electric & Engineering to Build 10MW Data Centre for RailTel",
            "Summary": "Techno Electric & Engineering Company has announced plans to construct a 10MW data centre for RailTel. No additional details about the project, such as timeline, cost, or specific location, were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748949281000,
            "Source": "default"
        },
        {
            "Title": "Techno Electric Announces Expansion Plans and Financial Targets",
            "Summary": "Techno Electric has expressed interest in developing edge data centers in Gandhinagar, Indore, and Bhopal, with plans to receive land possession soon. The company is in talks with hyperscalers to develop 4-5 edge data centers across India, aiming to complete around 250 megawatts of data centers by 2030. Techno Electric has a Rs 10,000 crore program to be deployed in the next 3 years. The company expects opportunities in solar plus storage hybrid systems and wind farm EPCs. They have received orders worth Rs 2,000 crores in Q4, bringing the total order tally for the year to over Rs 4,150 crores, exceeding their guidance of Rs 3,500 crores. The company now has a record order book of around Rs 11,000 crores as of March 2025. Techno Electric is targeting a top line of Rs 4,500 crores with EPS of no less than Rs 75 for 2026-27, and Rs 3,500 crores with EPS of no less than Rs 50 for the current year.",
            "Sentiment": "positive",
            "PublishDate": 1748576342000,
            "Source": "default"
        },
        {
            "Title": "Techno Electric & Engineering: Q4 Revenue Soars 86%, Stock Jumps 12%",
            "Summary": "Techno Electric & Engineering reported an 86% increase in Q4 revenue to ₹815.79 crore. EBITDA doubled to ₹126.71 crore with margin expansion. FY24 revenue grew 51% to ₹2,268.6 crore, a multi-year high. The stock surged 11.4% to ₹1,381.8 following the results.",
            "Sentiment": "positive",
            "PublishDate": 1748408398000,
            "Source": "earnings"
        },
        {
            "Title": "Techno Electric & Engineering Reports Q4 Profit and Revenue Growth, Announces Dividend",
            "Summary": "Techno Electric & Engineering reported a net profit of 1.32 billion rupees in Q4, up from 694 million rupees year-over-year and 1.04 billion rupees quarter-over-quarter. The company's Q4 revenue increased to 8 billion rupees from 4.83 billion rupees year-over-year. The company has recommended a dividend of 9 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748390415000,
            "Source": "default"
        },
        {
            "Title": "Techno Electric & Engineering Reports Strong Q4 Results and Dividend Announcement",
            "Summary": "Techno Electric & Engineering has announced its Q4 financial results and dividend. The company's Q4 net profit increased to 1.32 billion rupees from 694 million rupees year-over-year. Revenue rose to 8 billion rupees from 4.83 billion rupees in the same period. EBITDA for Q4 was 1.03 billion rupees, up from 589 million rupees, with EBITDA margin improving to 12.64% from 12.2%. The company has recommended a dividend of 9 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748357468000,
            "Source": "result"
        },
        {
            "Title": "Techno Electric & Engineering Launches Data Center Venture",
            "Summary": "Techno Electric & Engineering has launched a new subsidiary, Techno Digital Infra Pvt Ltd, with plans to invest $1 billion in data centers. The company has committed to establishing a cumulative capacity of 250 MW in hyperscale and edge data centers across India.",
            "Sentiment": "positive",
            "PublishDate": 1746622219000,
            "Source": "default"
        },
        {
            "Title": "Techno Electric Launches Digital Infrastructure Arm with $1B Investment Plan",
            "Summary": "Techno Electric has officially launched Techno Digital Infra Pvt Ltd, its wholly-owned digital infrastructure subsidiary. The company plans to develop an integrated network of hyperscale and edge data centers across India, targeting a cumulative capacity of 250 MW. This ambitious project involves a planned investment of $1 billion.",
            "Sentiment": "positive",
            "PublishDate": 1746507098000,
            "Source": "default"
        },
        {
            "Title": "Techno Electric & Engineering Reports Strong Q3 Financial Results",
            "Summary": "Techno Electric & Engineering has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 1.06 billion rupees, up from 776 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 6.76 billion rupees compared to 3.65 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739320452000,
            "Source": "earnings"
        },
        {
            "Title": "Techno Electric & Engineering Reports Significant Q3 EBITDA Growth",
            "Summary": "Techno Electric & Engineering has reported a substantial increase in its Q3 EBITDA, which rose to 989 million rupees from 449 million rupees year-over-year. The company's EBITDA margin also improved, increasing to 14.63% from 12.29% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739281228000,
            "Source": "earnings"
        },
        {
            "Title": "Techno Electric & Engineering Reports Strong Q3 Financial Results",
            "Summary": "Techno Electric & Engineering has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 1.06 billion rupees, up from 776 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 6.76 billion rupees compared to 3.65 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739281223000,
            "Source": "earnings"
        },
        {
            "Title": "Techno Electric & Engineering Submits QIP Proceeds Utilization Report",
            "Summary": "Techno Electric & Engineering has submitted a monitoring agency report by CARE Ratings regarding the utilization of Rs 1,250 crore raised through a Qualified Institutional Placement (QIP). The report covers the quarter ended September 30, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1731752798000,
            "Source": "corporate_action"
        },
        {
            "Title": "Techno Electric & Engineering Q2 Results: Net Profit and Revenue Update",
            "Summary": "Techno Electric & Engineering Company reported a consolidated net profit of 942 million rupees for Q2, up from 738 million rupees year-over-year and 981 million rupees quarter-over-quarter. However, Q2 revenue decreased to 4.4 billion rupees from 4.6 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731456086000,
            "Source": "result"
        },
        {
            "Title": "Techno Electric & Engineering Co Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Techno Electric & Engineering Co Ltd. Approximately 160,255 shares were traded at a price of Rs. 1749.75 per share, totaling Rs. 28.04 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1729137218000,
            "Source": "block_deals"
        }
    ]
}