{
    "Symbol": "TECHLABS",
    "ISIN": "INE0QD201012",
    "News": [
        {
            "Title": "Trident Techlabs Secures ₹1.4 Crore Order from Ministry of Defence",
            "Summary": "Trident Techlabs has received an order worth ₹1.4 crore from India's Ministry of Defence for cybersecurity solutions. The order highlights the company's involvement in providing technology for national defense and security purposes.",
            "Sentiment": "positive",
            "PublishDate": 1751357153000,
            "Source": "default"
        },
        {
            "Title": "Trident Techlabs Withdraws Preferential Issue",
            "Summary": "Trident Techlabs has decided to withdraw its previously announced preferential issue. The company's board determined that proceeding with the issue at this time would not be in the best interests of the company and its stakeholders. As a result, the board has resolved to cancel the preferential issue entirely.",
            "Sentiment": "negative",
            "PublishDate": 1743552582000,
            "Source": "corporate_action"
        },
        {
            "Title": "Trident Techlabs Withdraws Preferential Issue",
            "Summary": "Trident Techlabs has decided to withdraw its previously announced preferential issue. The company's board determined that proceeding with the issue at this time would not be in the best interests of the company and its stakeholders. As a result, the board has resolved to cancel the preferential issue entirely.",
            "Sentiment": "negative",
            "PublishDate": 1743520359000,
            "Source": "corporate_action"
        },
        {
            "Title": "Trident Techlabs Appoints Strategic and Business Development Advisor",
            "Summary": "Trident Techlabs has appointed Mr. Kizhepat Raghunathan Panicker as a Strategic and Business Development Advisor. This move suggests the company is focusing on enhancing its strategic planning and business growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1736146846000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Trident Techlabs Subsidiary to Acquire 60% Stake in Sivaltech Group",
            "Summary": "Trident Techlabs has announced that its subsidiary will acquire a 60% stake in Sivaltech Group. This acquisition represents a significant corporate action for the company, potentially expanding its business operations or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1735202081000,
            "Source": "corporate_action"
        }
    ]
}