{
    "Symbol": "TECILCHEM",
    "ISIN": "INE014B01011",
    "News": [
        {
            "Title": "TECIL Chemicals and Hydro Power Reports Loss in Quarter Ended September 2025",
            "Summary": "TECIL Chemicals and Hydro Power Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a loss after tax of Rs 19.44 lakhs for the quarter, compared to a loss of Rs 7.62 lakhs in the previous quarter. For the half year, the loss after tax was Rs 18.76 lakhs versus Rs 22.30 lakhs in the corresponding previous period. The company has no revenue from operations and operates in a single business segment. The Board of Directors approved these results in their meeting held on November 12, 2025. The financial statements were prepared in accordance with Indian Accounting Standards and reviewed by statutory auditors.",
            "Sentiment": "negative",
            "PublishDate": 1762943395148,
            "Source": "earnings"
        },
        {
            "Title": "Tecil Chemicals Board Approves Q1 2025 Results, Sets 80th AGM Date, and Authorizes Related Party Transactions",
            "Summary": "Tecil Chemicals and Hydro Power Limited's Board approved unaudited financial statements for the quarter ended June 30, 2025, showing a loss of Rs. 7.82 lakhs with earnings per share of negative Rs. 0.08. The company scheduled its 80th Annual General Meeting for September 18, 2025, at The Palms Hotel, Chingavanam. The Board authorized several material related party transactions including an unsecured loan up to Rs. 25 crores from Managing Director Varghese Kurian at 9% interest for financial years 2026-27 to 2028-29, salary payments for Company Secretary (Rs. 35 lakhs), Chief Financial Officer (Rs. 15 lakhs), and sitting fees for Independent Directors (Rs. 5 lakhs) for the same period. The company also re-appointed M.K Suresh as Internal Auditor for financial year 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1755002043706,
            "Source": "corporate_action"
        },
        {
            "Title": "Tecil Chemicals and Hydro Power: Small-Cap Stock Surges 20% Amid Market Crash",
            "Summary": "Tecil Chemicals and Hydro Power's stock hit a 20% upper circuit at ₹30.43 despite a significant market downturn. The company announced that the date for its board meeting to approve March quarter results will be declared soon.",
            "Sentiment": "positive",
            "PublishDate": 1744012838000,
            "Source": "corporate_action"
        }
    ]
}