{
    "Symbol": "TEGA",
    "ISIN": "INE011K01018",
    "News": [
        {
            "Title": "Tega Industries Approves INR 1500 Cr Borrowing Facility",
            "Summary": "Tega Industries board approves INR 1500 crore borrowing facility and investments totaling INR 3617 crore in subsidiaries to finance Molycop acquisition, expected to close by March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770896493673,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tega Industries Q3FY26 Results: Revenue Falls 24.5%",
            "Summary": "Tega Industries reported Q3FY26 standalone revenue of ₹1,867.72 million, down 24.5% YoY, with net profit declining 49.8% to ₹281.46 million. Consolidated revenue remained flat at ₹4,037.06 million.",
            "Sentiment": "negative",
            "PublishDate": 1770892379615,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC MF Acquires 5.02% Stake in Tega Industries",
            "Summary": "HDFC Mutual Fund disclosed substantial acquisition in Tega Industries Limited, increasing shareholding to 5.02% through open market purchase of 1,00,000 shares on January 29, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770112278079,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tega Industries De-registers Australian Subsidiary",
            "Summary": "Tega Industries board approves voluntary de-registration of wholly owned subsidiary Tega Australia, with AUD 84,778 to be returned to parent company while business operations remain unaffected.",
            "Sentiment": "neutral",
            "PublishDate": 1769758727346,
            "Source": "stocks"
        },
        {
            "Title": "Tega Industries Exercises USD 35 Million Upsize Option",
            "Summary": "Tega Industries' subsidiary exercises upsize option to increase investment by USD 35 million in SG Company, raising total stake to 84.2% with USD 394.29 million investment.",
            "Sentiment": "positive",
            "PublishDate": 1769223206723,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tega Industries Promoter Group Acquires Additional 7.72 Lakh Shares Through Preferential Allotment",
            "Summary": "Mehul Mohanka and persons acting in concert acquired 7,72,313 equity shares of Tega Industries through preferential allotment on November 28, 2025. The promoter group's shareholding decreased from 74.80% to 67.27% due to the increase in total share capital from Rs. 66.54 crore to Rs. 75.13 crore following the allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1764764237638,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Mutual Fund Increases Stake in Tega Industries to 5.47% Through Primary Market Purchase",
            "Summary": "Tata Mutual Fund and its associated schemes acquired 25,07,522 shares of Tega Industries Limited through primary market purchase, increasing their collective holding from 2.13% to 5.47%. The acquisition involved multiple Tata fund schemes and was completed on November 19, 2025, with the company's equity share capital expanding from Rs. 66.54 crore to Rs. 75.13 crore post-acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1764666114299,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Completes Rs 1,713 Crore Preferential Share Allotment",
            "Summary": "Tega Industries allotted 85,92,206 equity shares at Rs 1,994 per share to promoters, mutual funds, and public investors, raising Rs 1,713.29 crore through preferential placement. The allotment increases the company's paid-up share capital from Rs 66.54 crore to Rs 75.13 crore, with shares ranking pari-passu with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1764355135656,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Mutual Fund Increases Stake in Tega Industries to 5.36% Through Preferential Allotment",
            "Summary": "Tata Mutual Fund acquired 25,07,522 shares of Tega Industries Limited through primary market purchase preferential allotment, increasing its holding from 2.09% to 5.36%. The acquisition resulted in Tega Industries' equity share capital expanding from Rs. 66.53 crores to Rs. 76.57 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763632487575,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Reports 15% Revenue Growth in Q2 FY26, Equipment Business Surges 55%",
            "Summary": "Tega Industries achieved consolidated revenue of INR 4,211 million in Q2 FY26 with 15% year-on-year growth, driven by strong equipment business performance that grew 55% to INR 707 million. The company maintains healthy EBITDA margins of 20% and holds a robust order book of INR 11,556 million, with management confirming they remain on track to exceed their FY26 guidance while progressing with the Molycop acquisition expected to close by December-January.",
            "Sentiment": "positive",
            "PublishDate": 1763547465328,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries Establishes New Investment Unit in Singapore",
            "Summary": "Tega Industries has created a new subsidiary called Tega MC Investment Pte. Ltd. The establishment of this new unit represents a corporate restructuring move by the company.",
            "Sentiment": "positive",
            "PublishDate": 1763544586899,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Receives In-Principle Approval for Rs. 2,000 Crore Preferential Share Issue",
            "Summary": "NSE and BSE granted in-principle approval to Tega Industries for issuing 100,33,090 equity shares of Rs. 10 each at Rs. 1,994 per share to promoters and non-promoters on preferential basis. The approval allows the company to proceed with the share allotment subject to compliance with regulatory requirements and statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1763174735083,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Reports Strong Q2 Performance with 524% Jump in Net Profit",
            "Summary": "Tega Industries delivered robust quarterly results with consolidated net profit surging to 449 million rupees from 72 million rupees year-over-year, while revenue grew to 4.05 billion rupees from 3.5 billion rupees. The company's EBITDA nearly doubled to 692 million rupees with margin expansion to 17.1% from 9.71%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763074462933,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries Updates EGM Notice with Valuation Details and Allottee Information",
            "Summary": "Tega Industries has issued updates to its Extraordinary General Meeting notice following NSE requirements. The company clarified that its valuation report from registered valuer Mr. Neeraj Kumar Sureka shows a minimum floor price of Rs. 1,993.46 per equity share. The preferential issue is priced at Rs. 1,994 per share. Key promoters and directors plan to subscribe to the offer, including Managing Director Mehul Mohanka and Chairman Madan Mohanka, each subscribing to 1,50,451 shares. Aditya Birla Sun Life AMC will receive 3,00,902 shares, representing 0.39% of post-issue shareholding. The company noted that since the proposed preferential issue will not result in a change of control or allotment of more than 5% of post-issue share capital, a valuation report was not mandatory but was obtained per company's Articles of Association.",
            "Sentiment": "neutral",
            "PublishDate": 1761902844733,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Board Approves Changes to Preferential Issue Allottees and Shifts EGM to Virtual Mode",
            "Summary": "Tega Industries' Board of Directors approved modifications to the proposed allottees for its preferential issue worth INR 2000.60 crores. The company replaced 360 One Mutual Fund with four entities from the same group - Turnaround Opportunities Fund, 360 One High Growth Companies Fund, High Conviction Fund - Series 1, and 360 One Equity Opportunity Fund - maintaining the aggregate application size of INR 50 crores for the 360 One Group. The Board also approved changing the upcoming Extraordinary General Meeting scheduled for October 10, 2025, from physical to virtual mode following an extension granted by the Ministry of Corporate Affairs. The preferential issue includes 85 allottees across promoter, promoter group, and public categories, with the total issue size remaining unchanged at INR 2000.60 crores for 1,00,33,090 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758882534359,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukul Agarwal Invests Rs 100 Crore in Tega Industries Amid Major Fundraise",
            "Summary": "Investor Mukul Mahavir Agarwal, founder of Param Capital Group, acquired over 5 lakh shares worth Rs 100 crore in Tega Industries during the company's latest fundraising round. The fundraise attracted significant institutional participation, with Tata Mutual Fund leading at Rs 500 crore for 25.07 lakh shares, followed by Bandhan Mutual Fund (Rs 210 crore), Tata AIA Life Insurance (Rs 200 crore), ICICI Prudential Mutual Fund (Rs 150 crore), and Tata AIG General Insurance (Rs 100 crore). Tega Industries and Apollo Global Management signed a binding agreement to acquire US-based Molycop for $1.48 billion enterprise value, with Tega holding approximately 77% and Apollo 23% of the deal structure. The acquisition is priced at 8.6x FY25 EBITDA of $172 million, significantly lower than Tega's current 25x EBITDA multiple. Tega Industries shares have gained over 200% in the past 5 years, though they traded 3.1% lower at Rs 2,044 during the session.",
            "Sentiment": "positive",
            "PublishDate": 1758184711931,
            "Source": "stock"
        },
        {
            "Title": "Tega Industries Approves Rs 2,000.60 Crore Preferential Issue to 85 Investors",
            "Summary": "Tega Industries' Board of Directors approved the creation and issue of 100,33,090 equity shares through preferential issue to raise Rs 2,000.60 crores. The shares will be issued at Rs 1,994 per share (including premium of Rs 1,984) with a face value of Rs 10 each. The issue includes 85 proposed allottees across multiple categories: promoters and promoter groups receiving Rs 154 crores, qualified institutional buyers including Tata Mutual Fund (Rs 500 crores), Bandhan Mutual Fund (Rs 210 crores), and Tata AIA Life Insurance (Rs 200 crores). Individual investors, body corporates, directors, and employees are also part of the allotment. An Extraordinary General Meeting is scheduled for October 10, 2025, at Science City, Kolkata to seek shareholder approval for the preferential issue.",
            "Sentiment": "positive",
            "PublishDate": 1758178040722,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Board Approves Fundraising of Up to Rs 4,000 Crore",
            "Summary": "Tega Industries' board has approved raising funds up to Rs 4,000 crore through the issuance of equity shares and other securities.",
            "Sentiment": "positive",
            "PublishDate": 1757895069661,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Announces $1.48 Billion Acquisition of Molycop in Partnership with Apollo Funds",
            "Summary": "Tega Industries has entered into a term sheet to acquire Molycop, a global grinding media supplier for the mining industry, for approximately $1.48 billion in partnership with Apollo Funds as minority investor. The transaction is expected to close by December 31, 2025 or early January 2026, subject to regulatory approvals. Tega will fund the acquisition through $248 million in equity instruments including preferential allotment and qualified institutional placements, plus $112 million in debt. The promoter family plans to infuse INR 150-200 crores through preferential allotment. Molycop serves over 400 mines in 40 countries and reported $173 million EBITDA. The acquisition includes a $120 million deferred contingent liability tied to reopening of select closed mines. Tega expects to achieve revenue and cost synergies of $20 million by year two, scaling to $30 million annually from year four, while expanding EBITDA margins from 11.5% to 15%. The combined entity will have 26 manufacturing sites and target a consolidated return on equity of 18%. Molycop's current debt of $1 billion will be reduced to $780 million from day one, with plans to achieve net debt to EBITDA ratio below 2.5x over four years.",
            "Sentiment": "positive",
            "PublishDate": 1757779386715,
            "Source": "order&deals"
        },
        {
            "Title": "Tega Industries Board Approves Rs 4,000 Crore Funding Plan Through Equity and Securities",
            "Summary": "Tega Industries' board has approved a funding plan worth up to Rs 4,000 crores. The funding will be raised through the issuance of new equity shares and other securities.",
            "Sentiment": "positive",
            "PublishDate": 1757764672294,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Schedules Conference Call on Molycop Acquisition with Apollo Funds",
            "Summary": "Tega Industries Limited has scheduled a conference call for September 12, 2025, at 10:00 AM IST to discuss its proposed acquisition of Molycop in consortium with Apollo Funds. The company announced this development to stock exchanges on September 10, 2025. The conference call will update investors and analysts on the acquisition, with discussions based on publicly available information. Key participants include MD & Group CEO Mehul Mohanka and CFO Sharad Khaitan. The call has been organized on short notice to provide stakeholders with updates on this significant development.",
            "Sentiment": "neutral",
            "PublishDate": 1757609139330,
            "Source": "order&deals"
        },
        {
            "Title": "Tega Industries Plans Fundraising Through Equity And Debt Issuance",
            "Summary": "Tega Industries announced plans to explore fundraising options through both equity and debt issuance. The company scheduled this fundraising exploration for September 13.",
            "Sentiment": "positive",
            "PublishDate": 1757508216771,
            "Source": "stock"
        },
        {
            "Title": "Tega Industries to Acquire Molycop for $1.5 Billion, Becoming Main Shareholder",
            "Summary": "Tega Industries has announced plans to acquire Molycop in a $1.5 billion deal. Following the completion of this acquisition, Tega Industries will become the main shareholder of Molycop.",
            "Sentiment": "positive",
            "PublishDate": 1757506615456,
            "Source": "order&deals"
        },
        {
            "Title": "Tega Industries Revises Record Date for Final Dividend to September 09, 2025",
            "Summary": "Tega Industries Limited has revised the record date for determining shareholder eligibility for final dividend payment for FY 2024-25 to September 09, 2025, due to a public holiday on the previously announced date. The company had initially set Monday, September 08, 2025 as the record date, but changed it to Tuesday, September 09, 2025 after exchanges communicated that September 08 was declared a public holiday under the Negotiable Instruments Act. The revision affects shareholders of equity shares listed on BSE (scrip code: 543413) and NSE (symbol: TEGA) for final dividend entitlement for the financial year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757054161340,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Sets September 8, 2025 Record Date for Rs. 2 Final Dividend",
            "Summary": "Tega Industries Limited announced a final dividend of Rs. 2 per equity share for the financial year ended March 31, 2025. The Board of Directors recommended this dividend at their meeting held on May 15, 2025, representing 20% of the face value of Rs. 10 per share. The company has fixed September 8, 2025 as the record date for determining shareholder eligibility for the dividend. The dividend is subject to approval at the 49th Annual General Meeting scheduled for September 19, 2025. If approved, dividend payments will be made on or before October 18, 2025, subject to tax deductions at source.",
            "Sentiment": "positive",
            "PublishDate": 1756219310606,
            "Source": "corporate_action"
        },
        {
            "Title": "Tega Industries Reports 6% Revenue Growth to ₹3,716 Million in Q1 FY26 with Strong Equipment Segment Performance",
            "Summary": "Tega Industries delivered consolidated operating revenue of ₹3,716 million for the quarter ended June 30, 2025, representing 6% year-on-year growth. The company reported operating EBITDA of ₹725 million with margins of 20%. Equipment business showed strong performance with revenue of ₹643 million, up 78% year-on-year from ₹361 million in the same period last year. Consumable business contributed 82% of group revenue at ₹2,940 million, while equipment segment contributed 18%. The company maintains an order book of ₹10,053 million, with ₹6,103 million executable within 12 months. Management highlighted that Latin America is driving growth among all regions, with DynaPrime seeing maximum growth in the consumables portfolio. The Chile capacity expansion project remains on track for commercial production around the same time next year. Company maintains its 15% CAGR growth guidance and expects equipment business to grow at 25%.",
            "Sentiment": "positive",
            "PublishDate": 1754659759013,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries Reports Order Book of ₹1,005 Crores with ₹610 Crores Executable in Next 12 Months",
            "Summary": "Tega Industries has an order book worth ₹1,005 crores, with ₹610 crores expected to be executable within the next 12 months. The company's management is focusing on efficient execution and cost management strategies to improve margins while leveraging strong market demand.",
            "Sentiment": "positive",
            "PublishDate": 1754403332469,
            "Source": "stock"
        },
        {
            "Title": "Tega Industries Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Tega Industries reported quarterly results showing revenue growth to 3.6 billion rupees from 3.39 billion rupees year-over-year. However, consolidated net profit declined to 353 million rupees from 367 million rupees compared to the same period last year. EBITDA decreased to 556 million rupees from 642 million rupees year-over-year, with EBITDA margin contracting to 15.6% from 18.9% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754385362889,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries Subsidiary Appoints Anand Sen as Independent Director",
            "Summary": "Tega McNally Minerals Limited, a wholly owned subsidiary of Tega Industries Limited, has appointed Mr. Anand Sen as an Additional Director in the Non-Executive Independent category. The appointment is effective from July 18, 2025, for a term of 5 consecutive years. Sen already serves as a Non-Executive Independent Director on the parent company Tega Industries' board.",
            "Sentiment": "neutral",
            "PublishDate": 1753100032231,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tega Industries Reports Q4 Results and Declares Dividend",
            "Summary": "Tega Industries has announced its Q4 financial results and a dividend declaration. The company's Q4 consolidated net profit increased to 1.02 billion rupees from 895 million rupees year-over-year. Revenue rose to 5.36 billion rupees from 5.1 billion rupees. EBITDA improved to 1.49 billion rupees with a margin of 27.78%. The company has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747308128000,
            "Source": "result"
        },
        {
            "Title": "Tega Industries to Consider Q4 Results on May 15",
            "Summary": "Tega Industries has announced that it will consider its fourth quarter (Q4) financial results on May 15. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746619355000,
            "Source": "default"
        },
        {
            "Title": "Tega Industries Reports Q3 Revenue Growth",
            "Summary": "Tega Industries has reported a revenue of 4.1 billion rupees for the third quarter, compared to 3.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738742493000,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries Reports Significant Growth in Q3 EBITDA",
            "Summary": "Tega Industries has reported a substantial increase in its Q3 EBITDA, rising to 912 million rupees from 561 million rupees in the same quarter of the previous year. The company's EBITDA margin also improved significantly, reaching 22.28% compared to 16.49% in the year-ago period. This performance indicates a strong improvement in the company's operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738742368000,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Tega Industries has announced its financial results for the third quarter, reporting a consolidated net profit of 543 million rupees. This represents a substantial increase from the 356 million rupees reported in the same quarter of the previous year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738742316000,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries to Consider Q3 Results",
            "Summary": "Tega Industries has announced that it will consider its financial results for the third quarter on February 5.",
            "Sentiment": "neutral",
            "PublishDate": 1738067336000,
            "Source": "earnings"
        },
        {
            "Title": "Tega Industries: Rs 200 Crore Revenue Boost Expected from India Capex by FY27",
            "Summary": "Tega Industries anticipates Rs 200 crore incremental revenue by FY27 from capacity expansion in India. The company's Chile plant, operational by next fiscal year, is expected to contribute Rs 400-500 crore additional revenue in FY27, with full Rs 800 crore potential realized later. Tega maintains its 15% revenue growth and 20%+ EBITDA margin targets.",
            "Sentiment": "positive",
            "PublishDate": 1736403791000,
            "Source": "normal_news"
        },
        {
            "Title": "Tega Industries Reports Significant Decline in Q2 EBITDA",
            "Summary": "Tega Industries has reported a substantial decrease in its Q2 EBITDA, which fell to 343 million rupees from 817 million rupees year-over-year. The company's EBITDA margin also declined significantly, dropping to 9.71% from 21.65% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731573577000,
            "Source": "result"
        },
        {
            "Title": "Tega Industries Reports Q2 Revenue Decline",
            "Summary": "Tega Industries reported a revenue of 3.5 billion rupees for the second quarter, down from 3.8 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731573555000,
            "Source": "result"
        },
        {
            "Title": "Tega Industries Reports Significant Drop in Q2 Profit",
            "Summary": "Tega Industries has reported a consolidated net profit of 72 million rupees for the second quarter, marking a substantial decrease from 473 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731573530000,
            "Source": "result"
        },
        {
            "Title": "Tega Industries: Global Expansion Insights",
            "Summary": "<p><span class=\"positive\">Motilal Oswal</span> report highlights <b>Tega Industries'</b> <span class=\"positive\">progress</span> in <span class=\"neutral\">international markets</span>. <br/> Detailed analysis available to <span class=\"neutral\">NDTV Profit</span> subscribers.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728022393000,
            "Source": "normal_news"
        }
    ]
}