{
    "Symbol": "TEJASNET",
    "ISIN": "INE010J01012",
    "News": [
        {
            "Title": "Tejas Networks Q3FY26: Revenue up 17% to ₹307 cr",
            "Summary": "Tejas Networks reported Q3FY26 revenue of ₹307 crores, up 17% QoQ, driven by wireline products. Company faces ₹197 crore net loss amid BSNL 4G expansion delays but sees progress in international wireless trials.",
            "Sentiment": "neutral",
            "PublishDate": 1768558285016,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Posts ₹197 Cr Loss Despite BSNL Win",
            "Summary": "Tejas Networks reported a ₹197 crore quarterly loss as delayed BSNL orders force the company to hold over ₹2,300 crore inventory for four consecutive quarters, weighing on profitability.",
            "Sentiment": "negative",
            "PublishDate": 1768215845315,
            "Source": "stocks"
        },
        {
            "Title": "Tejas Networks eyes global 4G, 5G deals amid losses",
            "Summary": "Tejas Networks reports Q3 net loss of ₹196.55 crore due to delayed BSNL orders while pursuing international 4G and 5G opportunities across Africa, Europe, and Southeast Asia markets.",
            "Sentiment": "neutral",
            "PublishDate": 1768199779316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Stock Falls 8% on Weak Q3 Results",
            "Summary": "Tejas Networks shares declined 8% following Q3FY26 results showing 88.3% YoY revenue drop to ₹306.79 crores and net loss of ₹196.55 crores against previous year's profit of ₹165.67 crores.",
            "Sentiment": "negative",
            "PublishDate": 1768198462811,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks hits 52-week low on Q3 loss",
            "Summary": "Tejas Networks shares plunged 7.81% to ₹384.15 after reporting Q3 FY26 net loss of ₹196.55 crore against previous year's profit of ₹165.67 crore. Revenue declined 88% YoY to ₹306.79 crore.",
            "Sentiment": "negative",
            "PublishDate": 1768190909277,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3 Loss Widens to ₹196.55 Crore",
            "Summary": "Tejas Networks reported consolidated loss of ₹196.55 crore in Q3 FY26 compared to ₹165.67 crore profit last year. Revenue declined 88% YoY to ₹307 crore due to deferred BSNL orders.",
            "Sentiment": "negative",
            "PublishDate": 1768189135570,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3: Fourth straight loss narrows",
            "Summary": "Tejas Networks reported its fourth consecutive quarterly loss of ₹196.50 crore in Q3, though narrower than Q2's ₹307.00 crore loss. Revenue rose 17% sequentially but fell 88% year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1768184916092,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3 Revenue Drops 88% to ₹305 Crores",
            "Summary": "Tejas Networks reported a significant 88% decline in Q3 revenue to ₹305 crores compared to ₹2,642 crores in the previous year, while net loss widened to ₹197 crores from ₹165 crores year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1768176733726,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3 Loss Widens to ₹196 Crore",
            "Summary": "Tejas Networks reported consolidated loss of ₹196.55 crore in Q3 FY25 against profit of ₹165.67 crore in Q3 FY24. Revenue plunged 88% YoY to ₹306.79 crore due to BSNL order deferrals.",
            "Sentiment": "negative",
            "PublishDate": 1768021613234,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Reports ₹196.55 Cr Loss in Q3 FY26",
            "Summary": "Telecom gear maker posts second consecutive quarterly loss due to 88% revenue decline and delayed BSNL orders worth ₹1,526 crores, despite receiving ₹84.95 crore PLI incentives.",
            "Sentiment": "negative",
            "PublishDate": 1767988040723,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3 FY26 Earnings Call Audio Available",
            "Summary": "Tejas Networks has made the audio recording of its Q3 FY26 earnings call held on January 9, 2026, available on its official website for stakeholder access.",
            "Sentiment": "neutral",
            "PublishDate": 1767979433202,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Shows Positive Long-Term Outlook",
            "Summary": "Tejas Networks demonstrates encouraging prospects for future growth and business development based on recent company assessments and strategic positioning in the telecommunications sector.",
            "Sentiment": "positive",
            "PublishDate": 1767969336689,
            "Source": "stocks"
        },
        {
            "Title": "Tejas Networks Q3FY26 Revenue Falls to ₹307 Cr",
            "Summary": "Tejas Networks reported Q3FY26 revenue of ₹307 crores, down from ₹2,642 crores in Q3FY25, with net loss of ₹197 crores. Company secured 7 of 12 Bharatnet packages and won multiple orders.",
            "Sentiment": "negative",
            "PublishDate": 1767967125522,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3FY26: Revenue up 17% QoQ to ₹307 cr",
            "Summary": "Tejas Networks reported Q3FY26 revenue of ₹307 crores, up 17% QoQ, with losses narrowing to ₹197 crores. Order book grew to ₹1,329 crores with multiple wireless trials ongoing.",
            "Sentiment": "neutral",
            "PublishDate": 1767967036747,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3 EBITDA Loss Narrows to ₹1.30 Cr",
            "Summary": "Tejas Networks significantly improved its Q3 EBITDA performance with losses reducing from ₹3.70 crores in the previous year to ₹1.30 crores, marking a substantial 64.86% improvement year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1767965525780,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Q3 Loss Widens to ₹197 Crores",
            "Summary": "Tejas Networks reported a widened net loss of ₹197 crores in Q3 compared to ₹165 crores in the same quarter last year, while revenue declined significantly to ₹305 crores from ₹2,642 crores year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1767965503686,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Reports Q3 FY26 Loss of ₹196.89 Crore",
            "Summary": "Tejas Networks posted a net loss of ₹196.89 crore in Q3 FY26 compared to profit of ₹165.42 crore in Q3 FY25. Revenue dropped 88.43% YoY to ₹305.72 crore amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1767964213457,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Gets ICRA A1+ Rating for ₹500 Cr CP",
            "Summary": "Tejas Networks Limited receives [ICRA]A1+ credit rating from ICRA Limited for its ₹500 crore Commercial Paper programme, reflecting strong short-term creditworthiness and financial stability.",
            "Sentiment": "positive",
            "PublishDate": 1767961703985,
            "Source": "stocks"
        },
        {
            "Title": "Tejas Networks Q3FY26 Results Call on Jan 9, 2026",
            "Summary": "Tejas Networks schedules board meeting and investor call on January 9, 2026, to discuss Q3FY26 financial results for quarter ended December 31, 2025. Trading window closed until January 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767340299990,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Wins 7 BharatNet Phase-III Packages",
            "Summary": "Tejas Networks secures IP routing equipment contracts for 7 out of 12 BharatNet Phase-III packages, establishing itself as the leading supplier by package count in the government's rural connectivity initiative.",
            "Sentiment": "positive",
            "PublishDate": 1765422628889,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tejas Networks Allots 2.87 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "Tejas Networks allotted 2,86,755 equity shares on December 1, 2025, following the exercise of stock options by eligible employees under four different employee stock option plans with exercise prices of Rs. 85 and Rs. 10. The allotment increased the company's paid-up share capital from Rs. 1,77,16,22,030 to Rs. 1,77,44,89,580, with total equity shares rising from 17,71,62,203 to 17,74,48,958 shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764585710975,
            "Source": "corporate_action"
        },
        {
            "Title": "Tejas Networks Receives ₹84.95 Crore PLI Incentive Payment from Telecommunications Department",
            "Summary": "Tejas Networks received ₹84.95 crore as an initial payment under the Production Linked Incentive (PLI) scheme from the Telecommunications Department. This government incentive payment supports the company's manufacturing operations in the telecommunications sector.",
            "Sentiment": "positive",
            "PublishDate": 1764336569844,
            "Source": "stock"
        },
        {
            "Title": "Tejas Networks Appoints Dr. Randhir Thakur as Non-Executive Director Through Postal Ballot",
            "Summary": "Tejas Networks successfully passed an ordinary resolution through postal ballot to appoint Dr. Randhir Thakur (DIN: 09154242) as a Non-Executive, Non-Independent Director, effective November 22, 2025. The resolution received overwhelming shareholder support with 99.91% votes in favor from 1,091 members representing 63.73% of the company's equity share capital through e-voting.",
            "Sentiment": "positive",
            "PublishDate": 1763986084759,
            "Source": "corporate_action"
        },
        {
            "Title": "Tejas Networks Shares Investor Presentation Ahead of Analyst Meetings",
            "Summary": "Tejas Networks submitted an investor presentation to stock exchanges for analyst and institutional investor meetings scheduled for November 18 and November 20, 2025. The presentation covers the company's business operations, product portfolio spanning wireless and wireline telecom equipment, financial performance, and strategic initiatives including BSNL 4G/5G network deployment and global expansion partnerships.",
            "Sentiment": "neutral",
            "PublishDate": 1763436582122,
            "Source": "stock"
        },
        {
            "Title": "Tejas Networks Allots 289,790 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Tejas Networks Limited allotted 289,790 equity shares on October 31, 2025, following the exercise of stock options by eligible employees under three stock option plans. The allotment included 1,400 shares under the 2016 Employee Stock Option Plan at Rs. 85 per share, 1,687 shares under the 2017 Restricted Stock Unit Plan at Rs. 10 per share, and 286,703 shares under the 2022 Restricted Stock Unit Plan at Rs. 10 per share. Following this allotment, the company's paid-up share capital increased to Rs. 177.16 crores, comprising 17.71 crore equity shares of Rs. 10 each, up from the previous Rs. 176.87 crores divided into 17.69 crore equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761872082446,
            "Source": "corporate_action"
        },
        {
            "Title": "Tejas Networks Reports Rs 307 Crore Loss in Q2 FY26 Despite 30% Revenue Growth",
            "Summary": "Tejas Networks reported quarterly revenue of Rs 262 crores compared to Rs 202 crores in the previous quarter, marking 30% quarter-on-quarter growth. However, the company posted a loss of Rs 307 crores versus Rs 194 crores loss in the previous quarter. The loss included Rs 190 crores in provisions for inventory obsolescence, contract manufacturing process losses, and warranty expenses. The company's order book stood at Rs 1,200 crores compared to Rs 1,241 crores previously. Revenue mix remained 79% India and 21% international. The company is awaiting BSNL's Rs 1,500 crore add-on purchase order for 18,000 sites, which TCS has received as advance purchase order but hasn't converted to purchase order yet. BSNL has launched 4G services across 97,500 cell towers using Tejas equipment, carrying 4 petabytes of daily data traffic with 26 million active subscribers. Receivables stood at Rs 4,026 crores with Rs 700 crores collected during the quarter, while borrowings reached Rs 4,166 crores primarily for working capital needs. The company launched new products including 64T64R massive MIMO radio and 1.2 Tbps DWDM transmission system, and filed 39 patents bringing total to 587.",
            "Sentiment": "negative",
            "PublishDate": 1761659298755,
            "Source": "earnings"
        },
        {
            "Title": "PowerTel Selects Tejas Networks for 400Gbps DWDM Network Upgrade Across India",
            "Summary": "Tejas Networks has secured a Telecom Capacity Augmentation Project with PowerGrid Teleservices (PowerTel), a subsidiary of Power Grid Corporation of India. The project involves designing, supplying, installing, testing, commissioning and integrating a 400Gbps DWDM system for new greenfield sites and upgrading existing links across PowerTel's pan-India network. Tejas will deploy its TJ1600 DWDM/OTN product, which can deliver up to 1.2Tbps over a single wavelength and supports alien wavelength technology. The upgrade aims to address growing demand for high-bandwidth connectivity from data center providers, telecom operators, government and large enterprises. Tejas Networks operates in over 75 countries and is part of the Tata Group, with Panatone Finvest Ltd. being the majority shareholder.",
            "Sentiment": "positive",
            "PublishDate": 1761533167130,
            "Source": "order&deals"
        },
        {
            "Title": "Tejas Networks Shares Fall 1.5% Despite BharatNet Phase III Partnership with NCC",
            "Summary": "Tejas Networks shares declined 1.5% on Thursday, extending losses following its September quarter results. The company has begun shipping IP-MPLS routers and management systems for BharatNet Phase III project covering Madhya Pradesh, Dadra Nagar Haveli, Daman and Diu, and Uttarakhand. The partnership with NCC aims to upgrade middle-mile broadband infrastructure across 30,841 GPs and 411 block locations using IP-MPLS technology. The stock has fallen in three of the last four trading sessions. Tejas Networks reported its third consecutive quarterly loss due to lower revenue and provisions from manufacturing process losses, warranty and inventory obsolescence. The stock is the worst performer on the Nifty Smallcap index, declining 55% since the Nifty 50 hit a record high on September 27, 2024.",
            "Sentiment": "negative",
            "PublishDate": 1761196389237,
            "Source": "stock"
        },
        {
            "Title": "Tejas Networks Selected by NCC as IP/MPLS Router Supplier for BharatNet Phase III Project",
            "Summary": "Tejas Networks announced that Nagarjuna Construction Company (NCC) has selected the company as the supplier of IP/MPLS Routers for multiple packages of the BharatNet Phase III project. Tejas has begun shipping its IP-MPLS Routers and Management System for packages covering Madhya Pradesh, Dadra Nagar Haveli, Daman and Diu, and Uttarakhand. The project involves upgrading existing middle-mile broadband infrastructure from linear to ring topology across 30,841 Gram Panchayats and 411 Block locations using IP-MPLS technology. BharatNet is a Government of India program funded by Digital Bharat Nidhi that aims to extend high-speed broadband connectivity to every village in the country. Tejas Networks previously served as a GPON equipment supplier for earlier phases of the BharatNet project.",
            "Sentiment": "positive",
            "PublishDate": 1761188552057,
            "Source": "order&deals"
        },
        {
            "Title": "Tejas Networks Seeks Shareholder Approval for Dr. Randhir Thakur's Appointment as Non-Executive Director",
            "Summary": "Tejas Networks Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Dr. Randhir Thakur as a Non-Executive, Non-Independent Director. Dr. Thakur was initially appointed as an Additional Director on September 15, 2025, based on the recommendation of the Nomination and Remuneration Committee. The e-voting period runs from October 24, 2025, to November 22, 2025, with results to be announced by November 25, 2025. Dr. Thakur serves as Chief Executive Officer and Managing Director of Tata Electronics Limited and brings over 40 years of semiconductor industry experience. He holds more than 300 patents and is an IEEE Fellow. The appointment requires ordinary resolution approval from shareholders, with voting rights proportional to equity shareholding as of the October 17, 2025 cut-off date.",
            "Sentiment": "neutral",
            "PublishDate": 1760956291130,
            "Source": "corporate_action"
        },
        {
            "Title": "Tejas Networks Reports Third Consecutive Quarterly Loss with 90% Revenue Decline",
            "Summary": "Tejas Networks reported a net loss of ₹307.17 crore for the July-September quarter, marking its third straight loss-making quarter. This compares to a net profit of ₹275.18 crore in the same period last year. The company's revenue from operations declined 90.7% to ₹261.37 crore from ₹2,810.14 crore year-over-year. EBITDA turned negative at ₹293.7 crore versus a positive ₹534.45 crore previously. CFO Sumit Dhingra attributed the loss to lower revenue and provisions for manufacturing process losses, warranty, and inventory obsolescence. The company reported a 30% sequential revenue increase and ended the quarter with an order book of ₹1,204 crore, down from ₹4,845 crore in the year-ago period. For the first half of the financial year, total revenue declined 90% to ₹463.8 crore with a net loss of ₹501 crore. The stock has declined 50% this year and closed at ₹588.9 per share.",
            "Sentiment": "negative",
            "PublishDate": 1760929404385,
            "Source": "earnings"
        },
        {
            "Title": "Tejas Networks Makes Q2 FY26 Earnings Call Audio Recording Available Online",
            "Summary": "Tejas Networks Limited conducted its Q2 FY26 earnings call on October 17, 2025. The company has made the audio recording of the call available on its website for stakeholders to access at tejasnetworks.com. The company notified stock exchanges NSE and BSE about the availability of the earnings call recording.",
            "Sentiment": "neutral",
            "PublishDate": 1760721135760,
            "Source": "earnings"
        },
        {
            "Title": "Tejas Networks Reports Rs 501 Crore Loss for Six Months Ended September 2025",
            "Summary": "Tejas Networks Limited reported a consolidated loss after tax of Rs 501 crore for the six months ended September 30, 2025, compared to a profit of Rs 352.66 crore in the same period last year. The company's revenue from operations declined to Rs 463.80 crore from Rs 4,374.03 crore year-over-year. For the quarter ended September 30, 2025, the company posted a loss of Rs 307.13 crore versus a profit of Rs 275.18 crore in the corresponding quarter of the previous year. The cost of materials consumed included a provision for inventory obsolescence of Rs 145.43 crore for the quarter, primarily due to contract manufacturing process losses and design changes. Other expenses included Rs 44.44 crore provision for warranty expenses. The company's basic earnings per share was negative Rs 28.37 for the six-month period. The Board of Directors approved these unaudited financial results in a meeting held on October 17, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1760707736074,
            "Source": "earnings"
        },
        {
            "Title": "Tejas Networks Plans Global Expansion of 4G-5G Technology and Seeks New Telecom Partnerships in India",
            "Summary": "Tejas Networks announced its intention to expand its 4G and 5G technology offerings on a global scale. The company is actively seeking new partnerships with private telecom companies within India as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1760675109948,
            "Source": "stock"
        },
        {
            "Title": "Tejas Networks Launches 64T64R Massive MIMO Radio at India Mobile Congress",
            "Summary": "Tejas Networks introduced its homegrown 64T64R Massive MIMO Radio technology at the India Mobile Congress. The company showcased this domestically developed radio solution at the telecommunications industry event.",
            "Sentiment": "positive",
            "PublishDate": 1759977644190,
            "Source": "stock"
        },
        {
            "Title": "BSNL Plans 5G Tower Upgrades Within 6-8 Months, Communication Minister Announces",
            "Summary": "India's Communication Minister announced that BSNL plans to upgrade all its towers to 5G technology within a 6-8 month timeframe. This development relates to Tejas Networks, which appears connected to BSNL's 5G infrastructure plans.",
            "Sentiment": "positive",
            "PublishDate": 1759720954147,
            "Source": "stock"
        },
        {
            "Title": "BSNL Launches 4G Network Services",
            "Summary": "BSNL has introduced 4G network services. This development involves Tejas Networks, though the specific nature of their involvement is not detailed in the available information.",
            "Sentiment": "positive",
            "PublishDate": 1758860184296,
            "Source": "stock"
        },
        {
            "Title": "Tejas Networks Appoints Dr. Randhir Thakur as Additional Non-Executive Director",
            "Summary": "Tejas Networks Limited appointed Dr. Randhir Thakur as an Additional Director (Non-Executive and Non-Independent) effective September 15, 2025. The appointment was approved by the Board based on the Nomination and Remuneration Committee's recommendation and requires shareholder approval through Postal Ballot. Dr. Thakur serves as Chief Executive Officer and Managing Director of Tata Electronics Limited since April 2023 and brings over 40 years of semiconductor industry experience in manufacturing, R&D, and P&L management. He is an IEEE Fellow since 2013 with more than 300 patents and previously held senior positions at Intel, including President of Intel Foundry Services and Corporate Vice President. Dr. Thakur holds engineering degrees from National Institute of Technology Kurukshetra, University of Saskatchewan, and University of Oklahoma. He has no relationships with other directors of the company and is not debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1757936438466,
            "Source": "corporate_governance"
        },
        {
            "Title": "BSNL Plans Major Network Expansion with 300,000-400,000 New Towers",
            "Summary": "BSNL plans to issue a tender for 300,000 to 400,000 new towers as part of its network expansion strategy. The state-owned telecom operator also intends to introduce affordable plans aimed at attracting users from private telecom companies. This development is relevant for Tejas Networks, which operates in the telecom equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1756183680991,
            "Source": "stock"
        },
        {
            "Title": "Indian Government Encourages Private Telecom Companies to Adopt Domestic Equipment",
            "Summary": "The Indian government is urging private telecom companies to use domestically manufactured equipment in their networks. This initiative appears to promote the use of home-made telecom infrastructure, with Tejas Networks being mentioned in this context as a domestic equipment provider.",
            "Sentiment": "positive",
            "PublishDate": 1754970246320,
            "Source": "stock"
        },
        {
            "Title": "KhushTech Korea Launches India's First D2M Feature Phone Using Tejas Networks Technology",
            "Summary": "KhushTech Korea has developed the world's first Direct-to-Mobile (D2M) feature phone under the FreeStream brand, powered by Tejas Networks' SL-3000 D2M demodulator chip. The device operates in the 470-608 MHz broadcast bands and uses terrestrial TV broadcast airwaves to deliver multimedia content directly to phones without requiring Wi-Fi or internet service. The technology leverages the ATSC 3.0 broadcast standard and has been tested by Prasar Bharati in partnership with IIT Kanpur and Tejas Networks. KhushTech's CEO Eric Shin demonstrated the phone to Andhra Pradesh's IT Minister and announced plans to establish a manufacturing facility in Andhra Pradesh to support India's Make in India initiative. The device is positioned as a low-cost solution for educational content delivery in rural areas and is ready for commercialization as India's first BIS Certified D2M Feature Phone.",
            "Sentiment": "positive",
            "PublishDate": 1754588212876,
            "Source": "stock"
        },
        {
            "Title": "Vijay Kedia Exits Tejas Networks After Five Years as Stock Hits 52-Week Low",
            "Summary": "Veteran investor Vijay Kedia has exited his stake in Tata Group's Tejas Networks after five years of investment. Kedia Securities no longer appears in the public shareholding list, having held 18 lakh shares (1.02% stake) at the end of March. Kedia first invested in June 2020 with a 1.52% stake, peaked at 4.39%, and has been trimming his position since. Tejas Networks shares surged 2,035% from September 2020 levels of ₹70 to an all-time high of ₹1,495.1 in June 2024, but have since declined over 60%. The company reported an 89% sequential revenue decline and 87% year-over-year drop in quarterly results. Shares are currently trading at ₹608.45, down 2.8%, and have halved in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753249274562,
            "Source": "stock"
        },
        {
            "Title": "Tejas Networks Reports INR 194 Crore Loss in Q1 FY26 Despite INR 1,500 Crore BSNL Order Win",
            "Summary": "Tejas Networks reported a net revenue of INR 202 crores in Q1 FY26, significantly lower than the previous quarter's INR 1,907 crores, resulting in a loss of INR 194 crores. The revenue decline was primarily due to delayed purchase orders and shipment clearances, including the postponed deployment of 18,000 BSNL 4G network sites. However, the company expects to receive an order worth approximately INR 1,500 crores for BSNL's 4G expansion project covering 18,000-plus sites. The order book stood at INR 1,241 crores at quarter-end, with 92% from India and 8% international business. Key developments included strategic partnerships with Rakuten Symphony for 5G Open RAN solutions and Intel for Direct-to-Mobile chipsets. The company received PLI incentives of INR 122 crores and launched its 1.2 terabit per wavelength DWDM solution. Trade receivables increased to INR 4,453 crores while borrowings rose to INR 3,990 crores. Management expects significant receivable collections and order execution within the financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1753095218702,
            "Source": "earnings"
        },
        {
            "Title": "Tejas Networks: Q1 FY26 Swings to Rs 194 Crore Loss",
            "Summary": "Tejas Networks reported a net loss of Rs 194 crore in Q1 FY26, compared to a profit of Rs 77 crore in Q1 FY25. Revenue declined 87% YoY to Rs 202 crore. The company cited delays in purchase orders, including from BSNL, for the revenue shortfall. Strategic partnerships were signed with Rakuten Symphony, Intel, and mobile phone manufacturers for various initiatives.",
            "Sentiment": "negative",
            "PublishDate": 1752551225000,
            "Source": "earnings"
        },
        {
            "Title": "Tejas Networks Expects Growth and Improved Financials",
            "Summary": "Tejas Networks anticipates collecting a significant portion of receivables in the current financial year. The company remains optimistic about growth factors and continues to invest in R&D and sales for future business expansion. They reported better material margins in Q1, which helped offset the impact of lower revenues on fixed costs. Additionally, Tejas Networks expects to complete a BSNL expansion order worth ₹1,500 crore this financial year.",
            "Sentiment": "positive",
            "PublishDate": 1752550038000,
            "Source": "default"
        },
        {
            "Title": "Tejas Networks Reports Q1 Net Loss and Revenue Decline",
            "Summary": "Tejas Networks has reported its Q1 financial results. The company recorded a net loss of 1.9 billion rupees, compared to a profit of 811 million rupees in the same quarter last year. Revenue decreased to 2 billion rupees from 15.4 billion rupees year-over-year. The company's EBITDA also turned negative, with a loss of 1.35 billion rupees, compared to a gain of 2.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1752538930000,
            "Source": "default"
        },
        {
            "Title": "Tejas Networks Targets Growth with BSNL Contract and Global Partnerships",
            "Summary": "Tejas Networks aims for strong growth in FY26, driven by a ₹1,526 crore contract with BSNL for 4G technology. The company plans to expand its 5G and FTTX offerings and has formed global alliances with Rakuten and NEC.",
            "Sentiment": "positive",
            "PublishDate": 1752503533000,
            "Source": "default"
        },
        {
            "Title": "Tejas Networks: Q1 Net Loss of Rs 193.87 Crore, Revenue Plummets 87%",
            "Summary": "Tejas Networks reported a net loss of Rs 193.87 crore in Q1 FY26, compared to a profit of Rs 77.48 crore in the same period last year. Revenue decreased by 87.1% to Rs 201.98 crore. The company also reported an EBITDA loss of Rs 135.67 crore.",
            "Sentiment": "negative",
            "PublishDate": 1752497506000,
            "Source": "earnings"
        },
        {
            "Title": "Tejas Networks Reports Q1 Financial Results",
            "Summary": "Tejas Networks has reported its Q1 financial results. The company experienced an EBITDA loss of 1.35 billion rupees, compared to a gain of 2.3 billion rupees in the same quarter last year. The net loss for Q1 was 1.9 billion rupees, in contrast to a profit of 811 million rupees in the previous year. Revenue for Q1 was 2 billion rupees, down from 15.4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752496504000,
            "Source": "result"
        },
        {
            "Title": "Tejas Networks: Strategic Partnership with Rakuten Symphony for Open RAN Solutions",
            "Summary": "Tejas Networks announced a strategic partnership with Rakuten Symphony to develop integrated Open RAN solutions. The collaboration aims to combine Tejas's 4G/5G radio offerings with Rakuten Symphony's software and cloud portfolio for global market expansion.",
            "Sentiment": "positive",
            "PublishDate": 1750909471000,
            "Source": "corporate_action"
        }
    ]
}