{
    "Symbol": "TEMBO",
    "ISIN": "INE869Y01010",
    "News": [
        {
            "Title": "Tembo Global Eyes 90-100% Capacity at New Plant",
            "Summary": "Tembo Global's new Vasai manufacturing facility targets 90-100% capacity utilization within 2-3 years, backed by strong order book of ₹1,484 crore providing revenue visibility for next 1-2 years.",
            "Sentiment": "positive",
            "PublishDate": 1770348972899,
            "Source": "stocks"
        },
        {
            "Title": "Tembo Global Solar Division Targets ₹75-90 Cr Revenue",
            "Summary": "Tembo Global's solar division projects revenue of ₹75-90 crores in FY27 with ₹110 crores in subsidies. The ₹650 crore project expects full commercialization in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1770348943053,
            "Source": "stocks"
        },
        {
            "Title": "Tembo Global Sets Ambitious Growth Targets for FY27",
            "Summary": "Tembo Global Industries targets 35% to 40% revenue growth for FY27 with 10% to 12% profit margins. Defense segment commercial production expected by Q3 FY27 with revenue potential of ₹125-300 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770348730807,
            "Source": "stocks"
        },
        {
            "Title": "Tembo Global Q3 Net Profit Jumps 55% YoY to ₹253M",
            "Summary": "Tembo Global Industries reported consolidated net profit of ₹253 million in Q3, marking a significant 55.21% increase from ₹163 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770281678672,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tembo Global Industries Starts New Vasai Factory",
            "Summary": "Tembo Global Industries Limited commences production at its new Vasai facility with INR 75.00 crores investment, targeting annual revenues of up to INR 700.00 crores within 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1769676896038,
            "Source": "stocks"
        },
        {
            "Title": "Tembo Global Wins ₹300 Cr KNPC Sea Island Tender",
            "Summary": "Tembo Global Industries emerges as top bidder for Kuwait National Petroleum Company's ₹300 crore sea island facility upgrade project covering mooring hooks, sewage treatment, and fire protection systems.",
            "Sentiment": "positive",
            "PublishDate": 1768541260986,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tembo Global Gets Defence Manufacturing Licence",
            "Summary": "Tembo Classic Engineering, subsidiary of Tembo Global Industries, receives defence manufacturing licence for small arms facility in Maharashtra, supporting Make in India initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767330542129,
            "Source": "stocks"
        },
        {
            "Title": "Tembo Global Secures ₹7,000 Crore Order",
            "Summary": "Tembo Global Industries has announced securing a significant order valued at ₹7,000 crores, marking a major business development for the retail sector company.",
            "Sentiment": "positive",
            "PublishDate": 1765447770657,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tembo Global Industries Board Approves ₹1.3 Billion Investment in Defense Unit",
            "Summary": "Tembo Global Industries' board has approved a ₹1.3 billion investment in its subsidiary Tembo Defense Products. This significant capital allocation demonstrates the company's commitment to expanding its defense sector operations and capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764145093045,
            "Source": "stock"
        },
        {
            "Title": "Tembo Global Secures ₹107 Crore Order",
            "Summary": "Tembo Global has secured a new order worth ₹107 crore. The company currently has a market capitalization of ₹1,250 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763617366117,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Reports Strong Q2 Performance with 49% Revenue Growth",
            "Summary": "Tembo Global delivered robust quarterly results with revenue reaching 2.45 billion rupees, representing a significant increase from 1.64 billion rupees in the same period last year. The company's consolidated net profit rose to 201 million rupees compared to 146 million rupees year-over-year. EBITDA more than doubled to 332 million rupees from 147 million rupees, while EBITDA margin expanded to 13.5% from 8.96% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762855447948,
            "Source": "earnings"
        },
        {
            "Title": "Tembo Global Industries to Establish Regional Headquarters in Riyadh",
            "Summary": "Tembo Global Industries announced plans to establish a regional headquarters in Riyadh to enhance its Middle East operations. This initiative is part of the company's broader global expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1757999724525,
            "Source": "stock"
        },
        {
            "Title": "Tembo Global Industries Secures $12.44 Million Aviation Fuel Storage Contract at Colombo Airport",
            "Summary": "Tembo Global Industries has secured a $12.44 million (109 crore rupees) contract for aviation fuel storage tanks at Colombo Airport. The contract strengthens the company's global EPC (Engineering, Procurement, and Construction) presence in the aviation infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1755597389266,
            "Source": "stock"
        },
        {
            "Title": "Tembo Global Reports Strong Q1 Performance with Revenue Doubling Year-over-Year",
            "Summary": "Tembo Global delivered robust quarterly results with revenue reaching 2.5 billion rupees compared to 1.28 billion rupees in the same period last year. The company's consolidated net profit surged to 190 million rupees from 54.1 million rupees year-over-year. EBITDA increased significantly to 282 million rupees versus 83.5 million rupees, while EBITDA margin expanded to 11.35% from 6.5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755013739383,
            "Source": "earnings"
        },
        {
            "Title": "Tembo Global Board Approves 500 Crore Rupees Fundraising",
            "Summary": "The board of directors of Tembo Global has agreed to raise 500 crore rupees. No further details about the method of fundraising or its purpose were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752570019000,
            "Source": "default"
        },
        {
            "Title": "Tembo Defence Group Receives Land Comfort Letter from MIDC",
            "Summary": "Tembo Defence Group Co has received a comfort letter from Maharashtra Industrial Development Corporation (MIDC) for 100 acres of land in Amravati, Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1748245721000,
            "Source": "default"
        },
        {
            "Title": "Tembo Global Industries Secures Domestic Contracts Worth Rs 51.82 Crores",
            "Summary": "Tembo Global Industries has announced winning two major domestic contracts with a combined value of Rs 51.82 crores. This development represents a significant business achievement for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1745562056000,
            "Source": "default"
        },
        {
            "Title": "Tembo Global Industries Secures Offer Letter for Major Defense Project",
            "Summary": "Tembo Global Industries has announced that its division, Tembo Defence Products, has received an offer letter for a significant project. This development suggests a potential expansion in the company's defense sector operations and could represent a substantial business opportunity.",
            "Sentiment": "positive",
            "PublishDate": 1742516528000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries Receives Offer Letter for Major Defense Project",
            "Summary": "Tembo Global Industries has announced that its defense division, Tembo Defence Products, has received an offer letter for a significant project. While specific details about the project are not provided, it is described as a 'mega project', suggesting it is of substantial scale and importance for the company's defense business.",
            "Sentiment": "positive",
            "PublishDate": 1742469228000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Tembo Global Industries has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 163 million rupees, up from 44 million rupees in the same quarter last year. Revenue also saw a significant rise, reaching 1.64 billion rupees compared to 1.15 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739233245000,
            "Source": "earnings"
        },
        {
            "Title": "Tembo Global Industries Reports Significant Increase in Q3 EBITDA",
            "Summary": "Tembo Global Industries has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 increased to 273 million rupees, compared to 51 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded significantly to 16.58% from 4.45% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739199584000,
            "Source": "earnings"
        },
        {
            "Title": "Tembo Global Industries Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Tembo Global Industries has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 163 million rupees, up from 44 million rupees in the same quarter last year. Revenue also saw a significant rise, reaching 1.64 billion rupees compared to 1.15 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739199577000,
            "Source": "earnings"
        },
        {
            "Title": "Tembo Global Industries: ₹1,000-Crore Defence Manufacturing Deal with Maharashtra",
            "Summary": "Tembo Defence Products, a subsidiary of Tembo Global Industries, signed a ₹1,000-crore investment agreement with Maharashtra to boost defence manufacturing. The deal is expected to create 300 new jobs. Tembo Defence Products has also been invited to present at the World Economic Forum in Davos.",
            "Sentiment": "positive",
            "PublishDate": 1737539430000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Signs MOU with Maharashtra Government for Defence Projects",
            "Summary": "Tembo Global has entered into a Memorandum of Understanding (MOU) with the Government of Maharashtra for defence projects. The agreement is valued at 1,000 crore rupees, signaling a significant investment in the defence sector within the state.",
            "Sentiment": "positive",
            "PublishDate": 1737513618000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tembo Global Subsidiary to Establish Defense Manufacturing Facility in Maharashtra",
            "Summary": "A subsidiary of Tembo Global has signed a Memorandum of Understanding (MoU) with the Maharashtra government at the World Economic Forum in Davos. The agreement aims to establish a defense manufacturing facility in the state, potentially boosting local industry and creating job opportunities in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1736838067000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tembo Global Subsidiary Signs MoU with Maharashtra Government at Davos",
            "Summary": "A subsidiary of Tembo Global has entered into a Memorandum of Understanding (MoU) with the government of Maharashtra. This agreement was signed during the World Economic Forum event in Davos, Switzerland. The MoU likely represents a significant business or investment opportunity for Tembo Global in Maharashtra, though specific details of the agreement are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1736837985000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tembo Global Industries Secures Domestic Water Irrigation Project Order",
            "Summary": "Tembo Global Industries has obtained a domestic order for a water irrigation project valued at 40.73 crore rupees. This order represents a significant business opportunity for the company in the water infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1736403806000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries Secures 40 Crore Rupee Order",
            "Summary": "Tembo Global Industries has won an order worth 40 crore rupees. The company's current market capitalization stands at 872 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736327781000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries Wins Bid for Major Water Treatment Project",
            "Summary": "Tembo Global Industries has been declared the lowest bidder for a significant water treatment plant project in Northern India. The project is estimated to be worth approximately 1500 crore rupees, marking a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1733712418000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Secures 529 Million Rupee Water Irrigation Project Order",
            "Summary": "Tembo Global has been awarded a significant order worth 529 million rupees for a water irrigation project. This development represents a major contract for the company in the infrastructure sector, specifically in water management and agricultural support.",
            "Sentiment": "positive",
            "PublishDate": 1733462051000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries Secures 529 Million Rupee Order",
            "Summary": "Tembo Global Industries has announced receiving a significant order valued at 529 million rupees. This order represents a substantial business opportunity for the company and may have positive implications for its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1733409920000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries: Secures ₹43.89 Crore Water Irrigation Project",
            "Summary": "Tembo Global Industries Limited has won a domestic water irrigation project order worth ₹43.89 crore. The project involves supplying Ductile Iron pipes and is set to be completed within 12 months. The company's shares were trading up 2% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1733305495000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries Secures 43 Crore Rupee Order",
            "Summary": "Tembo Global Industries has won a new order worth 43 crore rupees. The company, which has a market capitalization of 700 crore rupees, has not provided additional details about the nature of the order or the client.",
            "Sentiment": "positive",
            "PublishDate": 1733116435000,
            "Source": "order&deals"
        },
        {
            "Title": "Tembo Global Industries Incorporates Solar Power Subsidiary",
            "Summary": "Tembo Global Industries has incorporated a new subsidiary called Tembo Global Solar Power. The new entity will focus on generating, accumulating, distributing, and supplying solar energy.",
            "Sentiment": "positive",
            "PublishDate": 1731678666000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tembo Global Industries Secures 595 Crore Rupees Solar Power Project",
            "Summary": "<p><span class='positive'>Tembo Global Industries</span> has secured a <span class='positive'>Power Purchase Agreement (PPA)</span> worth <b>595 crore rupees</b> with the <span class='neutral'>Maharashtra government</span> for a <b>124 MW</b> <span class='positive'>solar power project</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1729001069000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tembo Global to Pursue Power Purchase Agreements and Procurement Orders",
            "Summary": "<p><span class='neutral'>Tembo Global</span> has announced plans to <span class='positive'>initiate procurement orders</span> and <span class='positive'>participate in tendering processes</span> for <b>power purchase agreements</b> with various <span class='neutral'>government organizations</span>. This move suggests the company is <span class='positive'>expanding its operations</span> in the <b>energy sector</b> and seeking to <span class='positive'>secure contracts</span> with <span class='neutral'>public entities</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728540025000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tembo Global Industries Expands into Solar MEP Segment",
            "Summary": "<p><span class=\"positive\">Tembo Global Industries</span> has announced its <span class=\"positive\">entry</span> into the <b>Solar MEP</b> (Mechanical, Electrical, and Plumbing) segment, aiming to promote <span class=\"positive\">sustainable energy solutions</span>. This <span class=\"positive\">strategic move</span> indicates the company's <span class=\"positive\">commitment</span> to <span class=\"positive\">expanding</span> its portfolio and addressing the <span class=\"positive\">growing demand</span> for <span class=\"positive\">renewable energy technologies</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728539954000,
            "Source": "corporate_action"
        }
    ]
}