{
    "Symbol": "TENNIND",
    "ISIN": "INE19RI01016",
    "News": [
        {
            "Title": "Tenneco Clean Air Gets Buy Rating with ₹610 Target",
            "Summary": "Brokerage initiates coverage on Tenneco Clean Air India with Buy rating and ₹610 target price, citing strong market position and growth prospects despite EV transition risks.",
            "Sentiment": "positive",
            "PublishDate": 1767931387860,
            "Source": "stocks"
        },
        {
            "Title": "Tenneco Clean Air India Reports Strong Q2FY26 Results with INR 98.4 Billion New Order Bookings",
            "Summary": "Tenneco Clean Air India delivered solid Q2FY26 performance with value-added revenue growing 8.9% year-over-year to INR 11,515 million and EBITDA at INR 2,168 million with 18.8% margins. The company secured strategic wins worth INR 98.4 billion in incremental lifetime bookings including INR 17.6 billion exports, featuring entry into Japanese passenger vehicle OEM and strengthening position in shock absorbers market.",
            "Sentiment": "positive",
            "PublishDate": 1765355855182,
            "Source": "earnings"
        },
        {
            "Title": "Tenneco Clean Air India Reports Strong VAR Growth Outpacing Market",
            "Summary": "Tenneco Clean Air India achieved 8.9% Value Added Revenue growth in Q2 compared to 5% market growth, with H1 VAR growth of 8.2% against 4% market growth. The company's performance significantly exceeded industry benchmarks across both quarterly and half-yearly periods.",
            "Sentiment": "neutral",
            "PublishDate": 1764913596087,
            "Source": "earnings"
        },
        {
            "Title": "Tenneco Clean Air India Schedules Earnings Conference Call for Q2 and H1 FY26 Results",
            "Summary": "Tenneco Clean Air India Limited will host an earnings conference call on December 5, 2025 at 4:00 PM IST to discuss financial results for the quarter and half year ended September 30, 2025. The call will include management representatives including the CEO, CFO, and Company Secretary, with investor presentation and call recordings to be made available on the company website.",
            "Sentiment": "neutral",
            "PublishDate": 1764662856429,
            "Source": "corporate_action"
        }
    ]
}