{
    "Symbol": "TERASOFT",
    "ISIN": "INE482B01010",
    "News": [
        {
            "Title": "Tera Software Q3FY26 Net Profit Surges 198.5% YoY",
            "Summary": "Tera Software Limited reports strong Q3FY26 performance with net profit jumping to ₹674.39 lakhs from ₹225.05 lakhs YoY. Revenue increased 147.6% to ₹5,913.52 lakhs driven by robust growth across segments.",
            "Sentiment": "positive",
            "PublishDate": 1770735509427,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tera Software Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Tera Software Limited has scheduled a board meeting on February 10, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770014039875,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tera Software Receives Rs 12.05 Crore GST Demand Order from Andhra Pradesh Tax Department",
            "Summary": "Tera Software Limited received a GST demand order of Rs 12,04,76,230 from the Assistant Commissioner, Tenali, Commercial Taxes Department of Andhra Pradesh for alleged discrepancies in ITC claims and output tax declarations from July 2017 to August 2019. The company states there is no immediate impact on financial or operational activities and is taking steps to legally challenge the order.",
            "Sentiment": "negative",
            "PublishDate": 1763292959015,
            "Source": "stock"
        },
        {
            "Title": "Tera Software Reports Strong Q2 Growth with Net Profit Rising to 66M Rupees",
            "Summary": "Tera Software announced its quarterly results showing consolidated net profit of 66 million rupees compared to 13 million rupees in the same period last year. The company's revenue reached 714 million rupees versus 253 million rupees year-over-year, representing significant growth across both profitability and revenue metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762871985095,
            "Source": "earnings"
        },
        {
            "Title": "Tera Software Secures ₹58.12 Crore Contract from WBSEDCL for Spot Billing Project",
            "Summary": "Tera Software has been awarded a ₹58.12 crore contract by WBSEDCL for a spot billing project. The project will be implemented over three years across multiple zones in West Bengal.",
            "Sentiment": "positive",
            "PublishDate": 1758877068268,
            "Source": "order&deals"
        },
        {
            "Title": "Tera Software Reports Strong Q1 Performance with Rs 299.38 Lakhs Net Profit, Declares Rs 1 Final Dividend",
            "Summary": "Tera Software Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported net sales of Rs 3,274.04 lakhs and achieved a net profit of Rs 299.38 lakhs on standalone basis, with earnings per share of Rs 2.39. On consolidated basis, net profit stood at Rs 299.13 lakhs. The Board declared a final dividend of Rs 1 per share and scheduled the Annual General Meeting for September 26, 2025. The company operates through three segments: Integrated Solutions Division (Rs 1,632.24 lakhs revenue), Technical Division (Rs 1,641.80 lakhs), and Projects Division (Rs 324.26 lakhs). The paid-up equity share capital remains at Rs 1,251.19 lakhs with face value of Rs 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1755008048816,
            "Source": "earnings"
        },
        {
            "Title": "Tera Software's GST Writ Petitions Disposed by Jharkhand High Court",
            "Summary": "Tera Software Limited's six writ petitions related to GST cases were disposed by the High Court of Jharkhand. The petitions challenged a demand of Rs. 25,90,21,450 for disallowed Input Tax Credit (ITC) claims spanning FY 2017-18 to 2022-23. The court disposed the petitions as not pressed and directed the State Tax Officer to consider the company's reply against notices issued under the Jharkhand Goods and Service Tax Act and make a decision within four weeks. The company states that since the writ petitions have been disposed, the associated demand order no longer holds legal ground, resulting in no liability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754659720200,
            "Source": "stock"
        },
        {
            "Title": "Tera Software Schedules Board Meeting to Approve Quarterly Results and Consider Final Dividend",
            "Summary": "Tera Software Limited has scheduled a Board of Directors meeting on August 12, 2025, to consider and approve the un-audited standalone and consolidated financial results for the quarter ended June 30, 2025, along with a limited review report. The board may also consider declaring a final dividend for FY 2024-25. The trading window for company securities will remain closed for all directors, officers, designated persons, and connected persons until August 14, 2025, which is 48 hours after the announcement of financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1754297597946,
            "Source": "corporate_action"
        },
        {
            "Title": "Tera Software Receives 19.01 Billion Rupee Work Order for BharatNet Project",
            "Summary": "Tera Software has been awarded an Advance Work Order (AWO) worth 19.01 billion rupees for the BharatNet Project's Middle Mile Network - NER-I. The order involves designing, supplying, constructing, installing, upgrading, operating, and maintaining the middle mile network of BharatNet.",
            "Sentiment": "positive",
            "PublishDate": 1746576760000,
            "Source": "default"
        },
        {
            "Title": "Tera Software Secures 19.01 Billion Rupee Contract for BharatNet Project",
            "Summary": "Tera Software has been awarded a significant work order valued at 19.01 billion rupees. The contract involves the design, supply, construction, installation, upgradation, operation, and maintenance of the middle mile network for the BharatNet project. This comprehensive project aims to enhance India's digital infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1746533345000,
            "Source": "default"
        },
        {
            "Title": "Tera Software Consortium Secures 51.04 Billion Rupee Order",
            "Summary": "Tera Software has announced that a consortium it is part of has been awarded a significant order worth 51.04 billion rupees. This substantial contract represents a major business development for the company and its partners.",
            "Sentiment": "positive",
            "PublishDate": 1737591140000,
            "Source": "order&deals"
        },
        {
            "Title": "Tera Software Consortium Secures Major Contract",
            "Summary": "Tera Software has announced that a consortium it is part of has been awarded a significant contract worth 51.04 billion rupees. This substantial order represents a major business development for the company and its partners.",
            "Sentiment": "positive",
            "PublishDate": 1737546300000,
            "Source": "order&deals"
        },
        {
            "Title": "ITI-Led Consortium Secures Major BharatNet Phase 3 Project",
            "Summary": "A consortium led by ITI Ltd, which includes Tera Software, has been awarded an advance work order for the BharatNet Phase 3 project. The total value of this order is approximately 50.49 billion rupees. This project is likely part of India's digital infrastructure development initiative.",
            "Sentiment": "positive",
            "PublishDate": 1736777582000,
            "Source": "order&deals"
        },
        {
            "Title": "Tera Software Wins BharatNet Project Bids Worth Rs. 3022 Crores",
            "Summary": "Tera Software has participated in bids for the BharatNet Project's Middle Mile Network - Phase-3 in partnership with ITI Ltd (PSU). The company emerged as the lowest bidder (L1) for projects in Himachal Pradesh (Package No.8), West Bengal, and Andaman & Nicobar (Package No.9). The total order value for these projects is Rs. 3022 crores.",
            "Sentiment": "positive",
            "PublishDate": 1731071830000,
            "Source": "corporate_action"
        }
    ]
}