{
    "Symbol": "TEXINFRA",
    "ISIN": "INE435C01024",
    "News": [
        {
            "Title": "Texmaco Infrastructure Passes 5 Resolutions",
            "Summary": "Texmaco Infrastructure & Holdings successfully passes all five postal ballot resolutions including appointment of new Managing Director Anish Choudhury and re-appointment of Independent Director Ravi Todi.",
            "Sentiment": "positive",
            "PublishDate": 1768977185392,
            "Source": "stocks"
        },
        {
            "Title": "Jyotsna Poddar acquires 1 lakh shares in Texmaco",
            "Summary": "Jyotsna Poddar acquired 1,00,000 equity shares of Texmaco Infrastructure Holdings Limited as a gift from immediate relative Akshay Poddar, increasing her total holding to 0.57% of paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1766406841145,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Board Approves Director Re-appointment & AOA Changes",
            "Summary": "Texmaco Infrastructure Holdings board approves re-appointment of Ravi Todi as Independent Director for 5-year term from May 2026 and alteration of Articles of Association, both subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1765883413560,
            "Source": "stocks"
        },
        {
            "Title": "Texmaco Infrastructure Holdings Reports Quarterly Results and Announces Key Management Changes",
            "Summary": "Texmaco Infrastructure Holdings Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 227.25 lakhs for the quarter, compared to Rs 1,017.02 lakhs in the previous quarter. Net profit after tax stood at Rs 308.08 lakhs for the quarter versus Rs 60.73 lakhs in the prior quarter. The company made several key appointments: Anish Choudhury as Managing Director for three years effective November 11, 2025, and Rajat Arora as Company Secretary and Compliance Officer from November 10, 2025. Arvind Kumar Chaubey was re-designated from Manager to Business Head. Additionally, Prakash Chandra Kejriwal resigned as Non-Executive Director due to other commitments. The results were reviewed by statutory auditors L.B. Jha & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1762766785103,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Infrastructure Holdings Director Prakash Chandra Kejriwal Resigns Due to Other Commitments",
            "Summary": "Prakash Chandra Kejriwal (DIN: 00964460), Non-Executive Director of Texmaco Infrastructure Holdings Ltd., has resigned from his position effective close of business on November 10, 2025. Kejriwal cited other commitments as the reason for his resignation and confirmed there are no other material reasons for his departure. The company has informed the National Stock Exchange of India and BSE Limited about the resignation. Chief Financial Officer Ganesh Gupta signed the notification to the exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1762184551258,
            "Source": "corporate_governance"
        },
        {
            "Title": "Texmaco Infrastructure Reports 836% Jump in Net Profit to Rs 34.01 Crore",
            "Summary": "Texmaco Infrastructure & Holdings Limited reported net profit of Rs 34.01 crore for the quarter ended June 30, 2025, representing an 836% increase from Rs 3.64 crore in the same quarter last year. Revenue from operations grew 7% to Rs 40.49 crore. The significant profit growth was driven by other income surging 252% to Rs 60.77 crore. Among business segments, Mini Hydro showed strong performance with 61% revenue growth to Rs 7.92 crore, while Real Estate segment revenue increased 10% to Rs 17.91 crore. Job Work Services segment declined 11% to Rs 16.39 crore. The company's total assets expanded 22.5% to Rs 1,949.87 crore and net worth increased 22.9% to Rs 1,629.56 crore. Earnings per share improved to Rs 0.26 from Rs 0.03 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754913778992,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Infrastructure Company Secretary Neha Singh Resigns",
            "Summary": "Neha Singh has resigned from her position as Company Secretary and Compliance Officer of Texmaco Infrastructure & Holdings Limited. Her resignation becomes effective August 11, 2025, as she pursues new opportunities outside the organization. Singh also held other statutory and designated positions within the company, from which she is stepping down simultaneously.",
            "Sentiment": "neutral",
            "PublishDate": 1754558829055,
            "Source": "corporate_governance"
        },
        {
            "Title": "Texmaco Infrastructure & Holdings Approves Appointment of Arvind Kumar Chaubey as Manager Through Postal Ballot",
            "Summary": "Texmaco Infrastructure & Holdings Ltd completed a postal ballot process with members approving the appointment of Arvind Kumar Chaubey as Manager of the company. The remote e-voting was conducted from July 1 to July 30, 2025, with voting rights determined based on shareholding as of June 20, 2025. Out of the total votes cast, 197 members holding 84,495,237 shares (99.99%) voted in favor of the resolution, while 38 members with 6,535 shares (0.01%) voted against it. The resolution was deemed passed with requisite majority, equivalent to a decision made at a general meeting. The e-voting services were provided by KFin Technologies Limited, and the process was scrutinized by Geeta Roy Chowdhury.",
            "Sentiment": "positive",
            "PublishDate": 1753966260514,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Infrastructure & Holdings: Adventz Finance Increases Stake to 16.53%",
            "Summary": "Adventz Finance Private Ltd has increased its stake in Texmaco Infrastructure & Holdings to 16.53% by acquiring 70,000 additional shares through open market purchases on March 12, 2025. The stock experienced volatility, initially rising to ₹101.40 before declining to ₹97.00 on the BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1742203052000,
            "Source": "block_deals"
        },
        {
            "Title": "Texmaco Infra Partners with Hines, Conscient, and HDFC Capital for Delhi NCR Development",
            "Summary": "Texmaco Infrastructure & Holdings Limited has announced a strategic partnership with Hines, Conscient, and HDFC Capital for a significant residential-led mixed-use development project in Delhi NCR. The project will span nearly 10 acres in a prime location in Delhi, marking a major real estate venture for the involved parties.",
            "Sentiment": "positive",
            "PublishDate": 1738291918000,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Infrastructure & Holdings Reports Q2 Financial Results",
            "Summary": "Texmaco Infrastructure & Holdings announced its Q2 consolidated financial results. The company reported a net profit of 26 million rupees, up from 21 million rupees in the same quarter last year. However, revenue decreased to 48 million rupees from 52 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729845957000,
            "Source": "result"
        }
    ]
}