{
    "Symbol": "TEXMOPIPES",
    "ISIN": "INE141K01013",
    "News": [
        {
            "Title": "Texmo Pipes Board Meet Set for Feb 10 for Q3FY26 Results",
            "Summary": "Texmo Pipes and Products Limited has scheduled its board meeting for February 10, 2026, to consider Q3FY26 financial results. Trading window remains closed until February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770127799628,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmo Pipes Reports Quarterly Results for Second Quarter and Half Year Ended September 30, 2025",
            "Summary": "Texmo Pipes and Products Limited's Board approved unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The company submitted these results along with statements of assets, liabilities, cash flows, and limited review reports to stock exchanges in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763064322716,
            "Source": "earnings"
        },
        {
            "Title": "Texmo Pipes Approves Q1 FY26 Results, Schedules 17th AGM for September 26",
            "Summary": "Texmo Pipes and Products Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company scheduled its 17th Annual General Meeting for September 26, 2025, at 12:30 PM via video conferencing. The board also approved the re-appointment of Mr. Vijay Prasad Pappu as Whole-Time Director, who is liable to retire by rotation. Mr. Pappu, aged 65, has been with the company since incorporation and serves as Chief Financial Officer with over 39 years of factory operations experience.",
            "Sentiment": "neutral",
            "PublishDate": 1755012190943,
            "Source": "earnings"
        },
        {
            "Title": "SEBI Directs Texmo Pipes and Products to Address Financial Irregularities",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued directives to Texmo Pipes and Products regarding two financial matters. First, the company is instructed to recall a book entry loan from the accounts of Tapti Pipes & Products. Second, Texmo Pipes and Products is ordered to credit the outstanding amount of Global Depository Receipt (GDR) proceeds within a three-month timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1740061356000,
            "Source": "corporate_governance"
        }
    ]
}