{
    "Symbol": "TEXRAIL",
    "ISIN": "INE621L01012",
    "News": [
        {
            "Title": "Texmaco Rail Reports Q3FY26 Results with Strong Growth",
            "Summary": "Texmaco Rail & Engineering posted standalone net profit of ₹3,865.21 lakhs for Q3FY26, with revenue from operations at ₹1,04,075.58 lakhs. Board approved fund reallocation proposal.",
            "Sentiment": "positive",
            "PublishDate": 1770655593915,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Auditors Convert to LLP Structure",
            "Summary": "Texmaco Rail & Engineering's statutory auditors M/s. L. B. Jha & Co. have converted from partnership firm to Limited Liability Partnership effective January 21, 2026, with no change in audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1769087133924,
            "Source": "stocks"
        },
        {
            "Title": "Texmaco Rail Gets ESG Rating of 58 from CFC Finlease",
            "Summary": "Texmaco Rail & Engineering Limited receives an ESG rating of 58 with 'Average' risk category from CFC Finlease Private Limited, reflecting the company's environmental, social and governance performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768565182078,
            "Source": "stocks"
        },
        {
            "Title": "Texmaco Rail secures ₹126 cr orders from two clients",
            "Summary": "Texmaco Rail & Engineering Ltd announced two domestic orders worth ₹126.27 crore for freight wagon supply, with deliveries scheduled by August and September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767963958630,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Bags ₹130 Cr Orders, Order Book at ₹6,369 Cr",
            "Summary": "Texmaco Rail & Engineering secured three railway orders worth ₹130 crores, including contracts from IVC Logistics and APL Logistics. The company's total order book stands at ₹6,369 crores as of September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767963882500,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Wins ₹2.96 Cr Order from East Coast Railways",
            "Summary": "Texmaco Rail & Engineering Limited secures order worth ₹2.96 crores from East Coast Railways for bird prevention system setup in KUR Division, to be completed within 365 days.",
            "Sentiment": "positive",
            "PublishDate": 1767951039510,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Wins ₹2.96 Cr Bird Prevention Order",
            "Summary": "Texmaco Rail & Engineering secures ₹2.96 crore contract from East Coast Railways for bird prevention system installation with 365-day completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767950490646,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Stock Shows Recovery Signs After 30% Fall",
            "Summary": "Texmaco Rail & Engineering bounces back from 12-month decline, breaking above falling trendline resistance. Stock hit record high of ₹205.00 on January 17, 2025, with experts suggesting potential upside targets.",
            "Sentiment": "positive",
            "PublishDate": 1767931248116,
            "Source": "stocks"
        },
        {
            "Title": "Texmaco Rail Completes Hydro Systems for 2000 MW Project",
            "Summary": "Texmaco Rail & Engineering announces completion of hydro-mechanical systems for 2000 MW Subansiri Lower Hydroelectric Project. NHPC has commissioned first unit with three more operational.",
            "Sentiment": "positive",
            "PublishDate": 1767850437885,
            "Source": "stocks"
        },
        {
            "Title": "Texmaco Rail Subsidiary to Cease Operations Post Equity",
            "Summary": "Texmaco Rail Engineering's wholly-owned subsidiary Panihati Engineering Udyog will cease to be a subsidiary following ₹3.15 lakh equity investment by new investors in 31,500 shares of ₹10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1766221980846,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Wins ₹6.70 Cr Western Railway Order",
            "Summary": "Texmaco Rail & Engineering secured a ₹6.70 crore rail electrification contract from Western Railway for provision of a long feeder in Bhavnagar division, to be completed within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1765973674374,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail JV Wins ₹132 Cr Wagon Order",
            "Summary": "Texmaco Rail & Engineering's joint venture secures significant ₹132 crore contract for BLSS and BVCM wagons with completion deadline set for July 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765783965156,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jyotsna Poddar Files SAST Disclosure for Texmaco Rail",
            "Summary": "Jyotsna Poddar filed regulatory disclosure under SAST Regulation 10(6) confirming acquisition of 2,50,000 Texmaco Rail shares via gift from Akshay Poddar, increasing her stake to 0.09%.",
            "Sentiment": "neutral",
            "PublishDate": 1765535947435,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Wins ₹15.80 Cr Order from JSW Energy",
            "Summary": "Texmaco Rail & Engineering secures ₹15.80 crore contract from JSW Energy (Utkal) Limited for supply of BOBR wagons and brake vans, with completion timeline of 4-5 months.",
            "Sentiment": "positive",
            "PublishDate": 1765529626666,
            "Source": "co_actions_results"
        },
        {
            "Title": "Texmaco Rail Engineering Secures Rs. 3.36 Crore Order from Central Railway",
            "Summary": "Texmaco Rail Engineering Limited has been awarded a Rs. 3.36 crore contract by Central Railway for replacement of copper G jumper in Mumbai Division. The project is scheduled for completion within 12 months from the date of issuance of the letter of acceptance.",
            "Sentiment": "positive",
            "PublishDate": 1764330462334,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail Engineering Wins Rs. 6.39 Crore Central Railway Contract",
            "Summary": "Texmaco Rail Engineering Limited secured a Rs. 6.39 crore order from Central Railway for modification to existing OHE in connection with extension of Island Platform at Kalyan Station of Mumbai Division. The domestic contract is to be completed within 6 months from the date of issuance of letter of acceptance, with no promoter group interest in the awarding entity.",
            "Sentiment": "positive",
            "PublishDate": 1763623331291,
            "Source": "stock"
        },
        {
            "Title": "Texmaco Rail Reports Q2FY26 Results with 28.6% Growth in Freight Car Deliveries",
            "Summary": "Texmaco Rail Engineering reported quarterly revenue of INR 1,258 crores with EBITDA of INR 132 crores (10.5% margin) and delivered 2,334 freight cars, showing 28.6% increase from previous quarter. The company maintains an order book of INR 6,367 crores and completed strategic partnerships with RVNL for rail infrastructure projects and HORMANN Vehicle Engineering for passenger mobility solutions.",
            "Sentiment": "positive",
            "PublishDate": 1763204767234,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail Engineering Secures Rs. 12.77 Crore Order from Delhi Metro",
            "Summary": "Texmaco Rail Engineering Limited received a Rs. 12.77 crore contract from Delhi Metro Rail Corporation for installation, testing and commissioning of ballastless track including supply of buffer stop. The domestic order is scheduled for completion within 12 months from December 1, 2025, with no promoter group interest in the awarding entity.",
            "Sentiment": "positive",
            "PublishDate": 1763173512118,
            "Source": "stock"
        },
        {
            "Title": "Texmaco Rail Expects 30-40% Infrastructure Contract Completion This Financial Year",
            "Summary": "Texmaco Rail expects to complete 30-40% of its infrastructure contracts this financial year. The company is expanding into new product areas including locomotive couplers, passenger train couplers, and weldable crossings for track renewal. Texmaco Rail aims for steady or higher wagon production in Q2 FY26 and seeks to increase EBITDA margins into the mid to high teens.",
            "Sentiment": "positive",
            "PublishDate": 1763004062216,
            "Source": "stock"
        },
        {
            "Title": "Texmaco Rail Engineering Reports Quarterly Results with Board Approvals and Monitoring Updates",
            "Summary": "Texmaco Rail Engineering Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company also received monitoring agency reports from CARE Ratings Limited for the preferential issue. During the quarter, the Scheme of Amalgamation of Texmaco West Rail Limited became effective following NCLT Order filing. The company received NOCs from BSE and NSE for a Scheme of Arrangement with subsidiary Belgharia Engineering Udyog Private Limited for transfer of Infra-Rail Green Energy division. As of September 30, 2025, the company has 8 subsidiaries and 2 joint ventures. The monitoring report indicates no amount was utilized during the quarter ended September 30, 2025 from the Rs. 150 crore preferential issue proceeds, with Rs. 33.16 crore remaining invested in mutual funds. Warrants worth Rs. 5.42 crore lapsed in October 2025 as they were not exercised by one investor.",
            "Sentiment": "neutral",
            "PublishDate": 1762861884907,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail & Engineering Reports Q2 Revenue Growth to 12.58 Billion Rupees",
            "Summary": "Texmaco Rail & Engineering Ltd reported quarterly revenue of 12.58 billion rupees compared to 11.2 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1762853529026,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail & Engineering Reports 27.7% Jump in Q2 Net Profit to 618 Million Rupees",
            "Summary": "Texmaco Rail & Engineering Ltd reported Q2 net profit of 618 million rupees compared to 484 million rupees in the same period last year. The company's EBITDA increased to 1.25 billion rupees from 926 million rupees year-over-year. EBITDA margin improved to 9.94% from 8.3% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762853078071,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail Engineering to Join Conference Call on Q2 FY26 Results",
            "Summary": "Texmaco Rail Engineering Limited will participate in a conference call organized by ICICI Securities Limited on November 12, 2025 at 11:00 a.m. IST to discuss its performance for the quarter and half year ended September 30, 2025. The company will be represented by Executive Director Vice Chairman Indrajit Mookerjee, Managing Director Sudipta Mukherjee, and Chief Financial Officer Kishor Kumar Rajgaria. The company stated it will not make any presentation and no unpublished price sensitive information will be shared during the conference.",
            "Sentiment": "neutral",
            "PublishDate": 1762508455644,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail & Engineering Secures Orders Worth 785.1 Million Rupees",
            "Summary": "Texmaco Rail & Engineering has received two significant orders totaling 785.1 million rupees. The company secured a 446.1 million rupees order from Maha-Metro and a 339 million rupees order from Central Railway. These orders represent new business wins for the rail engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1761741404255,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail Secures ₹86.85 Crore Order from UltraTech Cement",
            "Summary": "Texmaco Rail & Engineering Limited secured an order worth ₹86.85 crore from UltraTech Cement Limited for the supply of BCFC wagons along with a brake van, with delivery scheduled by March 2026. The company also received another order worth ₹129.09 crore from Rail Vikas Nigam Limited for traction overhead equipment work at the Yavatmal-Digras section, to be completed within 18 months. However, the company's quarterly results showed a decline with net profit falling 49.8% to ₹30 crore, revenue dropping 16.3% to ₹910.6 crore, and EBITDA decreasing 33.5% to ₹71.2 crore. Operating margins narrowed to 7.8% from 9.8% in the previous year. Company shares closed at ₹147.70, down 1.11%.",
            "Sentiment": "neutral",
            "PublishDate": 1758199673897,
            "Source": "order&deals"
        },
        {
            "Title": "Texrail Secures Rs. 86.85 Crore Order from Ultratech Cement for Railway Wagons",
            "Summary": "Texmaco Rail & Engineering Limited has been awarded a Rs. 86.85 crore order by Ultratech Cement Limited for BCFC Wagons and Brake Vans. The domestic order is scheduled for delivery by March 2026. The contract does not involve any related party transactions, and the promoter group has no interest in the entity awarding the order.",
            "Sentiment": "positive",
            "PublishDate": 1758196029555,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail Secures ₹129 Crore Order from Rail Vikas Nigam Despite Quarterly Earnings Decline",
            "Summary": "Texmaco Rail & Engineering Limited received a ₹129.09 crore order from Rail Vikas Nigam Limited for overhead equipment work at the Yavatmal-Digras section of Nagpur Division in Central Railways. The project involves design, supply, erection, testing, and commissioning of 2*25 KV Traction Overhead Equipment, to be completed within 18 months. The company reported quarterly results showing net profit declined 49.8% to ₹30 crore from ₹59.8 crore year-on-year, while revenue dropped 16.3% to ₹910.6 crore from ₹1,088.2 crore. EBITDA fell 33.5% to ₹71.2 crore and operating margins narrowed to 7.8% from 9.8%. The Board approved reappointment of Indrajit Mookerjee as Executive Director & Vice Chairman and Sudipta Mukherjee as Managing Director, subject to shareholder approval. Shares closed at ₹147.25, up 3.70%.",
            "Sentiment": "neutral",
            "PublishDate": 1757673601957,
            "Source": "stock"
        },
        {
            "Title": "Texmaco Rail & Engineering Secures ₹129.09 Crore Order from Rail Vikas Nigam Limited",
            "Summary": "Texmaco Rail & Engineering received approval for a ₹129.09 crore order from Rail Vikas Nigam Limited. The project involves designing and installing traction equipment at the Yavatmal-Digras section. The company expects to complete the project within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1757667098372,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco West Rail Limited Amalgamates with Texmaco Rail & Engineering Limited",
            "Summary": "Texmaco West Rail Limited has been amalgamated with Texmaco Rail & Engineering Limited, effective September 11, 2025. The National Company Law Tribunal, Kolkata Bench sanctioned the Scheme of Amalgamation on August 4, 2025, under Sections 230 to 232 of the Companies Act, 2013. Both companies filed the certified copy of the tribunal order with the Registrar of Companies on September 9 and 11, 2025 respectively, making the scheme effective. Texmaco West Rail Limited serves as the transferor company in this amalgamation.",
            "Sentiment": "neutral",
            "PublishDate": 1757598176108,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Rail Receives Certified Copy of Amalgamation Order from NCLT Kolkata",
            "Summary": "Texmaco Rail & Engineering Limited has received the certified copy of the order from the National Company Law Tribunal, Kolkata Bench, sanctioning the Scheme of Amalgamation with Texmaco West Rail Limited. The tribunal had sanctioned the amalgamation scheme on August 4, 2025, under Sections 230 to 232 of the Companies Act, 2013. The certified order is now available on the company's website. Texmaco Rail will notify stock exchanges when the scheme becomes effective.",
            "Sentiment": "positive",
            "PublishDate": 1757410982132,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Rail Reports 48% Revenue Growth in Q3 FY25 with Order Book at ₹7,612 Cr",
            "Summary": "Texmaco Rail & Engineering Limited reported quarterly revenue from operations of ₹1,326 crore, marking a 47.9% year-on-year growth. EBITDA reached ₹139 crore with a margin of 10.5%, representing a 51.7% increase compared to the same quarter last year. Profit after tax grew to ₹76 crore with a 5.8% margin. The company delivered 2,714 freight cars during the quarter, a 54.6% increase from 1,756 cars in the previous year. For the nine-month period, revenue grew 59.4% to ₹3,760 crore with EBITDA of ₹411 crore. The company maintains an order book of ₹7,612 crore as of December 31, 2024. Texmaco has approved the merger of Texmaco West Rail Limited, expected to complete within six months, and plans to transfer its Infra-Rail and Green Energy business to a subsidiary within 12-15 months. CARE ratings upgraded the company's long-term bank facilities to CARE A (RWD) and short-term facilities to CARE A1 (RWD).",
            "Sentiment": "positive",
            "PublishDate": 1757079873409,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail & Engineering Reports Revenue of ₹4,234 Crore in FY 2024-25, Publishes Sustainability Report",
            "Summary": "Texmaco Rail & Engineering Limited has submitted its Business Responsibility and Sustainability Report for FY 2024-25. The railway equipment manufacturer reported total revenue of ₹4,233.97 crore and net worth of ₹2,655.57 crore. The company operates through two main segments: Freight Car Division contributing 80.98% of turnover, and EPC & Infrastructure Division contributing 19.02%. The company operates 5 manufacturing plants in India, serves 23 states domestically and 17 international countries, with exports accounting for 7.48% of total turnover. The company employs 1,216 people and 6,282 workers across permanent and temporary positions. Working capital management improved with accounts payable days reducing from 84 days to 59 days. The company's CSR initiatives have benefited over 200,000 people, focusing on sanitation, health, education and sports. Safety performance improved with Lost Time Injury Frequency Rate decreasing from 3.2 to 1.99.",
            "Sentiment": "positive",
            "PublishDate": 1756388501867,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Rail & Engineering Forms Joint Venture with Rail Vikas Nigam for Railway Equipment Manufacturing",
            "Summary": "Texmaco Rail & Engineering Limited's Board of Directors approved a joint venture agreement with Rail Vikas Nigam Limited to establish a new company focused on railway sector operations. The joint venture will see Texmaco holding 49% and RVNL holding 51% of the share capital. The new entity will engage in manufacturing and maintenance of freight and passenger rolling stock, locomotives, coaches, wagons, trainsets, and metro coaches. It will also participate in domestic and international tenders and execute EPC projects in rail infrastructure. Texmaco's investment amounts to INR 4.9 crores through cash consideration. The transaction is expected to close by December 31, 2025, subject to necessary regulatory approvals. The joint venture aims to leverage complementary strengths of both companies to pursue business opportunities in the railway sector, aligning with Texmaco's core operations while expanding its market capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1756290782109,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail Secures ₹103 Crore Order for Wagons and Brake Vans",
            "Summary": "Texmaco Rail & Engineering Ltd won a ₹103.16 crore order from Leap Grain Rail Logistics to deliver BCBFG wagons and BVCM brake vans, with execution required within 10 months. The company previously secured a $62.24 million international order from CAMALCO SA, Cameroon in June, including 560 open-top wagons and a 20-year maintenance contract. However, the company's quarterly results showed significant declines with net profit falling 49.8% to ₹30 crore, revenue dropping 16.3% to ₹910.6 crore, and EBITDA declining 33.5% to ₹71.2 crore. Operating margins compressed to 7.8% from 9.8% in the previous year. Texmaco shares closed at ₹141.60, up 2.14% following the order announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1755784844510,
            "Source": "stock"
        },
        {
            "Title": "Texmaco Rail Reports Q1 FY26 Revenue of ₹911 Crores, Order Book Stands at ₹7,053 Crores",
            "Summary": "Texmaco Rail & Engineering Limited reported Q1 FY26 revenue of ₹911 crores with EBITDA of ₹79 crores (8.7% margin) and profit after tax of ₹29 crores (3.2% margin). The company delivered 1,815 freight cars during the quarter and maintains an order book of ₹7,053 crores as of June 30, 2025. Revenue decline was attributed to shortage of wagon wheel sets from Indian Railways and temporary inspection holdups at Texmaco West subsidiary. The company secured a 20-year maintenance contract in Africa and signed an MoU with Rail Vikas Nigam Limited (RVNL). CARE rating agency upgraded the company's long-term bank facilities rating to CARE A with stable outlook. Management expects revenue normalization in future quarters as wheel set supply issues have been resolved and maintains its growth guidance for the year.",
            "Sentiment": "neutral",
            "PublishDate": 1755597072502,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail & Engineering Positioned for Growth with Record Order Book and Defense Diversification",
            "Summary": "Texmaco Rail & Engineering is set to benefit from the railways capital expenditure boom, supported by a record order book. The company is diversifying its operations into defense and metro projects while enhancing its manufacturing capabilities, which is expected to drive multi-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1755102862429,
            "Source": "stock"
        },
        {
            "Title": "Texmaco Rail & Engineering Reports Decline in Q1 Financial Performance",
            "Summary": "Texmaco Rail & Engineering Ltd reported quarterly results showing decreased financial performance across key metrics. Revenue fell to 9.1 billion rupees from 10.9 billion rupees year-over-year. EBITDA declined to 709 million rupees compared to 1.07 billion rupees in the same period last year, with EBITDA margin dropping to 7.79% from 9.82%. Consolidated net profit decreased to 300 million rupees from 598 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755093184168,
            "Source": "earnings"
        },
        {
            "Title": "Texmaco Rail & Engineering Receives NCLT Approval for Amalgamation with Texmaco West Rail",
            "Summary": "The National Company Law Tribunal, Kolkata Bench has sanctioned the Scheme of Amalgamation between Texmaco West Rail Limited and Texmaco Rail & Engineering Limited. The order dated August 4, 2025 has been uploaded on the Tribunal's website. The scheme will become effective once both companies complete the requisite filings with the Registrar of Companies. Texmaco West Rail Limited will act as the transferor company in this amalgamation process under Sections 230 to 232 of the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1754659891857,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Rail Secures ₹73 Crore Order",
            "Summary": "Texmaco Rail has secured a new order valued at ₹73 crore. The company announcement indicates successful business development in their rail sector operations.",
            "Sentiment": "positive",
            "PublishDate": 1754382477071,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail & Engineering Limited Receives NCLT Approval for Amalgamation with Texmaco West Rail Limited",
            "Summary": "The National Company Law Tribunal, Kolkata Bench has sanctioned the Scheme of Amalgamation of Texmaco West Rail Limited with Texmaco Rail & Engineering Limited and their respective shareholders under Sections 230 to 232 of the Companies Act, 2013. The tribunal's order was dated August 4, 2025. Texmaco West Rail Limited will serve as the transferor company in this amalgamation. The company stated that upon receipt of the certified copy of the order, further steps will be undertaken to implement the scheme.",
            "Sentiment": "positive",
            "PublishDate": 1754311762951,
            "Source": "corporate_action"
        },
        {
            "Title": "Texmaco Rail & Engineering Secures ₹47.77 Crore Contract",
            "Summary": "Texmaco Rail & Engineering has secured a contract worth ₹47.77 crores. The company operates in the rail and engineering sector.",
            "Sentiment": "positive",
            "PublishDate": 1753011910131,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail & Engineering Secures 362.8 Million Rupee Order",
            "Summary": "Texmaco Rail & Engineering has received an order valued at 362.8 million rupees. The news briefly mentions the company securing this order but provides no additional details about the nature of the order, the client, or the timeline for execution.",
            "Sentiment": "positive",
            "PublishDate": 1751633500000,
            "Source": "default"
        },
        {
            "Title": "South Western Railway Awards 277.6 Million Rupee Order to Texmaco Rail & Engineering",
            "Summary": "Texmaco Rail & Engineering has been awarded an order worth 277.6 million rupees by South Western Railway. The order details and specific nature of the work were not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751328369000,
            "Source": "default"
        },
        {
            "Title": "South Western Railway Awards 277.6 Million Rupee Order to Texmaco Rail & Engineering",
            "Summary": "Texmaco Rail & Engineering has received an order worth 277.6 million rupees from South Western Railway. The news indicates a significant business deal for the company in the railway sector.",
            "Sentiment": "positive",
            "PublishDate": 1751287534000,
            "Source": "default"
        },
        {
            "Title": "Texmaco Rail: Secures Major International Order, Eyes Export Growth",
            "Summary": "Texmaco Rail and Engineering has won a Rs 535 crore order from Cameroon's Camalco SA for 1,600 wagons. The company aims to increase exports from 7-8% to 30% of total turnover in 2-3 years. Texmaco targets 20% topline growth by FY26 and plans to develop its coal segment into a Rs 1,500-2,000 crore profit center.",
            "Sentiment": "positive",
            "PublishDate": 1751279164000,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail Engineering: Secures Rs 535 Crore Order from South Africa",
            "Summary": "Texmaco Rail Engineering has won a Rs 535 crore order from Camalco South Africa, including Rs 282 crore for manufacturing 560 open top wagons and a Rs 253 crore maintenance contract for 20 years. The order will be completed in two phases within 24 months, with potential for an additional 1,040 wagons in subsequent phases.",
            "Sentiment": "positive",
            "PublishDate": 1750911677000,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail and Engineering: Secures ₹535 Crore International Order from Cameroon",
            "Summary": "Texmaco Rail and Engineering Ltd has won a $62.24 million (₹535 crore) order from CAMALCO SA., Cameroon. The order includes manufacturing 560 open-top wagons and a 20-year maintenance contract. Potential for additional 1,040 wagons over 5 years. Q4 revenue up 17.5% YoY to ₹1,346.4 crore, net profit down 12% to ₹40 crore. Final dividend of ₹0.75 per share recommended.",
            "Sentiment": "positive",
            "PublishDate": 1750863476000,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail & Engineering Secures $62.24 Million Order",
            "Summary": "Texmaco Rail & Engineering has received an order valued at $62.24 million. The news briefly mentions that the order is related to the company's rail business, but no further details about the nature of the order or the client are provided.",
            "Sentiment": "positive",
            "PublishDate": 1750861452000,
            "Source": "default"
        },
        {
            "Title": "Texmaco Rail & Engineering: Secures Rs 44 Crore Railway Infrastructure Contract",
            "Summary": "Texmaco Rail & Engineering has won a Rs 44.04 crore order from Mumbai Railway Vikas Corporation for a traction infrastructure project on the Central Railway. The project involves setting up a traction substation, sectioning posts, and related infrastructure, to be completed within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1749614106000,
            "Source": "order&deals"
        },
        {
            "Title": "Texmaco Rail & Engineering: Secures ₹44 Crore Railway Infrastructure Order",
            "Summary": "Texmaco Rail & Engineering Limited has been awarded a ₹44.04 crore order by Mumbai Railway Vikas Corporation Limited for railway infrastructure work. The project involves supply, construction, installation, testing, and commissioning of traction transformers and related equipment for Central Railway lines. The project has an 18-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1749564422000,
            "Source": "order&deals"
        }
    ]
}