{
    "Symbol": "TFCILTD",
    "ISIN": "INE305A01023",
    "News": [
        {
            "Title": "TFCI Q3 FY26 Profit Surges 40.6% to ₹3,181.51 Lakh",
            "Summary": "Tourism Finance Corporation of India reported strong Q3 FY26 results with net profit jumping 40.6% YoY to ₹3,181.51 lakh. Revenue from operations grew 21.7% to ₹6,963.61 lakh with improved asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1769778995577,
            "Source": "co_actions_results"
        },
        {
            "Title": "TFCI Board Meet Set for Jan 30 to Review Q3FY26 Results",
            "Summary": "Tourism Finance Corporation of India has scheduled its board meeting for January 30, 2026, to consider and approve financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769078259833,
            "Source": "co_actions_results"
        },
        {
            "Title": "TFCI Invests in Two Alternative Investment Funds",
            "Summary": "Tourism Finance Corporation of India announces strategic investments as co-sponsor and anchor investor in Holystone Hospitality Fund (5% stake) and Certus Real Estate Fund (10% stake), both Category II AIFs.",
            "Sentiment": "positive",
            "PublishDate": 1767814581876,
            "Source": "stocks"
        },
        {
            "Title": "TFCI Invests in Two Alternative Investment Funds",
            "Summary": "Tourism Finance Corporation of India announces strategic investments as co-sponsor and anchor investor in Holystone Hospitality Fund (5%) and Certus Real Estate Fund (10%), with SEBI applications filed.",
            "Sentiment": "positive",
            "PublishDate": 1767725352693,
            "Source": "stocks"
        },
        {
            "Title": "Tourism Finance: Ekta Halwasiya buys 92L shares",
            "Summary": "Ekta Halwasiya acquired 92 lakh shares of Tourism Finance Corporation at ₹56.01 per share on Monday, marking her second consecutive day of purchases. Stock hit 20% upper circuit.",
            "Sentiment": "positive",
            "PublishDate": 1767661172301,
            "Source": "co_actions_results"
        },
        {
            "Title": "TFCI Hits Upper Circuit After Strategic AIF Investments",
            "Summary": "Tourism Finance Corporation shares surge 20% to ₹66.28 after announcing investments in Holystone Hospitality Fund (5%) and Certus Real Estate Fund (10%). Trading volume reached 102.29 lakh shares worth ₹617.92 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767530575072,
            "Source": "stocks"
        },
        {
            "Title": "Cupid shares plunge 20% after 13-day rally ends",
            "Summary": "Cupid shares crashed 20% to Rs 419.95 amid profit booking after a 13-session rally that delivered 34% gains, with technical indicators showing overbought conditions.",
            "Sentiment": "negative",
            "PublishDate": 1767344697789,
            "Source": "stocks"
        },
        {
            "Title": "Tourism Finance Corp Reports 14% Growth in Quarterly Net Profit to 291M Rupees",
            "Summary": "Tourism Finance Corp announced net profit of 291 million rupees for its quarterly results, representing an increase from 256 million rupees in the same period of the previous year. This marks a year-over-year growth of approximately 14% in net profit for the company.",
            "Sentiment": "positive",
            "PublishDate": 1762764519471,
            "Source": "earnings"
        },
        {
            "Title": "Tourism Finance Corp Receives Initial Approval for Cosmea Investment Acquisition",
            "Summary": "Tourism Finance Corp has received initial approval to proceed with the acquisition of Cosmea Investment Pvt. Ltd. and its subsidiaries. The approval represents a preliminary step in the acquisition process for the tourism finance company.",
            "Sentiment": "positive",
            "PublishDate": 1759754744647,
            "Source": "order&deals"
        }
    ]
}