{
    "Symbol": "TFL",
    "ISIN": "INE804H01012",
    "News": [
        {
            "Title": "Transwarranty Finance Allots 6L Shares Under ESOP",
            "Summary": "Transwarranty Finance Limited allotted 6,00,289 equity shares to employees under its Employee Stock Option Plan 2019, increasing paid-up capital to ₹55.12 crores across 5,51,16,194 shares.",
            "Sentiment": "positive",
            "PublishDate": 1767103138047,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transwarranty Finance secures ₹15 cr loan from IDFC",
            "Summary": "Transwarranty Finance Limited availed ₹15 crore loan from IDFC First Bank Limited with promoter Kumar Nair pledging 1.40 crore equity shares as security under SEBI compliance disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1766502648052,
            "Source": "stocks"
        },
        {
            "Title": "Transwarranty Finance Reports Quarterly Loss, Approves NCD Issuance Plan",
            "Summary": "Transwarranty Finance Limited approved unaudited financial results for the quarter ended September 30, 2025, and authorized issuance of unlisted Non-Convertible Debentures on private placement basis with coupon rates ranging from 11.25% to 12.00% per annum. The company's board meeting on November 13, 2025, also addressed a significant accounting policy change from cost method to fair value measurement for investments in subsidiaries and associates, effective March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763049743521,
            "Source": "earnings"
        },
        {
            "Title": "Transwarranty Finance Independent Director Completes Second Term",
            "Summary": "Transwarranty Finance Limited announced that Mr. Sudharshanan Nair (DIN: 01510505) ceased to hold office as an Independent Director on November 8, 2025, upon completion of his second consecutive term. His second term as Independent Director commenced on November 9, 2020. The Board of Directors acknowledged his valuable contributions during his tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762612430415,
            "Source": "corporate_governance"
        },
        {
            "Title": "Transwarranty Finance Appoints Ashok Nawany as Independent Director",
            "Summary": "Transwarranty Finance Limited has appointed Mr. Ashok Parumal Nawany (DIN: 00505885) as an Independent Director effective November 8, 2025, for a five-year term until November 7, 2030, subject to member approval. The appointment was approved by the Board of Directors based on the recommendation of the Nomination, Remuneration and Compensation Committee. Mr. Nawany brings nearly four decades of leadership experience and has been instrumental in the growth of Nawany Group, particularly in industrial and commercial real estate with emphasis on quality construction and timely project execution. He holds an M.A. in Leadership Sciences from Mumbai University. The company confirmed that Mr. Nawany is not debarred from holding directorship by SEBI or any other authority.",
            "Sentiment": "positive",
            "PublishDate": 1762352096151,
            "Source": "corporate_governance"
        },
        {
            "Title": "Transwarranty Finance Limited Approves Issuance of Unlisted Non-Convertible Debentures Worth Up to Rs 12.95 Crore",
            "Summary": "Transwarranty Finance Limited's Board of Directors approved the issuance of unlisted Non-Convertible Debentures (NCDs) on a private placement basis for up to Rs 12.95 crore. The offering includes 295 secured NCDs of Rs 1 lakh each, 500 unsecured NCDs of Rs 1 lakh each, and 50 special category Type B NCDs of Rs 10 lakh each. The secured NCDs carry an 11.25% annual coupon with quarterly interest payments and 3-year tenure, while unsecured NCDs offer 11.50% annual coupon with monthly payments and 5-year tenure. Special category NCDs provide 12% annual returns with varying payment frequencies. Secured debentures will be backed by pari-passu charge on certain current assets of the company. The NCDs will not be listed on exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1758206821330,
            "Source": "corporate_action"
        },
        {
            "Title": "Transwarranty Finance Reports Q1 2025 Results, Approves NCD Issuance and External Borrowing Plans",
            "Summary": "Transwarranty Finance Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported total income of Rs 332.17 lakhs compared to Rs 1,484.34 lakhs in the same quarter last year, with profit after tax of Rs 57.33 lakhs versus Rs 1,259.66 lakhs previously. On consolidated basis, the company posted a loss after tax of Rs 85.68 lakhs compared to a loss of Rs 38.58 lakhs in the prior year quarter. The Board also approved the reappointment of M/s. Yogesh Sharma & Co. as Secretarial Auditor for five years from 2025-26 to 2029-30, subject to shareholder approval. Additionally, the company received approval to issue unlisted Non-Convertible Debentures worth up to Rs 129.5 crores through private placement and to raise funds via external commercial borrowings, both requiring shareholder consent at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753962954391,
            "Source": "earnings"
        },
        {
            "Title": "Transwarranty Finance Schedules Board Meeting to Consider Quarterly Results and Fund-Raising Proposals",
            "Summary": "Transwarranty Finance Limited has scheduled a board meeting for July 31, 2025, to consider multiple key matters. The board will review unaudited financial results for the quarter ended June 30, 2025, covering both standalone and consolidated figures. The meeting will also address the issuance of unlisted non-convertible debentures on a private placement basis and proposals for raising funds through NCDs and External Commercial Borrowings, subject to shareholder approval at the upcoming Annual General Meeting. Additionally, the board will consider convening the AGM to seek shareholder approval for these fund-raising proposals. The company's trading window for securities remains closed until 48 hours after the financial results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1753375848876,
            "Source": "corporate_action"
        }
    ]
}