{
    "Symbol": "TGBHOTELS",
    "ISIN": "INE797H01018",
    "News": [
        {
            "Title": "TGB Banquets and Hotels CFO Jaydeepsinh Chavda Resigns Due to Personal Reasons",
            "Summary": "Jaydeepsinh Chavda resigned from his position as Chief Financial Officer and Key Managerial Personnel of TGB Banquets and Hotels Limited, effective from the close of business hours on November 25, 2025, citing personal reasons. Chavda had been associated with the company since February 11, 2025, and the company has accepted his resignation while acknowledging his contributions during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1764054207632,
            "Source": "corporate_governance"
        },
        {
            "Title": "TGB Banquets and Hotels Reports Quarterly Financial Results for September 2025",
            "Summary": "TGB Banquets and Hotels Limited's Board approved unaudited standalone financial results for the quarter and half year ended September 30, 2025, during a meeting held on November 13, 2025. The company's financial statements include profit and loss accounts, balance sheet, and cash flow statements, with statutory auditors completing their limited review as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763045807940,
            "Source": "earnings"
        },
        {
            "Title": "TGB Banquets and Hotels Approves Q1 Results and Key Director Re-appointments",
            "Summary": "TGB Banquets and Hotels Limited held a board meeting on August 13, 2025, approving unaudited financial results for the quarter ended June 30, 2025. The board approved re-appointments of key leadership positions: Mr. Narendra G. Somani as Managing Director and Chairman for 3 years from October 1, 2025; Mr. Devanand G. Somani and Mr. Hemant G. Somani as Whole Time Directors for 5 years from January 26, 2026; and Mrs. Jasmin Jaykumar Doshi as Non-Executive Independent Woman Director for a second 5-year term from November 9, 2025. The company also appointed M/s. Umesh Ved & Associates as Secretarial Auditors for 5 years from financial year 2025-26 to 2029-30. All appointments are subject to shareholder approval at the upcoming Annual General Meeting. The three male directors are brothers with extensive experience in hospitality and event management, while Mrs. Doshi is a qualified Company Secretary with over 10 years of professional experience.",
            "Sentiment": "neutral",
            "PublishDate": 1755091599664,
            "Source": "corporate_action"
        }
    ]
}