{
    "Symbol": "TGL",
    "ISIN": "INE0K6601012",
    "News": [
        {
            "Title": "Teerth Gopicon Awarded 1200 MW Solar Projects by NHPC",
            "Summary": "Teerth Gopicon has received a Letter of Award from NHPC (National Hydroelectric Power Corporation) for the development of 1200 MW solar power projects. This significant contract represents a major opportunity for Teerth Gopicon in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741134354000,
            "Source": "order&deals"
        },
        {
            "Title": "NHPC Awards 1200 MW Solar Project to Teerth Gopicon",
            "Summary": "Teerth Gopicon has received a Letter of Award from NHPC (National Hydroelectric Power Corporation) for the development of 1200 MW solar projects. This significant contract marks a major milestone for Teerth Gopicon in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741092160000,
            "Source": "order&deals"
        },
        {
            "Title": "Teerth Gopicon Signs MoU with Madhya Pradesh Government for ₹1500 Crore Project",
            "Summary": "Teerth Gopicon has signed a Memorandum of Understanding (MoU) with the Madhya Pradesh government for a project worth 1500 crore rupees. The company, which currently has a market capitalization of 420 crore rupees, is set to undertake this significant venture in partnership with the state government.",
            "Sentiment": "positive",
            "PublishDate": 1740470687000,
            "Source": "corporate_action"
        },
        {
            "Title": "Teerth Gopicon Secures Lowest Bid for NHPC Project",
            "Summary": "Teerth Gopicon has been declared the lowest bidder for tender documents issued by NHPC (National Hydroelectric Power Corporation). The bid project cost is reported to be 202 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738754526000,
            "Source": "order&deals"
        },
        {
            "Title": "Teerth Gopicon Secures Tender for High-Rise Tower Project",
            "Summary": "<p><span class='positive'>Teerth Gopicon</span> has <span class='positive'>announced</span> that it has <span class='positive'>secured</span> a <b>tender</b> for <span class='positive'>acquiring</span> a <b>land parcel</b> intended for a <b>high-rise tower project</b>. The company <span class='neutral'>estimates</span> that this project will <span class='positive'>generate revenue</span> of <span class='positive'>1.85 billion rupees</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728915463000,
            "Source": "corporate_action"
        }
    ]
}