{
    "Symbol": "THANGAMAYL",
    "ISIN": "INE085J01014",
    "News": [
        {
            "Title": "Thangamayil Jewellery Appoints New Company Secretary",
            "Summary": "Thangamayil Jewellery Limited has appointed CS K. Narayanan as Company Secretary and Compliance Officer with effect from 02nd February, 2026, following board approval.",
            "Sentiment": "positive",
            "PublishDate": 1770015740309,
            "Source": "stocks"
        },
        {
            "Title": "Thangamayil Jewellery targets ₹7,500 cr revenue",
            "Summary": "Thangamayil Jewellery expects to cross ₹7,500 crore revenue in FY26, driven by higher volumes across gold, silver and diamonds. The company plans second phase expansion around Chennai from FY27.",
            "Sentiment": "positive",
            "PublishDate": 1769077047965,
            "Source": "stocks"
        },
        {
            "Title": "Thangamayil Jewellery Q3FY26 PAT Surges 119% YoY",
            "Summary": "Thangamayil Jewellery reported strong Q3FY26 results with PAT jumping 119% YoY to ₹104.78 crores. Revenue increased 112% to ₹2,401.21 crores driven by higher gold and silver volumes.",
            "Sentiment": "positive",
            "PublishDate": 1768984891570,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thangamayil Jewellery surges 28% in 3 sessions",
            "Summary": "Thangamayil Jewellery shares jumped 28% over three consecutive sessions, driven by optimism from strong Q3 business updates reported by industry peers like Titan and Senco Gold.",
            "Sentiment": "positive",
            "PublishDate": 1767847370198,
            "Source": "stocks"
        },
        {
            "Title": "Thangamayil Jewellery Company Secretary Passes Away",
            "Summary": "Thangamayil Jewellery Limited announces the demise of Mr. V. Vijayaraghavan, Company Secretary and Compliance Officer, due to medical complications on December 16, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1765880993970,
            "Source": "stocks"
        },
        {
            "Title": "Thangamayil Jewellery Opens New Branch in Chengalpattu",
            "Summary": "Thangamayil Jewellery Limited has opened a new branch in Chengalpattu, Tamil Nadu on December 14, 2025, expanding its retail presence in the state.",
            "Sentiment": "positive",
            "PublishDate": 1765781244475,
            "Source": "stocks"
        },
        {
            "Title": "Thangamayil Jewellery Surges 53% in Five Sessions, Hits All-Time High on Strong Quarterly Results",
            "Summary": "Thangamayil Jewellery shares rallied over 53% in five trading sessions, reaching an all-time high of Rs 3,144. The surge followed strong September-quarter results showing net profit of Rs 58.5 crore versus a loss of Rs 17.4 crore year-over-year, with revenue jumping 45% to Rs 1,711 crore. EBITDA improved to Rs 106.2 crore from a loss of Rs 7.5 crore previously, bringing margins to 6.2%. October revenue crossed Rs 1,000 crore for the first time, surging 178% year-over-year to Rs 1,032 crore, with gold ornament volumes up 77% to 764 kg. Technical analysts note the stock broke out from year-long consolidation with strong volumes, though momentum indicators are now in overbought territory. Analysts suggest watching for dips toward Rs 2,800-2,570 support levels, with potential upside targets of Rs 3,300-3,500 if the stock holds above Rs 2,600-2,800.",
            "Sentiment": "positive",
            "PublishDate": 1762492744060,
            "Source": "stock"
        },
        {
            "Title": "Thangamayil Jewellery Fully Utilizes Rs 510 Crore Rights Issue Proceeds",
            "Summary": "Thangamayil Jewellery Limited has fully utilized the entire Rs 510 crore raised through its rights issue conducted from February 21 to March 4, 2025. The monitoring agency report by CARE Ratings Limited for the quarter ended September 30, 2025, shows no deviation from stated objectives. The funds were deployed across three main areas: Rs 8.71 crore for capital expenditure toward setting up six new retail stores (completed by June 2025), Rs 401.03 crore for inventory requirements in new stores (completed by September 30, 2025), Rs 97.67 crore for general corporate purposes including short-term working capital requirements, and Rs 2.59 crore for rights issue expenses. The company's promoters are Balarama Govinda Das, B.A.Ramesh and N.B.Kumar. All government and statutory approvals related to the objectives have been obtained, including certificates for BIS standards and labor department approvals for new stores.",
            "Sentiment": "positive",
            "PublishDate": 1762198337781,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery Reports Record Monthly Revenue of Rs 1,032 Crores in October 2025",
            "Summary": "Thangamayil Jewellery Limited achieved a milestone by crossing Rs 1,000 crores in monthly revenue for the first time, recording Rs 1,032 crores in October 2025 compared to Rs 371 crores in October 2024, marking a 178% increase. Gold ornaments volume grew 77% to 764 kgs from 432 kgs in the corresponding previous year period. The company noted that its Chennai metro new outlets are performing satisfactorily, though it cannot assess revenue growth trends for the remaining five months due to current wide price fluctuations in the market.",
            "Sentiment": "positive",
            "PublishDate": 1762157178236,
            "Source": "stock"
        },
        {
            "Title": "Thangamayil Jewellery Reports Strong Q2 Turnaround with 585M Rupees Net Profit",
            "Summary": "Thangamayil Jewellery reported quarterly net profit of 585 million rupees, marking a significant turnaround from a loss of 174 million rupees in the same period last year. The company's revenue grew to 17 billion rupees compared to 11.8 billion rupees year-over-year. EBITDA improved substantially to a gain of 994 million rupees from a loss of 104 million rupees in the previous year, with an EBITDA margin of 5.83%.",
            "Sentiment": "positive",
            "PublishDate": 1762155086345,
            "Source": "earnings"
        },
        {
            "Title": "Thangamayil Jewellery Opens Two New Branches in Chennai",
            "Summary": "Thangamayil Jewellery Limited opened two new branches in Chennai, Tamil Nadu, located in Avadi and Keelkattalai on September 21, 2025. The company announced the expansion through a communication to stock exchanges BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1757927228157,
            "Source": "stock"
        },
        {
            "Title": "Thangamayil Jewellery Reports Progress on Rs 510 Crore Rights Issue Fund Utilization",
            "Summary": "Thangamayil Jewellery Limited submitted a monitoring agency report from CARE Rating Limited regarding the utilization of proceeds from their Rs 510 crore rights issue. The rights issue was conducted from February 21 to March 4, 2025, with Rs 178.50 crore received from promoters through converted unsecured loans and Rs 331.50 crore through allotment. As of June 30, 2025, the company has utilized Rs 489.44 crore of the total proceeds across four key areas: capital expenditure for six new retail stores (Rs 8.71 crore fully utilized), inventory for new stores (Rs 380.51 crore utilized out of Rs 401.03 crore), general corporate purposes (Rs 97.67 crore fully utilized), and rights issue expenses (Rs 2.55 crore utilized out of Rs 2.59 crore). The monitoring agency reported no deviations from the stated objectives, with Rs 20.56 crore remaining unutilized. The company has obtained necessary government approvals including BIS standards, GST registration, and labor department clearances for new stores.",
            "Sentiment": "positive",
            "PublishDate": 1755065102771,
            "Source": "stock"
        },
        {
            "Title": "Thangamayil Jewellery Approves Final Dividend of Rs. 12.50 Per Share",
            "Summary": "Thangamayil Jewellery Limited shareholders approved a final dividend of Rs. 12.50 per equity share at their 25th Annual General Meeting held on July 28, 2025. The dividend represents 125% of the face value of Rs. 10 per equity share and will be paid on or before August 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753710931300,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery Reports 19% Profit Decline Despite 12.7% Revenue Growth",
            "Summary": "Thangamayil Jewellery reported a 19% decline in net profit to Rs 45.7 crore for the quarter ended June 30, 2025, compared to Rs 56.6 crore in the same period last year. Despite the profit drop, revenue increased 12.7% to Rs 1,555.3 crore from Rs 1,380.5 crore. The company's margins contracted significantly, with EBITDA falling 71% to Rs 69.4 crore and margin dropping to 4.5% from 17.5%. Retail sales grew 28% to Rs 1,505 crore, while same-store sales growth slowed to 6.83% from 19.76% in the previous year. The company expanded its retail presence to 64 outlets from 58 outlets. Shares closed 1.8% lower at Rs 1,800.6, though three analysts maintain 'buy' ratings with price targets suggesting 41.9% potential upside.",
            "Sentiment": "negative",
            "PublishDate": 1753702156327,
            "Source": "earnings"
        },
        {
            "Title": "Thangamayil Jewellery Reports Mixed Q1 FY26 Results with Revenue Growth but Profit Decline",
            "Summary": "Thangamayil Jewellery reported Q1 FY26 results showing revenue growth to 15.5 billion rupees from 12.2 billion rupees year-over-year. However, net profit declined to 457 million rupees from 567 million rupees in the same period last year. EBITDA decreased to 844 million rupees from 899 million rupees, with EBITDA margin compressing to 5.43% from 7.36% year-over-year. Same-store sales growth moderated to 6.83% compared to 19.76% in the previous year. The company expects sales volume to increase in upcoming quarters of FY25-26 if gold prices remain steady or decline.",
            "Sentiment": "neutral",
            "PublishDate": 1753696345685,
            "Source": "stock"
        },
        {
            "Title": "Thangamahil Jewellery to Open Two New Stores in Chennai",
            "Summary": "Thangamahil Jewellery has announced plans to launch two new stores in Chennai in the near future. This expansion indicates the company's growth strategy in the jewelry retail sector.",
            "Sentiment": "positive",
            "PublishDate": 1751283977000,
            "Source": "default"
        },
        {
            "Title": "Thangamayil Jewellery Announces Dividend of ₹12.5 Per Share",
            "Summary": "Thangamayil Jewellery has declared a dividend of ₹12.5 per share for its shareholders. This announcement represents a significant corporate action that will directly benefit the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1747296213000,
            "Source": "result"
        },
        {
            "Title": "Thangamayil Jewellery Reports Q4 Financial Results",
            "Summary": "Thangamayil Jewellery announced its Q4 financial results. Revenue increased to 13.8B rupees from 9.83B rupees year-over-year. EBITDA rose to 571M rupees from 483M rupees, while EBITDA margin decreased to 4.14% from 4.92%. Net profit improved to 314M rupees from 282M rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747295897000,
            "Source": "result"
        },
        {
            "Title": "Thangamayil Jewellery to Consider Q4 Results on May 15",
            "Summary": "Thangamayil Jewellery has announced that it will consider its fourth quarter (Q4) financial results on May 15. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter, which is an important event for investors and analysts to assess the company's financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1746532948000,
            "Source": "default"
        },
        {
            "Title": "Thangamayil Jewellery Reports Slight Revenue Increase on Akshaya Tritiya",
            "Summary": "Thangamayil Jewellery has reported a revenue of ₹158.8 crore on Akshaya Tritiya, compared to ₹157.28 crore in the previous year, indicating a marginal year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1746176235000,
            "Source": "default"
        },
        {
            "Title": "Thangamayil Jewellery: Promoters Release Entire Stock Pledge",
            "Summary": "Thangamayil Jewellery's promoters have fully released their pledged shares, making all promoter-held shares free from encumbrances. The stock price rose 2.33% to ₹2,054.35 on the BSE following this announcement. Promoters hold 61.27% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1743485398000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery Approves Rights Issue Price",
            "Summary": "Thangamayil Jewellery has approved a rights issue price of 1,400 rupees per rights equity share. This corporate action allows existing shareholders to purchase additional shares at a specified price, potentially raising capital for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1741565360000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery: Rights Issue Approved at ₹1,400 Per Share",
            "Summary": "Thangamayil Jewellery has approved the allotment of 36.4 lakh equity shares at ₹1,400 per share in its rights issue. This increases the company's paid-up equity share capital from ₹27.43 crore to ₹31.08 crore. The company reported strong financial performance with 24% YoY growth in retail revenue for the first nine months of FY25.",
            "Sentiment": "positive",
            "PublishDate": 1741353788000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery Announces Rights Issue Price",
            "Summary": "Thangamayil Jewellery has approved a rights issue price of 1,400 rupees per rights equity share. This corporate action allows existing shareholders to purchase additional shares at a specified price, potentially raising capital for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1741351446000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery: Equirus Securities Reiterates Top Pick Status",
            "Summary": "Thangamayil Jewellery's stock hit 20% upper circuit as Equirus Securities reiterated it as top retail pick with a target price of Rs 2,614. The company plans expansion in Chennai, starting with a flagship store in T-Nagar. Equirus projects strong growth in revenue, EBITDA, and net profit over FY2025-2027. The company's DigiGold scheme shows promise in customer acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1740470457000,
            "Source": "normal_news"
        },
        {
            "Title": "Thangamayil Jewellery Ltd: Stock Surges 20% on New Store Opening",
            "Summary": "Thangamayil Jewellery Ltd's stock hit the upper circuit of 20% after opening a new showroom in Chennai's T. Nagar. The new store reported sales of ₹16.12 crore and 7,250 footfalls on its opening day. The company expects over 24% revenue growth by FY2025 and plans to raise ₹510 crore through a rights issue for store expansion.",
            "Sentiment": "positive",
            "PublishDate": 1740468190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery: ₹510 Crore Rights Issue for Store Expansion",
            "Summary": "Thangamayil Jewellery plans to invest ₹510 crore raised through a rights issue for store expansion.",
            "Sentiment": "positive",
            "PublishDate": 1738840139000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thangamayil Jewellery Aims to Maintain EBITDA Margin Above 6%",
            "Summary": "Thangamayil Jewellery has expressed confidence in maintaining its EBITDA margin at levels above 6% in the future. The company reported an EBITDA margin excluding customs duty of 6.1% for the first nine months of the current financial year, as disclosed during a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1738824278000,
            "Source": "earnings"
        },
        {
            "Title": "Thangamayil Jewellery Projects 24%+ Revenue Growth for FY25",
            "Summary": "Thangamayil Jewellery has announced during a conference call that it expects to achieve more than 24% revenue growth by the end of fiscal year 2025. This projection indicates strong confidence in the company's future performance and expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1738824153000,
            "Source": "earnings"
        },
        {
            "Title": "Thangamayil Jewellery Reports Q3 Revenue Growth",
            "Summary": "Thangamayil Jewellery has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 reached 11.3 billion rupees, compared to 8.9 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738746307000,
            "Source": "earnings"
        },
        {
            "Title": "Thangamayil Jewellery Reports Improved Q3 EBITDA and Margin",
            "Summary": "Thangamayil Jewellery has announced its Q3 financial results, showing significant improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 824 million rupees from 497 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 7.28% from 5.56% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738746295000,
            "Source": "earnings"
        },
        {
            "Title": "Thangamayil Jewellery Reports Significant Profit Increase in Q3",
            "Summary": "Thangamayil Jewellery has reported a substantial increase in net profit for the third quarter. The company's net profit rose to 482 million rupees, compared to 280 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738746230000,
            "Source": "earnings"
        },
        {
            "Title": "Thangamayil Jewellery Reports Q2 EBITDA Loss",
            "Summary": "Thangamayil Jewellery, an Indian jewelry company, has reported an EBITDA loss of 104 million rupees for the second quarter. This represents an improvement compared to the EBITDA loss of 231 million rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1730880830000,
            "Source": "result"
        },
        {
            "Title": "Thangamayil Jewellery Reports Q2 Revenue Growth",
            "Summary": "Thangamayil Jewellery, an Indian jewelry company, has reported a revenue of 11.8 billion rupees for the second quarter, compared to 9.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730880701000,
            "Source": "result"
        },
        {
            "Title": "Thangamayil Jewellery Reports Q2 Net Loss",
            "Summary": "Thangamayil Jewellery has reported a net loss of 174 million rupees for the second quarter, compared to a profit of 84 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730880666000,
            "Source": "result"
        }
    ]
}