{
    "Symbol": "THEINVEST",
    "ISIN": "INE924D01017",
    "News": [
        {
            "Title": "ITI Reports Q3FY26 Profit Turnaround",
            "Summary": "The Investment Trust of India Limited reported standalone profit of ₹41.35 lakhs in Q3FY26 versus loss of ₹111.52 lakhs in Q3FY25, while consolidated profit reached ₹1,280.46 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770129761712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Investment Trust of India Board Meet on Feb 3, 2026",
            "Summary": "The Investment Trust of India Limited has scheduled a board meeting for February 03, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769524307333,
            "Source": "co_actions_results"
        },
        {
            "Title": "Investment Trust of India Redeems Outstanding OCPS",
            "Summary": "The Investment Trust of India Limited has successfully redeemed 10,050 outstanding 0% Optionally Convertible Preference Shares worth ₹32.66 lakh on December 30, 2025, completing the five-year tenure cycle.",
            "Sentiment": "neutral",
            "PublishDate": 1767162232792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Investment Trust of India Loses Control of ITI Gold Loans Limited Following Non-Participation in Fundraising",
            "Summary": "The Investment Trust of India Limited did not participate in ITI Gold Loans Limited's equity fundraising exercise, resulting in IGLL ceasing to be a subsidiary effective November 29, 2025. IGLL will now be reclassified as an Associate Company, marking a significant change in the corporate structure and control dynamics between the two entities.",
            "Sentiment": "negative",
            "PublishDate": 1764425845348,
            "Source": "corporate_action"
        },
        {
            "Title": "Investment Trust of India Faces Rs 2.99 Crore Stamp Duty Demand Over Merger Order",
            "Summary": "The Investment Trust of India Limited has been levied a stamp duty of Rs 2,99,47,295 by the Collector of Stamps, Mumbai, on its NCLT-approved merger with subsidiary ITI Management Advisors Ltd. The company has filed an appeal under the Maharashtra Stamp Act challenging the order and expects a favorable outcome with no material financial impact anticipated.",
            "Sentiment": "neutral",
            "PublishDate": 1763992986766,
            "Source": "stock"
        },
        {
            "Title": "Investment Trust of India Seeks Shareholder Approval to Extend Employee Stock Option Plan to Subsidiary Employees",
            "Summary": "The Investment Trust of India Limited has issued a postal ballot notice seeking shareholder approval through remote e-voting to extend its FFSIL-ESOP 2017 scheme to employees of subsidiary companies. The company proposes to grant up to 30 lakh employee stock options exercisable into equity shares of Rs. 10 each, with e-voting scheduled from November 19 to December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763102506021,
            "Source": "corporate_action"
        },
        {
            "Title": "The Investment Trust of India Re-submits Complete Financial Results After Missing Pages",
            "Summary": "The Investment Trust of India Limited re-uploaded its unaudited financial results for the quarter and half year ended September 30, 2025, after inadvertently missing certain pages in the initial submission. The omitted documents included Notes to Standalone Financial Results, Standalone Assets and Liabilities, and Standalone Cash Flow Statement. The company reported consolidated revenue from operations of Rs 19,331 lakhs for the quarter, with net profit after tax of Rs 561 lakhs. On a standalone basis, the company posted revenue from operations of Rs 270.28 lakhs but recorded a net loss of Rs 32.29 lakhs for the quarter. The company's demerger scheme of its Non-lending Business Undertaking into Distress Asset Specialist Limited remains pending regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1762426085028,
            "Source": "earnings"
        },
        {
            "Title": "The Investment Trust of India Reports Q2 Consolidated Net Profit of ₹861 Crores, Approves ESOP Extension and OCPS Redemption",
            "Summary": "The Investment Trust of India Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported consolidated net profit after tax of ₹861.01 crores compared to ₹1,020.80 crores in the previous quarter. Revenue from operations stood at ₹7,905.56 crores versus ₹7,010.07 crores in the prior quarter. The Board approved extension of the FFSIL-Employee Stock Option Plan 2017 to eligible employees of subsidiary companies, covering 30 lakh equity shares with exercise price at face value of ₹10 per share or last closing price. The company also approved redemption of 10,050 unlisted 0% Optionally Convertible Preference Shares of ₹325 each, due for redemption on December 30, 2025. The consolidated results include financial performance of subsidiaries including ITI Securities Broking Limited, ITI Credit Limited, and other group entities. Basic earnings per share was ₹0.56 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762355587251,
            "Source": "earnings"
        },
        {
            "Title": "The Investment Trust of India Reports 73% Decline in Q2 Net Profit",
            "Summary": "The Investment Trust of India reported Q2 consolidated net profit of 56 million rupees, down from 204 million rupees in the same quarter last year. Revenue decreased to 791 million rupees from 1.1 billion rupees year-over-year. EBITDA fell to 165 million rupees from 236 million rupees, while EBITDA margin slightly declined to 20.92% from 21.24%.",
            "Sentiment": "negative",
            "PublishDate": 1762349053715,
            "Source": "earnings"
        },
        {
            "Title": "The Investment Trust of India Re-appoints Mrs. Papia Sengupta as Independent Director for Second Term",
            "Summary": "The Investment Trust of India Limited shareholders approved the re-appointment of Mrs. Papia Sengupta as an Independent Director for a second term of five years from December 19, 2025 to December 18, 2030 at the company's 34th Annual General Meeting held on August 25, 2025. Mrs. Sengupta, who holds DIN 07701564, brings over three decades of banking sector experience and previously served as Executive Director at Bank of Baroda and Chief General Manager at the State Bank Group. Her expertise spans Corporate & MSME Finance, Stressed Assets Management, Risk Management, Banking, Treasury & Investment, Audit & Inspection, Overseas Banking, and Human Resource Management. She holds qualifications including CAIIB from the Indian Institute of Banking and Finance and Chartered Financial Analyst (CFA) program from ICFAI. Mrs. Sengupta is not related to any company directors and does not hold any shares in the company.",
            "Sentiment": "positive",
            "PublishDate": 1756126808638,
            "Source": "corporate_governance"
        },
        {
            "Title": "The Investment Trust of India Limited Approves Quarterly Results and Key Corporate Actions",
            "Summary": "The Investment Trust of India Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹270.28 lakhs and consolidated revenue from operations of ₹7,010.07 lakhs for the quarter. Net profit after tax stood at ₹12.72 lakhs on standalone basis and ₹1,238.99 lakhs on consolidated basis. The Board also approved several corporate actions including revision of the employee stock option plan (FFSIL-ESOP 2017), dilution of equity interest in subsidiary ITI Gold Loans Limited where the company will cease to be the holding company, appointment of two senior management personnel - Darshna Devang Mehta as Group Head-Human Resource and Mannish Patil as Group Head-Information Technology, and re-appointment of Papia Sengupta as Independent Director for a second five-year term from December 18, 2025 to December 17, 2030. The company scheduled its 34th Annual General Meeting for August 25, 2025 through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1753455343560,
            "Source": "earnings"
        },
        {
            "Title": "Investment Trust of India Reports 26% Decline in Q1 Net Profit",
            "Summary": "The Investment Trust of India reported a consolidated net profit of 92 million rupees for Q1, down from 124 million rupees in the same period last year, representing a 26% year-over-year decline. The company's revenue for the quarter was 701 million rupees compared to 708 million rupees in the previous year, showing a marginal decrease of 1%.",
            "Sentiment": "negative",
            "PublishDate": 1753453762799,
            "Source": "earnings"
        },
        {
            "Title": "Investment Trust of India Approves Quarterly Results and Key Corporate Actions",
            "Summary": "The Investment Trust of India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹270.28 lakhs and consolidated revenue of ₹7,010.07 lakhs for the quarter. The Board also approved revision of the employee stock option plan for Fortune Financial Services (India) Limited, subject to shareholder approval. Additionally, the company decided to dilute its equity interest in subsidiary ITI Gold Loans Limited, where it currently holds 50.33% stake, which will result in the company ceasing to be the holding company while ITI Gold Loans will remain an associate company. The Board appointed Darshna Devang Mehta as Group Head-Human Resource and Mannish Patil as Group Head-Information Technology as Senior Management Personnel. Papia Sengupta was re-appointed as Independent Director for a second five-year term from December 18, 2025 to December 17, 2030, subject to shareholder approval. The 34th Annual General Meeting was scheduled for August 25, 2025 through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1753453719313,
            "Source": "corporate_action"
        },
        {
            "Title": "Investment Trust of India Corrects EPS Filing Discrepancy",
            "Summary": "Investment Trust of India has clarified a discrepancy in its earnings per share (EPS) filing. The company has updated its EPS to ₹1.10, adjusting it from the previously reported figure of ₹0.67. This correction represents a significant increase in the reported EPS.",
            "Sentiment": "positive",
            "PublishDate": 1750683513000,
            "Source": "default"
        },
        {
            "Title": "The Investment Trust of India Reports Q4 Profit and Revenue Growth",
            "Summary": "The Investment Trust of India has reported its Q4 financial results. The company's consolidated net profit increased to 58 million rupees, up from 35 million rupees year-over-year and 40 million rupees quarter-over-quarter. Revenue for Q4 also saw growth, reaching 940 million rupees compared to 865 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746802722000,
            "Source": "result"
        }
    ]
}