{
    "Symbol": "THELEELA",
    "ISIN": "INE0AQ201015",
    "News": [
        {
            "Title": "Leela Palaces subsidiary receives IT assessment order",
            "Summary": "Leela Palaces Hotels & Resorts disclosed that its wholly owned subsidiary Schloss HMA Private Limited received an income tax assessment order for AY 2023-24, with no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1770390240324,
            "Source": "stocks"
        },
        {
            "Title": "Leela Palaces Expects To Exceed EBITDA Growth Guidance",
            "Summary": "Management expects to exceed earlier guidance of mid to high teens EBITDA growth for FY26, driven by strong performance in first 9 months during Q3FY26 earnings call.",
            "Sentiment": "positive",
            "PublishDate": 1768573337408,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leela Palaces submits Q3FY26 monitoring report",
            "Summary": "Leela Palaces Hotels & Resorts submitted its Q3FY26 monitoring agency report showing no deviation from IPO proceeds utilization. ICRA confirmed proper deployment of funds.",
            "Sentiment": "neutral",
            "PublishDate": 1768560245113,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leela Palaces Q3 Net Profit Doubles to ₹148 Crore",
            "Summary": "Leela Palaces Hotels & Resorts reported consolidated net profit of ₹147.88 crore for Q3, more than doubling from ₹56.40 crore year ago, driven by 21% revenue growth to ₹457.43 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768554228950,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leela Palaces Hotels Q3 EBITDA Rises to ₹2.38B",
            "Summary": "Leela Palaces Hotels reported Q3 EBITDA of ₹2.38 billion versus ₹1.87 billion year-on-year, with EBITDA margin improving to 52% from 50.46% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768551606456,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leela Palaces receives appellate orders on tax credit",
            "Summary": "Leela Palaces Hotels & Resorts receives four appellate orders from Joint Commissioner of Commercial Taxes regarding alleged ineligible input tax credit availment, with no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768317005235,
            "Source": "stocks"
        },
        {
            "Title": "Leela Palaces Q3FY26 earnings call on Jan 16",
            "Summary": "Leela Palaces Hotels & Resorts Limited announces Q3FY26 earnings conference call scheduled for January 16, 2026 at 5:00 PM IST with management team participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768234989645,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Raises Leela Palaces Target to ₹573",
            "Summary": "Morgan Stanley maintains overweight rating on Leela Palaces Hotels & Resorts, raising target price from ₹562 to ₹573, reflecting continued confidence in the luxury hospitality company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1767930875759,
            "Source": "stocks"
        },
        {
            "Title": "Leela Palaces incorporates new subsidiary for luxury hotels",
            "Summary": "Leela Palaces Hotels & Resorts has incorporated wholly owned subsidiary Leela Imperial Suites Private Limited to own, operate, manage and develop luxury hotels and resorts under 'The Leela' brand.",
            "Sentiment": "positive",
            "PublishDate": 1767625545341,
            "Source": "stocks"
        },
        {
            "Title": "Leela Palaces incorporates new wholly owned subsidiary",
            "Summary": "Leela Palaces Hotels & Resorts Limited has incorporated a wholly owned subsidiary, Leela Imperial Suites Private Limited, with ₹5.00 lakh authorized capital for luxury hotel operations.",
            "Sentiment": "positive",
            "PublishDate": 1767622549146,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leela Palaces subsidiary faces mixed GST orders",
            "Summary": "TPRPL receives multiple GST orders from Jaipur authorities - one case dropped entirely (₹2.02 cr), while three others confirm demands totaling ₹77.35 lakhs with interest and penalties.",
            "Sentiment": "neutral",
            "PublishDate": 1767112262813,
            "Source": "stocks"
        },
        {
            "Title": "Leela Palaces stock gains 8% on expansion plans",
            "Summary": "Analysts see 40% upside potential in Leela Palaces stock following Dubai acquisition and domestic expansion plans. Company reported strong Q2 FY25 results with 12.1% revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1766710070149,
            "Source": "stocks"
        },
        {
            "Title": "Leela Palaces Hotels Launches New Division",
            "Summary": "Leela Palaces Hotels & Resorts announces the introduction of a new business division called 'Leela Essence Hospitality' as part of its strategic expansion initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1766459835555,
            "Source": "stocks"
        },
        {
            "Title": "Leela Palaces Incorporates New Hospitality Subsidiary",
            "Summary": "Leela Palaces Hotels & Resorts Limited has incorporated a wholly owned subsidiary, Leela Essence Hospitality Private Limited, on December 22, 2025, with authorized capital of ₹5.00 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1766426222529,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leela Palaces Incorporates New Wholly Owned Subsidiary",
            "Summary": "Leela Palaces Hotels & Resorts Limited has incorporated a wholly owned subsidiary, Leela Nirvana Resorts Private Limited, with authorized share capital of ₹5.00 lakh and paid-up capital of ₹1,000.",
            "Sentiment": "positive",
            "PublishDate": 1766165761346,
            "Source": "co_actions_results"
        },
        {
            "Title": "Argon Holdings Acquires Sofitel The Palm FZE Property in Dubai",
            "Summary": "Argon Holdings, a stakeholder in Leela Palaces Hotels, has acquired Sofitel The Palm FZE, a luxury beachfront property on Dubai's Palm Jumeirah. The 23-acre property includes a 361-key luxury hotel, 182 branded residences, and 3 villas.",
            "Sentiment": "positive",
            "PublishDate": 1764213056056,
            "Source": "order&deals"
        },
        {
            "Title": "Leela Palaces Hotels & Resorts Invests $47.72M Through Subsidiary in UAE Entity",
            "Summary": "Leela Palaces Hotels & Resorts Limited announced that its wholly owned subsidiary, Aries Holdings (DIFC) Limited, has made an additional investment of $47.72 million in Argon Holdings (DIFC) Limited. The company maintains its 25% shareholding and voting rights in Argon Holdings with no change in control. Argon Holdings is an investment company incorporated in October 2023 in the United Arab Emirates with a paid-up share capital of $1,468 and nil turnover. The investment aims to explore business opportunities in the UAE and was made through a rights issue offering uniform terms to all shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1762848761833,
            "Source": "corporate_action"
        },
        {
            "Title": "Leela Palaces Hotels & Resorts Partners for Luxury Desert Resort in Jaisalmer",
            "Summary": "Leela Palaces Hotels & Resorts has partnered for the management of a luxury desert resort in Jaisalmer, Rajasthan. The resort is scheduled to open in 2026 and will enhance the company's presence in the popular travel market.",
            "Sentiment": "positive",
            "PublishDate": 1762448241661,
            "Source": "stock"
        },
        {
            "Title": "Leela Palaces Hotels & Resorts Reports Q2 PAT of Rs 75 Crore, Revenue Grows 11% YoY",
            "Summary": "Leela Palaces Hotels & Resorts reported revenues of Rs 333.4 crore in the second quarter, representing an 11% year-on-year increase. The luxury hospitality chain posted a profit after tax of Rs 75 crore and EBITDA growth of 17% to Rs 161 crore. CEO Anuraag Bhatnagar highlighted this as the fourth consecutive quarter of positive profit after tax. Revenue per available room grew 13%, driven by improved occupancy and average daily rates, with owned hotels showing strong double-digit growth across city and resort segments. The company expects to deliver mid-to-high teens EBITDA growth for financial year 2026, supported by operating momentum and strategic initiatives. The chain announced its international expansion with entry into Dubai's Palm Jumeirah.",
            "Sentiment": "positive",
            "PublishDate": 1760445518755,
            "Source": "earnings"
        },
        {
            "Title": "Leela Palaces Hotels Targets Mid-to-High Teens EBITDA Growth for FY26",
            "Summary": "Leela Palaces Hotels announced it is on track to deliver mid-to-high teens EBITDA growth for FY26. The company expressed confidence in achieving this earnings growth target.",
            "Sentiment": "positive",
            "PublishDate": 1760434672758,
            "Source": "stock"
        },
        {
            "Title": "Leela Palaces Hotels & Resorts Reports Strong Q2 Performance and Approves Investment in UAE Subsidiary",
            "Summary": "Leela Palaces Hotels & Resorts Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs. 1,944.67 million for the quarter, with net profit after tax of Rs. 728.52 million. On a consolidated basis, revenue from operations reached Rs. 3,106.49 million for the quarter, with net profit of Rs. 747.22 million. The Board also approved an investment of USD 49.667 million in its wholly owned subsidiary, Aries Holdings (DIFC) Limited, incorporated in the UAE. The company completed its IPO during the quarter ended June 30, 2025, raising Rs. 25,000 million through fresh equity issuance at Rs. 435 per share, with shares listed on BSE and NSE on June 2, 2025. The company utilized Rs. 23,000 million from IPO proceeds for debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1760433495476,
            "Source": "earnings"
        },
        {
            "Title": "Schloss Bangalore Changes Company Name to Leela Palaces Hotels & Resorts Limited",
            "Summary": "Schloss Bangalore will change its company name to Leela Palaces Hotels & Resorts Limited effective October 13, 2025. The company's trading symbol will remain unchanged as Theleela.",
            "Sentiment": "neutral",
            "PublishDate": 1759984556220,
            "Source": "corporate_action"
        },
        {
            "Title": "Leela Palaces Promoters Encumber 75.91% Shareholding for $500 Million Term Loan Facility",
            "Summary": "The promoters of Leela Palaces Hotels & Resorts Limited have entered into a facility agreement for a term loan facility of up to US$ 500 million with multiple lenders including Barclays Bank PLC, Deutsche Bank AG, Morgan Stanley Bank N.A., MUFG Bank Ltd, Nomura Singapore Limited, Standard Chartered Bank, and Sumitomo Mitsui Banking Corporation. The agreement involves the creation of encumbrance on 100% of the promoters' shareholding, representing 75.91% of the company's total share capital (25,34,98,104 shares). A charge has been created on 100% of the issued share capital held by the holding company BSREP III India Ballet Holdings (DIFC) Limited in each of the promoters. The facility agreement includes covenants related to the promoters' equity shares, effective from September 19, 2025. The loan proceeds will be used for payments or distributions to investors, repayment of shareholder loans, and transaction costs. The value of encumbered shares is US$ 1,204,399,834 against the loan amount of US$ 500,000,000, providing a security cover ratio of 2.409. The company is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1759217386283,
            "Source": "corporate_action"
        },
        {
            "Title": "Deutsche Bank Group Creates Encumbrance Over 75.91% Stake in Schloss Bangalore Limited for $500 Million Facility",
            "Summary": "Deutsche Bank Group has disclosed the creation of encumbrance over equity shares of Schloss Bangalore Limited held by seven promoter entities. The promoters collectively own 253,498,104 shares, representing approximately 75.91% of the company's total share capital. This encumbrance relates to a term loan facility of up to $500 million entered into on September 19, 2025, with multiple lenders including Barclays Bank PLC, Morgan Stanley Bank N.A., MUFG Bank Ltd, Nomura Singapore Limited, Standard Chartered Bank, and Sumitomo Mitsui Banking Corporation. Deutsche Bank AG Hong Kong Branch acts as the agent, while DB Trustees (Hong Kong) Limited serves as the offshore security agent. The facility agreement includes covenants that create encumbrance over the promoters' equity holdings in Schloss Bangalore Limited. Additionally, a charge has been created on 100% of the issued share capital held by the holding company BSREP III India Ballet Holdings (DIFC) Limited in each of the promoter entities to secure the facility.",
            "Sentiment": "neutral",
            "PublishDate": 1758622526130,
            "Source": "corporate_action"
        },
        {
            "Title": "Schloss Bangalore Plans Name Change to Leela Palaces Hotels & Resorts, Reports Strong Q1 Results",
            "Summary": "Schloss Bangalore Ltd, owner and operator of The Leela luxury hospitality chain, announced plans to rename itself to Leela Palaces Hotels & Resorts Ltd. The board approved the proposal, which requires shareholder consent and regulatory approvals. The company reported strong quarterly results with standalone revenue rising 22% year-on-year to ₹93 crore. It posted a profit of ₹35 crore, reversing from a ₹10 crore loss in the same quarter last year. EBITDA increased 29% to ₹44 crore with margins improving by 260 basis points to 47.3%. The company, founded in 2019, made its stock market debut on June 2 at a nearly 7% discount to issue price. Shares closed 1.33% lower at ₹420.35 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755874397120,
            "Source": "stock"
        },
        {
            "Title": "Schloss Bangalore Reports Record Q1 Performance with 25% Revenue Growth and Positive PAT",
            "Summary": "Schloss Bangalore Limited, operator of The Leela Palaces Hotels and Resorts, delivered strong quarterly results with total income rising 25% year-on-year to INR 301 crores. EBITDA grew 63% to INR 128 crores with margins expanding 980 basis points to 42.5%. The company turned profitable with PAT of INR 8.7 crores compared to a loss of INR 75 crores in the same quarter last year. RevPAR increased 20% driven by 4% occupancy growth to 64% and 13% ADR improvement. The performance was achieved despite headwinds from geopolitical tensions and Operation Sindoor. Post-IPO, the company maintains a strong balance sheet with net debt of INR 227 crores, translating to 0.3x net debt to EBITDA. The company signed agreements to expand into Mumbai's BKC with a 250-key hotel through a 50-50 joint venture with Brookfield. Management is confident of delivering double-digit EBITDA growth and targets reaching INR 2,000 crores EBITDA by FY30 through same-store growth, new verticals like ARQ membership clubs, and expansion of owned hotels.",
            "Sentiment": "positive",
            "PublishDate": 1753788489000,
            "Source": "earnings"
        },
        {
            "Title": "Schloss Bangalore Invests ₹67.5 Crores in BKC Luxury Project Joint Venture with Brookfield Affiliate",
            "Summary": "Schloss Bangalore has announced an investment of ₹67.5 crores in a luxury project located in BKC (Bandra Kurla Complex). The company will maintain a 50% stake in this joint venture partnership with a Brookfield affiliate.",
            "Sentiment": "positive",
            "PublishDate": 1753459223072,
            "Source": "order&deals"
        },
        {
            "Title": "Schloss Bangalore Plans Expansion with 8 Hotels Including BKC Mumbai Project",
            "Summary": "Schloss Bangalore has announced plans for significant expansion with 8 hotels in development, including a landmark project in BKC Mumbai. The company expects strong EBITDA growth in FY26, targeting mid-to-high teens growth driven by positive operating trends and strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1753195960442,
            "Source": "stock"
        },
        {
            "Title": "Schloss Bangalore Limited Reports Best-Ever Q1 Performance with 25% Revenue Growth",
            "Summary": "Schloss Bangalore Limited (The Leela) delivered its strongest Q1 performance with total revenue rising 25% to ₹3,013 million and EBITDA surging 63% to ₹1,280 million. The company achieved positive PAT of ₹87 million compared to a loss of ₹750 million in the previous year. RevPAR increased 20% driven by 4% occupancy growth and 13% ADR improvement. EBITDA margin expanded 980 basis points to 42.5%. The company maintains a strong balance sheet with net debt-to-EBITDA ratio of 0.3x following IPO proceeds used for debt reduction. The Leela operates 13 properties with 3,544 keys and has 8 hotels with 966 keys in pipeline. The company is expanding into Mumbai with a new owned hotel in BKC and launching ARQ luxury clubs across multiple locations.",
            "Sentiment": "positive",
            "PublishDate": 1753180671054,
            "Source": "earnings"
        },
        {
            "Title": "Schloss Bangalore Reports Strong Turnaround with Q1 Profit of 88M Rupees",
            "Summary": "Schloss Bangalore achieved a consolidated net profit of 88 million rupees in Q1, marking a significant turnaround from a loss of 750 million rupees in the same period last year. The company's revenue grew to 2.75 billion rupees compared to 2.28 billion rupees year-over-year, representing an increase of approximately 21%.",
            "Sentiment": "positive",
            "PublishDate": 1753174220435,
            "Source": "earnings"
        },
        {
            "Title": "Schloss Invests ₹10.52 Billion in Bangalore and Chennai Properties",
            "Summary": "Schloss has made significant investments in two properties: ₹4.7 billion in Schloss Chanakya and ₹5.82 billion in Schloss Chennai. The total investment amounts to ₹10.52 billion across these two locations.",
            "Sentiment": "positive",
            "PublishDate": 1749131437000,
            "Source": "default"
        },
        {
            "Title": "Schloss Bangalore Consortium Secures 80-Year Lease for BKC Plot",
            "Summary": "A consortium led by Schloss Bangalore has secured an 80-year lease for a prime commercial plot in Bandra Kurla Complex (BKC) from the Mumbai Metropolitan Region Development Authority (MMRDA) for ₹1,302 crore. The consortium plans to develop a mixed-use project on the site, which will include a luxury hotel.",
            "Sentiment": "positive",
            "PublishDate": 1748995707000,
            "Source": "default"
        },
        {
            "Title": "Schloss Bangalore Consortium Secures 80-Year Lease for BKC Plot",
            "Summary": "A consortium led by Schloss Bangalore has obtained an 80-year lease for a prime commercial plot in Bandra Kurla Complex (BKC) from the Mumbai Metropolitan Region Development Authority (MMRDA). The deal is valued at ₹1,302 crore. The consortium plans to develop a mixed-use project on the site, which will include a luxury hotel.",
            "Sentiment": "positive",
            "PublishDate": 1748963166000,
            "Source": "default"
        },
        {
            "Title": "Schloss Bangalore: Secures 80-Year Lease for Rs 1,302 Crore BKC Plot",
            "Summary": "Schloss Bangalore Ltd. has secured an 80-year lease for a commercial plot in Mumbai's Bandra Kurla Complex for Rs 1,302 crore. The company plans to develop a 250-key luxury hotel and mixed-use projects on the 8,411.88 square metre plot. This announcement comes a day after the company's stock market debut, where it listed below its IPO price.",
            "Sentiment": "positive",
            "PublishDate": 1748958563000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schloss Bangalore Ltd.: Hong Kong Firm Acquires Rs 73 Crore Stake on Listing Day",
            "Summary": "Ward Ferry Management, through WF Asian Reconnaissance Fund, bought 17 lakh shares of Schloss Bangalore Ltd. at Rs 434.13 each on its stock market debut. The stock closed at Rs 435.55 on NSE, up 6.85% from its IPO price, despite opening at a discount.",
            "Sentiment": "neutral",
            "PublishDate": 1748876806000,
            "Source": "block_deals"
        },
        {
            "Title": "Schloss Bangalore: Leela Hotels Shares List at 7% Discount to IPO Price",
            "Summary": "Schloss Bangalore, operating The Leela brand, listed on NSE at ₹406 and BSE at ₹406.50, a 7% discount to its IPO price of ₹435. The IPO was subscribed 4.50 times overall. The company raised ₹2,500 crore through fresh issue and ₹1,000 crore via OFS. It plans to use ₹2,300 crore for debt repayment.",
            "Sentiment": "negative",
            "PublishDate": 1748838376000,
            "Source": "normal_news"
        }
    ]
}