{
    "Symbol": "THEMISMED",
    "ISIN": "INE083B01024",
    "News": [
        {
            "Title": "Themis Medicare Allots 60,000 Shares Under ESOP",
            "Summary": "Themis Medicare Limited allotted 60,000 equity shares under its Employee Stock Option Scheme 2012, increasing paid-up share capital from 9.20 crores to 9.21 crores shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765463340519,
            "Source": "co_actions_results"
        },
        {
            "Title": "Themis Medicare Reports Q2 FY26 Results with 31% API Business Growth Despite Formulations Headwinds",
            "Summary": "Themis Medicare reported consolidated revenue of Rs 78 crore for Q2 FY26 with API business growing 31% year-on-year in H1 FY26, while facing disruption in a high-margin major business line under regulatory investigation. The company expects positive development on the regulatory matter by March 2026 and continues focusing on hospital business expansion and operational efficiency improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1763061207862,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare Reports Loss in Q2 FY2026, Withdraws Merger with Gujarat Themis Biosyn",
            "Summary": "Themis Medicare Limited reported a net loss of Rs 635.55 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 1,337.25 lakhs in the same period last year. Revenue from operations declined to Rs 7,799.41 lakhs from Rs 11,700.99 lakhs year-on-year. The company's Board withdrew the proposed merger scheme with Gujarat Themis Biosyn Limited, which was originally approved in November 2024. Gujarat Themis Biosyn decided to focus on its core fermentation-based pharmaceutical business and withdrew from the merger in June 2025. The company received approval for striking off its UK subsidiary Carpo Medicals Limited, resulting in exceptional items of Rs 129.39 lakhs. Themis Medicare will continue focusing on its domestic pharmaceutical formulations business. The company operates solely in the pharmaceuticals segment and reported total expenses of Rs 8,642.11 lakhs for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1763022056123,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare Reports Q2 Financial Loss After Previous Year Profit",
            "Summary": "Themis Medicare reported an EBITDA loss of 31 million rupees in Q2, compared to a gain of 170 million rupees in the same quarter of the previous year. The company also posted a net loss of 54 million rupees versus a profit of 99 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1763020340043,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare's Independent Woman Director Ms. Manjul Sandhu Completes Term",
            "Summary": "Themis Medicare Limited announced that Ms. Manjul Sandhu (DIN: 00330363) completed her term as Independent Woman Director on November 10, 2025, and ceased to hold the position from the close of business hours that day. The Board expressed appreciation for her contributions during her tenure. Ms. Sandhu served as a Non-Executive Independent Woman Director and was a member of the Corporate Social Responsibility Committee and Risk Management Committee. The company made this disclosure under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762821354087,
            "Source": "corporate_governance"
        },
        {
            "Title": "Themis Medicare Declares Rs 0.50 Per Share Dividend, Appoints New Secretarial Auditor and Independent Director",
            "Summary": "Themis Medicare Limited has declared a dividend of Rs 0.50 per equity share (50% on face value of Re 1) totaling Rs 4.60 crore for the financial year ended March 31, 2025. The company appointed M/s. SAV & Associates LLP as Secretarial Auditor for five consecutive financial years from 2026 to 2030, with CS Shirish Shetye as the representative. Additionally, Ms. Neha Thakore has been appointed as Independent Woman Director effective August 1, 2025, for a five-year term until July 31, 2030. Ms. Thakore brings over 25 years of pharmaceutical industry experience and serves as Managing Partner of Rifa Pharma and COO & Director at Avik Pharmaceutical Ltd. She also holds leadership positions in industry committees including Chairperson of IDMA POSH, HR & ESG Committees.",
            "Sentiment": "positive",
            "PublishDate": 1757688115856,
            "Source": "corporate_action"
        },
        {
            "Title": "Themis Medicare Reports Q1 Net Loss of 142 Million Rupees",
            "Summary": "Themis Medicare reported a consolidated net loss of 142 million rupees in Q1, compared to a profit of 247 million rupees in the same period last year. The company's revenue declined to 976 million rupees from 1.3 billion rupees year-over-year. EBITDA turned negative with a loss of 101 million rupees, contrasting with a gain of 292 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754266116634,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare Reports Loss in Q1, Appoints New Directors and Sets Dividend Record Date",
            "Summary": "Themis Medicare Limited's Board approved quarterly results showing a standalone net loss of Rs 1,537.37 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 1,871.47 lakhs in the same quarter last year. Revenue from operations declined to Rs 9,757.77 lakhs from Rs 12,299.38 lakhs year-over-year. The company appointed Ms. Neha Thakore as Additional Non-Executive Woman Independent Director for a 5-year term and Mr. Viraj Save as Executive President - Sales & Marketing. The Board set September 5, 2025 as the record date for dividend entitlement for the financial year ended March 31, 2025. The company withdrew its proposed merger scheme with Gujarat Themis Biosyn Limited and provided for investments and receivables of Rs 129.39 lakhs related to the dissolution of its UK subsidiary Carpo Medicals Limited.",
            "Sentiment": "negative",
            "PublishDate": 1754053957796,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare Reports Q1 Loss as Revenue Declines",
            "Summary": "Themis Medicare reported a consolidated net loss of 142 million rupees in Q1, compared to a profit of 247 million rupees in the same period last year. The company's EBITDA turned negative at a loss of 101 million rupees, versus a gain of 292 million rupees year-over-year. Revenue declined to 976 million rupees from 1.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754053562028,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare Reports Q4 Revenue Decline and Net Loss",
            "Summary": "Themis Medicare experienced a 26.70% decrease in Q4 revenue compared to the previous quarter. The company reported a consolidated net loss of 96.6 million rupees for Q4, compared to a profit of 66.4 million rupees in the same quarter last year. However, it showed an improvement from the previous quarter, where it had a profit of 5.2 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1747760678000,
            "Source": "result"
        },
        {
            "Title": "Themis Medicare Reports Q3 EBITDA and Margin Results",
            "Summary": "Themis Medicare has reported its Q3 EBITDA at 85 million rupees, compared to 81 million rupees in the same quarter last year, showing a year-over-year increase. However, the company's Q3 EBITDA margin decreased to 9.09% from 9.77% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739536384000,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare Reports Significant Drop in Q3 Net Profit",
            "Summary": "Themis Medicare has reported a substantial decrease in its third-quarter consolidated net profit, which fell to 5 million rupees from 74 million rupees in the same period last year. However, the company's revenue showed growth, increasing to 938 million rupees from 825 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739536378000,
            "Source": "earnings"
        },
        {
            "Title": "Themis Medicare Announces Merger with Gujarat Themis Biosyn",
            "Summary": "Themis Medicare has announced the amalgamation of Gujarat Themis Biosyn Ltd (GTBL) with itself. As part of the merger, Themis Medicare (TML) will issue 118 shares for every 100 shares held in GTBL.",
            "Sentiment": "neutral",
            "PublishDate": 1731944390000,
            "Source": "corporate_action"
        },
        {
            "Title": "Themis Medicare Terminates API Business Transfer Agreement with Subsidiary",
            "Summary": "Themis Medicare has announced the termination of an agreement with one of its units regarding the transfer of its Active Pharmaceutical Ingredients (API) business. This decision suggests a significant change in the company's strategic plans for its API division.",
            "Sentiment": "neutral",
            "PublishDate": 1731943398000,
            "Source": "corporate_action"
        },
        {
            "Title": "Themis Medicare Reports Significant Q2 EBITDA Growth",
            "Summary": "Themis Medicare has reported a substantial increase in its Q2 EBITDA, rising from 32.6 million rupees in the previous year to 170 million rupees this year. The company's EBITDA margin also improved significantly, increasing from 4.44% to 17.09% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729860220000,
            "Source": "result"
        },
        {
            "Title": "Themis Medicare Reports Strong Q2 Revenue Growth",
            "Summary": "Themis Medicare, a pharmaceutical company, has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 996 million rupees, compared to 735 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729860210000,
            "Source": "result"
        },
        {
            "Title": "Themis Medicare Reports Q2 Net Profit Increase",
            "Summary": "Themis Medicare's Q2 net profit rose to 99 million rupees, up from 71 million rupees year-over-year. The company also saw a significant increase from the previous quarter's 187 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729860200000,
            "Source": "result"
        }
    ]
}