{
    "Symbol": "THERMAX",
    "ISIN": "INE152A01029",
    "News": [
        {
            "Title": "Thermax Board Approves Wind Energy Subsidiaries Merger",
            "Summary": "Thermax Limited announces board approval for amalgamation scheme between step-down subsidiaries Jalansar Wind Energy and Kanakal Wind Energy, both engaged in renewable energy business.",
            "Sentiment": "neutral",
            "PublishDate": 1770206283341,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thermax Q3 Profit Surges 76% to ₹2.04 Billion",
            "Summary": "Thermax reported strong Q3 performance with consolidated net profit jumping 76% YoY to ₹2.04 billion, while revenue grew 4.2% to ₹26.35 billion, demonstrating robust operational execution.",
            "Sentiment": "positive",
            "PublishDate": 1770041851071,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thermax-HPCL sign MoU for sustainable energy solutions",
            "Summary": "Thermax Limited and HPCL signed a strategic MoU at India Energy Week 2026 to collaborate on HP AEM electrolysers, CO2 capture solutions, bio-pyrolysis oil processing and other emerging energy technologies.",
            "Sentiment": "positive",
            "PublishDate": 1769750355623,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thermax sets up Saudi Arabia subsidiary",
            "Summary": "Thermax Limited announces incorporation of wholly owned step-down subsidiary Thermax Energy Solutions Company in Saudi Arabia for on-site services and maintenance operations.",
            "Sentiment": "positive",
            "PublishDate": 1769613258319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thermax Gets Credit Rating Boost from Crisil",
            "Summary": "Crisil Ratings reaffirmed Thermax Limited's credit ratings with AA+ stable long-term and A1+ short-term ratings, while enhancing total bank loan facilities from ₹4,270 crores to ₹5,500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768886562265,
            "Source": "stocks"
        },
        {
            "Title": "Thermax CHRO Jasmeet Bhatia Resigns from Company",
            "Summary": "Thermax Limited announces resignation of Executive Vice President and Chief Human Resources Officer Jasmeet Bhatia, effective January 16, 2026, after serving three-month notice period.",
            "Sentiment": "neutral",
            "PublishDate": 1768568894084,
            "Source": "stocks"
        },
        {
            "Title": "Thermax Gets CARE A1+ Rating for Commercial Papers",
            "Summary": "CareEdge Ratings assigns CARE A1+ credit rating to Thermax Limited's commercial papers, citing strong market position, diversified portfolio, and healthy financial profile with 19% CAGR growth over FY22-FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768289449622,
            "Source": "stocks"
        },
        {
            "Title": "Thermax Plans to Expand FEPL to 1GW with Partner",
            "Summary": "Thermax announces plans to expand its First Energy Private Limited (FEPL) capacity to 1GW and will bring a suitable partner on board for this expansion initiative.",
            "Sentiment": "positive",
            "PublishDate": 1767766813845,
            "Source": "stocks"
        },
        {
            "Title": "Thermax Subsidiary Sells Back Acquired Shares",
            "Summary": "Thermax's subsidiary First Energy Private Limited sells back 100% shareholding of Onix-Two Enersol Private Limited to original seller for ₹1.00 lakh due to non-fulfillment of closing conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1767452498565,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thermax Receives GST Penalty of ₹11.86 Lakh",
            "Summary": "Thermax Limited received a GST assessment order imposing a penalty of ₹11.86 lakh from State Tax Officer, Jamshedpur for input tax credit mismatch with supplier returns.",
            "Sentiment": "negative",
            "PublishDate": 1767263473819,
            "Source": "stocks"
        },
        {
            "Title": "Thermax Subsidiary Creates New Step-Down Entity",
            "Summary": "Thermax's subsidiary First Energy establishes a new wholly owned step-down subsidiary named First Energy 15 Pvt Ltd, expanding the company's corporate structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765894777522,
            "Source": "stocks"
        },
        {
            "Title": "Thermax Wins ₹218.46 Cr Court Battle Against RCF",
            "Summary": "High Court sets aside arbitral award, orders customer to refund ₹218.46 crores to Thermax with 6% interest. Court grants four-week stay for appellate remedy.",
            "Sentiment": "positive",
            "PublishDate": 1765376716378,
            "Source": "stocks"
        },
        {
            "Title": "Thermax Wins Court Battle as Bombay High Court Sets Aside Rs. 250 Crore Arbitral Award",
            "Summary": "The Bombay High Court set aside an arbitral award dated June 5, 2023, that had directed Thermax Limited to pay Rs. 173.72 crores plus interest and repair costs, with an estimated total financial impact of Rs. 250 crores. The court has directed the claimant to refund the entire deposit amount of Rs. 218.45 crores along with 6% annual interest to Thermax, though granted a four-week stay on the judgment's operation.",
            "Sentiment": "positive",
            "PublishDate": 1765358986685,
            "Source": "stock"
        },
        {
            "Title": "Bombay High Court Cancels Arbitral Award Against Thermax",
            "Summary": "The Bombay High Court has cancelled an arbitral award that was previously issued against Thermax. This legal development removes a potential financial liability for the engineering and energy solutions company.",
            "Sentiment": "positive",
            "PublishDate": 1765292927484,
            "Source": "stock"
        },
        {
            "Title": "Thermax Celebrates 30 Years of NSE Listing with Ceremonial Bell-Ringing Event",
            "Summary": "Thermax marked 30 years of NSE listing with a ceremonial event attended by NSE MD CEO Ashish Chauhan and company leadership, highlighting its transformation from a boiler manufacturer to an energy transition solutions provider. The company's revenue expanded from Rs. 470 crores in FY1995-96 to Rs. 10,389 crores in FY2024-25, with manufacturing capabilities growing to 16 facilities globally.",
            "Sentiment": "positive",
            "PublishDate": 1765190608073,
            "Source": "stock"
        },
        {
            "Title": "Thermax Subsidiary Secures Rs. 580 Crore Utility Boiler Order from Dangote Industries Nigeria",
            "Summary": "Thermax Babcock Wilcox Energy Solutions Limited (TBWES), a wholly owned subsidiary of Thermax, secured an order worth more than Rs. 580 crore from Dangote Industries for utility boilers and associated systems for their refinery and petrochemical complex in Nigeria. The order includes four units of 400 TPH high-pressure utility boilers with a 22-month delivery period, continuing Thermax's long-standing partnership with the West African conglomerate that began in 2017.",
            "Sentiment": "positive",
            "PublishDate": 1764145999581,
            "Source": "order&deals"
        },
        {
            "Title": "Thermax Secures Major Order Worth Rs 5.8 Billion",
            "Summary": "Thermax has secured a significant order valued at Rs 5.8 billion, marking a substantial business win for the company. This large order represents a notable addition to the company's order book and demonstrates strong demand for its services.",
            "Sentiment": "positive",
            "PublishDate": 1764145723333,
            "Source": "order&deals"
        },
        {
            "Title": "Thermax Limited Receives 2.35 Crore Equity Shares from Subsidiary TCSPL",
            "Summary": "Thermax Chemical Solutions Private Limited (TCSPL), a wholly owned subsidiary of Thermax Limited, has allotted 2,35,00,000 equity shares of Rs. 10 each on rights basis to its parent company. The share allotment is part of additional equity investment for further investment in Fortmax Chemicals India Private Limited, a subsidiary of TCSPL.",
            "Sentiment": "neutral",
            "PublishDate": 1763717911403,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax Reports 6% Rise in Order Booking to Rs 3,551 Crore in Q2 FY26, Revenue Drops 5%",
            "Summary": "Thermax Limited reported order booking of Rs 3,551 crore in Q2 FY2025-26, up 6% from the previous year, driven by improved performance in Industrial Products segment. However, revenue declined 5% to Rs 2,474 crore compared to the same period last year. The company's profit before tax dropped significantly by 35% to Rs 174 crore, while profit after tax fell 40% to Rs 119 crore. Order balance stood at Rs 12,300 crore, up 6% year-on-year. The Industrial Products segment showed strong order booking growth of 18%, while Industrial Infra segment saw a 16% decline in order booking. Green Solutions segment reported exceptional 415% growth in order booking, partly due to a change in reporting methodology by subsidiary TOESL. The company highlighted several project wins including data center cooling solutions, biomass boilers, and renewable energy projects. Thermax noted that profitability in Industrial Infra was impacted by lower margins due to cost overruns, while the Chemicals segment faced pressure from higher fixed costs and input cost increases.",
            "Sentiment": "neutral",
            "PublishDate": 1762896268106,
            "Source": "earnings"
        },
        {
            "Title": "Thermax Reports ₹10,389 Crore Revenue, Expands Into Data Center Cooling and Biofuel Markets",
            "Summary": "Thermax reported revenue of ₹10,389 crore with operations spanning over 90 countries. The company secured data center cooling orders exceeding 100 MW capacity and entered the biofuel market through 1G ethanol projects. During Q2FY26, Thermax commissioned compressed biogas (CBG) plants producing approximately 2,700 tons. The company maintains a strong pipeline across industrial boilers, emission control systems, and water treatment solutions. Thermax is focusing on sustainability initiatives, decarbonization efforts, and clean energy technology integration as part of its global expansion strategy targeting energy transition opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1762875101487,
            "Source": "stock"
        },
        {
            "Title": "Thermax Reports Decline in Q2 Financial Performance",
            "Summary": "Thermax reported consolidated net profit of 1.2 billion rupees for Q2, down from 1.97 billion rupees in the same period last year. Revenue decreased to 24.7 billion rupees from 26 billion rupees year-over-year. EBITDA fell to 1.7 billion rupees compared to 2.77 billion rupees previously, with EBITDA margin contracting to 6.99% from 10.64% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762863349375,
            "Source": "earnings"
        },
        {
            "Title": "Thermax's Step-Down Subsidiary First Energy 11 Private Limited Ceases to be Wholly Owned",
            "Summary": "Thermax Limited announced that First Energy 11 Private Limited (FE11PL) is no longer a wholly owned step-down subsidiary of the company. This change occurred after FE11PL allotted 3,45,87,000 equity shares to Garden Silk Mills Private Limited, which is identified as a Captive User under the Electricity Act, 2003. The company had previously provided intimations regarding this matter in July 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761661444331,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax Board Approves Merger with Subsidiary Buildtech and Rs 82 Crore Investment in Group Companies",
            "Summary": "Thermax Limited's board approved three major corporate actions on October 17, 2025. The company approved a scheme of merger by absorption of its wholly-owned subsidiary Buildtech Products India Private Limited, with an appointed date of April 1, 2025, subject to National Company Law Tribunal and other regulatory approvals. Buildtech, acquired in October 2024, operates in construction materials and chemicals manufacturing with Rs 28.6 crores total income and Rs 20.9 crores net worth as of March 31, 2025. The merger aims to consolidate business operations, enhance synergies, simplify group structure, and reduce compliance costs. No shares will be issued as consideration since Buildtech is wholly-owned by Thermax. Additionally, the board approved Rs 40 crores equity investment in Thermax Chemical Solutions Private Limited for further investment in Fortmax Chemicals India Private Limited, which operates in specialty chemicals manufacturing. The board also approved up to Rs 42 crores support through equity or loan to Enernxt Private Limited, a Bio CNG business subsidiary, via Thermax Onsite Energy Solutions Limited. Both investments are intended to meet capital expenditure and operational expenses of the respective subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1760705390239,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax's Step-Down Subsidiary Fortmax Chemicals Ceases to be Wholly Owned After Share Allotment to Brazilian Company",
            "Summary": "Thermax Limited announced that Fortmax Chemicals India Private Limited (FCIPL) has ceased to be its wholly owned step-down subsidiary. The Board of Directors of FCIPL approved the allotment of 44,10,000 equity shares of face value Rs. 10 each at par to Oswaldo Cruz Química Indústria e Comércio Ltda., Brazil (OCQ). This allotment represents 49% of FCIPL's equity share capital. Following the restructuring, the shareholding pattern shows Thermax Chemical Solutions Private Limited holding 51% and OCQ holding 49%. The company stated there are no benefits to the promoter/promoter group/group companies from this restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1758025244981,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax Invests ₹115 Crores in Renewable Energy Subsidiary First Energy 10",
            "Summary": "Thermax has infused ₹115 crores into its step-down renewable energy subsidiary First Energy 10 Pvt. Ltd. The investment represents the company's capital allocation toward its renewable energy operations through this subsidiary entity.",
            "Sentiment": "positive",
            "PublishDate": 1757424114060,
            "Source": "stock"
        },
        {
            "Title": "Thermax Acquires 23.03% Stake in Subsidiary to Make it Wholly Owned",
            "Summary": "Thermax Limited signed a Share Purchase Agreement with Everenviro Resource Management Private Limited to acquire a 23.03% equity stake in its subsidiary Thermax Bioenergy Solutions Private Limited (TBSPL). The acquisition involves 87,50,000 equity shares for Rs 16.71 crores in cash consideration. Upon completion, TBSPL will become a wholly owned subsidiary of Thermax. TBSPL operates in Technology, Engineering, Procurement & Construction for Bio-CNG Projects and was incorporated on August 12, 2022. The company's turnover has grown from Rs 48.04 crores in March 2023 to Rs 569.80 crores in March 2025. The transaction is expected to complete within 30 days and is classified as a related party transaction conducted on an arm's length basis.",
            "Sentiment": "positive",
            "PublishDate": 1755102752183,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax Signs Technology Licensing Agreement with HydrogenPro for Gas Separator Technology",
            "Summary": "Thermax has entered into a technology licensing deal with HydrogenPro for gas separator technology. The agreement involves the licensing of specialized technology related to gas separation systems.",
            "Sentiment": "positive",
            "PublishDate": 1755002919246,
            "Source": "stock"
        },
        {
            "Title": "Thermax Officials Forecast 12-13% Chemical Margin Growth and Double-Digit Segment Expansion",
            "Summary": "Thermax company officials have projected margin growth of 12-13% for their chemicals business in Q2. The management expects double-digit growth across all business segments during this period.",
            "Sentiment": "positive",
            "PublishDate": 1754126609036,
            "Source": "stock"
        },
        {
            "Title": "Thermax Shareholders Approve Ashish Bhandari's Re-appointment as MD & CEO for Five Years",
            "Summary": "Thermax Limited shareholders approved the re-appointment of Ashish Bhandari as Managing Director, CEO, and Key Managerial Personnel for a five-year term from September 1, 2025 to August 31, 2030 at the 44th Annual General Meeting held on July 31, 2025. Bhandari has been leading Thermax Group as MD & CEO since September 1, 2020, focusing on advancing the company's strategic direction in energy transition and sustainability. He brings over two decades of experience from world-leading organizations and previously served as Vice President for India and South Asia regions at Baker Hughes. Under his leadership, Thermax has been driving innovation, digital transformation using AI and IoT technologies, and expanding into emerging sectors. Bhandari envisions that by 2030, a significant portion of Thermax's portfolio will comprise businesses currently in nascent stages. He is not related to any other Director on the Board and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1754056474583,
            "Source": "corporate_governance"
        },
        {
            "Title": "Thermax Plans Green Energy Expansion with ₹11,376 Crore Order Backlog",
            "Summary": "Thermax has outlined plans for long-term green energy expansion, supported by an order backlog of ₹11,376 crore. The company is focusing on clean hydrogen technology, biomass boilers, and waste heat recovery solutions. The industrial infrastructure and green solutions segments are expected to boost profits ahead of a planned capital expenditure surge.",
            "Sentiment": "positive",
            "PublishDate": 1753972190606,
            "Source": "stock"
        },
        {
            "Title": "Thermax Reports Mixed Q1 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "Thermax reported quarterly results showing EBITDA of 2.25 billion rupees compared to 1.41 billion rupees in the same period last year. The company's EBITDA margin improved to 10.47% from 6.46% year-over-year. Consolidated net profit increased to 1.52 billion rupees from 1.16 billion rupees in the previous year. However, revenue declined to 21.5 billion rupees from 21.84 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753957926368,
            "Source": "earnings"
        },
        {
            "Title": "Thermax Executive Council Member Pravin Karve to Retire on July 31, 2025",
            "Summary": "Thermax Limited announced that Mr. Pravin Karve, a member of the Executive Council, will retire effective July 31, 2025. Following his retirement, Karve will cease to be Senior Management Personnel of the company. The retirement represents a planned departure rather than a resignation, and the company has notified stock exchanges BSE and NSE of this leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1753866779895,
            "Source": "corporate_governance"
        },
        {
            "Title": "Thermax Invests ₹102 Crore in Renewable Subsidiary First Energy",
            "Summary": "Thermax has invested ₹102 crore in its renewable energy subsidiary First Energy as part of green energy initiatives. The investment represents the company's commitment to expanding its renewable energy operations through its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753286776983,
            "Source": "stock"
        },
        {
            "Title": "Thermax Schedules Q1 FY26 Earnings Call",
            "Summary": "Thermax has scheduled its Q1 FY26 earnings call for August 1, 2025, at 11:15 AM. The company will discuss its quarterly financial results during this call.",
            "Sentiment": "neutral",
            "PublishDate": 1752832033000,
            "Source": "default"
        },
        {
            "Title": "Thermax Announces Closure of First Energy 11 Unit",
            "Summary": "Thermax has announced the closure of its First Energy 11 unit. The news indicates a significant operational change for the company, potentially impacting its energy-related business segment. However, the provided information is limited, and no further details about the reasons for the closure or its potential impacts are available.",
            "Sentiment": "neutral",
            "PublishDate": 1751983548000,
            "Source": "default"
        },
        {
            "Title": "Thermax Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 307,373 shares of Thermax Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 3550.00 per share. The total value of the trade amounted to Rs. 109.12 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749457375000,
            "Source": "block_details"
        },
        {
            "Title": "Thermax Reports Q4 Profit and Revenue Growth, Declares Dividend",
            "Summary": "Thermax announced its Q4 financial results, showing a year-over-year increase in both net profit and revenue. The company's consolidated net profit rose to 2.05 billion rupees from 1.9 billion rupees in the previous year. Revenue increased to 30.8 billion rupees from 27.64 billion rupees. Additionally, Thermax has recommended a dividend of 14 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747008711000,
            "Source": "default"
        },
        {
            "Title": "Thermax Reports Q4 Results and Dividend Announcement",
            "Summary": "Thermax has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 2.05 billion rupees from 1.9 billion rupees year-over-year. Revenue rose to 30.8 billion rupees from 27.64 billion rupees in the same period. EBITDA improved to 2.99 billion rupees, though the EBITDA margin slightly decreased to 9.69%. The company has recommended a dividend of 14 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746796001000,
            "Source": "result"
        },
        {
            "Title": "Thermax Increases Stake in Subsidiary Thermax Bioenergy Solutions",
            "Summary": "Thermax has increased its equity stake in its subsidiary, Thermax Bioenergy Solutions Pvt Ltd (TBSPL), from 65% to 76.97%. This was achieved by subscribing to 1.3 crore new equity shares at ₹10 each.",
            "Sentiment": "positive",
            "PublishDate": 1746632275000,
            "Source": "default"
        },
        {
            "Title": "Thermax to Consider Q4 Results on May 9",
            "Summary": "Thermax Limited has announced that it will consider its fourth quarter (Q4) financial results on May 9. This is a routine corporate announcement regarding the scheduled date for the company's quarterly earnings review.",
            "Sentiment": "neutral",
            "PublishDate": 1744893438000,
            "Source": "default"
        },
        {
            "Title": "Thermax Incorporates New Wholly Owned Subsidiary",
            "Summary": "Thermax Limited has announced the incorporation of a new wholly owned step-down subsidiary named Fortmax Chemicals India Pvt Ltd (FCIPL). This move represents a significant corporate action, potentially expanding Thermax's operations in the chemical sector.",
            "Sentiment": "neutral",
            "PublishDate": 1744387962000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax Sells Stake in Covacsis Technologies for 100 Million Rupees",
            "Summary": "Thermax Limited has entered into an agreement to sell its stake in Covacsis Technologies. The company received a consideration of 100 million rupees (approximately $1.2 million) from the sale.",
            "Sentiment": "neutral",
            "PublishDate": 1743679431000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax Ltd. Sees Block Trade of Rs. 23 Crores on NSE",
            "Summary": "A significant block trade occurred for Thermax Ltd. on the National Stock Exchange (NSE). Approximately 65,738 shares were traded at a price of Rs. 3498.60 per share, totaling around Rs. 23 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1742791340000,
            "Source": "block_deals"
        },
        {
            "Title": "Thermax Ltd: Forms Joint Venture with Brazil's OCQ for Acrylic Resin Production",
            "Summary": "Thermax's subsidiary enters a joint venture with Brazil's OCQ, taking a 51% stake. The new entity will manufacture acrylic resins in India, starting with a production line in Gujarat. This move expands Thermax's chemical portfolio and marks its entry into a new business line.",
            "Sentiment": "positive",
            "PublishDate": 1741614649000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax's Subsidiary Status Change",
            "Summary": "Thermax Vebro Polymers India, a unit of Thermax, has ceased to be a wholly owned step-down subsidiary of the company. This change in subsidiary status indicates a shift in the corporate structure of Thermax.",
            "Sentiment": "neutral",
            "PublishDate": 1741006269000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thermax Ltd: CEO Predicts Strong Q4 Despite Muted Q3 Results",
            "Summary": "Thermax CEO Ashish Bhandari expects a strong Q4 performance due to quick revenue recovery in January, improved project mix, and 40% growth in industrial product orders. The company reported a 51% YoY drop in Q3 net profit but sees better opportunities ahead, including in government projects.",
            "Sentiment": "positive",
            "PublishDate": 1738933144000,
            "Source": "earnings"
        },
        {
            "Title": "Thermax Reports Mixed Q3 Results with Slight EBITDA Growth",
            "Summary": "Thermax, an engineering solutions company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased marginally to 1.89 billion rupees from 1.87 billion rupees year-over-year. However, the EBITDA margin decreased to 7.54% from 8.06% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738660823000,
            "Source": "earnings"
        },
        {
            "Title": "Thermax Reports Q3 Revenue Increase",
            "Summary": "Thermax Limited has reported a revenue of 25.08 billion rupees for the third quarter, compared to 23.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738660797000,
            "Source": "earnings"
        },
        {
            "Title": "Thermax Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Thermax Limited, an Indian engineering company, has reported a consolidated net profit of 1.2 billion rupees for the third quarter, down from 2.37 billion rupees in the same period last year. This represents a significant year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738660752000,
            "Source": "earnings"
        },
        {
            "Title": "Thermax: CEO Foresees Sustained Growth as Major Projects Resume",
            "Summary": "Thermax's CEO anticipates continued growth in the second half of the fiscal year, driven by the resumption of large-scale projects.",
            "Sentiment": "positive",
            "PublishDate": 1731568133000,
            "Source": "normal_news"
        }
    ]
}