{
    "Symbol": "THOMASCOTT",
    "ISIN": "INE480M01011",
    "News": [
        {
            "Title": "Thomas Scott Board Meet Set for Feb 14 Q3FY26 Results",
            "Summary": "Thomas Scott (India) Limited has scheduled a board meeting for February 14, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770386703369,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bang Overseas Reports Fire Incident at Bhiwandi Warehouse, Operations Temporarily Halted",
            "Summary": "Bang Overseas Limited experienced a fire incident at its warehouse facility in Bhiwandi on November 25, 2025, causing damage to part of the building and certain assets including stock with no casualties reported. The company has temporarily halted operations at the affected warehouse, reported the incident to insurance company for claims, and is taking necessary actions to resume operations while assessing the exact quantum of loss.",
            "Sentiment": "negative",
            "PublishDate": 1764153456977,
            "Source": "stock"
        },
        {
            "Title": "Thomas Scott India Reports 40% Revenue Growth to Rs 57 Crore in Q2 FY26",
            "Summary": "Thomas Scott India Limited achieved its best quarterly sales with revenue from operations at Rs 57 crore, up 40% year-on-year, while EBITDA surged 93% to Rs 8.5 crore with margins at 14.94%. The technology-enabled fashion retailer operates 15+ brands including flagship Thomas Scott and licensed brands like Nautica and Aeropostale, with strong performance driven by higher sales volumes and improved pricing realization.",
            "Sentiment": "positive",
            "PublishDate": 1763444391871,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Scott India Reports 27.9% Jump in Half-Year Profit to Rs 818.14 Lacs",
            "Summary": "Thomas Scott (India) Limited announced unaudited financial results showing total comprehensive income of Rs 818.14 lacs for the half-year ended September 30, 2025, compared to Rs 405.20 lacs in the previous year. The textile manufacturing company's quarterly results showed profit before tax of Rs 729.87 lacs versus Rs 357.43 lacs in the same quarter last year, with total income rising to Rs 5,693.67 lacs from Rs 4,119.33 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1763061141195,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Scott (India) Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Thomas Scott (India) Limited's Board of Directors approved the unaudited standalone financial results for the quarter ended June 30, 2025, during a meeting held on August 14, 2025. The board meeting took place at the company's corporate office in Mumbai, commencing at 1:00 PM and concluding at 2:30 PM. The approved results, along with a limited review report from statutory auditors M/s. Bharat Gupta & Co., have been submitted to BSE and NSE. Managing Director Vedant Bang signed the regulatory submissions.",
            "Sentiment": "neutral",
            "PublishDate": 1755163894802,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Scott (India) Limited Reports Fire Incident at Gurgaon Factory",
            "Summary": "Thomas Scott (India) Limited experienced a fire incident on July 27, 2025, at its factory premises located at Plot No. 423, Ground Floor, Pace City II, Sector 37, Gurgaon. The fire caused damage to part of the factory building and certain machinery/assets, with the exact quantum of loss currently being assessed. No personnel were injured or killed in the incident. Operations at the affected shed have been temporarily halted while the company coordinates with local authorities and files insurance claims. Management is working to resume operations and mitigate business impact.",
            "Sentiment": "negative",
            "PublishDate": 1753709162210,
            "Source": "stock"
        },
        {
            "Title": "Thomas Scott (India) Reports Q3 EBITDA Growth",
            "Summary": "Thomas Scott (India) has reported its Q3 financial results. The company's EBITDA increased to 55 million rupees, up from 33 million rupees in the same quarter last year. However, the EBITDA margin decreased to 12.20% from 13.97% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739362763000,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Scott (India) Reports Q3 Financial Results",
            "Summary": "Thomas Scott (India) has announced its financial results for the third quarter. The company reported a net profit of 30 million rupees, showing an increase from 24 million rupees year-over-year and 28 million rupees quarter-over-quarter. Revenue for Q3 stood at 454 million rupees, significantly up from 233 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739362666000,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Scott (India) Schedules Board Meeting to Discuss Fundraising",
            "Summary": "Thomas Scott (India) has announced a board meeting scheduled for December 21 to consider fundraising options for the company. This meeting suggests that the company may be planning to raise capital, potentially through various means such as issuing new shares, bonds, or other financial instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1734528115000,
            "Source": "corporate_action"
        }
    ]
}