{
    "Symbol": "THOMASCOOK",
    "ISIN": "INE332A01027",
    "News": [
        {
            "Title": "Thomas Cook India Q3 FY26 Results Show Strong Growth",
            "Summary": "Thomas Cook India reported 20% PBT growth in Q3 FY26, driven by strong forex performance with 41.5% EBIT margins and robust Sterling Holiday Resorts results.",
            "Sentiment": "positive",
            "PublishDate": 1770904684452,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling Delivers Record Q3 FY26 Results",
            "Summary": "Sterling Holiday Resorts reported record Q3 FY26 revenue of ₹1,582 million with 10% YoY growth, marking 24th consecutive profitable quarter. EBITDA margin maintained at 36% with debt-free balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1770732369549,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thomas Cook India Partners with Mauritius Tourism Authority",
            "Summary": "Thomas Cook India and SOTC Travel sign strategic MOU with Mauritius Tourism Promotion Authority to boost travel from India market through destination promotion and product development initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1770377565821,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Reports Mixed Q3 Results",
            "Summary": "Thomas Cook India posted a standalone net loss of ₹21.4 million in Q3 FY26 due to exceptional items related to new labour codes, despite strong nine-month performance with net profit of ₹1,003.9 million.",
            "Sentiment": "neutral",
            "PublishDate": 1770285337748,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thomas Cook Q3 Net Profit Drops 16% to ₹417M",
            "Summary": "Thomas Cook India reported Q3 consolidated net profit of ₹417 million, down from ₹496 million year-over-year, while revenue grew 4.3% to ₹21.5 billion from ₹20.61 billion in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1770284463708,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thomas Cook India Partners with Cinnamon Life Sri Lanka",
            "Summary": "Thomas Cook India and SOTC Travel have formed a strategic partnership with Cinnamon Life in Sri Lanka to capitalize on India's growing travel market potential.",
            "Sentiment": "positive",
            "PublishDate": 1770282418144,
            "Source": "stocks"
        },
        {
            "Title": "Sterling Launches Valley of Pine Resort in Lansdowne",
            "Summary": "Thomas Cook's subsidiary Sterling Holiday Resorts opens its ninth Uttarakhand property, a boutique mountain retreat near Gumkhal designed for drive-to travellers from Delhi NCR and Western UP.",
            "Sentiment": "positive",
            "PublishDate": 1770214315891,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Partners With Tamil Nadu Govt",
            "Summary": "Thomas Cook India and SOTC Travel have entered into a Memorandum of Understanding with the Tamil Nadu government to strengthen tourism partnerships and collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1770032691186,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India shares rise on Budget benefits",
            "Summary": "Thomas Cook India shares gained 5.3% following Union Budget 2026 announcement of reduced foreign tour charges, benefiting the travel and tourism sector.",
            "Sentiment": "positive",
            "PublishDate": 1769927798160,
            "Source": "union_budget"
        },
        {
            "Title": "Sterling Holiday Resorts Opens Arka Suites Puri",
            "Summary": "Thomas Cook's Sterling Holiday Resorts launches Arka Suites Puri, a luxury boutique hotel featuring spacious accommodations and enhanced privacy for guests.",
            "Sentiment": "positive",
            "PublishDate": 1769764268310,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook Opens New Forex Store in Bengaluru",
            "Summary": "Thomas Cook (India) Limited expands its Karnataka presence with a new forex outlet in JP Nagar, Bengaluru, bringing the city total to 11 stores. Launch includes promotional offers.",
            "Sentiment": "positive",
            "PublishDate": 1769667605707,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Q3 FY26 Earnings Call on Feb 6",
            "Summary": "Thomas Cook (India) Limited announces earnings conference call scheduled for February 6, 2026 at 4:00 p.m. IST to discuss Q3 & 9M FY26 unaudited financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769601015634,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sterling Holiday Resorts Opens New Resort in Jodhpur",
            "Summary": "Thomas Cook's Sterling Holiday Resorts launches Sterling Amargarh Jodhpur, expanding its footprint in Rajasthan with spacious event facilities and strategic location near cultural attractions.",
            "Sentiment": "positive",
            "PublishDate": 1769158805441,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Opens Fifth Nature Trails Resort",
            "Summary": "Thomas Cook (India) Ltd expands its Nature Trails portfolio with the launch of its fifth resort in Rishikesh, strategically positioned between Rishikesh and Haridwar to offer guests both spiritual and adventure tourism experiences.",
            "Sentiment": "positive",
            "PublishDate": 1768891375682,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook Board Meet on Feb 5 for Q3FY26 Results",
            "Summary": "Thomas Cook India schedules board meeting on February 5, 2026 to approve Q3FY26 unaudited financial results and consider postal ballot for director appointments including new independent director.",
            "Sentiment": "neutral",
            "PublishDate": 1768560145261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thomas Cook India Partners With Gujarat Government",
            "Summary": "Thomas Cook India announces strategic partnership with Gujarat Government to enhance domestic tourism opportunities and promote travel within the state.",
            "Sentiment": "positive",
            "PublishDate": 1768307254957,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Partners with Gujarat Government",
            "Summary": "Thomas Cook India signs strategic MOU with Gujarat Tourism to boost domestic tourism through focused destination promotion initiatives and structured training programs.",
            "Sentiment": "positive",
            "PublishDate": 1768306994490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thomas Cook India Launches 4th Nature Trails Resort in Goa",
            "Summary": "Thomas Cook India expands Nature Trails brand beyond Maharashtra with launch of Rock Valley resort in Ponda, Goa, featuring 15-acre property with adventure activities and infinity pools.",
            "Sentiment": "positive",
            "PublishDate": 1767861202924,
            "Source": "stocks"
        },
        {
            "Title": "Sterling Holiday Resorts Opens Second Sikkim Property",
            "Summary": "Thomas Cook's Sterling Holiday Resorts launches Sterling Mount Olive in Gangtok, marking its second property in Sikkim and expanding its presence in the northeastern tourism market.",
            "Sentiment": "positive",
            "PublishDate": 1767859248632,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook Subsidiary Shifts Office to Maharashtra",
            "Summary": "Thomas Cook (India) Limited's material subsidiary Sterling Holiday Resorts Limited has received shareholder approval to relocate its registered office from Tamil Nadu to Maharashtra, subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1767617381056,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Faces ₹1.54L GST Penalty",
            "Summary": "Thomas Cook (India) Limited receives GST penalty of ₹1,53,668 from Ernakulam authorities under CGST Act 2017, with total demand of ₹13.73 lakh including interest. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767187392891,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Receives ₹1.02 Cr Tax Demand",
            "Summary": "Thomas Cook (India) Limited received a tax demand of ₹1.02 crores from Haryana's Excise and Taxation officer, with additional interest and penalty charges totaling ₹88.05 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1767096241673,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Receives ₹2.80L GST Penalty Order",
            "Summary": "Thomas Cook India received a penalty order of ₹2,80,175 under CGST Act 2017 from tax authority on December 29, 2025. Company plans to file submission against the order.",
            "Sentiment": "negative",
            "PublishDate": 1767015162326,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Receives GST Order from Rajasthan",
            "Summary": "Thomas Cook (India) Limited receives regulatory order from Assistant Commissioner, Jaipur-I, Rajasthan regarding GST demand of ₹39.56 lakh with interest and penalty totaling ₹74.82 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1766744835051,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Receives GST Penalty Order",
            "Summary": "Thomas Cook India Limited received a regulatory order from Commercial Tax Officer, Chennai Central, imposing GST demand of ₹27.33 lakh, interest of ₹18.09 lakh, and penalty of ₹2.73 lakh under CGST Act 2017.",
            "Sentiment": "negative",
            "PublishDate": 1766485902396,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook Directors Complete Second Terms",
            "Summary": "Two independent directors of Thomas Cook (India) Limited completed their second consecutive five-year terms and ceased to be directors effective December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766478463366,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Appoints New Independent Director",
            "Summary": "Thomas Cook (India) Limited's board approves appointment of Gurumoorthy Mahalingam as Additional Non-Executive Independent Director for 5-year term starting December 19, 2025, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1766056045927,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Receives RBI Penalty Order",
            "Summary": "Thomas Cook (India) Limited received a regulatory order from the Reserve Bank of India on December 17, 2025, imposing a penalty of ₹1,79,000 for contravention of money changing activities regulations.",
            "Sentiment": "negative",
            "PublishDate": 1766038555238,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook Opens Third Outlet in Indore",
            "Summary": "Thomas Cook (India) Limited inaugurated its third outlet in Indore, Madhya Pradesh, expanding its network to 5 locations in the state to capitalize on growing travel demand from the region.",
            "Sentiment": "positive",
            "PublishDate": 1765541615785,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Launches AI Avatar TACY as Brand Ambassador",
            "Summary": "Thomas Cook India introduces TACY, an AI-powered digital avatar serving as brand ambassador and travel assistant, debuting with Europe Summer 2026 portfolio featuring 1,000+ guaranteed departures.",
            "Sentiment": "positive",
            "PublishDate": 1765526391882,
            "Source": "stocks"
        },
        {
            "Title": "Thomas Cook India Receives GST Penalty Orders Worth INR 8.58 Crore from Tax Authorities",
            "Summary": "Thomas Cook India received two GST penalty orders totaling INR 8.58 crore from Delhi South Commissionerate and West Bengal authorities for alleged short payment of GST amounts. The company plans to appeal both orders and states there is no material financial or operational impact on the entity.",
            "Sentiment": "negative",
            "PublishDate": 1765293993918,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Opens First Forex Outlet in Varanasi, Expands UP Presence to 5 Locations",
            "Summary": "Thomas Cook India inaugurated its first foreign exchange outlet in Varanasi to address increasing demand for forex services in the region. The expansion brings the company's total outlets in Uttar Pradesh to 5, with zero fees being offered to initial customers at the new location.",
            "Sentiment": "positive",
            "PublishDate": 1764917899568,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Reports Q2 FY26 Results with Mixed Performance Amid External Headwinds",
            "Summary": "Thomas Cook India's revenue grew 3% Y-o-Y to INR 20,738 million in Q2 FY26, with profit before tax maintaining at INR 1,098 million versus INR 1,096 million in Q2 FY25, despite weather disruptions and geopolitical challenges affecting domestic travel and hospitality segments. The company launched innovative forex solutions including partnership with Blinkit for 10-minute forex card delivery and expanded its resort portfolio to 65 properties, while facing margin pressures in travel business due to competitive pricing and external factors.",
            "Sentiment": "neutral",
            "PublishDate": 1763646464316,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Cook India Launches Europe Summer 2026 Holiday Packages with SOTC Travel",
            "Summary": "Thomas Cook India has introduced Europe Summer 2026 holiday packages through SOTC Travel, featuring over 60 guided tours with discounts up to ₹70,000 per couple. The packages include additional benefits such as free vacation or cruise options on select bookings, targeting travelers planning European holidays.",
            "Sentiment": "positive",
            "PublishDate": 1763621197349,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Seeks Shareholder Approval for ESOP Amendments and Pool Expansion",
            "Summary": "Thomas Cook (India) Limited has issued a postal ballot notice seeking shareholder approval to increase its ESOP 2024-EXECOM pool from 5.57 million to 6.57 million options and reduce vesting periods from 4 years to 3 years across multiple employee stock option schemes. The company also proposes extending these amended ESOP benefits to employees of subsidiary companies, with e-voting scheduled from November 20 to December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763558512522,
            "Source": "corporate_action"
        },
        {
            "Title": "Thomas Cook India Opens New Forex Store in Kottayam, Kerala",
            "Summary": "Thomas Cook India unveiled a newly designed foreign exchange store in Kottayam, Kerala, expanding its network to 14 outlets across the state with enhanced customer experience features and strategic location benefits. The outlet targets diverse customer segments including leisure travelers, business professionals, students, and NRIs, offering comprehensive forex services including prepaid travel cards, digital services, and overseas remittances.",
            "Sentiment": "positive",
            "PublishDate": 1763112165913,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Appoints New Chairman and Approves ESOP Amendments",
            "Summary": "Thomas Cook (India) Limited's Board of Directors designated Mr. Gopalakrishnan Soundarajan as Chairman of the Board and Company effective November 12, 2025. Soundarajan, a Non-Executive Director since May 2021, holds a Bachelor of Commerce degree and is a Chartered Accountant and CFA. He serves as Managing Director at Hamblin Watsa Investment Counsel Ltd and previously held senior positions at ICICI Lombard. The Board also approved amendments to three Employee Stock Option Schemes (ESOP 2013, ESOP 2018-EXECOM, and ESOP 2024-EXECOM), subject to shareholder approval. For ESOP 2024-EXECOM, the option pool is proposed to increase from 5.57 million to 6.57 million options. Additionally, the Board approved executing an addendum to a Joint Venture Agreement with Atirath Technologies Private Limited and Indian Horizon Marketing Services Limited, along with investment approval of up to Rs 27 million in the JV Company.",
            "Sentiment": "positive",
            "PublishDate": 1762991835512,
            "Source": "corporate_governance"
        },
        {
            "Title": "Thomas Cook India Reports 9% Revenue Growth to Rs 44,818 Mn in H1FY26 Despite Geopolitical and Weather Challenges",
            "Summary": "Thomas Cook (India) Limited reported revenue from operations growth of 9% year-on-year to Rs 44,818 million for H1FY26 and 3% growth to Rs 20,738 million for Q2FY26. PBT after exceptional items was maintained at Rs 2,211 million in H1FY26 versus Rs 2,187 million in H1FY25. The company faced headwinds from geopolitical events and weather disturbances in key domestic markets. Financial Services showed retail turnover increase of 13% for Q2FY26 and 9% for H1FY26, led by holidays and overseas education segments, maintaining healthy EBIT margins at 49% for Q2FY26. Travel Services revenue grew 12% in H1FY26 and 6% in Q2FY26. Sterling Holidays opened seven new properties during the quarter but profitability was impacted by higher setup costs and lower occupancy levels. Digiphoto Entertainment Imaging revenue declined 3% in H1FY26 and 6% in Q2FY26 due to geopolitical issues affecting Middle East markets. The Group maintained cash and bank balances of Rs 23,861 million as of September 30, 2025 versus Rs 20,739 million as of March 31, 2025. Thomas Cook India won two awards at the Adam Smith Awards Asia 2025 for Best Risk Management Solution and Best Investing Solution.",
            "Sentiment": "positive",
            "PublishDate": 1762988621009,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Cook India Reports Strong Q2 Performance with 480.7 Million Profit, Property Sale Boosts Results",
            "Summary": "Thomas Cook (India) Limited reported net profit of Rs. 480.7 million for the quarter ended September 30, 2025, compared to Rs. 554.8 million in the previous quarter and Rs. 216.6 million in the same quarter last year. Revenue from operations reached Rs. 5,501.5 million for the quarter. The company recognized an exceptional gain of Rs. 256.5 million from the sale of its property in Udyog Vihar Phase-III, Gurugram. For the half-year period, net profit stood at Rs. 1,028.3 million versus Rs. 300.7 million in the corresponding period last year. The company paid a dividend of Rs. 211.7 million to equity shareholders in September 2025. The Board approved the unaudited financial results in their meeting held on November 12, 2025. The company operates across three main segments: Financial Services, Travel and Related Services, and Leisure Hospitality & Resorts Business.",
            "Sentiment": "positive",
            "PublishDate": 1762967041959,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Cook India Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Thomas Cook India reported Q2 consolidated net profit of 664 million rupees compared to 649 million rupees in the same period last year. Revenue increased to 21 billion rupees from 20 billion rupees year-over-year. However, EBITDA declined to 1.1 billion rupees from 1.25 billion rupees, with EBITDA margin contracting to 5.22% from 6.21% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762953500043,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Cook India Schedules Q2FY26 Earnings Conference Call for November 14, 2025",
            "Summary": "Thomas Cook (India) Limited has announced an earnings conference call for analysts and investors scheduled for November 14, 2025, at 11:30 a.m. IST to discuss the company's Q2FY26 unaudited financial results. The call will be hosted by BK Securities and will feature senior management members providing key comments followed by an interactive Q&A session. The company's financial results announcement is set for November 12, 2025. Thomas Cook India is described as a leading integrated omni-channel travel and travel-related financial services company, established in 1881, offering services including foreign exchange, corporate travel, MICE, leisure travel, value-added services, and visa services. The company operates across 28 countries spanning 5 continents and has received multiple industry awards. Fairbridge Capital (Mauritius) Limited, a subsidiary of Fairfax Financial Holdings Limited, is the promoter with a 63.83% shareholding in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762431690980,
            "Source": "earnings"
        },
        {
            "Title": "Thomas Cook India's Desert Adventures Secures Saudi Tourism License",
            "Summary": "Desert Adventures, associated with Thomas Cook (India), has received a license from Saudi Arabia's Tourism Ministry. This licensing approval enables the company to operate tourism services in Saudi Arabia.",
            "Sentiment": "positive",
            "PublishDate": 1762265470757,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Launches Expanded China Holiday Packages with SOTC Travel",
            "Summary": "Thomas Cook India has unveiled a large China holidays collection in partnership with SOTC Travel. The company is capitalizing on new direct flights and increased demand for China travel. The collection includes new destinations and special travel experiences for customers.",
            "Sentiment": "positive",
            "PublishDate": 1762150004481,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India and SOTC Travel Launch Private Van Tours Across Multiple Destinations",
            "Summary": "Thomas Cook India and SOTC Travel have introduced Van Tours, a new travel service combining group tour affordability with personalized holiday flexibility. The tours are designed for small groups of 4-12 travelers and cover destinations including Vietnam, Japan, South Korea, Oman, Philippines, China, Dubai, Abu Dhabi, Georgia, Uzbekistan, Kazakhstan, Cambodia and Laos. Each itinerary spans an average of 7 days and includes premium private vehicles, English-speaking local driver-guides, and four-star hotel stays with breakfast. Pricing starts at INR 38,000 per person for 7 nights to Bali and goes up to INR 3 lakhs for Japan, excluding airfare and meals. The service targets families, friend groups, women travelers, and celebratory trips, offering features like unlimited bottled water, soft drinks, and the ability to customize itineraries. The companies selected visa-free or easy-visa destinations to enhance accessibility for Indian travelers.",
            "Sentiment": "positive",
            "PublishDate": 1761848154336,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Partners with Gen S Life to Target Growing Senior Travel Market",
            "Summary": "Thomas Cook India has announced a strategic partnership with Gen S Life to strengthen its position in the senior travel segment, focusing on making spiritual journeys easier and safer for travelers aged 55 and above. The collaboration includes hosting an educational webinar on October 29th titled 'Making Pilgrimage Travel Easy & Enjoyable for 55+' featuring choreographer Sandip Soparrkar and Thomas Cook's tour managers. The company is responding to India's growing senior population, projected to reach 347 million by 2050, representing 21% of the total population. Thomas Cook will launch specialized group tours with elder-friendly accommodations, experienced tour managers, and easy access vehicles for international destinations across Europe. The company's spiritual travel offerings include circuits across India and Nepal, featuring VIP darshans, AC vehicle transfers, and aerial Char Dham helicopter journeys that reduce traditional 10-day road trips to 4 days. Gen S Life is a lifestyle platform for the 55+ demographic with over 40,000 downloads and 15,000+ registered users.",
            "Sentiment": "positive",
            "PublishDate": 1760618594661,
            "Source": "order&deals"
        },
        {
            "Title": "Thomas Cook India Subsidiary Sterling Holiday Resorts Launches New Resort in Kerala",
            "Summary": "Thomas Cook (India) Limited announced the launch of Sterling Govardhana Malampuzha, a new resort property in Kerala, through its wholly owned subsidiary Sterling Holiday Resorts Limited. The resort marks Sterling's 11th property across 8 destinations in Kerala and transforms Malampuzha from a day destination into a signature getaway accessible from Coimbatore, Kozhikode, and Kochi. Located near the Western Ghats and within driving distance of Palakkad and Coimbatore, the resort offers rooms and suites for families and couples, along with venues for celebrations. The property features Savoree restaurant serving Kerala regional cuisine and provides access to local attractions including a ropeway, rock gardens, and dam views. This expansion strengthens Sterling's regional network connecting Tamil Nadu, Central Kerala, and the Nilgiris, supporting the company's strategy to create drive-to circuits and transform high-potential locations into must-stay destinations.",
            "Sentiment": "positive",
            "PublishDate": 1760357491182,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Becomes Exclusive Transport & Accommodation Partner for Asian Aquatic Championships 2025",
            "Summary": "Thomas Cook India has signed an agreement as the exclusive partner for accommodation and transport services for the Asian Aquatic Championships 2025. The company will manage services for over 1,100 participants, including 650+ athletes, 60+ support staff and dignitaries from 29 Asian countries competing in swimming, artistic swimming, diving and water polo at Veer Savarkar Sports Complex, Ahmedabad. Thomas Cook's MICE team has deployed a 40+ member dedicated team to handle operations across 6 hotel locations over 15 days. Services include airport arrival and departure assistance, logistics management with premium coaches and cars, and accommodation with diverse culinary options including vegetarian, vegan, halal, kosher and gluten-free menus. The championships are organized by the Swimming Federation of India and supported by the Sport Authority of Gujarat, marking India's first-ever hosting of the Asian Aquatics Championships.",
            "Sentiment": "positive",
            "PublishDate": 1760095624068,
            "Source": "stock"
        },
        {
            "Title": "Sterling Holiday Resorts Opens Fifth Resort in Himachal Pradesh",
            "Summary": "Sterling Holiday Resorts, part of Thomas Cook (India), has opened Sterling Ameris Kasauli in Himachal Pradesh. This marks the company's fifth resort in the state. The new property focuses on mindful travel experiences and local food offerings.",
            "Sentiment": "positive",
            "PublishDate": 1759827685439,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Partners with Tourism Ministry to Enhance Tourist Experience Through Real-Time Feedback",
            "Summary": "Thomas Cook (India) Limited has signed a three-year memorandum of understanding with the Ministry of Tourism to improve tourist experiences across Indian destinations. The partnership will collect real-time traveller feedback on cleanliness, safety, accessibility, service standards, and visitor satisfaction through co-branded, Ministry-standardised feedback forms across Thomas Cook's platforms. The aggregated data will be shared with the ministry to support improvements in tourism infrastructure and service delivery. India's tourism sector is projected to grow 9.6% by 2028 with expected international arrivals of 30.5 million by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1759299909024,
            "Source": "stock"
        },
        {
            "Title": "Thomas Cook India Partners With Tourism Ministry To Improve Travel Services",
            "Summary": "Thomas Cook India has entered into a partnership with the Tourism Ministry aimed at enhancing travel experiences throughout the country. The collaboration focuses on improving travel services and experiences for travelers across India.",
            "Sentiment": "positive",
            "PublishDate": 1759147733230,
            "Source": "stock"
        }
    ]
}