{
    "Symbol": "THYROCARE",
    "ISIN": "INE594H01019",
    "News": [
        {
            "Title": "Thyrocare Board Approves Amendment to Insider Trading Code",
            "Summary": "Thyrocare Technologies Limited's Board of Directors approved amendments to its Code of Conduct for insider trading regulations during its January 28, 2026 meeting, with the updated code now available on the company website.",
            "Sentiment": "neutral",
            "PublishDate": 1769599654050,
            "Source": "stocks"
        },
        {
            "Title": "Thyrocare Q3FY26 Results & Board Approvals",
            "Summary": "Thyrocare Technologies announced Q3FY26 financial results for quarter ended December 31, 2025, along with amendments to insider trading code and bonus share allotment details.",
            "Sentiment": "neutral",
            "PublishDate": 1769598327024,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thyrocare Appoints Madhuri Dixit as Brand Ambassador",
            "Summary": "Thyrocare Technologies Limited announces legendary actor Madhuri Dixit as brand ambassador on Republic Day to strengthen preventive healthcare awareness and promote routine health monitoring across India.",
            "Sentiment": "positive",
            "PublishDate": 1769523273511,
            "Source": "stocks"
        },
        {
            "Title": "Thyrocare Wins Two Awards at National Diagnostics Forum",
            "Summary": "Thyrocare Technologies Limited received 'Best Diagnostic Lab Chain of the Year' and 'Patient-Centric Diagnostic Company of the Year' awards at the 4th National Diagnostics Forum & Awards 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769098300739,
            "Source": "stocks"
        },
        {
            "Title": "Thyrocare Q3FY26 Earnings Call Set for January 28",
            "Summary": "Thyrocare Technologies has scheduled its Q3FY26 earnings conference call for January 28, 2026, at 5:30 PM IST to discuss unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768906697913,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thyrocare Appoints Rajdeep Panwar as CCO",
            "Summary": "Thyrocare Technologies announces appointment of Rajdeep Panwar as Chief Commercial Officer effective January 05, 2026, bringing 21 years of healthcare and diagnostics experience to the leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1767592349569,
            "Source": "stocks"
        },
        {
            "Title": "Thyrocare Appoints Dr. Ramesh Kinha as COO",
            "Summary": "Thyrocare Technologies Limited has appointed Dr. Ramesh Kinha as Chief Operating Officer, effective December 18, 2025. Dr. Kinha brings over 17 years of healthcare and diagnostics experience.",
            "Sentiment": "positive",
            "PublishDate": 1766035197537,
            "Source": "stocks"
        },
        {
            "Title": "Docon Technologies Creates Encumbrance on 64.6 Million Thyrocare Bonus Shares",
            "Summary": "Docon Technologies Private Limited has created an auto-encumbrance on 64,646,464 bonus equity shares allotted by Thyrocare Technologies following a 2:1 bonus issue on December 01, 2025. The pledged shares, representing 60.93% of Thyrocare's total paid-up equity share capital, secure API Holdings Limited's debenture obligations through Catalyst Trusteeship Limited as debenture trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1764938417435,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Allots 10.61 Crore Bonus Shares in 2:1 Ratio",
            "Summary": "Thyrocare Technologies' Stakeholders Relationship Committee approved allotment of 10,61,07,794 bonus equity shares of Rs. 10 each in 2:1 proportion to eligible shareholders as of November 28, 2025 record date. The bonus issue increased the company's paid-up share capital from Rs. 53.05 crore to Rs. 159.16 crore, with new shares ranking equally with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1764559583348,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Chief Commercial Officer Nitin Chugh Resigns",
            "Summary": "Nitin Chugh, Chief Commercial Officer at Thyrocare Technologies Limited, will cease his association with the company effective November 30, 2025, to pursue opportunities outside the organization. The company has progressed in identifying a suitable replacement and will provide details to stock exchanges in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1764397902342,
            "Source": "corporate_governance"
        },
        {
            "Title": "Thyrocare Technologies Announces Record Date for Bonus Share Issue",
            "Summary": "Thyrocare Technologies Limited has published newspaper notifications in Business Standard and Pratahkal regarding the record date for issuing bonus equity shares to shareholders. The company submitted the required regulatory intimation and made the information available on its investor website for shareholder awareness.",
            "Sentiment": "positive",
            "PublishDate": 1763373445847,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Increases Authorized Share Capital to Rs 300 Crores",
            "Summary": "Thyrocare Technologies shareholders approved via postal ballot the increase of authorized share capital from an unspecified amount to Rs 300 crores, divided into 30 crore equity shares of Rs 10 each. The company also amended its Articles of Association to include provisions for capitalization of profits and bonus share issuance through reserve accounts.",
            "Sentiment": "positive",
            "PublishDate": 1763317442526,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Responds to BSE Query on Significant Share Volume Increase",
            "Summary": "Thyrocare Technologies clarified to BSE that it is unaware of reasons behind the significant increase in its share trading volume across exchanges. The company stated the volume increase is purely market-driven and management has no connection to it, while confirming compliance with all disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763113325636,
            "Source": "stock"
        },
        {
            "Title": "API Holdings Redeems ₹500 Crore NCDs While Thyrocare Share Pledge Remains Unchanged",
            "Summary": "API Holdings Limited has fully repaid and redeemed Series 2 Non-Convertible Debentures worth ₹500 crore on October 28, 2025. Despite this redemption, there is no change in the number of encumbered shares of Thyrocare Technologies Limited held by Docon Technologies Private Limited. Docon continues to maintain a pledge on 3,23,23,232 shares of Thyrocare, representing 60.93% of the total share capital. The shares remain pledged with Catalyst Trusteeship Limited as Debenture Trustee for debentures issued by API Holdings Limited. The pledge was created as security for corporate guarantees extended by Docon to secure API Holdings' obligations related to facilities availed through issuance of unlisted, unrated, secured, redeemable non-convertible debentures. Series 1 Debentures with an aggregate nominal value of up to ₹12,000 million remain outstanding with multiple debenture holders including 360 One Prime Limited, Microlabs, and various other institutional and individual investors.",
            "Sentiment": "neutral",
            "PublishDate": 1762926718328,
            "Source": "corporate_action"
        },
        {
            "Title": "Docon Technologies Sells 10% Stake in Thyrocare, Reduces Promoter Holding to 60.93%",
            "Summary": "Docon Technologies Private Limited, a wholly owned subsidiary of API Holdings Limited and promoter of Thyrocare Technologies Limited, sold 53,32,860 equity shares representing approximately 10% of Thyrocare's total paid-up share capital. The transaction was completed on October 24, 2025 through market trades. Following this sale, Docon's promoter shareholding in Thyrocare decreased from 70.98% to 60.93% of the total paid-up equity share capital. Docon continues to remain a promoter and holding company of Thyrocare after the transaction. The disclosure was made under regulatory requirements to stock exchanges BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761650391003,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Prudential Mutual Fund Crosses 5% Stake in Thyrocare Technologies",
            "Summary": "ICICI Prudential Mutual Fund acquired 19,98,400 shares of Thyrocare Technologies on October 24, 2025, through secondary market purchases. This acquisition increased the fund's total shareholding from 8,25,490 shares (1.56%) to 28,23,890 shares (5.33%) of the company's paid-up capital. The fund clarified that the holding is from an investment perspective and not aimed at seeking controlling interest. Thyrocare Technologies has a total equity share capital of ₹52,99,44,470 comprising 5,29,94,447 shares with a face value of ₹10 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761572202180,
            "Source": "stock"
        },
        {
            "Title": "Thyrocare Promoter Docon Technologies Sells 10% Stake for Rs 667.69 Crore",
            "Summary": "Docon Technologies Private Limited, a promoter of Thyrocare Technologies Limited, sold 53,32,860 equity shares representing approximately 10% of the company's total paid-up capital through market trades on October 24, 2025. The transaction was executed at an average price of Rs 1,252.03 per share for a total consideration of Rs 667.69 crore. Following this sale, Docon remains a promoter of the company, with the overall promoter shareholding decreasing from 70.98% to 60.93%.",
            "Sentiment": "neutral",
            "PublishDate": 1761290750164,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Reports 22% Revenue Growth, Announces 2:1 Bonus Issue and Interim Dividend",
            "Summary": "Thyrocare Technologies reported consolidated revenue of INR217 crores for Q2 FY26, marking a 22% year-on-year growth. The pathology business grew 24% year-on-year, while the partnerships business expanded 35%. The company processed 53.3 million tests, up 21% year-on-year, and served 5 million patients, a 12% increase. Standalone normalized EBITDA margin improved to 36%, up 470 basis points year-on-year. The Board approved a 2:1 bonus share issue and declared an interim dividend of INR7 per equity share. Active quarterly franchisees increased to 10,100 from 8,446 in the same quarter last year. The company achieved Six Sigma quality levels, reducing complaints from 11.8% to 3.8%. Thyrocare operates 37 labs in India and 1 in Tanzania, with the Tanzania business growing 30% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760712838822,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Announces 2:1 Bonus Share Issue and Capital Increase via Postal Ballot",
            "Summary": "Thyrocare Technologies Limited has announced a postal ballot for shareholders to vote on three key resolutions. The company proposes to increase its authorized share capital from Rs. 100 crores to Rs. 300 crores by creating additional 20 crore equity shares of Rs. 10 each. The board has also approved a 2:1 bonus share issue, where shareholders will receive 2 new fully paid-up equity shares for every 1 existing share held, capitalizing approximately Rs. 106.11 crores from reserves. Additionally, the company seeks approval to alter its Articles of Association to accommodate these changes. The remote e-voting period runs from October 18, 2025 to November 16, 2025, with results expected by November 18, 2025. The board describes this bonus issue as a gesture of appreciation to shareholders during the company's Silver Jubilee year and Diwali celebrations.",
            "Sentiment": "positive",
            "PublishDate": 1760611170420,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Shares Jump 16% to 52-Week High on Strong Q2 Results",
            "Summary": "Thyrocare Technologies shares surged 16% to Rs 1,470, reaching a fresh 52-week high following strong Q2 FY26 results. The diagnostic company reported an 82% year-on-year growth in profit after tax to Rs 47.90 crore. Revenue increased 22% to Rs 216.53 crore, while normalized EBITDA rose 49% to Rs 75.36 crore. The company maintained steady margins at 33% and gross margins at 72%. Growth was driven by a 24% increase in the Pathology segment, with franchise revenue up 20% and partnership revenue surging 35%. Thyrocare processed 53.3 million tests during the quarter, marking a 21% increase. The company remains debt-free with net cash exceeding Rs 190 crore and expanded its network by adding four new labs. The Board approved a 2:1 bonus share issue and declared an interim dividend of Rs 7 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1760508915489,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Tech Expects Lower Q3 Margins with Q4 Recovery",
            "Summary": "Thyrocare Tech management forecasts lower margins in Q3 but expects recovery in Q4. The company anticipates H1 and H2 performance to remain similar unless major investments are made. Management remains cautious about revising H2 guidance despite strong performance, citing challenges including fewer fever cases and difficult year-over-year comparisons.",
            "Sentiment": "neutral",
            "PublishDate": 1760498905337,
            "Source": "stock"
        },
        {
            "Title": "Thyrocare Technologies Reports Strong Q2 Performance with 80% Jump in Net Profit",
            "Summary": "Thyrocare Technologies reported consolidated net profit of 480 million rupees for Q2, representing an 80% increase from 267 million rupees in the same period last year. Revenue grew 23% to 2.17 billion rupees compared to 1.77 billion rupees year-over-year. The company's EBITDA rose to 713.5 million rupees from 482.9 million rupees, while EBITDA margin expanded to 32.95% from 27.23% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760440029135,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Approves 2:1 Bonus Share Issue and Rs 7 Interim Dividend",
            "Summary": "Thyrocare Technologies' Board approved quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs 202.23 crores and profit of Rs 43.03 crores. The company declared an interim dividend of Rs 7 per equity share (70% of face value) for FY 2025-26, with record date set as October 24, 2025. The Board recommended a 2:1 bonus share issue to celebrate the company's Silver Jubilee, requiring shareholder approval through postal ballot. To facilitate the bonus issue, authorized share capital will increase from Rs 100 crores to Rs 300 crores. The company also allotted 59,450 equity shares under its employee stock option scheme and re-appointed Ernst & Young as internal auditors for FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1760439150117,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Appoints Alok Kumar Jagnani as Non-Executive Director",
            "Summary": "Thyrocare Technologies Limited appointed Mr. Alok Kumar Jagnani (DIN: 00644360) as a Non-Executive and Non-Independent Director through a postal ballot and e-voting process. The ordinary resolution was passed with 99.9226% votes in favor and 0.0774% against, with a total of 4,57,32,435 valid votes cast. The remote e-voting period ran from August 28, 2025 to September 26, 2025. The scrutinizer's report confirmed the resolution was approved with the requisite majority. The company has a fully paid-up share capital of Rs. 52,99,44,470 divided into 5,29,94,447 equity shares of Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1758907288001,
            "Source": "corporate_governance"
        },
        {
            "Title": "Thyrocare Technologies Reports Pledge of 3.23 Crore Equity Shares by Promoter Company",
            "Summary": "Thyrocare Technologies Limited disclosed that Docon Technologies Private Limited, its promoter and holding company, has pledged 3,23,23,232 equity shares representing 60.99% of the total share capital. The pledge was created in favor of Catalyst Trusteeship Limited acting as Debenture Trustee on behalf of debenture holders to secure new debentures issued by API Holdings Ltd., the ultimate holding company. The pledge transaction was completed on September 17, 2025. Thyrocare's equity share capital remains at Rs. 52.99 crore comprising 5.29 crore equity shares of Rs. 10 face value each.",
            "Sentiment": "neutral",
            "PublishDate": 1758260476595,
            "Source": "corporate_action"
        },
        {
            "Title": "Vistra ITCL Releases Pledge on 71.06% Stake in Thyrocare Technologies",
            "Summary": "Vistra ITCL (India) Limited, acting as Debenture Trustee, released its pledge on 3,76,56,092 equity shares of Thyrocare Technologies Limited on September 16, 2025. The pledged shares represented 71.06% of Thyrocare's total voting capital. Following the pledge release, Vistra's encumbered shareholding in Thyrocare reduced to nil. Thyrocare has a total equity share capital of 5,29,94,447 shares with a face value of Rs. 10 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758174165422,
            "Source": "corporate_action"
        },
        {
            "Title": "API Holdings Issues INR 1,700 Crore Debentures to Redeem Existing Debt, Docon to Pledge Up to 61% Thyrocare Shares",
            "Summary": "API Holdings Limited, the ultimate holding company of Thyrocare Technologies Limited, is issuing new secured, unlisted, redeemable non-convertible debentures worth INR 1,700 crore to redeem existing debentures valued at INR 1,545.38 crore. Docon Technologies Private Limited, which currently holds 71.06% of Thyrocare's equity shares, will pledge up to 61% of Thyrocare's equity shares as security for the new debentures. The transaction documents were executed on September 11, 2025, involving API Holdings, Docon Technologies, AHWSPL India Private Limited, and Catalyst Trusteeship Limited. While the agreements do not impact Thyrocare's current management or control, there could be potential impact on direct control if the pledge is enforced upon an event of default. Docon's entire current shareholding was pledged for the existing debentures and will be released upon redemption.",
            "Sentiment": "neutral",
            "PublishDate": 1757948914747,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "Thyrocare Technologies Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Alok Kumar Jagnani (DIN: 00644360) as a Non-Executive & Non-Independent Director. Jagnani was appointed as Additional Director by the Board on July 24, 2025, based on the Nomination and Remuneration Committee's recommendation. He is a Chartered Accountant with over 20 years of experience in finance, risk management, and corporate assurance across manufacturing and service sectors. Jagnani has been associated with the company since August 2023 and previously served as Chief Financial Officer until July 23, 2025, when he transitioned to Group CFO of API Holdings Limited. The e-voting period runs from August 28, 2025, at 9:00 a.m. to September 26, 2025, at 5:00 p.m., with results to be declared by September 29, 2025. The cut-off date for eligible shareholders is August 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756136113454,
            "Source": "corporate_action"
        },
        {
            "Title": "Rahul Guha Appointed as CEO of API Holdings While Retaining Thyrocare Leadership Role",
            "Summary": "Rahul Guha, Managing Director and CEO of Thyrocare Technologies Limited, has been appointed as Managing Director and CEO of API Holdings Limited, effective August 27, 2025. The appointment was approved by API Holdings' Board of Directors based on the recommendation of its Nomination and Remuneration Committee. Guha will retain his position at Thyrocare while taking on additional responsibilities at API Holdings, the ultimate holding company. Previously, Guha served as President - Operations at API, focusing on driving synergies across the group companies. As part of the leadership restructuring, Siddharth Shah, the Managing Director and CEO of API Holdings, has been re-designated as Director and Vice Chairman effective the same date.",
            "Sentiment": "positive",
            "PublishDate": 1754484650817,
            "Source": "corporate_governance"
        },
        {
            "Title": "Thyrocare Plans Expansion Through Franchise Growth and B2B Partnerships",
            "Summary": "Thyrocare has outlined its strategy to expand operations in India and internationally. The company plans to deepen its domestic presence through franchise-led growth, strengthen B2B partnerships, and scale affordable diagnostic services. The expansion strategy includes public-private partnerships, insurance tie-ups, and an overseas push to broaden its market reach.",
            "Sentiment": "positive",
            "PublishDate": 1753281842477,
            "Source": "stock"
        },
        {
            "Title": "Thyrocare Technologies Reports 23% Revenue Growth in Q1 FY26 Results",
            "Summary": "Thyrocare Technologies announced its unaudited financial results for Q1 FY26 ended June 30, 2025, showing consolidated revenue of ₹193 crore, up 23% year-over-year. The company reported normalized EBITDA growth of 42% and pathology revenue growth of 25%. Key operational metrics showed 46.9 million tests conducted (15% increase), 4.6 million patients served (12% increase), and 9,551 active franchisees (17% increase). The company expanded its network by commissioning a Regional Processing Lab in Bhagalpur, Bihar with 2,500 samples per day capacity and launched two new partner labs in Kashmir and Roorkee. Thyrocare now operates 30 established labs across India and 10 other labs including partner facilities. The pathology business contributed 63% of revenue while partnerships accounted for 31%, with direct-to-consumer business at 6%.",
            "Sentiment": "positive",
            "PublishDate": 1753267645556,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Reports 23% Revenue Growth in Q1FY26, Announces Leadership Changes",
            "Summary": "Thyrocare Technologies Limited reported consolidated revenue of INR 193.03 crores for Q1FY26, marking a 23% year-over-year increase. The company's profit after tax grew 62% to INR 38.06 crores, while normalized EBITDA increased 42% to INR 63.35 crores. Total test volume reached 46.9 million, reflecting 15% growth. The pathology business showed strong performance with franchise revenue growing 20% and partnership revenue surging 36%. Consolidated gross margin remained stable at 71%. The company announced significant leadership changes including the appointment of Vikram Gupta as Chief Financial Officer, replacing Alok Kumar Jagnani who was elevated to Group CFO of parent company API Holdings Limited. Jagnani was simultaneously appointed as a Non-Executive Director. The board also noted the resignation of Director Hardik Kishor Dedhia and changes in senior management personnel. Thyrocare opened new laboratories in Bhagalpur, Kashmir, and Roorkee during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753267100605,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Reports Strong Q1 Performance with 61% Jump in Net Profit",
            "Summary": "Thyrocare Technologies delivered robust quarterly results with consolidated net profit rising to 389 million rupees from 241.7 million rupees year-over-year. Revenue increased to 1.93 billion rupees compared to 1.57 billion rupees in the same period last year. The company's EBITDA grew to 577.7 million rupees from 426.4 million rupees, while EBITDA margin improved to 29.93% from 27.17% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753266560097,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Appoints New CFO and Reports Strong Quarterly Results",
            "Summary": "Thyrocare Technologies announced key leadership changes with Vikram Gupta appointed as Chief Financial Officer effective July 24, 2025, replacing Alok Kumar Jagnani who transitions to Group CFO of parent company API Holdings. The company reported quarterly results for the period ended June 30, 2025, with standalone revenue from operations of Rs. 143.63 crores and profit of Rs. 36.05 crores. Board changes include Jagnani's appointment as Non-Executive Director and Hardik Kishor Dedhia's resignation from directorship. The company also increased its stake in Thyrocare Laboratories (Tanzania) Limited to 57.25% from 50%, making it a subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753266528626,
            "Source": "corporate_governance"
        },
        {
            "Title": "Thyrocare Technologies Receives Tax Demands Totaling ₹133.1 Million",
            "Summary": "Thyrocare Technologies has received tax demands amounting to ₹2.1 Million and ₹131 Million. No further details about the nature of these tax demands or the periods they relate to were provided in the given snippet.",
            "Sentiment": "negative",
            "PublishDate": 1751299430000,
            "Source": "default"
        },
        {
            "Title": "Thyrocare Technologies: Q4 Profit Surge Propels Shares to 8-Month High",
            "Summary": "Thyrocare Technologies reported a 22% increase in Q4 net profit to Rs 21.7 crore. Revenue rose 21.3% YoY to Rs 187 crore. EBITDA margin expanded to 30.8%. The board recommended a final dividend of Rs 21 per share. Shares surged 15.18% to Rs 886.",
            "Sentiment": "positive",
            "PublishDate": 1745470391000,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Reports Q4 FY23 Financial Results",
            "Summary": "Thyrocare Technologies announced its Q4 FY23 financial results. The company's consolidated net profit increased to 217 million rupees, up from 178 million rupees year-over-year and 191.1 million rupees quarter-over-quarter. Revenue for Q4 rose to 1.87 billion rupees from 1.54 billion rupees in the same quarter last year. Additionally, the company recommended a final dividend of 21 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745453515000,
            "Source": "default"
        },
        {
            "Title": "Thyrocare Technologies Reports Significant Volume Growth in FY25",
            "Summary": "Thyrocare Technologies has announced that its total testing volume for the fiscal year 2025 grew to 167.9 million, which the company claims is the largest by far in terms of volume.",
            "Sentiment": "positive",
            "PublishDate": 1745409388000,
            "Source": "default"
        },
        {
            "Title": "Thyrocare Technologies Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Thyrocare Technologies has announced its Q4 financial results, showing significant year-over-year improvements. The company's Q4 revenue increased to 1.87 billion rupees from 1.54 billion rupees in the previous year. EBITDA rose to 577 million rupees from 338 million rupees, with the EBITDA margin expanding to 30.83% from 21.92%. Consolidated net profit for Q4 reached 217 million rupees, up from 178 million rupees year-over-year and 191.1 million rupees quarter-on-quarter. Additionally, the company has recommended a final dividend of 21 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745408539000,
            "Source": "result"
        },
        {
            "Title": "Thyrocare Technologies: Q4 Profit Jumps 22%, Declares ₹21 Dividend",
            "Summary": "Thyrocare Technologies reported a 21.9% YoY increase in Q4 net profit to ₹21.7 crore. Revenue grew 21.3% to ₹187.2 crore, while EBITDA surged 70.5% to ₹57.8 crore. EBITDA margin improved to 30.9%. The board recommended a final dividend of ₹21 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1745406311000,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Invests Additional $25,000 in Joint Venture",
            "Summary": "Thyrocare Technologies has made an additional investment of $25,000 in a joint venture company. This move suggests the company is strengthening its position or expanding operations through this partnership.",
            "Sentiment": "positive",
            "PublishDate": 1741047068000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Invests $25,000 in Joint Venture",
            "Summary": "Thyrocare Technologies has made an additional investment of $25,000 in a joint venture company. This move suggests the company is expanding its interests or strengthening its position in a particular business area through collaborative efforts.",
            "Sentiment": "neutral",
            "PublishDate": 1741012486000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies: Q3 Profit and Revenue Show Strong Growth",
            "Summary": "Thyrocare Technologies reported a 24% YoY increase in Q3 net profit to ₹19.1 crore. Revenue from operations grew 23.2% to ₹165.9 crore. EBITDA surged 32.4% to ₹41.7 crore, with EBITDA margin improving to 25.1%.",
            "Sentiment": "positive",
            "PublishDate": 1738585059000,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Reports Q3 Financial Results",
            "Summary": "Thyrocare Technologies has announced its Q3 consolidated financial results. The company's net profit increased to 191 million rupees from 153 million rupees in the same quarter last year. Revenue also saw growth, rising to 1.66 billion rupees from 1.35 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737678295000,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Reports Improved Q3 EBITDA and Margin",
            "Summary": "Thyrocare Technologies has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 417 million rupees from 308 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 25.11% from 22.80% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737631042000,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Reports Strong Q3 Financial Results",
            "Summary": "Thyrocare Technologies has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 191 million rupees from 153 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 1.66 billion rupees compared to 1.35 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737631035000,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies to Consider Q3 Results",
            "Summary": "Thyrocare Technologies Limited has announced that it will consider its third quarter (Q3) financial results on January 23.",
            "Sentiment": "neutral",
            "PublishDate": 1737038442000,
            "Source": "earnings"
        },
        {
            "Title": "Thyrocare Technologies Invests $100,000 in Tanzanian Subsidiary",
            "Summary": "Thyrocare Technologies has made an additional equity investment of $100,000 in its subsidiary, Thyrocare Laboratories (Tanzania) Limited. This represents another tranche of investment in the company's Tanzanian operations.",
            "Sentiment": "positive",
            "PublishDate": 1733277081000,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyrocare Technologies Reports Improved Q2 Financial Performance",
            "Summary": "Thyrocare Technologies has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 375 million rupees to 483 million rupees. Additionally, the EBITDA margin rose from 25.35% to 27.23%.",
            "Sentiment": "positive",
            "PublishDate": 1729688531000,
            "Source": "result"
        },
        {
            "Title": "Thyrocare Technologies Reports Q2 Revenue Growth",
            "Summary": "Thyrocare Technologies, a diagnostic services provider, has announced its second quarter revenue for the current fiscal year. The company reported revenue of 1.8 billion rupees, compared to 1.48 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729688522000,
            "Source": "result"
        }
    ]
}