{
    "Symbol": "TI",
    "ISIN": "INE133E01013",
    "News": [
        {
            "Title": "Tilaknagar Industries Promoter Pledges 6.5L Shares",
            "Summary": "Shivani Amit Dahanukar pledges 6,50,000 equity shares to Avendus Finance, increasing her total pledged holdings to 11.80% of share capital as per SEBI disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1770892886540,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tilaknagar Industries announces key leadership changes",
            "Summary": "Tilaknagar Industries Ltd. announces major changes in Key Managerial Personnel and Senior Management following Imperial Blue acquisition, with new CFO appointment and role transitions effective immediately.",
            "Sentiment": "neutral",
            "PublishDate": 1769501426729,
            "Source": "stocks"
        },
        {
            "Title": "Imperial Blue Whisky Records Strong Debut at Tilaknagar",
            "Summary": "Tilaknagar Industries reports Imperial Blue whisky achieved 1.79 million cases in primary sales during December 2025, its first month post-acquisition, while strengthening market position across South India.",
            "Sentiment": "positive",
            "PublishDate": 1768800864307,
            "Source": "stocks"
        },
        {
            "Title": "Imperial Blue Whisky Sells 1.79M Cases in December",
            "Summary": "Tilaknagar Industries reports strong performance for Imperial Blue whisky with 1.79 million cases sold in December 2025, indicating robust market demand for the premium brand.",
            "Sentiment": "positive",
            "PublishDate": 1768800606542,
            "Source": "stocks"
        },
        {
            "Title": "Tilaknagar Industries seeks member approval via postal ballot",
            "Summary": "Tilaknagar Industries announces postal ballot for director appointment and ESOP scheme implementation, with e-voting from January 11 to February 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767970234102,
            "Source": "stocks"
        },
        {
            "Title": "Tilaknagar Industries seeks shareholder approval for director appointment and ESOP scheme",
            "Summary": "Tilaknagar Industries announces postal ballot for appointing independent director Jenamejayan Kamalam Shivan and implementing ESOP 2025 scheme with 50 lakh stock options. E-voting period from January 11 to February 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767970194892,
            "Source": "stocks"
        },
        {
            "Title": "CRISIL Reaffirms Tilaknagar Industries A- Rating",
            "Summary": "CRISIL Ratings reaffirmed Tilaknagar Industries' long-term rating at 'Crisil A-/Stable' and removed it from Rating Watch, following the Imperial Blue acquisition clarity.",
            "Sentiment": "positive",
            "PublishDate": 1767150601517,
            "Source": "stocks"
        },
        {
            "Title": "Tilaknagarindustries Promoters Create Encumbrance on Shares for Imperial Blue Brands Acquisition Financing",
            "Summary": "Tilaknagarindustries promoters led by Amit Dahanukar created non-disposal undertakings on 2,68,44,552 shares (12.89% stake) and additional pledges through Catalyst Trusteeship Limited on November 20, 2025. The encumbrance involves multiple lenders including ICICI Bank, JP Morgan Chase Bank, and others, with funds designated for acquiring Imperial Blue Brands from Pernod Ricard India.",
            "Sentiment": "neutral",
            "PublishDate": 1764651910140,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Completes INR 3,442 Crore Acquisition of Imperial Blue Business from Pernod Ricard India",
            "Summary": "Tilaknagar Industries Limited has completed the acquisition of Imperial Blue business division from Pernod Ricard India for INR 3,442 crore through slump sale, with additional deferred payment of $28 million after four years. The acquisition of India's third-largest whisky brand by volume expands TI's national footprint, adds manufacturing units across four states, and accelerates the company's premiumisation journey across IMFL categories.",
            "Sentiment": "positive",
            "PublishDate": 1764560854896,
            "Source": "order&deals"
        },
        {
            "Title": "Tilaknagar Industries Allots 3.32 Lakh Equity Shares Under ESOP Schemes",
            "Summary": "Tilaknagar Industries' Finance Committee approved allotment of 3,32,075 equity shares with face value of Rs. 10 each to employees under various ESOP schemes. The company's paid-up equity share capital increased from Rs. 246,83,87,500 to Rs. 247,17,08,250 following the allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1764239978842,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagarr Industries Promoter Creates Share Encumbrance for Financing Facility",
            "Summary": "Amit Dahanukar, promoter of Tilaknagarr Industries Limited, executed a non-disposal undertaking on November 20, 2025, creating encumbrance over 5,41,30,375 equity shares (approximately 26% shareholding) in favor of Catalyst Trusteeship Limited as security trustee. The undertaking relates to financing arrangements with six lenders including ICICI Bank, JPMorgan Chase Bank, Kotak Mahindra Bank, Avendus Finance, Poonawalla Fincorp and Piramal Finance, requiring the promoter group to maintain at least 26% shareholding and restricting share transfers without lender consent.",
            "Sentiment": "neutral",
            "PublishDate": 1763993592793,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Allots 9.3 Lakh Equity Shares to Promoter Amit Dahanukar",
            "Summary": "Tilaknagar Industries' Finance Committee approved allotment of 9,30,000 equity shares to promoter Mr. Amit Dahanukar following conversion of warrants at Rs. 286.50 per warrant, raising Rs. 26.64 crores. The company's paid-up equity share capital increased from Rs. 245.91 crores to Rs. 246.84 crores, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763987908833,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Allots 3.77 Crore Equity Shares Through Warrant Conversion",
            "Summary": "Tilaknagar Industries' Finance Committee approved allotment of 3,77,15,000 equity shares at Rs. 10 face value to warrant holders who exercised conversion rights, raising Rs. 1,080.53 crores. The company's paid-up equity share capital increased from Rs. 208.19 crores to Rs. 245.91 crores, with shares to be locked-in as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763626197670,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Launches Seven Islands Pure Malt Whisky, Enters Premium Whisky Market",
            "Summary": "Tilaknagar Industries Ltd., India's largest brandy producer, launched Seven Islands Pure Malt Whisky made from four single malts from India and Scotland, marking its strategic entry into the premium whisky category. The launch follows the company's Imperial Blue acquisition announcement and establishes whisky as its second major growth pillar alongside its brandy leadership, targeting India's whisky market which accounts for 66% of total spirits consumption.",
            "Sentiment": "positive",
            "PublishDate": 1763621492722,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Reports Strong Q2 Performance with 16.2% Volume Growth and Imperial Blue Deal Progress",
            "Summary": "Tilaknagar Industries achieved 16.2% volume growth and Rs. 398 crore revenue in Q2 FY26, while receiving Competition Commission approval for Imperial Blue acquisition and raising Rs. 986 crore through preferential issue. The company expanded its premium portfolio with Monarch Legacy Edition Brandy across 6 states and strengthened distribution through Spaceman Spirits partnership, positioning for accelerated growth in the alcoholic beverages market.",
            "Sentiment": "positive",
            "PublishDate": 1763470021981,
            "Source": "earnings"
        },
        {
            "Title": "Tilaknagar Industries Provides Multi-Year Growth and Margin Guidance During Conference Call",
            "Summary": "Tilaknagar Industries outlined its financial projections during a conference call, expecting mid-teens volume growth for FY26 standalone business (excluding Imperial Blue) and EBITDA margins around 60% for FY27-28. The company plans to provide revised guidance for the combined business after the Imperial Blue deal closure, with revenue growth expected to be slightly below volume growth in FY26 due to higher NSR base in H1 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1763215837923,
            "Source": "order&deals"
        },
        {
            "Title": "Tilaknagar Industries Reports Monitoring Agency Assessment for Rs 2,295.63 Crore Preferential Issue",
            "Summary": "Tilaknagar Industries submitted CRISIL's monitoring report for its preferential issue comprising Rs 549.32 crore equity shares and Rs 1,746.31 crore convertible warrants, with proceeds allocated for brand acquisition (Rs 1,399 crore), working capital (Rs 500 crore), and general corporate purposes (Rs 495.63 crore). The company received 25% of warrant proceeds (Rs 436.57 crore) with remaining 75% payable upon conversion within 18 months, while Rs 985.89 crore remains unutilized in bank deposits and accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1763111141895,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Receives Rs. 19.72 Crores Subsidy from Maharashtra Government",
            "Summary": "Tilaknagar Industries received Rs. 19.72 crores as partial subsidy from the Government of Maharashtra on October 18, 2025, relating to the company's past investments. The disclosure was delayed due to verification processes following the government's revision of its remittance procedures.",
            "Sentiment": "positive",
            "PublishDate": 1763108226781,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Reports Strong Q2 Growth, Appoints New Director and Launches ESOP Scheme",
            "Summary": "Tilaknagar Industries approved unaudited financial results for the quarter and half year ended September 30, 2025, appointed Mr. Jenamejayana Kamalam Shivan as Additional Independent Director for 3 years, and launched the Tilaknagar Employee Stock Option Scheme 2025 with 50,00,000 stock options. The company reported volume growth of 16.2% YoY in Q2FY26 reaching 34.2 lakh cases, net revenue of Rs 398 crore with 6.2% YoY growth, and EBITDA of Rs 60 crore, while maintaining strong market share gains across key markets.",
            "Sentiment": "positive",
            "PublishDate": 1763067531492,
            "Source": "earnings"
        },
        {
            "Title": "Tilaknagar Industries Reports 9.6% Profit Drop Despite 6.2% Revenue Growth in Q2",
            "Summary": "Tilaknagar Industries reported net profit of ₹52.6 crore for Q2, down 9.6% year-on-year, while revenue grew 6.2% to ₹398.3 crore with operating margin narrowing to 15% from 17.5%. The IMFL manufacturer gained market share across key markets with 16.2% volume growth to 34.2 lakh cases, though margin pressure affected profitability despite steady topline performance.",
            "Sentiment": "neutral",
            "PublishDate": 1763059053926,
            "Source": "earnings"
        },
        {
            "Title": "Tilaknagar Industries Schedules Q2FY26 Earnings Conference Call for November 14, 2025",
            "Summary": "Tilaknagar Industries Limited has scheduled a post-results earnings conference call for analysts and investors on Friday, November 14, 2025, at 11:30 AM IST to discuss Q2FY26 results. The call will be led by senior management including Chairman MD Amit Dahanukar, President-Strategy Corporate Development Ameya Deshpande, and CFO Abhinav Gupta. The session will begin with a brief management discussion on quarterly results followed by a Q&A session. Tilaknagar Industries is a leading alcoholic beverage company with over 90 years of legacy, known for manufacturing Mansion House Brandy, India's highest and world's second highest selling brandy. The company operates 21 manufacturing units across 12 states and has a diverse brand portfolio including whisky, rum, and gin products.",
            "Sentiment": "neutral",
            "PublishDate": 1762613111124,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Gets CCI Approval to Acquire Imperial Blue Business from Pernod Ricard India",
            "Summary": "Tilaknagar Industries Limited received approval from the Competition Commission of India to acquire business operations from Pernod Ricard India. The acquisition covers the production, bottling, marketing, and selling of Imperial Blue brands.",
            "Sentiment": "positive",
            "PublishDate": 1759916433058,
            "Source": "order&deals"
        },
        {
            "Title": "CCI Approves Tilaknagar Industries' Acquisition of Imperial Brands' Beverages Business",
            "Summary": "The Competition Commission of India has granted approval for Tilaknagar Industries to acquire the beverages business from Imperial Brands. This regulatory clearance enables the transaction to proceed between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1759844341061,
            "Source": "order&deals"
        },
        {
            "Title": "Tilaknagar Industries Appoints Nishant Jain as Sales President, Creates New Sales Division",
            "Summary": "Tilaknagar Industries has appointed Nishant Jain as Sales President to drive nationwide market growth. The company has established a standalone sales division and plans to expand its whisky segment through the Imperial Blue acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1759731774197,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Appoints Nishant Jain as President - Sales",
            "Summary": "Tilaknagar Industries Ltd appointed Mr. Nishant Jain as President - Sales, a senior management position, effective October 03, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Mr. Jain brings over 26 years of experience in the alco-beverage sector across Sales, Trade Marketing and Key Accounts. He previously served as Chief Operating Officer – Spirits Business at Inbrew Beverages, where he helped establish the business and built sales and distribution networks across 22 states in India and five international markets. He has also held leadership roles at Allied Blenders & Distillers as Sales Director- South and spent over two decades with Pernod Ricard India in various commercial roles. Mr. Jain is an alumnus of IIT Roorkee and IIM Lucknow.",
            "Sentiment": "positive",
            "PublishDate": 1759509712032,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tilaknagar Industries Allocates 18.4 Lakh Shares to Multiple Investment Entities",
            "Summary": "Tilaknagar Industries has allocated shares to several investment entities. The company allocated 2.5 lakh shares to Ramesh S Damani Finance Private Limited. Additionally, it allocated 8.6 lakh shares to Abakkus Diversified Alpha Fund & Abakkus Growth Fund 2, and 7.3 lakh shares to Abakkus Diversified Alpha Fund 2. The total share allocation amounts to 18.4 lakh shares across these institutional investors and funds.",
            "Sentiment": "neutral",
            "PublishDate": 1759156151970,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Upholds High Court Ruling in Favor of Tilaknagar Industries Against Allied Blenders",
            "Summary": "The Supreme Court has upheld a High Court decision supporting Tilaknagar Industries in its legal dispute with Allied Blenders. The ruling prohibits Allied Blenders from selling Mansion House products in India, representing a legal victory for Tilaknagar Industries in what appears to be a trademark or product rights dispute.",
            "Sentiment": "positive",
            "PublishDate": 1758096879990,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Promoter Pledges Shares Worth 17% Stake to Bajaj Finance",
            "Summary": "Mrs. Shivani Amit Dahanukar, a promoter of Tilaknagar Industries Ltd., has pledged 3,29,76,043 shares representing 17.01% of the company's total share capital to Bajaj Finance Limited. The pledge was created on September 4, 2025, for loan purposes. Following this transaction, the promoter's total encumbered holdings stand at 2,92,55,152 shares, which is 15.09% of the total share capital. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757942239329,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Shareholders Approve Five Special Resolutions Through Postal Ballot",
            "Summary": "Tilaknagar Industries announced the successful passage of five special resolutions through postal ballot voting that concluded on August 23, 2025. The approved resolutions include the re-appointment and remuneration of Mrs. Shivani Amit Dahanukar as Executive Director and Key Managerial Personnel, increase in borrowing powers under Section 180(1)(c) of the Companies Act 2013, enhancement of limits for sale, creation of mortgage or charge on company assets under Section 180(1)(a), approval for raising funds through issuance of securities, and approval for limits on investments, loans, guarantees and securities under Section 186. All resolutions received requisite majority with voting percentages ranging from 92.08% to 99.59% in favor. The postal ballot was conducted through remote e-voting from July 25 to August 23, 2025, with 832 members out of 124,120 total shareholders participating in the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1756205797533,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Issues Corrigendum to EGM Notice for Preferential Issue Following Stock Exchange Clarifications",
            "Summary": "Tilaknagar Industries issued a corrigendum to its Extraordinary General Meeting notice scheduled for August 20, 2025, following clarification requests from BSE and NSE regarding a proposed preferential issue. The company is seeking to issue up to 143.8 million equity shares and 457.15 million convertible warrants at Rs 382 per share/warrant, raising approximately Rs 2,295.63 crores. The funds will be used for acquiring Pernod Ricard India's Imperial Blue Brands business (Rs 1,300 crores), working capital (Rs 500 crores), and general corporate purposes (Rs 495.63 crores). The corrigendum corrected pre-preferential shareholding disclosure for allottee Bhavini Ajay Shah and revised post-issue shareholding calculations. Promoter Amit Arun Dahanukar intends to subscribe to up to 80 million convertible warrants. The issue involves 44 allottees including institutional investors and individuals, with the issue price remaining unchanged from the original notice.",
            "Sentiment": "neutral",
            "PublishDate": 1755097199306,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Forecasts Mid-to-High Teens Revenue Growth for FY26-FY27",
            "Summary": "Tilaknagar Industries has projected mid-to-high teens revenue growth for FY26 and mid-teens growth for FY27. The company expects EBITDA margins to range between 15-16.5% for FY26 and 15.5-17.5% for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1755056996701,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Reports Record Quarterly EBITDA with 88% Growth in Q1 FY26",
            "Summary": "Tilaknagar Industries announced strong quarterly results with net revenue growing 30.6% to INR 409 crore and EBITDA surging 88% to INR 94 crore, marking the highest ever quarterly EBITDA. Volume growth reached 26.5% to 32.1 lakh cases with market share gains in key markets. Profit after tax more than doubled, increasing 120.8% to INR 89 crore. The company maintains a net cash position of INR 163 crore. Tilaknagar signed definitive agreements to acquire Imperial Blue business from Pernod Ricard India for EUR 413 million, subject to regulatory approval expected by end of 2025. The Board approved INR 59 crore investment to expand Prag Distillery capacity from 6 lakh to 36 lakh cases annually. The Bombay High Court upheld the company's ownership of Mansion House and Savoy Club trademarks.",
            "Sentiment": "positive",
            "PublishDate": 1754924322616,
            "Source": "earnings"
        },
        {
            "Title": "Tilaknagar Industries Reports Strong Growth Driven by Premium Products and Market Expansion",
            "Summary": "Tilaknagar Industries is experiencing strong growth attributed to premium products and expansion into new markets. The company has achieved improved operational efficiency and reduced debt levels, which are supporting margin improvements and market share gains in the Indian Made Foreign Liquor (IMFL) segment.",
            "Sentiment": "positive",
            "PublishDate": 1754923001144,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Expects CCI Approval for Imperial Blue Acquisition by 2025",
            "Summary": "Tilaknagar Industries expects to receive Competition Commission of India (CCI) approval for its Imperial Blue acquisition by 2025. The company is awaiting regulatory clearance for this purchase transaction.",
            "Sentiment": "positive",
            "PublishDate": 1754920822972,
            "Source": "order&deals"
        },
        {
            "Title": "Tilaknagar Industries Reports Strong Q1 Growth, Approves ₹250 Million Distillery Expansion",
            "Summary": "Tilaknagar Industries reported consolidated net profit of ₹885 million in Q1, significantly higher than ₹400.8 million in the same period last year. Revenue increased to ₹8.63 billion compared to ₹6.64 billion year-over-year. The company has approved ₹250 million for expanding its Prag Distillery operations.",
            "Sentiment": "positive",
            "PublishDate": 1754918979172,
            "Source": "earnings"
        },
        {
            "Title": "Tilaknagar Industries Increases Stake in Spaceman Spirits Lab to 21.36% with Rs 10.66 Crore Investment",
            "Summary": "Tilaknagar Industries Limited completed follow-on investments totaling Rs 10.66 crores in Spaceman Spirits Lab Private Limited. The company disbursed Rs 9.15 crores as second and third tranches of a previously agreed investment and acquired 2,236 additional equity shares from existing shareholder Yash Laxman Tindwani for Rs 1.51 crores at Rs 6,765.79 per share. Following these transactions, Tilaknagar's shareholding in Spaceman Spirits Lab will increase to 21.36% on a fully diluted basis, making it an associate company. Spaceman Spirits Lab, incorporated in June 2020, operates in the craft alcohol segment with brands including Samsara Gin, Sitara Rum, and Amara Vodka. The company reported a turnover of Rs 11.7 crores and net worth of Rs 12.1 crores for the financial year ended March 31, 2024. The acquisition is aimed at strengthening Tilaknagar's presence in the premium craft alcohol segment and will be completed by August 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754481706849,
            "Source": "order&deals"
        },
        {
            "Title": "Tilaknagar Industries Increases Stake in Spaceman Spirits Lab",
            "Summary": "Tilaknagar Industries has confirmed the acquisition of additional shares in Spaceman Spirits Lab, expanding its ownership in the spirits company.",
            "Sentiment": "positive",
            "PublishDate": 1754480878937,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Shares Fall 4.55% Despite ₹2,296 Crore Fundraising Approval",
            "Summary": "Tilaknagar Industries shares declined 4.55% to ₹486.85 after reaching their 52-week high the previous day. The company's board approved a preferential issue worth ₹2,296 crore at ₹382 per security to fund the acquisition of Imperial Blue brand and general corporate purposes. The fundraising involves 44 investors with 9 investors contributing ₹549 crore through equity shares and 35 investors raising ₹1,747 crore through warrants. Chairman Amit Dahanukar leads promoter participation with a ₹306 crore warrant subscription. Notable participants include Axana Estates LLP, SMALLCAP World Fund Inc, TIMF Holdings, Abakkus Asset Manager funds, and Bandhan Mutual Fund. The 90-year-old company operates 19 manufacturing units across 12 states with brands including Mansion House, Courrier Napoleon brandies, Mansion House Whisky, Madiraa Rum and Blue Lagoon Gin.",
            "Sentiment": "neutral",
            "PublishDate": 1753851304936,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Raises Rs 2,296 Crore Through Preferential Issue to Fund Imperial Blue Acquisition",
            "Summary": "Tilaknagar Industries' board approved a preferential issue of equity shares and warrants worth Rs 2,296 crore to finance its Imperial Blue whiskey acquisition from Pernod Ricard. The issue is priced at Rs 382 per security with participation from 44 investors, including promoters and existing stakeholders. Nine investors will subscribe through equity shares contributing Rs 549 crore, while 35 investors will participate through warrants raising Rs 1,747 crore. The promoter group, led by Amit Dahanukar, will subscribe warrants worth Rs 306 crore. Other participants include Axana Estates LLP, SMALLCAP World Fund Inc, TIMF Holdings, funds managed by Abakkus Asset Manager, Bandhan Mutual Fund, and high-net-worth individuals. Tilaknagar acquired Imperial Blue for Rs 4,150 crore in an all-cash deal, marking its entry into the whiskey segment which represents two-thirds of India's spirits market. The company plans to raise up to Rs 6,500 crore total, including up to Rs 2,500 crore in equity or equity-linked securities and the remainder in debt securities.",
            "Sentiment": "positive",
            "PublishDate": 1753801946950,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Approves Rs 2,295 Crore Capital Raise Through Preferential Issue",
            "Summary": "Tilaknagar Industries board approved increasing authorized share capital from Rs 226 crores to Rs 310 crores. The company will issue up to 1.44 crore equity shares at Rs 382 per share to raise Rs 549 crores from non-promoter investors including SMALLCAP World Fund and Bandhan Focused Fund. Additionally, 4.57 crore convertible warrants will be issued at Rs 382 each to raise Rs 1,746 crores from both promoter and non-promoter categories. The warrants are convertible within 18 months with 25% payment upfront and 75% on conversion. An extraordinary general meeting is scheduled for August 20, 2025 to seek shareholder approval. The company also approved providing Rs 34 crores financial assistance to subsidiary Prag Distillery for expanding bottling capacity by 200 lakh proof litres in Andhra Pradesh after receiving an extension for the Letter of Intent.",
            "Sentiment": "positive",
            "PublishDate": 1753791967442,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries to Receive 340 Million Rupees for Business Expansion",
            "Summary": "Tilaknagar Industries will receive 340 million rupees from Prag Board for business expansion purposes. Additionally, Andhra Pradesh has extended the Letter of Intent (LOI) duration for the company's Prag Distillery expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1753791402776,
            "Source": "order&deals"
        },
        {
            "Title": "Tilak Nagar Industries Plans Preferential Share Issue Worth Up To 22.95 Billion Rupees",
            "Summary": "Tilak Nagar Industries plans to issue shares valued at up to 5.49 billion rupees and warrants worth up to 17.46 billion rupees on a preferential basis. The combined fundraising initiative totals up to 22.95 billion rupees through this preferential allotment structure.",
            "Sentiment": "positive",
            "PublishDate": 1753790728865,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Seeks Shareholder Approval for Executive Director Re-appointment and INR 6,500 Crore Fund Raising",
            "Summary": "Tilaknagar Industries has issued a postal ballot notice seeking shareholder approval for five key resolutions. The company proposes to re-appoint Mrs. Shivani Amit Dahanukar as Executive Director for three years from June 2025 to May 2028 with annual remuneration up to INR 3.5 crores. The company seeks to increase borrowing limits to INR 5,000 crores and raise funds up to INR 6,500 crores through various securities including equity and debt instruments. The fund raising comprises up to INR 2,500 crores in equity or equity-linked securities and up to INR 4,000 crores in debt securities. Additionally, the company requests approval for investment and loan limits of INR 500 crores under Section 186 of the Companies Act. The e-voting period runs from July 25 to August 23, 2025, with results to be declared by August 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753364348242,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries Approves €412.6 Million Acquisition of Imperial Blue Brands from Pernod Ricard India",
            "Summary": "Tilaknagar Industries Ltd. has approved the acquisition of Pernod Ricard India Private Limited's business undertaking related to Imperial Blue Brands for €412.6 million (approximately ₹4,150 crores), including a deferred payment of €28 million. The transaction involves acquiring the business of production, bottling, marketing and sale of alcoholic beverages under Imperial Blue Brands on a slump sale basis. Imperial Blue is the third largest brand in the Indian-made foreign liquor segment with a sales volume of 22.4 million cases and approximately 9% volume share in the whisky category, present in 27 states and union territories. The business recorded a turnover of ₹3,067 crores for April 2024 to March 2025. The company plans to raise funds up to ₹6,500 crores through various securities (comprising up to ₹2,500 crores in equity/equity linked securities and up to ₹4,000 crores in debt securities) and increase borrowing limits to ₹5,000 crores. Tilaknagar has also incorporated a wholly-owned subsidiary named Grain & Grape Works Private Limited on July 22, 2025, for manufacturing and marketing alcoholic and non-alcoholic beverages. The acquisition is subject to Competition Commission of India approval and is expected to be completed within 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1753285682425,
            "Source": "order&deals"
        },
        {
            "Title": "Tilaknagar Industries Exploring Strategic Opportunities, Reports No Material Events",
            "Summary": "Tilaknagar Industries announced it is exploring strategic opportunities while confirming that no events requiring disclosure have occurred. The company made this statement to clarify its current position regarding potential business developments.",
            "Sentiment": "neutral",
            "PublishDate": 1753197065008,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries Leads Race to Acquire Imperial Blue Brand for ₹4,000 Crore",
            "Summary": "Tilaknagar Industries is the front-runner to acquire Pernod Ricard's Imperial Blue whisky brand in a deal valued at approximately ₹4,000 crore. The acquisition would be funded through a combination of debt and equity. The company's board will meet on July 23 to consider a fund-raising proposal, while the company holds cash reserves of around ₹107 crore. Tilaknagar Industries' stock surged 8% on Tuesday to ₹453, with gains exceeding 20% over the past five trading sessions. Neither company has responded to requests for comment.",
            "Sentiment": "positive",
            "PublishDate": 1753167901402,
            "Source": "order&deals"
        },
        {
            "Title": "Tilaknagar Industries Accused of Paying Rs 2.18 Billion in Kickbacks to Andhra Liquor Syndicate",
            "Summary": "Andhra Police reports indicate that Tilaknagar Industries received orders valued at Rs 14.72 billion from 2019 to 2024. The company is accused of paying Rs 2.18 billion to an Andhra liquor syndicate for kickbacks on these orders.",
            "Sentiment": "negative",
            "PublishDate": 1753089394812,
            "Source": "stock"
        },
        {
            "Title": "Tilaknagar Industries to Review Fundraising Proposal on July 23",
            "Summary": "Tilaknagar Industries has scheduled a review of its fundraising proposal for July 23. The company will examine the proposal during this planned review session.",
            "Sentiment": "neutral",
            "PublishDate": 1753014146076,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilaknagar Industries: Plans $500 Million Acquisition of Imperial Blue Whisky",
            "Summary": "Tilaknagar Industries is seeking to raise $500 million to acquire Imperial Blue Whisky from Pernod Ricard. The company has mandated Kotak Mahindra Bank and Avendus Capital to arrange financing through rupee-denominated NCDs. The debt is expected to be priced in the low-to-mid teens. Tilaknagar plans to fund the majority of the bid through debt and the remainder via equity.",
            "Sentiment": "positive",
            "PublishDate": 1750292270000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tilak Nagar Industries in Talks to Acquire Imperial Blue Brand from Pernod Ricard",
            "Summary": "Tilak Nagar Industries is leading negotiations to acquire the Imperial Blue brand from Pernod Ricard. The news suggests a potential business expansion for Tilak Nagar Industries in the alcoholic beverage sector.",
            "Sentiment": "positive",
            "PublishDate": 1749008078000,
            "Source": "default"
        }
    ]
}