{
    "Symbol": "TICL",
    "ISIN": "INE388G01026",
    "News": [
        {
            "Title": "Twamev Construction Reports Q3FY26 Results",
            "Summary": "Twamev Construction and Infrastructure Limited announced Q3FY26 financial results with revenue of ₹2,083 lakhs and net profit of ₹179 lakhs for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769856697087,
            "Source": "co_actions_results"
        },
        {
            "Title": "Twamev Construction Seeks Promoter Reclassification",
            "Summary": "Twamev Construction and Infrastructure Limited applies to stock exchanges for reclassification of five promoters and promoter group entities to public shareholders under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769582427146,
            "Source": "stocks"
        },
        {
            "Title": "Twamev Construction Board Meet on Jan 31 for Q3FY26",
            "Summary": "Twamev Construction and Infrastructure Limited has scheduled its board meeting for January 31, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769069147361,
            "Source": "co_actions_results"
        },
        {
            "Title": "Twameva Construction Corrects Independent Director Resignation Date",
            "Summary": "Twameva Construction and Infrastructure Limited issued a corrigendum correcting the resignation date of Independent Director Mrs. Ramya Hariharan from December 28, 2025 to November 28, 2025 due to a typographical error. The company confirmed all other details from their earlier intimation dated December 5, 2025 remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1765181831800,
            "Source": "corporate_governance"
        },
        {
            "Title": "Twameva Construction Independent Director Ramya Hariharan Resigns Due to Professional Commitments",
            "Summary": "Mrs. Ramya Hariharan (DIN: 06928511) resigned as Independent Director of Twameva Construction and Infrastructure Limited, effective from November 28, 2025, citing pressing professional commitments as the reason. Her resignation also terminates her membership in all Board Level Committees of the company, with the Board acknowledging her valuable guidance and contribution during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1764949073485,
            "Source": "corporate_governance"
        },
        {
            "Title": "Twamev Construction Promoter Ravi Todi Sells 14,454 Equity Shares",
            "Summary": "Promoter Ravi Todi sold 14,454 equity shares of Twamev Construction and Infrastructure Limited in the open market on December 4, 2025, for Rs. 3,99,249.48. His shareholding decreased marginally from 31.80% to 31.79% of the company's total equity capital of 15,50,00,000 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764856741412,
            "Source": "corporate_action"
        },
        {
            "Title": "Twamev Construction Reports Strong Q2 Performance with 539 Lakh Profit, Faces Exchange Penalty for Delayed Annual Report",
            "Summary": "Twamev Construction and Infrastructure Limited posted a net profit of 405 lakh for Q2 and 539 lakh for the half-year ended September 30, 2025, with revenue from operations at 2,411 lakh. The company received a monetary penalty from stock exchanges for delayed submission of its Annual Report for FY 2024-25 beyond prescribed timelines, which management termed as inadvertent.",
            "Sentiment": "neutral",
            "PublishDate": 1764135880060,
            "Source": "earnings"
        },
        {
            "Title": "Twamev Construction Promoter Ravi Todi Sells 0.46% Stake Through Stock Exchange",
            "Summary": "Ravi Todi disposed of 7,18,218 shares representing 0.46% of Twamev Construction and Infrastructure Limited through an Offer for Sale mechanism on November 20, 2025. The transaction reduced Todi's shareholding from 32.40% to 31.94% in the construction company listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763625541374,
            "Source": "corporate_action"
        },
        {
            "Title": "Twamev Construction Promoter Ravi Todi to Sell 10.13% Stake Through OFS",
            "Summary": "Promoter Ravi Todi plans to sell 1,57,03,800 equity shares (10.13% stake) of Twamev Construction And Infrastructure Limited through offer for sale mechanism on November 18-19, 2025, with floor price set at ₹32.50 per share. The sale aims to achieve minimum public shareholding compliance as prescribed under SEBI regulations, with separate windows for non-retail investors on T-day and retail investors on T+1 day.",
            "Sentiment": "neutral",
            "PublishDate": 1763383474220,
            "Source": "corporate_action"
        },
        {
            "Title": "Twamev Construction Reports Quarterly Results, Faces Stock Exchange Penalty for Delayed Annual Report Filing",
            "Summary": "Twamev Construction and Infrastructure Limited (formerly Tantia Constructions Limited) announced its board meeting outcomes for November 12, 2025. The company approved unaudited financial results for the quarter and half-year ended September 30, 2025. The board acknowledged that stock exchanges imposed a monetary penalty on the company for delayed submission of the Annual Report for Financial Year 2024-25 beyond prescribed timelines. The company has since submitted the annual report and paid the penalty. The auditor's review report highlighted several matters including the company's process of making settlement of resolution plan amount of Rs 2100 Lacs subject to account upgradation status from NPA as per NCLT Kolkata order dated July 14, 2025. The report also noted issues with provision for gratuity and leave encashment, unaccounted rental income of INR 8 Lakh for the quarter, and unbilled revenue of INR 438 Lakh included in revenue from operations.",
            "Sentiment": "negative",
            "PublishDate": 1762996911079,
            "Source": "earnings"
        },
        {
            "Title": "Twamev Construction Receives Contract Value Increase of Rs 15.38 Crore from East Coast Railway",
            "Summary": "Twamev Construction and Infrastructure Limited announced an increase in the value of an existing railway contract from East Coast Railway. The original contract value of Rs 62.60 crore has been increased by Rs 15.38 crore, bringing the revised contract value to Rs 77.98 crore. The contract involves construction of flyover bridges and major bridges between Haridaspur and Chadikhol of Haridaspur-Paradeep Line, as well as construction work between Siju and Paradeep coaching yard under KUR Division. The original Letter of Acceptance was dated September 18, 2023, with a completion date of June 30, 2026. The company disclosed this information under SEBI listing regulations regarding material contract variations.",
            "Sentiment": "positive",
            "PublishDate": 1762240642060,
            "Source": "corporate_action"
        },
        {
            "Title": "Twamev Construction Promoter Group Member Sells 5 Lakh Equity Shares",
            "Summary": "Vijay Laxmi Tapuria, a promoter group member of Twamev Construction and Infrastructure Limited, sold 5,00,000 equity shares in the open market on September 26, 2025. The transaction reduced Tapuria's shareholding from 93,75,000 shares (6.05%) to 88,75,000 shares (5.73%) in the company. The shares were sold through open market transactions, with the company's total equity share capital remaining at 15,50,00,000 shares of Re. 1/- each. The disclosure was made under SEBI regulations for substantial acquisition and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1758963351025,
            "Source": "corporate_action"
        },
        {
            "Title": "Twamev Construction Promoter Releases Pledge on 25 Lakh Equity Shares",
            "Summary": "Tarun Chaturvedi, a promoter of Twamev Construction and Infrastructure Limited, released pledge on 25,07,607 equity shares out of his total holding of 65 lakh shares. The pledge release transaction occurred on September 24, 2025, with Jaswik Traders Private Limited as the lender. The pledge was originally created to secure a working capital loan. Following this release, Chaturvedi's total shareholding remains at 2,53,21,156 shares (16.34% of total share capital), while his encumbered shares reduced to 39,92,393 shares (2.56% of total share capital). The company's total equity share capital stands at 15.5 crore shares of Re. 1/- each.",
            "Sentiment": "neutral",
            "PublishDate": 1758869102956,
            "Source": "corporate_action"
        },
        {
            "Title": "Twamev Construction Promoter Pledges 1.6 Crore Shares to Secure Loan Facility",
            "Summary": "Tarun Chaturvedi, a promoter of Twamev Construction and Infrastructure Limited, has pledged 1,60,00,000 equity shares to Jaswik Traders Private Limited on August 14, 2025, to secure a loan against securities facility for working capital needs. The pledge represents 10.32% of the company's total share capital. Following this transaction, Chaturvedi's unencumbered shareholding decreased from 16.33% to 6.01%, while his total holding including pledged shares remains at 16.33%. The company's shares are listed on BSE and NSE with scrip code 532738 and symbol TICL respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1756111760012,
            "Source": "corporate_action"
        },
        {
            "Title": "Multiple Companies Publish Quarterly Financial Results for June 2025",
            "Summary": "Several companies published their unaudited financial results for the quarter ended June 30, 2025. Twamev Construction and Infrastructure Limited reported the publication of their quarterly results in Business Standard and Arthik Lipi newspapers. Tilaknagar Industries reported total income from operations of Rs. 850.01 lakhs and a net loss of Rs. 1,174.75 lakhs for the quarter. Sicagen India Limited showed total income from operations of Rs. 204.54 lakhs with net profit of Rs. 1.54 lakhs. RDC Concrete India Limited reported total income from operations of Rs. 631.82 lakhs with net profit of Rs. 42.92 lakhs. BCL Industries Limited posted total income from operations of Rs. 82,293.16 lakhs. Additionally, Nishta Mall Management Company Private Limited invited expressions of interest for mall management services under insolvency proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1755502524124,
            "Source": "earnings"
        },
        {
            "Title": "Twamev Construction Promoter Pledges 1.6 Crore Shares to Jaswik Traders for Loan Facility",
            "Summary": "Tarun Chaturvedi, a promoter of Twamev Construction and Infrastructure Limited, pledged 1.6 crore equity shares to Jaswik Traders Private Limited on August 14, 2025, to secure a Loan Against Securities facility for working capital requirements. The pledge represents 10.32% of the company's total share capital. Following this transaction, Chaturvedi's unencumbered shareholding decreased from 16.34% to 6.01%, while his total encumbered shares now stand at 10.32%. The company's shares are listed on BSE and NSE with a total equity capital of 15.5 crore shares of Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1755495256186,
            "Source": "corporate_action"
        },
        {
            "Title": "Twamev Construction Approves Quarterly Results and Sets 60th AGM Date for September 24, 2025",
            "Summary": "Twamev Construction and Infrastructure Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of INR 1,174 lakhs including INR 103 lakhs of unbilled revenue. The company scheduled its 60th Annual General Meeting for September 24, 2025, via video conferencing, with September 15, 2025 as the cut-off date for voting eligibility. The Board also approved alterations to the company's Memorandum and Articles of Association, subject to shareholder approval. The company is processing a resolution plan payment of INR 2,100 lakhs pending account upgrade from NPA status as per NCLT Kolkata order dated July 14, 2024. During the quarter, promoter Tarun Chaturvedi sold 46,48,086 equity shares through an Offer for Sale, reducing promoter shareholding from 94.33% to 91.33% to comply with minimum public shareholding requirements. The auditor's review highlighted several emphasis matters including pending arbitration proceedings and subsidiary-related issues.",
            "Sentiment": "neutral",
            "PublishDate": 1754994114943,
            "Source": "corporate_action"
        },
        {
            "Title": "Tantia Constructions: Secures Rs 151-Crore Ropeway Contract in Meghalaya",
            "Summary": "Tantia Constructions Ltd., in partnership with a third party, has won a Rs 151 crore contract from Meghalaya's Directorate of Tourism for a passenger ropeway at Shillong Peak. The project includes design, construction, and maintenance under the Meghalaya Ecotourism Infrastructure Development Project, funded by the New Development Bank.",
            "Sentiment": "positive",
            "PublishDate": 1733408257000,
            "Source": "order&deals"
        },
        {
            "Title": "Tantia Constructions Secures Lowest Bid for 1.51 Billion Rupee Project",
            "Summary": "Tantia Constructions has emerged as the lowest bidder for a project worth 1.51 billion rupees (approximately $18.3 million USD). This development suggests the company is well-positioned to secure a significant construction contract, potentially boosting its project portfolio and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1731548839000,
            "Source": "corporate_action"
        }
    ]
}