{
    "Symbol": "TIGERLOGS",
    "ISIN": "INE906O01029",
    "News": [
        {
            "Title": "Tiger Logistics Q3FY26 Results & Leadership Update",
            "Summary": "Tiger Logistics reports Q3FY26 financial results with net profit of ₹593.77 lakhs and announces re-appointment of Chairman & Managing Director for five years.",
            "Sentiment": "positive",
            "PublishDate": 1770892006249,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tiger Logistics Reports Strong Q2 Performance with 64.6% Revenue Growth and 88.9% EBITDA Jump",
            "Summary": "Tiger Logistics (India) Limited announced its unaudited financial results for Q2 H1 FY26, ending September 30, 2025. The company reported quarterly revenue of ₹16,873.1 lakhs, up 64.6% quarter-on-quarter and 5.3% year-on-year. EBITDA increased 88.9% quarter-on-quarter to ₹1,113.8 lakhs with margins improving to 6.6%. Profit after tax rose 83.1% quarter-on-quarter and 14.4% year-on-year to ₹861.9 lakhs, with margins at 5.1%. For the half-year period, revenue reached ₹27,125 lakhs (up 3.8% year-on-year), EBITDA stood at ₹1,703 lakhs (up 22.0% year-on-year), and PAT reached ₹1,333 lakhs (up 9.6% year-on-year). Chairman and MD Harpreet Singh Malhotra attributed the performance to broad-based operational momentum, disciplined cost control, and effective operating leverage across all business verticals.",
            "Sentiment": "positive",
            "PublishDate": 1762985507107,
            "Source": "earnings"
        },
        {
            "Title": "Tiger Logistics Signs MoU with Russia's H2 Invest for Liquid Hydrogen Transportation Technology in India",
            "Summary": "Tiger Logistics (India) Limited has signed a Memorandum of Understanding with H2 Invest Limited Liability Company, a Russian hydrogen technology enterprise, to collaborate on transportation and storage infrastructure for liquid hydrogen in India. The partnership will introduce cryogenic tanks for liquid hydrogen storage and transportation, integrating H2 Invest's CryoSafe container technology into India's hydrogen value chain. The joint venture will enable multimodal transportation of liquid hydrogen by truck, railway and container ships, and includes scope for technology transfer, local manufacturing, and joint implementation of large-scale industrial projects in the new energy sector. Chairman & Managing Director Harpreet Singh Malhotra stated that the collaboration combines global hydrogen technology with Indian logistics expertise to create scalable, sustainable solutions. The initiative aligns with India's National Green Hydrogen Mission to position the country as a global hub for green hydrogen production and utilization. The proposed joint venture will serve as a technology and manufacturing platform for hydrogen logistics, supporting both domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1760362943515,
            "Source": "order&deals"
        },
        {
            "Title": "Tiger Logistics (India) Gets NSE Listing Approval for September 18",
            "Summary": "Tiger Logistics (India) has received approval for listing and trading of its equity shares on the National Stock Exchange (NSE). The listing will be effective from September 18.",
            "Sentiment": "positive",
            "PublishDate": 1758033770518,
            "Source": "stock"
        },
        {
            "Title": "Tiger Logistics Board Approves Quarterly Results and Sets AGM Date for September 2025",
            "Summary": "Tiger Logistics (India) Limited's Board of Directors approved the unaudited quarterly financial results for the period ended June 30, 2025, along with the Limited Review Report from Statutory Auditors. The board also approved the Directors' Report for the financial year ended March 31, 2025, and scheduled the 25th Annual General Meeting for September 25, 2025, at 1:00 PM via video conferencing. Additional approvals included the appointment of a scrutinizer and CDSL for e-voting and AGM facilitation. The company announced that the Register of members will be closed from September 18-25, 2025. The board meeting was held on August 6, 2025, from 4:00 PM to 5:45 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1754486567146,
            "Source": "earnings"
        },
        {
            "Title": "Tiger Logistics Reports Marginal Growth in Q1 Results",
            "Summary": "Tiger Logistics (India) reported Q1 net profit of 47 million rupees compared to 46.2 million rupees in the same period last year. The company's revenue increased to 1.03 billion rupees from 1.01 billion rupees year-over-year. EBITDA rose to 59 million rupees from 51.6 million rupees, while EBITDA margin improved to 5.75% from 5.11% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754485741977,
            "Source": "earnings"
        },
        {
            "Title": "Tiger Logistics Wins 'Logistics Company of the Year' at All India Maritime and Logistics Awards 2025",
            "Summary": "Tiger Logistics (India) Limited received the 'Logistics Company of the Year' award at the 15th Edition of the All India Maritime and Logistics Awards 2025. The award ceremony took place on August 1, 2025, at Hotel JW Marriott, Mumbai. The company was recognized for its exceptional performance, customer-centric approach, sectoral diversification, and sustained growth across key industry verticals. The MALA Awards are organized annually by EXIM India and are considered one of the most credible recognitions in the Indian logistics industry. Tiger Logistics is celebrating its 25th year of operations in 2025. CMD Harpreet Singh Malhotra stated that the recognition reflects the team's commitment to operational excellence and customer trust, representing their journey of over 25 years in shaping India's global logistics landscape.",
            "Sentiment": "positive",
            "PublishDate": 1754311262146,
            "Source": "stock"
        },
        {
            "Title": "Tiger Logistics Secures Rs 7 Crore Solar Equipment Logistics Contract",
            "Summary": "Tiger Logistics (India) Limited announced the successful execution of multiple large-scale solar logistics projects through its renewable energy vertical, TiGreen. The company moved approximately 2 GW of solar manufacturing equipment in a single project, with shipment batch sizes of up to 200 containers. Key routes included shipments from Chinese ports (Qinzhou, Wuhu, Shanghai, and Ningbo) to Indian ports (Nhava Sheva, Mundra, Hazira, and Chennai). The company secured a specific contract from Goldi Solar Pvt Ltd for ocean logistics involving approximately 200 containers with sea freight charges of around Rs 7 crores, to be executed within 45 days. The projects involved end-to-end movement of high-value capital equipment from China to India for solar module manufacturing. CMD Harpreet Singh Malhotra stated that TiGreen's performance reinforces their position as a trusted logistics partner to the renewable energy sector and expects continued momentum driven by ongoing investments in solar infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1753795702166,
            "Source": "order&deals"
        },
        {
            "Title": "Tiger Logistics Subsidiary Secures Major Solar Logistics Contracts",
            "Summary": "Tiger Logistics announced that its subsidiary has won major contracts in solar logistics. The contracts represent a significant business development for the company's subsidiary operations in the renewable energy logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1753682700359,
            "Source": "stock"
        },
        {
            "Title": "Tiger Logistics Applies for Direct Listing on NSE Main Board",
            "Summary": "Tiger Logistics has filed an application for direct listing on the National Stock Exchange (NSE) Main Board. The company is seeking to transition from its current listing to the main board of the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1752756164000,
            "Source": "default"
        },
        {
            "Title": "Tiger Logistics (India) Approves Listing on NSE Main Board",
            "Summary": "Tiger Logistics (India) has approved the listing of the company on the main board of the National Stock Exchange (NSE). This decision represents a significant corporate action that could potentially increase the company's visibility and trading liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1751506339000,
            "Source": "default"
        },
        {
            "Title": "Tiger Logistics (India) Approved for Main NSE Board Listing",
            "Summary": "Tiger Logistics (India) has received approval to list on the main board of the National Stock Exchange (NSE). This move represents a significant milestone for the company, potentially increasing its visibility and trading liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1751461299000,
            "Source": "default"
        },
        {
            "Title": "Tiger Logistics (India) Reports Q4 Financial Results",
            "Summary": "Tiger Logistics (India) has announced its Q4 financial results. The company reported a net profit of 64 million rupees, compared to 40 million rupees in the same quarter last year (year-over-year) and 84 million rupees in the previous quarter (quarter-over-quarter). Revenue for Q4 stood at 1.15 billion rupees, up from 927 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748351688000,
            "Source": "result"
        },
        {
            "Title": "Tiger Logistics Secures Major Projects with BHEL and HPCL",
            "Summary": "Tiger Logistics has reported significant growth by securing new projects in the government and PSU sector. The company has specifically mentioned obtaining major projects with Bharat Heavy Electricals Limited (BHEL) and Hindustan Petroleum Corporation Limited (HPCL), indicating an expansion of their business portfolio in the public sector.",
            "Sentiment": "positive",
            "PublishDate": 1745885365000,
            "Source": "default"
        },
        {
            "Title": "Tiger Logistics Secures Major Projects with BHEL and HPCL",
            "Summary": "Tiger Logistics has announced new growth initiatives in its government and PSU business segment. The company has secured significant projects with Bharat Heavy Electricals Limited (BHEL) and Hindustan Petroleum Corporation Limited (HPCL), indicating an expansion of its operations in the public sector.",
            "Sentiment": "positive",
            "PublishDate": 1745844135000,
            "Source": "default"
        },
        {
            "Title": "Enforcement Directorate Visits Tiger Logistics Office and MD's Residence",
            "Summary": "The Enforcement Directorate (ED) has conducted visits to the office of Tiger Logistics (India) and the residence of its Managing Director. The company has stated that these visits have no material impact on Tiger Logistics' operations.",
            "Sentiment": "neutral",
            "PublishDate": 1745194884000,
            "Source": "default"
        },
        {
            "Title": "Enforcement Directorate Visits Tiger Logistics Office and MD's Residence",
            "Summary": "The Enforcement Directorate has conducted visits to the office of Tiger Logistics (India) and the residence of its Managing Director. The company has stated that these visits have no material impact on Tiger Logistics' operations.",
            "Sentiment": "neutral",
            "PublishDate": 1744896558000,
            "Source": "default"
        },
        {
            "Title": "Tiger Logistics (India) Ltd: Renewable Energy Vertical 'TiGreen' Drives Growth",
            "Summary": "Tiger Logistics' renewable energy vertical 'TiGreen' has seen significant growth, with monthly volumes reaching 1,500 TEUs, up from 300 TEUs in November 2024. The company projects additional annual revenue of ₹100-₹150 crores from renewable energy logistics and aims to increase volume to 3,500 TEUs per month in the next 3-6 months. Tiger Logistics has also experienced a substantial increase in solar module imports from China.",
            "Sentiment": "positive",
            "PublishDate": 1741252257000,
            "Source": "normal_news"
        },
        {
            "Title": "Tiger Logistics Anticipates Significant Revenue Growth from Renewable Energy Logistics",
            "Summary": "Tiger Logistics (TIGREEN) expects to generate an additional annual revenue of ₹100-₹150 crores from its renewable energy logistics operations. This growth trajectory positions the company for substantial expansion in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741237149000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tiger Logistics' Subsidiary Tigreen Targets Significant Revenue Growth",
            "Summary": "Tigreen, a subsidiary of Tiger Logistics, anticipates generating an additional annual revenue of ₹100-₹150 crores. The company aims to handle up to 3,500 TEUs (Twenty-foot Equivalent Units) per month within the next 3-6 months, indicating a substantial increase in their logistics operations and capacity.",
            "Sentiment": "positive",
            "PublishDate": 1741237127000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tiger Logistics' Renewable Energy Vertical 'Tigreen' Advances in Solar Logistics",
            "Summary": "Tiger Logistics has reported progress in its renewable energy vertical called 'Tigreen', which is focusing on solar logistics. This development indicates the company's expansion into the renewable energy sector, particularly in providing logistics services for solar energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1741237044000,
            "Source": "corporate_action"
        }
    ]
}