{
    "Symbol": "TIIL",
    "ISIN": "INE545H01011",
    "News": [
        {
            "Title": "Technocraft Industries Shares Q3FY26 Call Recording",
            "Summary": "Technocraft Industries (India) Limited releases audio recording of investor conference call discussing financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770895429321,
            "Source": "co_actions_results"
        },
        {
            "Title": "Technocraft Industries Q3FY26 Earnings Call on Feb 12",
            "Summary": "Technocraft Industries (India) Limited has scheduled a conference call on February 12, 2026, at 11:30 hrs IST to discuss its third quarter financial performance ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768975961648,
            "Source": "co_actions_results"
        },
        {
            "Title": "Technocraft Industries Gets ESG Score of 58 from CFC",
            "Summary": "Technocraft Industries (India) Limited receives ESG score of 58 from SEBI-licensed rating provider CFC Finlease Private Limited, disclosed under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768562588157,
            "Source": "stocks"
        },
        {
            "Title": "Technocraft Industries Reports Strong Q2 FY26 Results with 21% Revenue Growth",
            "Summary": "Technocraft Industries (India) Limited reported consolidated revenue of Rs 75,199.73 lakhs for Q2 FY26, up from Rs 62,056.53 lakhs in Q2 FY25, with net profit rising to Rs 7,917.08 lakhs from Rs 7,421.26 lakhs year-over-year. The company's Board approved the unaudited financial results for the quarter and half-year ended September 30, 2025, showing improved performance across its drum closures, scaffolding, yarn, and fabric divisions.",
            "Sentiment": "positive",
            "PublishDate": 1763054054129,
            "Source": "earnings"
        },
        {
            "Title": "Technocraft Industries Plans £10 Million UK Investment to Create 18 Jobs",
            "Summary": "Technocraft Industries (India) announced plans to invest £10 million in the UK market to support its growth strategy. The investment is expected to generate 18 new jobs in the country.",
            "Sentiment": "positive",
            "PublishDate": 1759992639766,
            "Source": "stock"
        },
        {
            "Title": "Technocraft Industries Reports Flat Q1 Performance Amid US Tariff Challenges, Formwork Business Shows Strong Growth",
            "Summary": "Technocraft Industries India Limited reported stable quarterly results despite challenging market conditions driven by US tariff increases. The company's scaffolding business faced headwinds with US sales declining approximately 35% quarter-on-quarter due to tariff-related demand disruptions. Current tariffs on scaffolding products stand at 23%, potentially rising to 34% if additional Russian-linked tariffs are implemented. The formwork business (Mach One) showed robust performance with the new Aurangabad plant operating at 75% capacity and expected to reach 90-95% utilization. The company maintains confidence in achieving INR 900 crores revenue from Mach One business, up from INR 520 crores previously. Management indicated that while scaffolding exports may face degrowth, the domestic formwork business remains strong with INR 350 crores order book representing approximately 4 months of sales. The engineering services division continues expansion with new operations in Japan, while textile operations face significant challenges from potential 50% tariffs on US exports.",
            "Sentiment": "neutral",
            "PublishDate": 1755167370558,
            "Source": "earnings"
        },
        {
            "Title": "Technocraft Industries Targets Global Infrastructure Growth with Scaffolding Business and Zero-Debt Strategy",
            "Summary": "Technocraft Industries plans to capitalize on global infrastructure development through its scaffolding business expansion while maintaining its leadership position in drum closure manufacturing. The company operates with zero debt and employs a diversified export strategy aimed at achieving consistent double-digit growth rates.",
            "Sentiment": "positive",
            "PublishDate": 1754923078138,
            "Source": "stock"
        },
        {
            "Title": "Technocraft Industries Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Technocraft Industries reported Q1 consolidated net profit of 794 million rupees, down from 804.5 million rupees in the same period last year. Revenue increased to 6.3 billion rupees compared to 6.2 billion rupees year-over-year. EBITDA declined to 1.1 billion rupees from 1.15 billion rupees, while EBITDA margin compressed to 17.66% from 18.69% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754917350740,
            "Source": "earnings"
        },
        {
            "Title": "Technocraft Industries Reports Q4 Results and Announces Dividend",
            "Summary": "Technocraft Industries has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 660 million rupees from 549 million rupees year-over-year. Q4 revenue rose to 7 billion rupees from 5.93 billion rupees in the previous year. EBITDA for Q4 improved to 1.1 billion rupees from 841 million rupees, with EBITDA margin expanding to 15.71% from 14.2% year-over-year. The company has recommended a dividend of 20 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748524149000,
            "Source": "result"
        },
        {
            "Title": "Technocraft Industries Reports Q3 Financial Results",
            "Summary": "Technocraft Industries has announced its Q3 consolidated financial results. The company reported a net profit of 398 million rupees, down from 583 million rupees in the same quarter last year. However, revenue increased to 6.44 billion rupees from 5.13 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320449000,
            "Source": "earnings"
        },
        {
            "Title": "Technocraft Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Technocraft Industries has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 925 million rupees from 720 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 14.35% from 14.04% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739281310000,
            "Source": "earnings"
        },
        {
            "Title": "Technocraft Industries Reports Q3 Financial Results",
            "Summary": "Technocraft Industries has announced its Q3 financial results. The company's consolidated net profit decreased to 398 million rupees from 583 million rupees year-over-year. However, revenue increased to 6.44 billion rupees from 5.13 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739281305000,
            "Source": "earnings"
        },
        {
            "Title": "Technocraft Industries Schedules Q3 Results Meeting",
            "Summary": "Technocraft Industries has announced that it will consider and approve its third quarter financial results on February 11. This meeting will likely provide insights into the company's performance for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737547986000,
            "Source": "earnings"
        },
        {
            "Title": "Technocraft Industries Anticipates Expansion of Customer Base and Sales",
            "Summary": "Technocraft Industries has announced that their current initiatives are expected to lead to an expansion of their customer base. The company also anticipates an increase in overall sales, both in terms of volume and value. This statement suggests a positive outlook for the company's growth and market position.",
            "Sentiment": "positive",
            "PublishDate": 1737441815000,
            "Source": "corporate_action"
        },
        {
            "Title": "Technocraft Industries Receives B Certification from Polish Institute",
            "Summary": "Technocraft Industries has been awarded the prestigious B Certification from the Quality and Certification Center of the Institute of Technology in Poland. This certification is likely to enhance the company's credibility and may indicate compliance with specific quality standards or sustainability practices.",
            "Sentiment": "positive",
            "PublishDate": 1737441794000,
            "Source": "corporate_action"
        }
    ]
}