{
    "Symbol": "TIINDIA",
    "ISIN": "INE974X01010",
    "News": [
        {
            "Title": "TII Acquires 87% Stake in Orange Koi for ₹73 Crores",
            "Summary": "Tube Investments of India Limited enters metal injection molding business through strategic acquisition of Orange Koi Private Limited, marking expansion into precision manufacturing for medical and defence sectors.",
            "Sentiment": "positive",
            "PublishDate": 1770375855489,
            "Source": "co_actions_results"
        },
        {
            "Title": "SMALLCAP World Fund reduces stake in Tube Investments",
            "Summary": "SMALLCAP World Fund, Inc. sold 46.42 lakh shares of Tube Investments of India Ltd through open market transactions, reducing its holding from 5.58% to 3.18% as per regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1769753240807,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tube Investments Allots 10,000 Shares Under ESOP",
            "Summary": "Tube Investments of India allotted 10,000 equity shares at Rs. 270.20 per share under Employee Stock Option Plan 2017, increasing outstanding shares to 19,35,19,670.",
            "Sentiment": "neutral",
            "PublishDate": 1769526644527,
            "Source": "co_actions_results"
        },
        {
            "Title": "TII India Q3FY26 Earnings Call on Feb 4, 2026",
            "Summary": "Tube Investments of India Limited announces earnings conference call scheduled for February 4, 2026 at 4:30 PM IST to discuss Q3FY26 results with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769157620128,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tube Investments Gets ESG Rating of 69 from NSE",
            "Summary": "Tube Investments of India Limited receives ESG rating of 69 from NSE Sustainability Ratings and Analytics Limited based on FY 2025 publicly disclosed information.",
            "Sentiment": "positive",
            "PublishDate": 1767882467444,
            "Source": "stocks"
        },
        {
            "Title": "Tube Investments Senior Management Change",
            "Summary": "Tube Investments announces retirement of Krishna Srinivas and appointment of Ganesh Gulab Kale as Senior Management Personnel effective January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767185777080,
            "Source": "stocks"
        },
        {
            "Title": "Tube Investments Allots 820 Shares Under ESOP",
            "Summary": "Tube Investments of India Limited allotted 820 equity shares on December 26, 2025, under Employee Stock Option Plan 2017, increasing outstanding shares to 19.35 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766733731591,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tube Investments of India Sees Rs. 312.05 Crore Block Trade on NSE",
            "Summary": "Tube Investments of India executed a block trade worth Rs. 312.05 crores involving approximately 1,171,764 shares at Rs. 2,663.10 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765338427146,
            "Source": "order&deals"
        },
        {
            "Title": "Tube Investments Receives Stock Exchange Approval for Yanmar Coromandel Agrisolutions Reclassification",
            "Summary": "Tube Investments of India Limited received no-objection letters from NSE and BSE for reclassifying Yanmar Coromandel Agrisolutions Private Limited from Promoter and Promoter Group Category to Public Category. The approvals were granted on December 5, 2025, following the company's application dated November 7, 2025, under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764949658459,
            "Source": "corporate_action"
        },
        {
            "Title": "Tube Investments of India Gets Credit Ratings Reaffirmed by ICRA Limited",
            "Summary": "ICRA Limited reaffirmed credit ratings for Tube Investments of India's facilities totaling Rs. 1,550 crores, including long-term fund-based facility rated ICRA [AA] (Stable) and short-term facilities rated ICRA [A1]. The ratings cover cash credit of Rs. 525 crores, interchangeable facility of Rs. 525 crores, LC/BG facility of Rs. 500 crores, and commercial paper of Rs. 525 crores.",
            "Sentiment": "positive",
            "PublishDate": 1764326044825,
            "Source": "stock"
        },
        {
            "Title": "Tube Investments Reports 11.5% PBT Growth in Q2 FY2026, Sees Strong Demand Post-GST Cuts",
            "Summary": "Tube Investments of India Limited reported quarterly results with standalone revenue at Rs. 2,119 crores compared to Rs. 2,065 crores in the same period previous year. Profit before tax grew 11.5% to Rs. 250 crores from Rs. 225 crores. The engineering division generated Rs. 1,382 crores revenue with 10% volume growth, while the mobility business reached Rs. 194 crores compared to Rs. 168 crores previously. At consolidated level, revenue was Rs. 5,523 crores versus Rs. 4,925 crores. The company reported strong demand uptick in October and November following GST rate changes on September 22nd. TI Clean Mobility's EV business grew 21% year-on-year and 31% quarter-on-quarter, delivering volumes of 2,082 three-wheelers, 44 heavy commercial vehicles, 167 small commercial vehicles, and 100 e-tractors. The company plans capital expenditure of Rs. 300-400 crores for the base business and additional investments in TI Medical and 3xper ventures.",
            "Sentiment": "positive",
            "PublishDate": 1762843332893,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Tube Investments of India reported quarterly results showing revenue growth to 55.22 billion rupees from 49.2 billion rupees year-over-year. However, net profit declined to 1.87 billion rupees compared to 2.07 billion rupees in the same period last year. EBITDA increased to 5.44 billion rupees from 4.9 billion rupees, while EBITDA margin slightly decreased to 9.86% from 9.96% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762336147581,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments Reports 11.5% Growth in Quarterly Profit Before Tax to Rs 250 Crores",
            "Summary": "Tube Investments of India Limited reported quarterly revenue of Rs 2,119 crores compared to Rs 2,065 crores in the same period last year. Profit before tax grew 11.5% to Rs 250 crores from Rs 225 crores in the corresponding quarter of the previous year. The company's Engineering segment generated revenue of Rs 1,382 crores with profit before interest and tax of Rs 164 crores. Metal Formed Products segment recorded revenue of Rs 408 crores with PBIT of Rs 44 crores. Mobility segment achieved revenue of Rs 194 crores with PBIT of Rs 4 crores, turning profitable from a loss of Rs 0.36 crores in the previous year. The company's consolidated revenue reached Rs 5,523 crores compared to Rs 4,925 crores in the corresponding quarter. The Board also approved a reclassification request from Yanmaar Coromandel Agrisolutions Private Limited to move from Promoter Group category to Public Shareholder category, subject to obtaining No Objection Certificate from stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1762335729468,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Allots 10,960 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Tube Investments of India Limited allotted 10,960 equity shares of Re. 1 each following the exercise of stock options by eligible employees under the Employee Stock Option Plan 2017. The allotment increased the company's outstanding equity shares from 19,34,97,890 to 19,35,08,850, with the paid-up equity share capital rising from Rs. 19,34,97,890 to Rs. 19,35,08,850. The company informed stock exchanges NSE and BSE about this allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1762268165038,
            "Source": "corporate_action"
        },
        {
            "Title": "Tube Investments of India Schedules Earnings Conference Call for November 5",
            "Summary": "Tube Investments of India Limited has announced a conference call for analysts and investors scheduled for November 5, 2025, at 4:30 PM IST. The call will discuss the company's unaudited financial results for the quarter and half year ended September 30, 2025. The management team participating includes Executive Chairman M A M Arunachalam, Vice Chairman Vellayan Subbiah, Managing Director Mukesh Ahuja, CFO A N Meyyappan, and division heads from TPI, MFPD, and TI Cycles. The session will feature an earnings performance discussion followed by a Q&A segment.",
            "Sentiment": "neutral",
            "PublishDate": 1761654424849,
            "Source": "earnings"
        },
        {
            "Title": "Yanmar Coromandel Seeks Reclassification from Promoter to Public Shareholder in Tube Investments of India",
            "Summary": "Yanmar Coromandel has requested to be reclassified from promoter status to public shareholder status in Tube Investments of India. This reclassification would change Yanmar Coromandel's ownership category within the company's shareholding structure.",
            "Sentiment": "neutral",
            "PublishDate": 1758114031460,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tube Investments of India Sees Rs. 91.06 Crore Block Trade on NSE",
            "Summary": "Tube Investments of India executed a block trade worth Rs. 91.06 crores on the National Stock Exchange. The transaction involved approximately 294,629 shares at a price of Rs. 3,090.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756793021391,
            "Source": "order&deals"
        },
        {
            "Title": "Tube Investments of India Sees Rs. 57.80 Crore Block Trade on NSE",
            "Summary": "Tube Investments of India executed a block trade worth Rs. 57.80 crores on the National Stock Exchange. The transaction involved approximately 190,931 shares at a price of Rs. 3,027.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756182814472,
            "Source": "order&deals"
        },
        {
            "Title": "Tube Investments Reports Q1 FY2026 Results with Revenue Growth Across Divisions",
            "Summary": "Tube Investments of India reported quarterly results with standalone revenue of Rs. 2,007 crores compared to Rs. 1,960 crores in the same period previous year. Profit before tax increased to Rs. 222 crores from Rs. 208 crores. The engineering division generated revenue of Rs. 1,298 crores with profit before interest and tax at Rs. 153 crores. Metal formed products division recorded revenue of Rs. 366 crores with PBIT of Rs. 37 crores. The mobility division showed improvement with revenue of Rs. 198 crores and PBIT of Rs. 7 crores compared to Rs. 2 crores previously. Consolidated revenue reached Rs. 5,309 crores versus Rs. 4,578 crores in the corresponding quarter. The company's EV business delivered 1,791 units including 45 e-trucks, 1,668 three-wheelers, 44 small commercial vehicles and 34 e-tractors. Management indicated that operational breakeven for the EV segment is unlikely to be achieved this year due to volume challenges. The company plans product refreshes and network expansion to address competitive pressures in the three-wheeler segment.",
            "Sentiment": "neutral",
            "PublishDate": 1754660342310,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments Expects Double-Digit EBITDA Growth, Plans Truck Battery Swapping by Year-End",
            "Summary": "Tube Investments of India management expects double-digit EBITDA growth for its standalone operations in the future. The company also announced that battery swapping services for trucks are expected to commence by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1754285006431,
            "Source": "stock"
        },
        {
            "Title": "Tube Investments of India Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "Tube Investments of India reported Q1 consolidated net profit of 3 billion rupees, down from 3.2 billion rupees in the same period last year. Revenue increased to 53 billion rupees compared to 45.8 billion rupees year-over-year. EBITDA rose to 5.46 billion rupees from 5.3 billion rupees, while EBITDA margin compressed to 10.3% from 11.6% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754037583243,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Sees ₹57.57 Crore Block Trade on NSE",
            "Summary": "Tube Investments of India executed a block trade worth ₹57.57 crores on the National Stock Exchange. The transaction involved approximately 199,664 shares at a price of ₹2,883.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753849383136,
            "Source": "order&deals"
        },
        {
            "Title": "Tube Investments of India Sees ₹57.22 Crore Block Trade on NSE",
            "Summary": "Tube Investments of India executed a block trade worth ₹57.22 crores on the National Stock Exchange. The transaction involved approximately 199,301 shares at a price of ₹2,870.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753847917953,
            "Source": "order&deals"
        },
        {
            "Title": "Tube Investments of India Schedules Earnings Call for August 4, 2025",
            "Summary": "Tube Investments of India Ltd has scheduled an earnings conference call for analysts and investors on August 4, 2025, at 10:00 AM IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The webinar will feature senior management including Vice Chairman Vellayan Subbiah, Executive Chairman M A M Arunachalam, Managing Director Mukesh Ahuja, and CFO A N Meyyappan, among others. The session will include an earnings performance discussion followed by an interactive Q&A session.",
            "Sentiment": "neutral",
            "PublishDate": 1753271509527,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 452,250 shares of Tube Investments of India Ltd. was executed on the National Stock Exchange (NSE) for Rs. 133.09 crores. The trade was conducted at a price of Rs. 2942.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752824491000,
            "Source": "block_details"
        },
        {
            "Title": "Tube Investments of India Ltd. Block Trade on NSE",
            "Summary": "A block trade of 209,539 shares of Tube Investments of India Ltd. was executed on the National Stock Exchange (NSE) for Rs. 61.44 crores. The trade was carried out at a price of Rs. 2932.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752822511000,
            "Source": "block_details"
        },
        {
            "Title": "Tube Investments of India Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 347,085 shares of Tube Investments of India Ltd. occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 100.22 crores, with shares priced at Rs. 2887.40 each.",
            "Sentiment": "neutral",
            "PublishDate": 1750910318000,
            "Source": "block_details"
        },
        {
            "Title": "Tube Investments of India: Q4 Revenue Dips, Profit Boosted by One-Time Gain",
            "Summary": "Tube Investments of India reported flat Q4 revenue at ₹1,957 crore. Net profit rose to ₹814 crore, aided by a one-time gain of ₹569 crore. EBITDA increased 5% YoY to ₹227.7 crore. Engineering segment revenue declined, while mobility segment revenue grew. The company approved a ₹300 crore borrowing plan for FY2026.",
            "Sentiment": "neutral",
            "PublishDate": 1747301286000,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Approves 3 Billion Rupee Fundraising",
            "Summary": "The board of Tube Investments of India has approved a fundraising initiative for 3 billion rupees (approximately $36 million USD). This decision indicates the company's intent to secure additional capital, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1747298842000,
            "Source": "result"
        },
        {
            "Title": "Tube Investments of India Reports Q4 Financial Results",
            "Summary": "Tube Investments of India has released its Q4 financial results. The company's EBITDA decreased to 3.4 billion rupees from 4.5 billion rupees year-over-year, with EBITDA margin falling to 6.54% from 10.05%. Revenue increased to 51.5 billion rupees from 45 billion rupees. Consolidated net profit declined to 460 million rupees from 1.9 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747298648000,
            "Source": "result"
        },
        {
            "Title": "Tube Investment of India to Consider Q4 Results on May 15",
            "Summary": "Tube Investment of India has announced that it will consider its fourth quarter (Q4) financial results on May 15. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746456266000,
            "Source": "default"
        },
        {
            "Title": "Tube Investments of India Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 123,246 shares of Tube Investments of India Ltd. occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 31.65 Crores, with shares priced at Rs. 2568.30 each.",
            "Sentiment": "neutral",
            "PublishDate": 1745559723000,
            "Source": "block_details"
        },
        {
            "Title": "Tube Investments of India Ltd. Reports Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 205,825 shares of Tube Investments of India Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 2845.00 per share. The total value of this transaction amounts to Rs. 58.56 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1742875844000,
            "Source": "block_deals"
        },
        {
            "Title": "Tube Investments of India Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Tube Investments of India Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 251,537 shares, valued at Rs. 71.59 crores. The transaction price was Rs. 2846.05 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1742289208000,
            "Source": "block_deals"
        },
        {
            "Title": "Tube Investments of India Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 67,901 shares of Tube Investments of India Ltd. was executed on the National Stock Exchange (NSE) for Rs. 18.56 Crores. The trade was conducted at a price of Rs. 2733.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741580825000,
            "Source": "block_deals"
        },
        {
            "Title": "Tube Investments of India Ltd. Reports Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 235,597 shares of Tube Investments of India Ltd. was reported on the National Stock Exchange (NSE). The transaction was valued at Rs. 64.41 crores, with shares trading at Rs. 2733.85 each.",
            "Sentiment": "neutral",
            "PublishDate": 1741580432000,
            "Source": "block_deals"
        },
        {
            "Title": "Tube Investments of India Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Tube Investments of India Ltd. on the National Stock Exchange (NSE). The transaction involved approximately 407,427 shares, traded at a price of Rs. 2555.35 per share. The total value of the block trade amounted to Rs. 104.11 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740990431000,
            "Source": "block_deals"
        },
        {
            "Title": "Tube Investments of India Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Tube Investments of India Ltd. on the National Stock Exchange (NSE). The transaction involved approximately 300,300 shares, valued at Rs. 75.87 crores. The average price per share in this trade was Rs. 2526.55.",
            "Sentiment": "neutral",
            "PublishDate": 1740988299000,
            "Source": "block_deals"
        },
        {
            "Title": "Tube Investments Reports Volatile Market Conditions and Muted Engineering Division Performance",
            "Summary": "During a conference call, Tube Investments stated that the current market situation remains volatile, making it difficult to predict when growth will return. The company also reported that its engineering division's business topline has been muted due to the impact of metal prices.",
            "Sentiment": "negative",
            "PublishDate": 1738646464000,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Reports Q3 Revenue Growth",
            "Summary": "Tube Investments of India has announced its third-quarter revenue results. The company reported revenue of 48.1 billion rupees, compared to 42 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738571467000,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Reports Q3 Financial Results",
            "Summary": "Tube Investments of India has released its Q3 financial results. The company's EBITDA for the quarter increased to 4.92 billion rupees, up from 4.7 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 10.2% from 11.15% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738571436000,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Reports Q3 Net Profit Decline",
            "Summary": "Tube Investments of India has reported a consolidated net profit of 1.94 billion rupees for the third quarter, marking a significant decrease from 5.3 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738571407000,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Acquires Majority Stake in KCal Tech System India",
            "Summary": "Tube Investments of India has acquired a 67% equity stake in KCal Tech System India. This acquisition represents a significant corporate action, potentially expanding Tube Investments' portfolio and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1738323515000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tube Investments of India: Stock Drops 4.2% Amid Market Decline",
            "Summary": "Tube Investments of India Ltd. shares traded at Rs 3231.00 on BSE, down 4.2% from the previous close. The stock hit a 52-week low of Rs 3207.00. Market value stood at Rs 62483.31 crore. In the BSE500, 61 stocks were up while 438 were down.",
            "Sentiment": "negative",
            "PublishDate": 1737534878000,
            "Source": "normal_news"
        },
        {
            "Title": "Tube Investments of India Ltd: Stock Trades 0.7% Higher on BSE",
            "Summary": "Tube Investments of India Ltd shares traded at Rs 3415.00 on BSE, up 0.7% from the previous close. The company's market value stood at Rs 66208.70 crore. Trading volume was 1,474 lakh shares as of 10:48AM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1737436693000,
            "Source": "normal_news"
        },
        {
            "Title": "Tube Investments to Consider Q3 Results on February 3",
            "Summary": "Tube Investments of India Limited has announced that it will consider its third quarter (Q3) financial results on February 3. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737386438000,
            "Source": "earnings"
        },
        {
            "Title": "Tube Investments of India Ltd: Stock Rises 0.91% Amid Market Trading",
            "Summary": "Tube Investments of India Ltd shares traded at Rs 3436.95 on BSE, up 0.91% from the previous close. The stock has a market value of Rs 66601.03 crore. Promoters held 44.97% stake as of 30-Sep-2024, while FPIs and DIIs owned 28.38% and 14.7% respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1737361088000,
            "Source": "normal_news"
        },
        {
            "Title": "Tube Investments of India: Share Price Rises Amid Market Decline",
            "Summary": "Tube Investments of India Ltd. saw a 2.61% increase in share price to Rs 3410.45 during Friday's trade, despite the Sensex dropping 388.23 points. The stock had a trading volume of 2696 shares with a value of Rs 0.91 crore on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1737088815000,
            "Source": "normal_news"
        },
        {
            "Title": "Tube Investments of India Ltd: Shares Rise 1.58% in Thursday Trading",
            "Summary": "Tube Investments of India Ltd. shares increased by 1.58% to Rs 3347.15 during Thursday's trading session. The company's market cap stands at Rs 64740.33 crore. For Q2 FY2025, the company reported consolidated sales of Rs 4995.24 crore, up 14.38% YoY, and net profit of Rs 206.79 crore, up 21.48% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1737005773000,
            "Source": "normal_news"
        },
        {
            "Title": "Tube Investments of India: Stock Dips 1.25% Amid Market Fluctuations",
            "Summary": "Tube Investments of India Ltd. shares fell 1.25% to Rs 3283.20 in Wednesday's trade. The stock fluctuated between Rs 3336.40 and Rs 3250.00. Trading volume resulted in a turnover of Rs 1.04 crore. The company's ROE stands at 23.54%. Promoters hold 44.7% stake, FIIs 28.39%, and domestic institutional investors 9.52%.",
            "Sentiment": "neutral",
            "PublishDate": 1736928853000,
            "Source": "normal_news"
        }
    ]
}