{
    "Symbol": "TIJARIA",
    "ISIN": "INE440L01017",
    "News": [
        {
            "Title": "Tijaria Polypipes Reports Quarterly Loss Amid Ongoing Bank of India NPA Case",
            "Summary": "Tijaria Polypipes Limited reported a net loss of Rs 39.60 lacs for the quarter ended September 30, 2025, compared to a loss of Rs 26.62 lacs in the previous quarter. The company generated no revenue from operations during the quarter, with total income of Rs 10.06 lacs coming entirely from other income sources. The company faces significant financial challenges as Bank of India declared its account as Non-Performing Asset (NPA) with outstanding loan amount of Rs 7,116.27 lacs and bank guarantee of Rs 57 lacs. Bank of India has filed a case against the company with the National Company Law Tribunal (NCLT), Jaipur Bench, with the next hearing scheduled for December 1, 2025. The bank has forfeited equity shares worth Rs 540.27 lacs belonging to promoters and directors. During previous financial years, the bank sold forfeited shares totaling Rs 4,65,27,031 in 2023-24 and Rs 76,33,435 in 2022-23, with proceeds credited towards outstanding loan amounts. The company has no production activities during the quarter and has outstanding receivables and advances of Rs 2,517 lacs from various entities. The auditors issued a disclaimer of conclusion due to multiple concerns including lack of independent confirmation for major outstanding amounts and uncertainty over asset recoverability.",
            "Sentiment": "negative",
            "PublishDate": 1762982516268,
            "Source": "earnings"
        },
        {
            "Title": "Tijaria Polypipes Reports Net Loss of ₹26.62 Lacs in Q1 FY2026",
            "Summary": "Tijaria Polypipes Limited reported a net loss of ₹26.62 lacs for the quarter ended June 30, 2025, compared to a loss of ₹61.61 lacs in the same quarter last year. The company generated no revenue from operations during the quarter, with total income of ₹2.14 lacs coming entirely from other income sources. Total expenses stood at ₹28.76 lacs, primarily driven by depreciation costs of ₹19.01 lacs and other expenditures of ₹8.65 lacs. Basic and diluted earnings per share were -₹0.09. The company operates in two segments - Pipes (including HDPE, PVC pipe, irrigation systems) and Textiles (including mink blankets, masks). Both segments reported negative results, with the Pipe segment posting a loss of ₹12.90 lacs and Textile segment losing ₹13.29 lacs. The company's balance sheet shows negative total equity of ₹3,276.86 lacs and total borrowings of ₹7,740.25 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1754997371853,
            "Source": "earnings"
        }
    ]
}