{
    "Symbol": "TIL",
    "ISIN": "INE806C01018",
    "News": [
        {
            "Title": "TIL Limited Reschedules Board Meeting to Feb 13, 2026",
            "Summary": "TIL Limited postponed its board meeting from February 9 to February 13, 2026, to consider Q3FY26 unaudited financial results due to unavoidable circumstances.",
            "Sentiment": "neutral",
            "PublishDate": 1770267821705,
            "Source": "co_actions_results"
        },
        {
            "Title": "TIL Limited Holds EGM for Director Appointments",
            "Summary": "TIL Limited conducted an Extraordinary General Meeting on 28th January, 2026, to approve the appointment of two new directors - Mr. Anurag Srivastava as Non-Executive Director and Mr. Vijay Singh Chauhan as Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1769609796447,
            "Source": "stocks"
        },
        {
            "Title": "TIL Limited EGM Scheduled for January 28, 2026",
            "Summary": "TIL Limited announces Extraordinary General Meeting on January 28, 2026 via video conference to approve appointments of Anurag Srivastava as Non-Executive Director and Vijay Singh Chauhan as Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1766378833177,
            "Source": "stocks"
        },
        {
            "Title": "TIL Limited Reports Loss of Rs 1,394 Lakhs for Six Months Ended September 2025, Appoints New Director",
            "Summary": "TIL Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported a consolidated net loss of Rs 73 lakhs for the quarter and Rs 1,394 lakhs for the six-month period. Revenue from operations stood at Rs 7,264 lakhs for the quarter and Rs 14,462 lakhs for the half year. The Board appointed Mr. Anurag Srivastava as Additional Non-Executive Director effective November 10, 2025. Srivastava is currently Managing Director & CEO of Parasea Coal Mine Project at Gainwell Group and is a 2007 batch IAS officer with over 18 years of leadership experience. The company operates in material handling solutions, manufacturing equipment like mobile cranes, port equipment, and road construction equipment. Other income for the quarter included Rs 179 lakhs towards liabilities no longer required written back.",
            "Sentiment": "negative",
            "PublishDate": 1762790926036,
            "Source": "earnings"
        },
        {
            "Title": "TIL Limited Approves Q1 FY26 Results and Appoints Pinaki Niyogy as Key Managerial Personnel",
            "Summary": "TIL Limited's Board of Directors approved unaudited financial results for the first quarter ended June 30, 2025, and appointed Mr. Pinaki Niyogy as Key Managerial Personnel. Niyogy, who serves as Chief Technology Officer & Chief Operating Officer, has been with the company for over three decades and was re-designated to his current role in January 2024. The company allotted 37,50,000 warrants on June 9, 2025, at an issue price of Rs. 160 each on preferential basis, receiving Rs. 1,500 lakhs as warrant subscription money. TIL Limited operates in material handling solutions, manufacturing mobile cranes, port equipment, and construction equipment primarily within India. The company faces a SEBI penalty of Rs. 100 lakhs from May 2024, which has been stayed by Securities Appellate Tribunal pending appeal resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1754993438116,
            "Source": "earnings"
        },
        {
            "Title": "TIL Ltd: Forms Defence Business Unit, Eyes Rs 2,000 Crore Orders",
            "Summary": "TIL Ltd has formed a strategic business unit, TIL Defence, to support its expanding defence portfolio. The company aims to secure domestic defence orders worth Rs 2,000 crore over the next five years. TIL plans to focus on manufacturing approved designs, partnering with India's defence establishment and Defence PSUs, and modernizing key platforms with advanced technologies.",
            "Sentiment": "positive",
            "PublishDate": 1749472179000,
            "Source": "corporate_action"
        },
        {
            "Title": "TIL Launches 'TIL Defence' Strategic Business Unit",
            "Summary": "TIL (Tractors India Limited) has announced the creation of a new Strategic Business Unit (SBU) called 'TIL Defence'. This new unit is designed to consolidate the company's growing portfolio in the defense sector and enhance its role as a key supplier for the Indian Armed Forces. The move aims to boost the production of indigenous military equipment.",
            "Sentiment": "positive",
            "PublishDate": 1749467334000,
            "Source": "default"
        },
        {
            "Title": "TIL Reports Improved Q4 Financial Results",
            "Summary": "TIL (presumably a company) has reported its Q4 financial results. The company's net profit before exceptional items was 129 million rupees, compared to a loss of 339 million rupees in the same quarter last year. Revenue increased to 1 billion rupees from 314 million rupees year-over-year. EBITDA showed a gain of 121 million rupees, compared to a loss of 281 million rupees in the previous year's Q4. The EBITDA margin for the quarter was 11.94%.",
            "Sentiment": "positive",
            "PublishDate": 1748252153000,
            "Source": "result"
        },
        {
            "Title": "TIL Board to Consider Raising Equity Capital",
            "Summary": "TIL (Tata Investment Limited) has announced a board meeting scheduled for March 24 to consider raising equity capital. This decision could potentially impact the company's financial structure and shareholder value.",
            "Sentiment": "neutral",
            "PublishDate": 1742380935000,
            "Source": "corporate_action"
        },
        {
            "Title": "TIL Limited Considers Fund Raise of Up to 150 Crore Rupees",
            "Summary": "TIL Limited, a company with a market capitalization of 2086 crore rupees, is planning to consider raising funds up to 150 crore rupees through the issuance of equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1735803270000,
            "Source": "corporate_action"
        },
        {
            "Title": "TIL Company to Consider Raising Equity Capital",
            "Summary": "TIL Company has announced that it will consider raising equity capital on January 2. This decision suggests the company may be looking to increase its financial resources, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1735041860000,
            "Source": "corporate_action"
        },
        {
            "Title": "TIL Reports Improved Q2 EBITDA Performance",
            "Summary": "TIL (likely referring to TIL Limited) has reported a significant improvement in its Q2 EBITDA performance. The company achieved an EBITDA gain of 24 million rupees, compared to a loss of 115 million rupees in the same quarter of the previous year. The Q2 EBITDA margin was reported at 3.6%.",
            "Sentiment": "positive",
            "PublishDate": 1731059093000,
            "Source": "result"
        },
        {
            "Title": "TIL Renews Agreement with Hyster-Yale Asia-Pacific",
            "Summary": "<p>TIL (Transport and Infrastructure Leasing) has announced the <span class='positive'>renewal</span> of its dealer sales and service agreement with Hyster-Yale Asia-Pacific Pte. This <span class='positive'>continuation of partnership</span> suggests a <span class='positive'>stable</span> business relationship between the two companies in the Asia-Pacific region.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728305907000,
            "Source": "corporate_action"
        }
    ]
}