{
    "Symbol": "TIMETECHNO",
    "ISIN": "INE508G01029",
    "News": [
        {
            "Title": "Time Technoplast QIP Proceeds Update Q3 FY26",
            "Summary": "Time Technoplast utilized Rs. 340.03 crore from its Rs. 800.00 crore QIP in Q3 FY26, primarily for debt repayment and subsidiary investment, with Rs. 459.97 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770910916426,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Q3 FY26 earnings call on Feb 13",
            "Summary": "Time Technoplast Limited has scheduled its Q3 & 9MFY26 earnings conference call for February 13, 2026 at 16:00 IST, with senior management participation including MD Bharat Kumar Vageria.",
            "Sentiment": "neutral",
            "PublishDate": 1770480134370,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast unit signs exclusive battery deal",
            "Summary": "PowerBuild Batteries, subsidiary of Time Technoplast, enters exclusive distribution agreement with European battery manufacturer Monbat AD for VRLA battery solutions in India's data centre market.",
            "Sentiment": "positive",
            "PublishDate": 1770175934316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Repays Commercial Paper on Schedule",
            "Summary": "Time Technoplast Limited successfully completed timely repayment of commercial paper worth maturity amount on February 02, 2026, as per SEBI operational guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1770030554721,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Repays Commercial Paper on Maturity",
            "Summary": "Time Technoplast Limited successfully repaid its commercial paper worth maturity amount on January 29, 2026, as per scheduled maturity date, complying with SEBI operational guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1769687747245,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Time Technoplast Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769609888496,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Gets PESO Approval for Composite Cylinders",
            "Summary": "Time Technoplast becomes first Indian company to receive PESO approval for manufacturing Type-3 composite cylinders for high-pressure gas applications including hydrogen, oxygen, and medical uses.",
            "Sentiment": "positive",
            "PublishDate": 1767267914995,
            "Source": "stocks"
        },
        {
            "Title": "Time Technoplast Wins ₹510 Crore Contract",
            "Summary": "Time Technoplast has secured a significant contract valued at approximately ₹510 crores, marking a major business development for the plastic products manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1767181239176,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Wins ₹51 Cr HPCL Contract",
            "Summary": "Time Technoplast secured a ₹51 crore domestic supply contract from HPCL for rigid polymer packaging products, to be executed over two years as per delivery schedule.",
            "Sentiment": "positive",
            "PublishDate": 1767180110571,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Completes Another Commercial Paper Repayment",
            "Summary": "Time Technoplast Limited successfully repaid commercial paper INE508G14HS1 worth maturity amount on December 24, 2025, following December 23 record date. Second repayment within days demonstrates strong liquidity management.",
            "Sentiment": "positive",
            "PublishDate": 1766402386114,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Technoplast Completes H2 Drone Trials Successfully",
            "Summary": "Time Technoplast announces successful completion of hydrogen-powered drone trials with Type-III composite cylinders, positioning company at forefront of clean aviation technology with commercial deployment potential.",
            "Sentiment": "positive",
            "PublishDate": 1766374766041,
            "Source": "stocks"
        },
        {
            "Title": "Time Technoplast Partners with German Firm and Imperial Auto for Hydrogen Systems Development in India",
            "Summary": "Time Technoplast Ltd., Poppe Potthoff GmbH (Germany), and Imperial Auto Industries Ltd. have formed a strategic partnership to develop and deploy comprehensive hydrogen system solutions across India. The collaboration combines expertise in high-pressure Type-IV composite cylinders, precision engineering, and fluid-conveyance assemblies to strengthen India's hydrogen infrastructure spanning storage, distribution, and end-use applications.",
            "Sentiment": "positive",
            "PublishDate": 1765273464907,
            "Source": "order&deals"
        },
        {
            "Title": "Time Exports Acquires Additional Stake in Time Technoplast Through Open Market Purchase",
            "Summary": "Time Exports Private Limited, a promoter of Time Technoplast Limited, purchased 1,44,112 equity shares (0.03% stake) from the open market at an average price of Rs. 198.16 per share. The acquisition increases the promoter group's total holding in Time Technoplast to 47.49% from the previous 47.46%.",
            "Sentiment": "neutral",
            "PublishDate": 1763793741599,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Maintains 15% Volume Growth Target, Projects 11-12% Revenue Growth",
            "Summary": "Time Technoplast has maintained its volume growth forecast at 15% and expects revenue growth of 11-12% with potential 3-4% variation due to lower polymer prices. The company anticipates annual EBITDA margin improvement of 30-40 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1763436905439,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Plans Multi-Year Expansion with ₹1,200 Cr Capex for Hydrogen and Composite Cylinders",
            "Summary": "Time Technoplast announced plans to expand global hydrogen cylinder manufacturing capacity to 1.2 million units per annum by FY28, backed by strong order inflows from oil & gas majors and EV OEMs. The company is targeting ₹1,200 crore capex over 3 years for advanced polymers and renewables, focusing on 25%+ export growth CAGR and sustained EBITDA margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763137165805,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Reports Strong Growth with 14.4% Revenue Rise and Completes ₹800 Crore QIP",
            "Summary": "Time Technoplast delivered robust quarterly results with total income growing 14.4% to ₹13,715 million and PAT increasing 17.4% to ₹1,154 million, driven by 22% growth in composite cylinders and focus on value-added products. The company successfully completed a ₹800 crore QIP raising funds for debt repayment, automation investments, and expansion of its recycling subsidiary Time Ecotech, while maintaining strong margins and reducing net debt by ₹564 million.",
            "Sentiment": "positive",
            "PublishDate": 1763130289608,
            "Source": "earnings"
        },
        {
            "Title": "Time Technoplast Closes QIP Issue, Raises Funds Through Allocation of 3.98 Crore Shares",
            "Summary": "Time Technoplast Limited completed its Qualified Institutional Placement (QIP) on November 11, 2025. The company's committee of directors approved the closure of the issue and allocated 3,97,77,247 equity shares to eligible qualified institutional buyers at an issue price of Rs. 201.12 per share with a face value of Rs. 1 each. The issue price included a premium of Rs. 200.12 per share and represented a 5% discount on the floor price of Rs. 211.70 per share. The QIP issue was opened on November 6, 2025 and closed on November 11, 2025 after receiving application forms and funds in the company's escrow account from eligible QIBs. The company also approved the placement document and finalized allocation notes for the participating institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1762878058677,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Opens QIP at Floor Price of ₹211.70 Per Share",
            "Summary": "Time Technoplast's Committee of Directors approved the opening of a Qualified Institutional Placement (QIP) of equity shares with a face value of ₹1 each. The floor price has been set at ₹211.70 per equity share based on SEBI ICDR regulations pricing formula, with the relevant date being November 6, 2025. The company may offer a discount of up to 5% on the floor price. The QIP received prior board approval on October 25, 2024, and shareholder approval through postal ballot on November 28, 2024. The issue price will be determined in consultation with the appointed lead manager. The trading window for designated persons remains closed from October 1, 2025, until 48 hours after declaration of quarterly financial results for the quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762461106296,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Secures ₹190 Crore HDPE Pipe Order for Amaravathi Development Projects",
            "Summary": "Time Technoplast received an order worth approximately ₹190 crore from an EPC contractor for supplying HDPE pipe products for power duct applications in projects by Amaravathi Development Corporation Limited and Andhra Pradesh Capital Region Development Authority. The order brings the company's cumulative order book for HDPE pipes to around ₹280 crore. The company operates four manufacturing facilities across India with an annual production capacity of approximately ₹450 crore for HDPE pipe products. In FY2024-25, revenue from the HDPE pipe segment was around ₹283 crore. The company expects the Indian pipe market to grow at a CAGR exceeding 20% due to government investments in infrastructure and smart city development projects.",
            "Sentiment": "positive",
            "PublishDate": 1761834031379,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Subsidiary Gets ICAT Approval for E-Rickshaw Batteries",
            "Summary": "Time Technoplast's subsidiary Power Build Batteries received ICAT approval for its e-rickshaw batteries. The product meets OEM standards and is expected to generate ₹150 crore in revenue over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1760934501485,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Secures BIS License for PE Pipes, Enters Gas Distribution Sector",
            "Summary": "Time Technoplast has obtained a BIS (Bureau of Indian Standards) license for PE pipes under the IS 14885:2022 standard. This licensing enables the company to enter the gas distribution sector as planned.",
            "Sentiment": "positive",
            "PublishDate": 1759238694824,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Shares Trade Ex-Bonus as 1:1 Bonus Issue Takes Effect",
            "Summary": "Time Technoplast shares are trading adjusted for their 1:1 bonus issue with a record date of September 23. Shareholders who held shares as of Monday's close will receive one bonus share for every share held, while those purchasing today are not eligible. This marks the company's first bonus issue. The company recently secured a ₹67.2 crore contract for CNG/CBG mobile storage cascades on September 9. In its June quarter results, Time Technoplast reported net profit growth of 41% to ₹80.5 crore and revenue increase of 14% to ₹1,230 crore compared to the previous year. The stock closed the previous session at ₹476.9, down 0.6%, but has gained 18.5% over the last six months.",
            "Sentiment": "positive",
            "PublishDate": 1758593403242,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Sets Record Date for 1:1 Bonus Share Issue",
            "Summary": "Time Technoplast Limited has set September 15, 2025 as the record date for issuing bonus shares in a 1:1 ratio. Eligible shareholders will receive one new fully paid-up equity share of ₹1 for every existing share held. The bonus issue is subject to shareholder approval at the Annual General Meeting scheduled for September 11, 2025 at 4:00 PM, along with other statutory and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1757428949786,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Signs MoU to Acquire 74% Stake in Ebullient Packaging for ₹200 Cr",
            "Summary": "Time Technoplast Limited has entered into a Memorandum of Understanding to acquire a 74% equity stake in Ebullient Packaging Private Limited at an enterprise value of approximately ₹200 Cr. EPPL manufactures Flexible Intermediate Bulk Containers (FIBCs), polymer drums, jerry cans, and steel containers, serving industries including chemicals, pharmaceuticals, FMCG, agriculture, and food processing. The company reported revenues of ₹210 Cr for FY 2024-25 and projects ₹250 Cr for FY 2026 with a 10% EBITDA margin. EPPL has a strong presence in Western India and exports primarily to Europe. The acquisition will enable TTL to enter the flexible industrial packaging segment and expand its product portfolio beyond rigid packaging. The transaction is subject to customary due diligence including financial, legal, taxation, and regulatory reviews, with completion expected in 4 to 6 months. The consideration will be paid in cash, with the final price to be determined based on due diligence findings.",
            "Sentiment": "positive",
            "PublishDate": 1757166459419,
            "Source": "order&deals"
        },
        {
            "Title": "Time Technoplast Appoints New Joint Statutory Auditor After Resignation Due to Resource Constraints",
            "Summary": "Time Technoplast Limited announced that M/s. Khandelwal Jain & Co., one of its Joint Statutory Auditors, resigned citing resource constraints in auditing multiple factory locations. The auditing firm stated they were required to cover 23-24 plants within short timeframes, which strained their resources heavily given other client commitments. The Board approved the appointment of M/s. Raman S. Shah & Co. as the new Joint Statutory Auditor to replace the resigning firm. The Audit Committee confirmed no concerns or issues were raised by the outgoing auditors beyond the stated resource constraints. M/s. Raman S. Shah & Co., established in 1982, will serve for five consecutive years upon shareholder approval at the upcoming Annual General Meeting scheduled for September 11, 2025. The firm specializes in audit and advisory services across manufacturing sectors including pharmaceuticals, chemicals, polymers, textiles, logistics, and real estate.",
            "Sentiment": "neutral",
            "PublishDate": 1755088951722,
            "Source": "corporate_governance"
        },
        {
            "Title": "Time Technoplast Projects Double-Digit Growth Across Business Segments for FY26",
            "Summary": "Time Technoplast has outlined its growth projections for FY26, targeting 10-12% growth in packaging and 28-30% growth in composite products while aiming for a 20% return on capital. The company expects revenue of ₹125-150 crore from energy storage devices, with e-rickshaw batteries contributing ₹35-50 crore. Following expansion plans, Time Technoplast anticipates generating ₹700 crore in revenue from CNG/hydrogen cylinders.",
            "Sentiment": "positive",
            "PublishDate": 1755056272029,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Sets September 4, 2025 as Record Date for Final Dividend Eligibility",
            "Summary": "Time Technoplast Limited has announced September 4, 2025 as the record date for determining shareholders eligible to receive the final dividend for Financial Year 2024-25. The dividend payment is subject to declaration at the company's 35th Annual General Meeting. Shareholders holding equity shares with face value of Rs. 1 each as of the record date will be eligible for the dividend payment.",
            "Sentiment": "neutral",
            "PublishDate": 1754996349287,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Targets 20% Growth Over Next 3 Years",
            "Summary": "Time Technoplast aims to achieve over 20% growth rate in the next three years. The growth strategy is supported by hydrogen cylinders, CNG, and composite products. The company reports strong orders, increased capacity, and global presence in clean energy storage, which are expected to drive ongoing growth and improved profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754930347734,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Approves 1:1 Bonus Share Issue and Reports Q1 FY26 Results",
            "Summary": "Time Technoplast Limited's board approved a 1:1 bonus equity share issuance, subject to shareholder and regulatory approvals. For the quarter ended June 30, 2025, the company reported consolidated revenue of ₹1,352.65 crores compared to ₹1,230.05 crores in the same quarter last year. Net profit after tax increased to ₹96.55 crores from ₹80.46 crores year-on-year. Earnings per share stood at ₹4.19 versus ₹3.49 in the previous year. The board also approved increasing authorized share capital from ₹52.50 crores to ₹100 crores and re-appointed three whole-time directors. The company scheduled its 35th Annual General Meeting for September 11, 2025, with book closure dates from September 5-11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754928308393,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Reports 20% Growth in Quarterly Net Profit to 951 Million Rupees",
            "Summary": "Time Technoplast reported consolidated net profit of 951 million rupees compared to 793 million rupees in the same quarter last year, marking a year-over-year increase. The company's revenue grew to 13.25 billion rupees from 12.3 billion rupees in the corresponding period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754927859069,
            "Source": "earnings"
        },
        {
            "Title": "Time Technoplast Partners with Drone Stark Technologies for Hydrogen-Powered Drone Development",
            "Summary": "Time Technoplast has signed a memorandum of understanding with Drone Stark Technologies to develop hydrogen-powered drones. The collaboration will utilize composite hydrogen cylinders and fuel cell technology in the drone development process.",
            "Sentiment": "positive",
            "PublishDate": 1754561972809,
            "Source": "stock"
        },
        {
            "Title": "Time Technoplast Limited Completes Full Repayment of Commercial Paper",
            "Summary": "Time Technoplast Limited has repaid the full maturity amount of its commercial paper on July 28, 2025, as scheduled. The commercial paper with ISIN INE508G14HE1 and scrip code 728666 was repaid in full on its maturity date. The company had previously set July 25, 2025 as the record date for the repayment process.",
            "Sentiment": "positive",
            "PublishDate": 1753704358086,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Targets 20% ROCE for FY26",
            "Summary": "Time Technoplast has set a target Return on Capital Employed (ROCE) of 20% for the fiscal year 2026, according to their investor presentation. The company has not provided additional details or context for this target in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748399567000,
            "Source": "default"
        },
        {
            "Title": "Time Technoplast Reports Q4 Results and Recommends Dividend",
            "Summary": "Time Technoplast announced its Q4 financial results and dividend recommendation. The company's consolidated net profit increased to 1.1 billion rupees from 924 million rupees year-over-year. Q4 revenue rose to 14.7 billion rupees from 13.94 billion rupees in the previous year. EBITDA for Q4 was 2.14 billion rupees, up from 1.86 billion rupees, with EBITDA margin improving to 14.55% from 13.35%. The company has recommended a final dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748358751000,
            "Source": "result"
        },
        {
            "Title": "Time Technoplast Receives Approval for Hydrogen Composite Cylinder",
            "Summary": "Time Technoplast has obtained an approval certificate from Bureau Veritas for their Type IV composite cylinder designed for hydrogen application. The cylinder has a capacity of 150 litres.",
            "Sentiment": "positive",
            "PublishDate": 1747301154000,
            "Source": "default"
        },
        {
            "Title": "Time Technoplast Expands Polyethylene Pipe Business",
            "Summary": "Time Technoplast has announced plans to introduce an additional product in its existing polyethylene pipe business. The company will be expanding its offerings to include PE pipes specifically for gas distribution.",
            "Sentiment": "positive",
            "PublishDate": 1741047060000,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Expands Polyethylene Pipe Business with Gas Distribution Pipes",
            "Summary": "Time Technoplast has announced plans to introduce a new product line in its existing polyethylene pipe business. The company will be adding PE pipes specifically designed for gas distribution to its portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1741012828000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fire Incident at Time Technoplast's Gujarat Facility",
            "Summary": "Time Technoplast reported a fire incident at their facility in Gujarat. The company stated that the fire has been brought under control and no casualties were reported. Time Technoplast also assured that no business loss is anticipated due to this incident.",
            "Sentiment": "neutral",
            "PublishDate": 1739360935000,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Reports Q3 Financial Results",
            "Summary": "Time Technoplast announced its Q3 consolidated financial results. The company's net profit increased to 1 billion rupees, up from 916 million rupees year-over-year and 984 million rupees quarter-over-quarter. Revenue also saw growth, reaching 13.87 billion rupees compared to 13.25 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739320370000,
            "Source": "earnings"
        },
        {
            "Title": "Time Technoplast Reports Improved Q3 EBITDA and Margin",
            "Summary": "Time Technoplast has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 2 billion rupees, up from 1.91 billion rupees in the same quarter of the previous year. The EBITDA margin also saw a slight improvement, rising to 14.46% from 14.39% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739287731000,
            "Source": "earnings"
        },
        {
            "Title": "Time Technoplast Reports Q3 Financial Results",
            "Summary": "Time Technoplast has announced its Q3 consolidated financial results. The company reported a net profit of 1 billion rupees, compared to 916 million rupees in the same quarter last year, showing a year-over-year increase. The quarterly revenue stood at 13.87 billion rupees, up from 13.25 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739287671000,
            "Source": "earnings"
        },
        {
            "Title": "Time Technoplast Secures 406.4 Million Rupee Order",
            "Summary": "Time Technoplast has received a significant order valued at 406.4 million rupees. This order represents a positive development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1738627804000,
            "Source": "order&deals"
        },
        {
            "Title": "Time Technoplast Secures 406.4 Million Rupee Order",
            "Summary": "Time Technoplast has received a significant order valued at 406.4 million rupees. This order represents a substantial business opportunity for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1738591160000,
            "Source": "order&deals"
        },
        {
            "Title": "Time Technoplast to Consider Q3 Results on February 11",
            "Summary": "Time Technoplast Limited has announced that it will consider its financial results for the third quarter on February 11. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1738072228000,
            "Source": "earnings"
        },
        {
            "Title": "Time Technoplast Expands Middle East Operations with New Facility in Saudi Arabia",
            "Summary": "Time Technoplast has expanded its presence in the Middle East by establishing a new manufacturing facility in Saudi Arabia. The facility will focus on the production of Intermediate Bulk Containers (IBC) and plastic drums, strengthening the company's position in the region's industrial packaging market.",
            "Sentiment": "positive",
            "PublishDate": 1737505254000,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Expands Middle East Operations with New Facility in Saudi Arabia",
            "Summary": "Time Technoplast has expanded its presence in the Middle East by establishing a new production facility in Saudi Arabia. The facility will focus on manufacturing IBC (Intermediate Bulk Containers) and plastic drums. This strategic move strengthens the company's foothold in the region and enhances its manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737464907000,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Reports Improved Q2 Financial Performance",
            "Summary": "Time Technoplast has announced its Q2 financial results, showing an increase in EBITDA to 1.97 billion rupees from 1.67 billion rupees year-over-year. The company's EBITDA margin also improved to 14.32% from 13.97% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731339140000,
            "Source": "result"
        },
        {
            "Title": "Time Technoplast Reports Strong Q2 Financial Results",
            "Summary": "Time Technoplast has announced its Q2 financial results. The company's consolidated net profit increased to 984 million rupees, up from 704 million rupees year-over-year and 793 million rupees quarter-over-quarter. Revenue for Q2 rose to 13.7 billion rupees, compared to 11.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731339069000,
            "Source": "result"
        },
        {
            "Title": "Time Technoplast Subsidiaries Approve Amalgamation Scheme",
            "Summary": "Time Technoplast's subsidiary NED Energy Ltd and its wholly owned subsidiary Power Build Batteries Pvt Ltd (PBBPL) have approved a scheme of amalgamation. Both companies are involved in manufacturing power storage devices (batteries). The amalgamation will merge the two companies into a single entity.",
            "Sentiment": "neutral",
            "PublishDate": 1731083257000,
            "Source": "corporate_action"
        },
        {
            "Title": "Time Technoplast Announces Fundraising and Expansion Plans",
            "Summary": "Time Technoplast has approved two significant financial decisions. First, the company plans to raise funds through a Qualified Institutions Placement (QIP) worth 10 billion rupees. Second, the company has approved capital investments for the expansion of both greenfield and brownfield projects.",
            "Sentiment": "positive",
            "PublishDate": 1729863210000,
            "Source": "corporate_action"
        }
    ]
}