{
    "Symbol": "TIMKEN",
    "ISIN": "INE325A01013",
    "News": [
        {
            "Title": "Timken India publishes Q3 FY26 financial results",
            "Summary": "Timken India Limited has published its unaudited financial results for the quarter and nine months ended 31 December, 2025, following board approval on 4 February, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770381642459,
            "Source": "co_actions_results"
        },
        {
            "Title": "Timken India schedules Q3FY26 results call Feb 9",
            "Summary": "Timken India Limited announces conference call on February 9, 2026 at 4:30 PM IST to discuss Q3FY26 financial performance, arranged by B&K Securities with management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769683565816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Timken India Board Meet Set for Feb 4, 2026",
            "Summary": "Timken India Limited has scheduled a board meeting on February 4, 2026, to consider and approve unaudited consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768288889239,
            "Source": "co_actions_results"
        },
        {
            "Title": "Timken India Extends Green Energy Acquisition Timeline",
            "Summary": "Timken India extends completion timeline for acquiring 26.1% stake in Sunstream Green Energy C&I Three from December 2025 to March 2026, maintaining strategic renewable energy expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1767162199399,
            "Source": "co_actions_results"
        },
        {
            "Title": "Timken India IT Demand Reduced from ₹74.77 Cr to ₹32.47 Cr",
            "Summary": "Timken India's income tax demand notice reduced to ₹32.47 crores after rectification petition, down from original ₹74.77 crores for assessment year 2022-23. Company maintains appeal stance.",
            "Sentiment": "positive",
            "PublishDate": 1766152156200,
            "Source": "stocks"
        },
        {
            "Title": "Timken India Settles Consumer Dispute Case",
            "Summary": "Timken India Limited successfully settles consumer dispute appeal regarding share transmission with State Consumer Commission, avoiding ₹25,000 in compensation and litigation costs.",
            "Sentiment": "positive",
            "PublishDate": 1765969048690,
            "Source": "stocks"
        },
        {
            "Title": "Timken India's General Manager HR Resigns Due to Family Reasons",
            "Summary": "S Harish, General Manager HR-India at Timken India Limited, has resigned from his position due to family reasons with effect from December 15, 2025. The resignation follows a standard 3-month notice period as per company policy.",
            "Sentiment": "neutral",
            "PublishDate": 1765190581553,
            "Source": "corporate_governance"
        },
        {
            "Title": "Timken India Non-Executive Director Douglas Smith Resigns Due to Retirement",
            "Summary": "Douglas Smith (DIN: 02454618) has resigned as Non-Executive Director of Timken India Limited effective December 15, 2025, citing upcoming retirement from Timken services. Smith will also cease to be a Member of the Stakeholders Relationship Committee from the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1765189521467,
            "Source": "corporate_governance"
        },
        {
            "Title": "Timken India Completes Acquisition of Timken GGB Technology Private Limited Shares",
            "Summary": "Timken India Limited has completed the purchase of equity shares of Timken GGB Technology Private Limited from Timken Europe B.V. and The Timken Company on 1 December, 2025. The transaction represents a strategic acquisition within the Timken group structure, affecting the ownership of the technology subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1764597637052,
            "Source": "corporate_action"
        },
        {
            "Title": "Timken India Acquires Shares of Timken GGB Technology from Parent Companies",
            "Summary": "Timken India announced its plan to purchase shares of Timken GGB Technology from Timken Europe and The Timken Company. This acquisition represents an intra-group transaction that will affect the ownership structure of Timken GGB Technology within the Timken corporate family.",
            "Sentiment": "positive",
            "PublishDate": 1763799561367,
            "Source": "order&deals"
        },
        {
            "Title": "Timken India Receives Approval to Acquire Timken GGB Technology Shares",
            "Summary": "Timken India has received approval to purchase shares in Timken GGB Technology. The approval enables the company to proceed with the acquisition of stakes in the technology entity.",
            "Sentiment": "positive",
            "PublishDate": 1762179698021,
            "Source": "order&deals"
        },
        {
            "Title": "Timken India Reports Quarterly Results, Reappoints Independent Director and Names New Senior Management",
            "Summary": "Timken India's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 2,817.30 million for the quarter compared to Rs 2,177.50 million in the previous year quarter. Net profit for the quarter was Rs 1,189 per share (basic and diluted) versus Rs 1,196 per share in the corresponding quarter last year. The Board approved the re-appointment of Soumitra Hazra as Independent Director for a 3-year term starting May 31, 2026, subject to member approval. Hazra brings over 40 years of finance and legal experience, having previously served as Company Secretary & Chief-Compliance at Timken until September 2019. The company also appointed Gurdeep Grewal as General Manager-Mobile-Sales and Vijay Pratap Singh as General Manager Process-Sales to senior management positions. Both appointments are effective November 3, 2025, with tenure until retirement age of 60 years unless earlier separation occurs.",
            "Sentiment": "neutral",
            "PublishDate": 1762179310799,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Timken India reported quarterly net profit of 895 million rupees compared to 899.5 million rupees in the same period last year, representing a slight decline. Revenue increased to 7.7 billion rupees from 7.5 billion rupees year-over-year. EBITDA rose to 1.4 billion rupees from 1.3 billion rupees, while EBITDA margin improved to 17.92% from 17.72% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762177707498,
            "Source": "earnings"
        },
        {
            "Title": "Timken India General Manager Sales Aditya Roy Retires",
            "Summary": "Timken India Limited announced a change in senior management with Mr. Aditya Roy, General Manager-Sales, ceasing employment due to superannuation upon reaching retirement age. His cessation becomes effective at the close of business hours on October 31, 2025. The company notified stock exchanges NSE and BSE of this senior management personnel change.",
            "Sentiment": "neutral",
            "PublishDate": 1761844757626,
            "Source": "corporate_governance"
        },
        {
            "Title": "Timken India Acquires 26.1% Stake in Sunstreamgreen Energy for Solar Power Purchase",
            "Summary": "Timken India Limited has agreed to acquire 26.1% equity shares in Sunstreamgreen Energy C&I Three Private Limited for Rs 70,00,020. The acquisition involves purchasing 7,00,002 equity shares at Rs 10 each. This investment enables Timken India to purchase solar power under the Group Captive Scheme through a Power Purchase Agreement with the target company. Sunstreamgreen Energy, incorporated on July 14, 2025, operates in the renewable energy sector focusing on electricity generation through renewable sources. The company is required to hold at least 26% equity shareholding to maintain group captive status under applicable laws. The acquisition is expected to complete by December 2025 and does not fall under related party transactions. No governmental or regulatory approvals are required for this cash-based transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758541659762,
            "Source": "order&deals"
        },
        {
            "Title": "Timken India Reports Best-Ever Q1 with 3.2% Revenue Growth to ₹809 Crores",
            "Summary": "Timken India delivered its strongest first quarter performance with revenue from operations reaching ₹808.8 crores, marking a 3.2% year-on-year increase. Profit before tax remained flat at ₹130.4 crores with margins at 16.1% compared to 16.6% in the previous year. The company successfully capitalized one CRB line at its Bharuch plant and commenced commercial production in late June, with billing starting from July. Revenue mix showed rail contributing 24% (₹196.5 crores), mobile 19% (₹156 crores), distribution 18% (₹146 crores), process 18% (₹142 crores), and exports 20% (₹164 crores). Management expects the Bharuch facility to reach 45% utilization by year-end and remains cautiously optimistic about demand across key industrial sectors. The company is investing ₹120 crores in rail expansion at Jamshedpur and ₹35 crores in plain bearings capacity at Bharuch. Management expressed concerns about potential US tariff impacts on exports but noted the first bearing from the new plant was exported to North America.",
            "Sentiment": "positive",
            "PublishDate": 1754571090372,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Publishes Quarterly Financial Results and SEBI Circular Information",
            "Summary": "Timken India Limited published its unaudited financial results for the quarter ended June 30, 2025 in newspapers. The company informed stock exchanges NSE and BSE about the newspaper publication through a regulatory communication dated August 2, 2025. The publication also included information about a SEBI circular dated July 2, 2025 regarding a special window for re-lodgment of transfer requests for physical shares under the 'Ease of Doing Investment' initiative. The financial results are available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754130064525,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Reports 8% Growth in Net Profit for Q1",
            "Summary": "Timken India posted a net profit of 1.04 billion rupees in Q1, up from 963 million rupees in the same period last year. Revenue increased to 8.08 billion rupees from 7.83 billion rupees year-over-year. EBITDA rose marginally to 1.42 billion rupees from 1.41 billion rupees, though EBITDA margin declined slightly to 17.6% from 17.98% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753971175311,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Board Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Timken India Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, during a meeting held on July 31, 2025. The board meeting commenced at 6:15 PM and concluded at 7:15 PM. The company has submitted these results along with a Limited Review Report from its statutory auditors to the stock exchanges. Timken India trades on NSE under the symbol TIMKEN and on BSE with scrip code 522113.",
            "Sentiment": "neutral",
            "PublishDate": 1753971103770,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Expands Product Line and Reports Growth in Rail Sector",
            "Summary": "Timken India has begun assembling Cone Drive products at their Bharuch facility, supplying 300-400 units to Tata Solar Power. The company is also introducing additional tech products into their system. Timken India reports that their rail order book is expected to experience steady and solid growth.",
            "Sentiment": "positive",
            "PublishDate": 1748402097000,
            "Source": "default"
        },
        {
            "Title": "Timken India Reports Q4 Results and Recommends Dividend",
            "Summary": "Timken India has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 9.4 billion rupees from 9 billion rupees year-over-year. Q4 EBITDA rose to 2.1 billion rupees from 1.98 billion rupees, with the EBITDA margin improving to 22.32% from 22.13%. Net profit for Q4 grew to 1.87 billion rupees, up from 1.4 billion rupees year-over-year and 743.1 million rupees quarter-over-quarter. The company has recommended a dividend of 36 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748016086000,
            "Source": "result"
        },
        {
            "Title": "Timken India Announces Expected Start of Commercial Production at Bharuch Plant",
            "Summary": "Timken India has announced that commercial production at its new Bharuch plant is expected to commence in the first quarter of the financial year 2025-26. This information suggests that the company is expanding its manufacturing capabilities, which could potentially impact its future production capacity and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1744199274000,
            "Source": "corporate_action"
        },
        {
            "Title": "Timken India to Commence Commercial Production at Bharuch Facility",
            "Summary": "Timken India has announced plans to begin commercial production at its new facility in Bharuch during the first quarter of the fiscal year 2025-2026. This strategic expansion is expected to enhance the company's manufacturing capabilities and potentially increase its market presence in India.",
            "Sentiment": "positive",
            "PublishDate": 1742464177000,
            "Source": "corporate_action"
        },
        {
            "Title": "Timken India to Expand Rail Bearing Capacity at Jamshedpur Plant",
            "Summary": "Timken India has announced plans to enhance its manufacturing capacity at its Jamshedpur facility. The company will invest approximately 1.20 billion rupees to increase the production capacity of cup and cone components for rail bearings by 20%. This expansion aims to meet growing demand and strengthen Timken India's position in the rail bearing market.",
            "Sentiment": "positive",
            "PublishDate": 1741872129000,
            "Source": "corporate_action"
        },
        {
            "Title": "Timken India Ltd. Sees Block Trade of Rs. 18.03 Crores on NSE",
            "Summary": "A significant block trade occurred for Timken India Ltd. on the National Stock Exchange (NSE). The transaction involved approximately 70,074 shares, valued at Rs. 18.03 crores. The shares were traded at a price of Rs. 2,572.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741160906000,
            "Source": "block_deals"
        },
        {
            "Title": "Timken India Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 102,484 shares of Timken India Ltd. occurred on the National Stock Exchange (NSE) for a total value of Rs. 26.20 Crores. The shares were traded at a price of Rs. 2556.65 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741158799000,
            "Source": "block_deals"
        },
        {
            "Title": "Timken India Reports Q3 Financial Results",
            "Summary": "Timken India has announced its financial results for the third quarter. The company reported a net profit of 743 million rupees, which is an increase from 675 million rupees in the same quarter last year. However, it's a decrease from 899 million rupees in the previous quarter. The company's revenue for Q3 stood at 6.7 billion rupees, up from 6.12 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738801202000,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Reports Q3 EBITDA and Margin Results",
            "Summary": "Timken India has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 1.06 billion rupees, compared to 1.02 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 15.86% from 16.73% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738766365000,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Reports Q3 Financial Results",
            "Summary": "Timken India has announced its financial results for the third quarter. The company reported a net profit of 743 million rupees, showing an increase from 675 million rupees year-over-year. However, this represents a decrease from 899 million rupees quarter-over-quarter. Revenue for Q3 stood at 6.7 billion rupees, up from 6.12 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738766311000,
            "Source": "earnings"
        },
        {
            "Title": "Timken India Announces 7 Billion Rupee Investment in New Bharuch Facility",
            "Summary": "Timken India has announced plans to invest approximately 7 billion rupees in a new facility located in Bharuch. The company expects commercial production at this new project to begin in the fourth quarter of the 2024-2025 fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1731669613000,
            "Source": "corporate_action"
        },
        {
            "Title": "Timken India Reports Q2 EBITDA and Margin Decline",
            "Summary": "Timken India's Q2 EBITDA decreased to 1.3 billion rupees from 1.36 billion rupees year-over-year. The company's EBITDA margin also declined to 17.72% from 19.9% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730814258000,
            "Source": "result"
        },
        {
            "Title": "Timken India Reports Q2 FY2024 Financial Results",
            "Summary": "Timken India has announced its financial results for the second quarter. The company reported a net profit of 899.5 million rupees, which is a decrease from 930 million rupees year-over-year and 963 million rupees quarter-over-quarter. However, revenue increased to 7.5 billion rupees from 6.82 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730814180000,
            "Source": "result"
        },
        {
            "Title": "Timken India: ₹25 Crore Tax Demand Challenged",
            "Summary": "<p><span class='neutral'>Timken India</span> received an <span class='negative'>income tax demand</span> for <b>₹25 crore</b> plus interest for AY2021-22, due to <span class='neutral'>arm's length pricing</span> discrepancies in its distribution segment. The company plans to <span class='positive'>appeal</span> the order, considering it <span class='negative'>flawed</span>, and doesn't anticipate <span class='positive'>immediate financial impact</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728398502000,
            "Source": "normal_news"
        }
    ]
}