{
    "Symbol": "TINNARUBR",
    "ISIN": "INE015C01016",
    "News": [
        {
            "Title": "Tinna Rubber Q3-9MFY26 Results Show Margin Expansion",
            "Summary": "Tinna Rubber reports stable revenue with EBITDA margins expanding by ~200 bps and PAT margins by ~110 bps in 9MFY26, driven by operational efficiency improvements and post-monsoon demand recovery.",
            "Sentiment": "positive",
            "PublishDate": 1770557656823,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tinna Rubber Board Meet Set for Feb 7 for Q3FY26 Results",
            "Summary": "Tinna Rubber And Infrastructure Limited has scheduled a board meeting on February 07, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769879899524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tinna Rubber Secures ₹75.79 Cr Order from IOCL",
            "Summary": "Tinna Rubber And Infrastructure Limited wins significant two-year contract from Indian Oil Corporation to supply Crumb Rubber Modifier for CRMB plants in Haldia and Mathura, valued at ₹75.79 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768902075741,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tinna Rubber Makes Additional Investment of OMR 24,750 in Oman Subsidiary",
            "Summary": "Tinna Rubber and Infrastructure Limited has made an additional equity share capital contribution of OMR 24,750 (approximately ₹58 lacs) to its wholly owned subsidiary Global Recycle LLC in Oman. The investment represents the company's continued expansion of its subsidiary operations in the Middle East market.",
            "Sentiment": "positive",
            "PublishDate": 1763715358688,
            "Source": "stock"
        },
        {
            "Title": "Tinna Rubber Reports 18.5% EBITDA Margin in Q2 FY26 Despite Revenue Challenges from Extended Monsoon",
            "Summary": "Tinna Rubber and Infrastructure Limited achieved strong EBITDA margins of 18.5% in Q2 and 17% in H1 FY26 through strategic focus on higher-value products and selective reduction of low-margin sales, despite facing revenue impact from extended monsoon conditions. The company revised its annual growth guidance to 12-15% from earlier expectations, while advancing its Vision 2028 plan with INR 100 crores capex deployment including new rCB pyrolysis plant and international expansion in Oman, Saudi Arabia, and South Africa.",
            "Sentiment": "neutral",
            "PublishDate": 1763642219459,
            "Source": "earnings"
        },
        {
            "Title": "Tinna Rubber Reports Mixed Q2-H1 FY26 Results with Strategic Margin Focus",
            "Summary": "Tinna Rubber and Infrastructure Limited posted Q2 FY26 consolidated revenue of INR 120 Cr with 18.0% EBITDA margin and PAT of INR 12 Cr, while H1 FY26 revenue declined 2% to INR 250 Cr due to management's strategic decision to reduce low-margin commodity product sales. The company is expanding internationally with operations in Oman at 85% capacity utilization contributing INR 15 Cr revenue in H1 FY26, while investing INR 100 Cr capex over next 2 years and targeting INR 1,000 Cr revenue by 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1763225717621,
            "Source": "earnings"
        },
        {
            "Title": "Tinna Rubber And Infrastructure Limited Schedules Q2-H1 FY26 Earnings Call for November 17, 2025",
            "Summary": "Tinna Rubber And Infrastructure Limited will conduct an earnings conference call on Monday, November 17, 2025 at 3:00 PM IST to discuss the company's financial and operational performance for the second quarter and half year ended September 30, 2025. The call will be hosted by Go India Advisors and will feature key company participants including Joint Managing Director Gaurav Sekhri, Director and Chief Operating Officer Subodh Kumar Sharma, and Chief Financial Officer Ravindra Chabbra. The company has provided dial-in details and registration information for investors and stakeholders to participate in the earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1762889571109,
            "Source": "earnings"
        },
        {
            "Title": "Tinna Rubber And Infrastructure Limited Receives Approval for Voluntary Delisting from Calcutta Stock Exchange",
            "Summary": "Tinna Rubber And Infrastructure Limited has received approval for voluntary delisting of its equity shares from The Calcutta Stock Exchange Limited (CSE) effective September 15, 2025. The company's shares will continue to be listed and traded on BSE Limited and National Stock Exchange of India Limited. The CSE granted approval through letter ref: CSE/LD/DLL/16947/2025 dated September 12, 2025, under SEBI (De-listing of Equity Shares) Regulations, 2021. This follows previous intimations dated April 19, 2025 and May 07, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758630830821,
            "Source": "corporate_action"
        },
        {
            "Title": "Tinna Rubber Announces Inter-se Transfer of 86.15 Lakh Shares Among Promoter Group",
            "Summary": "Tinna Rubber And Infrastructure Limited disclosed an inter-se transfer of 86,15,862 equity shares among its promoter and promoter group through off-market gift transactions without consideration. Bhupinder Kumar Sekhri will acquire these shares (47.82% of share capital) from six promoter group members including Mrs. Shobha Sekhri, Mrs. Aarti Sekhri, Mrs. Puja Sekhri, Mr. Arnav Sekhri, Mr. Krishnav Sekhri, and Mr. Aditya Brij Sekhri. The transaction is scheduled to be completed by September 30, 2025. This transfer falls under exemption provided by SEBI SAST Regulations and will not change the aggregate promoter group shareholding. Post-transaction, Bhupinder Kumar Sekhri's shareholding will increase from 2.25% to 50.07%. The volume weighted average market price for 60 trading days preceding the notice was Rs. 881.63.",
            "Sentiment": "neutral",
            "PublishDate": 1758604670269,
            "Source": "corporate_action"
        },
        {
            "Title": "Tinna Rubber And Infrastructure Limited Receives RAR2025 Innovation Award",
            "Summary": "Tinna Rubber And Infrastructure Limited has been awarded the 'RAR2025 Innovation Award' by the Rubberized Asphalt Foundation. The award recognizes the company's efforts to expand the use of asphalt rubber into new areas of discovery through cutting-edge technology. The company announced this development to stock exchanges including BSE, NSE, and Calcutta Stock Exchange.",
            "Sentiment": "positive",
            "PublishDate": 1757336734848,
            "Source": "stock"
        },
        {
            "Title": "Tinna Rubber Sets September 5 Record Date for Rs. 4 Final Dividend for FY 2024-25",
            "Summary": "Tinna Rubber and Infrastructure Limited has announced September 5, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 4.00 per equity share for FY 2024-25. The dividend is subject to approval at the company's 38th Annual General Meeting scheduled for September 12, 2025, which will be conducted through video conferencing. Shareholders recorded at the end of business hours on the record date will be entitled to receive the dividend once approved by members at the AGM. The dividend will be paid within the stipulated timeframe following approval.",
            "Sentiment": "positive",
            "PublishDate": 1756298268993,
            "Source": "corporate_action"
        },
        {
            "Title": "Tinna Rubber Reports Flat Revenue at INR 131 Crores in Q1 FY26, EBITDA Margin Improves to 16%",
            "Summary": "Tinna Rubber and Infrastructure Limited reported Q1 FY26 revenue of INR 131 crores, remaining flat quarter-on-quarter but declining 4% year-on-year. EBITDA increased 19% to INR 21 crores with margins improving 237 basis points to 16%. PAT remained flat at INR 12 crores with 9% margin. The revenue decline was attributed to lower EPR contribution of INR 4 crores versus INR 10.5 crores in the previous year. Industrial segment grew 15% and steel segment grew 8% year-on-year, while infrastructure and consumer segments faced temporary slowdown. Gross margins improved 344 basis points due to lower raw material costs and operational efficiency. The company incurred INR 13 crores capex and is committed to INR 100 crores over two years. Management maintains FY26 guidance of INR 600+ crores revenue and 15.5%+ EBITDA margin, targeting INR 1,000 crores revenue by FY28 with 18%+ EBITDA margin.",
            "Sentiment": "neutral",
            "PublishDate": 1754911674852,
            "Source": "earnings"
        },
        {
            "Title": "Tinna Rubber Makes Additional $204,815 Investment in South African Joint Venture",
            "Summary": "Tinna Rubber and Infrastructure Limited invested US$ 2,04,815 (Rs. 1,80,06,311) in its South African joint venture Mbodla Investments (Pty) Ltd to acquire 35,86,310 ordinary shares at Rand 1 each. The company's ownership stake remains at 49% following this additional investment. The joint venture operates in the recycling of used motor vehicle tyres business and focuses on expansion and management of tyre recycling operations in South Africa, including manufacturing and export of used tyres, crumb rubber and allied products. Mbodla Investments was incorporated in February 2015 and has reported nil turnover for the last three years. The transaction is classified as a related party transaction since Mbodla is a joint venture of Tinna Rubber.",
            "Sentiment": "neutral",
            "PublishDate": 1754570867861,
            "Source": "stock"
        },
        {
            "Title": "Tinna Rubber Reports Q1 FY26 Results, Schedules AGM, and Approves ₹5 Crore Joint Venture Investment",
            "Summary": "Tinna Rubber and Infrastructure Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹13,027.33 lakhs compared to ₹13,600.69 lakhs in the same quarter last year. Net profit stood at ₹1,174.09 lakhs versus ₹1,639.25 lakhs in the previous year quarter. The Board scheduled the 38th Annual General Meeting for September 12, 2025, via video conferencing. Additionally, the company authorized investments up to ₹5 crores in Mbodla Investments (Pty) Ltd, South Africa, a joint venture. During the quarter, the company raised ₹7,869.96 lakhs through qualified institutional placement by allotting 8,86,257 equity shares at ₹888 per share. The funds will be used for manufacturing facility expansion, debt repayment, and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1754494763009,
            "Source": "earnings"
        },
        {
            "Title": "Tinna Rubber and Infrastructure Schedules Board Meeting for Q1 2025 Financial Results on August 6",
            "Summary": "Tinna Rubber and Infrastructure Limited has scheduled a Board of Directors meeting for August 6, 2025 to consider and approve the unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025, along with the limited review report of statutory auditors. The meeting will also address other matters. The trading window for dealing in company securities has been closed for designated persons, connected persons and their immediate relatives since July 1, 2025, and will reopen 48 hours after the financial results are made available to the public. The company trades on BSE (scrip code: 530475), NSE (symbol: TINNARUBR), and Calcutta Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1753942023106,
            "Source": "corporate_action"
        }
    ]
}