{
    "Symbol": "TIPSMUSIC",
    "ISIN": "INE716B01029",
    "News": [
        {
            "Title": "Tips Music Outperforms Saregama in Q2 Profitability",
            "Summary": "Tips Music achieved 59.6% net margin in Q2 FY26 versus Saregama's 19.1%, driven by digital-first model and selective content acquisition strategy with superior ROE of 82.9%.",
            "Sentiment": "neutral",
            "PublishDate": 1769417214415,
            "Source": "stocks"
        },
        {
            "Title": "Tips Music Uploads Q3FY26 Earnings Call Audio",
            "Summary": "Tips Music Limited has uploaded the audio recording of its Q3FY26 earnings call with investors and analysts on its website, following the discussion of unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768842215114,
            "Source": "co_actions_results"
        },
        {
            "Title": "TIPS Music Q3FY26 Revenue Jumps 21% to ₹94.3 Crores",
            "Summary": "TIPS Music Limited reported strong Q3FY26 results with revenue rising 21% YoY to ₹94.3 crores and PAT growing 33% to ₹58.7 crores. Operating EBITDA margins expanded to 79.0%.",
            "Sentiment": "positive",
            "PublishDate": 1768811109215,
            "Source": "co_actions_results"
        },
        {
            "Title": "TIPS Music Reports 21% Revenue Growth in Q3 FY26",
            "Summary": "TIPS Music Limited delivered strong Q3 FY26 results with revenue of ₹94.30 crores (21% YoY growth) and PAT of ₹58.70 crores (33% YoY growth). Company announced ₹5 interim dividend per share.",
            "Sentiment": "positive",
            "PublishDate": 1768810732139,
            "Source": "co_actions_results"
        },
        {
            "Title": "TIPS Music Q3FY26 Revenue Jumps 21.4% to ₹9,428.93 Lakhs",
            "Summary": "TIPS Music Limited reported strong Q3FY26 results with revenue of ₹9,428.93 lakhs, up 21.4% YoY. Net profit surged 32.6% to ₹5,865.76 lakhs. Board declares third interim dividend of ₹5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768810264634,
            "Source": "co_actions_results"
        },
        {
            "Title": "TIPS Music Q3FY26 Revenue Jumps 21% to ₹9,428.93 Lakhs",
            "Summary": "TIPS Music Limited reported strong Q3FY26 results with revenue of ₹9,428.93 lakhs, up 21.4% YoY. Net profit surged 32.6% to ₹5,865.76 lakhs. Board declared third interim dividend of ₹5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768810197908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tips Music Declares ₹5 Per Share Dividend",
            "Summary": "Tips Music has announced a dividend payment of ₹5.00 per share to its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1768809675805,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tips Music Q3 profit rises 33%, interim dividend announced",
            "Summary": "Tips Music Q3 profit surged 33% to ₹58.70 crores with revenue up 21% to ₹94.30 crores. Company declared ₹5 interim dividend and announced B4U TV partnership for global reach.",
            "Sentiment": "positive",
            "PublishDate": 1768809324754,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tips Music Q3FY26 Earnings Call Set for January 19",
            "Summary": "Tips Music Limited has scheduled an earnings conference call for January 19, 2026 at 5:00 PM IST to discuss Q3FY26 financial results with senior management including CMD Kumar S Taurani.",
            "Sentiment": "neutral",
            "PublishDate": 1768300653236,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tips Music Board Meet on Jan 19 for Q3 Results",
            "Summary": "Tips Music Limited has scheduled a board meeting on January 19, 2026, to consider Q3FY26 unaudited financial results and potential third interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768280625588,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tips Music Limited Reports 11% Revenue Growth in Q2 FY26, Maintains 20% Full-Year Guidance",
            "Summary": "Tips Music Limited reported revenue of INR89.22 crores for Q2 FY26, marking 11% year-on-year growth. Operating EBITDA reached INR67.9 crores with 14% growth and 76% margin. PAT grew 11% to INR53 crores. For the first half of FY26, revenue was INR177.3 crores (15% growth) and PAT reached INR98 crores (8% growth). The company released 133 songs in Q2, including 76 film songs and 57 non-film songs. YouTube subscriber base reached 134 million collectively. The Board declared a second interim dividend of INR4 per share for FY26. Management maintains 20% revenue growth guidance for the full year, down from earlier 30% target due to industry challenges including OTT platform consolidations and shutdowns. The company expects content investment of 23-25% of revenue and plans selective content acquisition strategy. Warner deal is locked until 2028, with overflow revenues expected in FY28.",
            "Sentiment": "positive",
            "PublishDate": 1761016055478,
            "Source": "earnings"
        },
        {
            "Title": "TIPS Music Reports 15% Revenue Growth in H1FY26, Declares Second Interim Dividend",
            "Summary": "TIPS Music Limited reported revenue growth of 15% year-over-year for H1FY26, reaching ₹177.3 crore compared to ₹154.5 crore in the previous period. Profit After Tax grew 8% year-over-year to ₹98.9 crore. For Q2FY26, revenue stood at ₹89.2 crore (11% year-over-year growth) with PAT of ₹53.2 crore (10% year-over-year growth). The company released 133 songs during the quarter, including 76 film tracks and 57 non-film tracks. YouTube subscriber base expanded to 134 million. The Board declared a second interim dividend of ₹4 per share for FY2026, totaling ₹51.13 crore with total shareholder payout of ₹102.26 crore. Chairman Kumar Taurani cited sustained paid subscriber growth and expansion in public performance segment as growth drivers despite challenging industry conditions.",
            "Sentiment": "positive",
            "PublishDate": 1760516802671,
            "Source": "earnings"
        },
        {
            "Title": "Tips Music Reports Strong Q2 Performance with 10% Revenue Growth",
            "Summary": "Tips Music delivered robust quarterly results with revenue rising to 892 million rupees from 806 million rupees year-over-year. Net profit increased to 532 million rupees compared to 482 million rupees in the same period last year. EBITDA grew to 678 million rupees from 595 million rupees, while EBITDA margin expanded to 76.03% from 73.77% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1760513372692,
            "Source": "earnings"
        },
        {
            "Title": "Tips Music Acquires Studio Radha's Music Catalogue with 4,000+ Gujarati and Kutchi Heritage Tracks",
            "Summary": "Tips Music Limited has acquired Studio Radha's complete music catalogue, adding over 4,000 traditional Gujarati and Kutchi songs to its regional music portfolio. The acquisition includes devotional music, folk music, and cultural storytelling tracks that will be made available across major streaming platforms and digital services under the Tips Music banner. Managing Director Kumar Taurani stated this strategic move aims to deepen the company's presence in India's regional music markets while introducing these songs to global audiences through their modern distribution infrastructure. Tips Music, founded in 1988, is a publicly-listed music company with over 34,000 tracks in its catalogue spanning multiple languages and genres.",
            "Sentiment": "positive",
            "PublishDate": 1755486218103,
            "Source": "stock"
        },
        {
            "Title": "Tips Music Reports 19% Revenue Growth to INR88 Crores in Q1 FY26, Declares INR4 Interim Dividend",
            "Summary": "Tips Music Limited reported quarterly revenue of INR88 crores, marking 19% year-over-year growth. The company declared a first interim dividend of INR4 per share. Content costs increased 85% year-over-year due to new releases, with operating margins at 64% and PAT at INR45.7 crores (5% growth). The company released 92 songs including 48 film songs and 42 non-film songs. YouTube subscribers reached 125.8 million with 20% compound growth over two years. Warner Music contributes 25-30% of revenue. Management revised revenue growth guidance to 20-30% from earlier 30% target, citing challenges from OTT platform shutdowns and policy changes. Popular tracks include 'Main Nachdi' with 75 million views and 'Chunnari Chunnari' with 2 billion views on Meta platforms. The company expects content costs to remain at 25-28% of revenue and targets minimum 20% PAT growth annually.",
            "Sentiment": "neutral",
            "PublishDate": 1754473574256,
            "Source": "earnings"
        },
        {
            "Title": "TIPS Music Reports 19% Revenue Growth and 5% PAT Increase in Q1FY26",
            "Summary": "TIPS Music Limited announced its financial results for the quarter ended June 30, 2025, reporting revenue of ₹88.1 crore, representing a 19% year-over-year increase from ₹73.9 crore in Q1FY25. Profit After Tax grew 5% to ₹45.7 crore compared to ₹43.6 crore in the previous year. Operating EBITDA reached ₹56.5 crore, up 4% year-over-year, though EBITDA margin decreased to 64.2% from 73.6%. The company released 92 songs during the quarter, including 48 film tracks and 44 non-film tracks, with the Punjabi track 'Main Nachdi' emerging as a major hit. YouTube subscriber count grew to 125.8 million. Content costs increased significantly by 85% to ₹23.5 crore from ₹12.7 crore in Q1FY25. The board declared an interim dividend of ₹4 per share, totaling ₹51.13 crore. Chairman Kumar Taurani highlighted the company's resilience despite industry challenges, while executives noted strong performance across digital platforms and successful automation of content management systems.",
            "Sentiment": "positive",
            "PublishDate": 1753867287360,
            "Source": "earnings"
        },
        {
            "Title": "Tips Music Declares ₹4 Dividend Per Share, Reports Q1 Revenue Growth",
            "Summary": "Tips Music announced a dividend of ₹4 per share. The company reported Q1 revenue of ₹881 million compared to ₹739.1 million in the same period last year. Q1 EBITDA increased to ₹565 million from ₹543 million year-over-year, though EBITDA margin declined to 64.18% from 73.55%. Net profit for Q1 rose to ₹458 million versus ₹435.6 million in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753865605290,
            "Source": "corporate_action"
        },
        {
            "Title": "Tips Music Limited Schedules Q1 FY26 Earnings Call for July 30, 2025",
            "Summary": "Tips Music Limited has scheduled an earnings conference call on July 30, 2025 at 5:00 PM IST to discuss Q1 FY26 unaudited financial results and operational performance with analysts and institutional investors. The call will be attended by key executives including Chairman & Managing Director Kumar S Taurani, Executive Director Girish Taurani, CEO Hari Nair, and CFO Sushant Dalmia. The company has provided dial-in details and access numbers for participants, with MUFG Intime India Pvt Ltd coordinating the event.",
            "Sentiment": "neutral",
            "PublishDate": 1753445698949,
            "Source": "earnings"
        },
        {
            "Title": "Tips Music Limited Schedules Board Meeting for July 30, 2025 to Review Q2 Results and Consider Interim Dividend",
            "Summary": "Tips Music Limited has announced a Board of Directors meeting scheduled for July 30, 2025. The board will consider and approve the unaudited financial results for the quarter ended June 30, 2025, and discuss the declaration of an interim dividend for the financial year 2025-26. If an interim dividend is declared, the board will also fix the record date for payment. The company notified both BSE and NSE about this scheduled meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753374780447,
            "Source": "corporate_action"
        },
        {
            "Title": "Tips Music Ltd.: Targets 30% Top-Line Growth Over Next Three Years",
            "Summary": "Tips Music Ltd. aims for 30% top-line growth over the next three years, with plans to increase new releases' revenue share to 20-25%. The company will focus on improving song quality by reducing annual releases to 125-150. It expects 30% bottom-line growth in FY26 and plans to sign bigger artists with more marketing efforts. The company's catalogue remains strong, contributing 75-80% of business.",
            "Sentiment": "positive",
            "PublishDate": 1747789207000,
            "Source": "normal_news"
        },
        {
            "Title": "TIPS MUSIC Reports Q4 Financial Results",
            "Summary": "TIPS MUSIC has announced its Q4 financial results. The company's EBITDA increased to 373 million rupees from 302 million rupees year-over-year. The EBITDA margin slightly decreased to 47.50% from 47.70% compared to the same period last year. Revenue for Q4 grew to 785 million rupees from 633 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745400342000,
            "Source": "result"
        },
        {
            "Title": "Tips Music Ltd: Q3 Profit Misses Estimates, Share Price Drops 7%",
            "Summary": "Tips Music Ltd reported Q3 FY2025 net profit of Rs 44.2 crore, up 27.6% YoY but below estimates. Revenue grew 19.8% to Rs 77.6 crore, missing forecasts. Ebitda rose 27.9% to Rs 56 crore with improved margin. Share price fell 7% following the earnings announcement.",
            "Sentiment": "negative",
            "PublishDate": 1737541814000,
            "Source": "earnings"
        },
        {
            "Title": "Tips Music: Reaffirms Profit Growth, Highlights TikTok Partnership Benefits",
            "Summary": "Tips Music's Managing Director reaffirms the company's profit growth target and outlines the advantages of their partnership with TikTok.",
            "Sentiment": "positive",
            "PublishDate": 1732618028000,
            "Source": "normal_news"
        },
        {
            "Title": "TIPS Music Ltd: Partners with TikTok for Global Music Distribution",
            "Summary": "TIPS Music Ltd has formed a direct partnership with TikTok to distribute its catalog of over 31,000 songs globally, excluding China and India. The agreement aims to expand TIPS Music's international reach, targeting Non-Resident Indians and expatriates. TIPS Music's shares were up 1.43% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1732511452000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tips Music: Q2 Profit Soars 21%, Declares Interim Dividend",
            "Summary": "Tips Music reported a 21.46% YoY increase in Q2 FY25 net profit to Rs 48.16 crore. Revenue jumped 32.42% to Rs 80.61 crore. The company declared a second interim dividend of Rs 2 per share. YouTube subscribers grew 21% to 108 million. 125 new songs were launched in Q2.",
            "Sentiment": "positive",
            "PublishDate": 1729072980000,
            "Source": "result"
        },
        {
            "Title": "TIPS Music: Interim Dividend Declared, New Director Appointed Amid Share Plunge",
            "Summary": "TIPS Music Ltd declared a second interim dividend of ₹2 per share for FY 2024-2025, payable by November 12, 2024. Chandrashekar Ponnuswamy was appointed as a non-executive independent director for a five-year term. The company's shares fell 6.73% to ₹773.90 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1729072574000,
            "Source": "corporate_action"
        },
        {
            "Title": "TIPS Music Reports Strong Q2 Revenue Growth",
            "Summary": "TIPS Music has reported a significant increase in its Q2 revenue, reaching 806 million rupees compared to 609 million rupees in the same quarter last year. This represents a year-over-year growth of approximately 32.3%.",
            "Sentiment": "positive",
            "PublishDate": 1729068100000,
            "Source": "result"
        },
        {
            "Title": "TIPS Music Reports Q2 Net Profit Increase",
            "Summary": "TIPS Music has reported a net profit of 482 million rupees for the second quarter, up from 396 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729068080000,
            "Source": "result"
        },
        {
            "Title": "Tips Music Ltd: Stock Surges 2.84% in Ongoing Rally",
            "Summary": "<p>Tips Music Ltd stock is <span class='positive'>up 2.84%</span> today, trading at Rs 788.6. The company has seen a <span class='positive'>13.17% rise</span> in the last month and a <span class='positive'>155.5% increase</span> over the past year. It's currently <span class='positive'>outperforming</span> both the <b>NIFTY</b> and <b>Nifty Media</b> index.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728545700000,
            "Source": "normal_news"
        }
    ]
}