{
    "Symbol": "TIPSFILMS",
    "ISIN": "INE0LQS01015",
    "News": [
        {
            "Title": "Tips Films Reports Q3 FY26 Loss of ₹286.87 Lacs",
            "Summary": "Tips Films Limited posted a net loss of ₹286.87 lacs for Q3 FY26 with revenue of ₹406.45 lacs. Nine-month losses reached ₹1,237.61 lacs despite revenue growth to ₹15,591.57 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1769505546571,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tips Films Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Tips Films Limited has issued a postal ballot notice seeking member approval for the appointment of Mr. Rahul B. Mehta as an Independent Director for a five-year term starting October 3, 2025. The remote e-voting process will be conducted from November 29 to December 28, 2025, with results to be announced by December 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764314078536,
            "Source": "corporate_action"
        },
        {
            "Title": "Tips Films Reports Rs 2,585 Lakh Loss in Latest Quarter Despite Revenue Growth",
            "Summary": "Tips Films Limited reported a net loss of Rs 2,584.72 lakh for the quarter ended September 30, 2025, compared to a profit of Rs 633.98 lakh in the previous quarter. The company's revenue from operations increased to Rs 5,648.62 lakh from Rs 9,536.51 lakh in the prior quarter. Cost of production of films was Rs 6,896.99 lakh, significantly higher than revenue. For the half-year period, the company posted a loss of Rs 950.74 lakh. Basic and diluted earnings per share stood at negative Rs 32.97 for the quarter. The company operates in film production and distribution as its single reportable business segment. Cash and cash equivalents decreased to Rs 251.64 lakh from Rs 1,705.01 lakh. Short-term borrowings reduced to Rs 16,300.04 lakh from Rs 19,001.40 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1762524892935,
            "Source": "earnings"
        },
        {
            "Title": "Tips Films Appoints Rahul B. Mehta as Independent Director, Reconstitutes Board Committees",
            "Summary": "Tips Films appointed Rahul B. Mehta as Additional Director designated as Non-Executive Independent Director for a five-year term starting October 03, 2025, subject to shareholder approval. Mehta, 47, brings experience in investment management, corporate advisory, and business operations, having served as Chief Business Officer at Powerbank and as an Investment Professional with IL&FS Investment Managers Limited managing funds worth over US$1.4 billion. The company reconstituted its Audit Committee and Nomination and Remuneration Committee following the appointment, with both committees now comprising Mr. Vinode Thomas as Chairperson, Ms. Radhika Madhukar Dudhat and Mr. Rahul B. Mehta as Independent Director members, and Mr. Kumar S. Taurani as Executive Director member on the Audit Committee. Mehta is not related to any existing directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1759476246051,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tips Films Reports Quarterly Results and Changes Internal Auditors",
            "Summary": "Tips Films Limited reported its unaudited financial results for the quarter ended June 30, 2025. The company posted a net profit of Rs. 474.41 lacs compared to a loss of Rs. 3,270.92 lacs in the previous quarter. Total income from operations was Rs. 1,269.20 lacs versus Rs. 7,557.32 lacs in the prior quarter. Basic and diluted earnings per share stood at Rs. 10.97 compared to a loss of Rs. 75.67 per share in the previous quarter. Additionally, SPML & Associates resigned as internal auditors effective August 14, 2025, citing preoccupation with other assignments. The company appointed Mathur & Co. as the new internal auditor for revenue audits starting from the second quarter of FY 2025-2026. Mathur & Co. is a chartered accountancy firm established in 1983 with 42 years of experience serving public sector undertakings, government bodies, banking institutions, and private corporations.",
            "Sentiment": "positive",
            "PublishDate": 1755168578272,
            "Source": "earnings"
        }
    ]
}