{
    "Symbol": "TIRUMALCHM",
    "ISIN": "INE338A01024",
    "News": [
        {
            "Title": "Thirumalai Chemicals Credit Rating Downgraded by ICRA",
            "Summary": "ICRA downgrades Thirumalai Chemicals' credit ratings to [ICRA]BBB+ (Negative) across multiple instruments worth ₹1,317.55 crores, citing performance moderation and increased US project costs.",
            "Sentiment": "negative",
            "PublishDate": 1768309550164,
            "Source": "stocks"
        },
        {
            "Title": "Thirumalai Chemicals Starts US Production Phase",
            "Summary": "TCL Specialties USA begins first phase of commercial production at new US facility with initial sale of Maleic Anhydride, marking significant milestone for Thirumalai Chemicals' international expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767431584511,
            "Source": "stocks"
        },
        {
            "Title": "Thirumalai Chemicals Begins Commercial Operations in USA",
            "Summary": "TCL Specialties LLC commenced first phase of commercial operations at its West Virginia facility with first sale of Maleic Anhydride. The facility features two major plants with combined capacity exceeding 70,000 tons annually.",
            "Sentiment": "positive",
            "PublishDate": 1765505345265,
            "Source": "stocks"
        },
        {
            "Title": "Thirumalai Chemicals' Subsidiary Faces Extended Maleic Anhydride Unit Outage Due to Machinery Failure",
            "Summary": "Thirumalai Chemicals' step-down subsidiary Optimistic Organic Sdn Bhd experienced a prolonged outage at its Maleic Anhydride unit due to machinery failure, which contributed INR 235 crore (9.6%) to FY25 consolidated revenue. The outage has already caused approximately INR 118 crore revenue reduction in H1 FY26, with the company taking steps including expert consultation to restore operations while the derivatives plant continues operating.",
            "Sentiment": "negative",
            "PublishDate": 1764955963354,
            "Source": "stock"
        },
        {
            "Title": "Thirumalai Chemicals Approves ₹56.14 Crore Preferential Share Issue to Promoters",
            "Summary": "Thirumalai Chemicals Limited shareholders approved a special resolution for preferential allotment of 18,96,614 equity shares at ₹296 per share to promoter group entities, raising ₹56.14 crore through private placement. The resolution received overwhelming support with 99.99% of valid votes (4,45,95,980 votes) cast in favor, with shares to be allotted within 15 days and listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1764349361454,
            "Source": "corporate_action"
        },
        {
            "Title": "Thirumalai Chemicals Reports Progress on Rs 450.63 Crore Preferential Issue Fund Utilization",
            "Summary": "Thirumalai Chemicals utilized Rs 211.94 crore from its preferential issue for capital expenditure in US subsidiary TCL Specialties LLC and Rs 99.17 crore for operational payments during the quarter ended September 30, 2025. CRISIL Ratings found no deviation from stated objectives, with Rs 139.52 crore remaining unutilized across various bank accounts of the company and its subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1763173150348,
            "Source": "corporate_action"
        },
        {
            "Title": "Thirumalai Chemicals Receives Rs. 47.53 Crore Tax Demand Notice Under CGST Act",
            "Summary": "Thirumalai Chemicals Limited received a tax demand notice of Rs. 47.53 crore from the Assistant Commissioner (ST), Ranipet, Tamil Nadu for alleged excess ITC availed based on GSTR-9 scrutiny under Section 73 of the CGST Act, 2017. The company believes the demands are erroneous and plans to pursue legal remedies, stating that any financial implications are likely to be insignificant with no material impact on its financial position.",
            "Sentiment": "negative",
            "PublishDate": 1763099025944,
            "Source": "stock"
        },
        {
            "Title": "Thirumalai Chemicals Reports Q2 Net Loss of 333.8M Rupees",
            "Summary": "Thirumalai Chemicals reported a consolidated net loss of 333.8 million rupees in Q2, compared to a profit of 48.9 million rupees in the same period last year. The company's Q2 revenue declined to 4.45 billion rupees from 5.25 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762597356376,
            "Source": "earnings"
        },
        {
            "Title": "Thirumalai Chemicals Reports Quarterly Results and Raises ₹45 Crore Through Equity Issue",
            "Summary": "Thirumalai Chemicals Limited announced its unaudited financial results for the quarter ended September 30, 2025, approved by the Board of Directors on November 8, 2025. The company allotted 1,62,60,040 equity shares of ₹1 each on August 26, 2025, at a price of ₹277 per share, raising ₹45,003 lakh through a preferential issue. The results were prepared in accordance with Indian Accounting Standards and reviewed by statutory auditors Walker Chandiok & Co LLP. The company operates in manufacturing and sale of specialty chemicals as its only reportable segment. The financial statements include both standalone and consolidated results covering the company and its seven subsidiaries across Malaysia, Singapore, Europe, Netherlands, United States, and India.",
            "Sentiment": "neutral",
            "PublishDate": 1762594421517,
            "Source": "earnings"
        },
        {
            "Title": "Thirumalai Chemicals Board Approves ₹56.14 Crore Equity Fundraising Plan",
            "Summary": "Thirumalai Chemicals' board has approved a plan to raise ₹56.14 crores through equity shares. The fundraising plan requires approval from shareholders and regulatory authorities before implementation.",
            "Sentiment": "positive",
            "PublishDate": 1761724322116,
            "Source": "corporate_action"
        },
        {
            "Title": "Thirumalai Chemicals Schedules Board Meeting to Consider Preferential Equity Share Issue",
            "Summary": "Thirumalai Chemicals Limited has scheduled a Board of Directors meeting on October 25, 2025 to consider issuing equity shares on a preferential basis. The issue will be subject to regulatory and shareholder approvals, with the board also determining the issue price as permitted under applicable laws. The company has closed its trading window for designated persons from October 01, 2025 until 48 hours after declaring financial results for the quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761143106671,
            "Source": "corporate_action"
        },
        {
            "Title": "Thirumalai Chemicals' President - Food Ingredients Mr. Venkatraghavan Retires",
            "Summary": "Mr. Venkatraghavan, President - Food Ingredients at Thirumalai Chemicals Limited, retired effective October 11, 2025. He will no longer serve as Senior Management Personnel of the company. The retirement was effective from the close of business hours on October 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760204022067,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tirumala Chemicals Raises ₹450.62 Crores Through Preferential Share Allotment",
            "Summary": "Tirumala Chemicals has allotted 1,62,68,040 equity shares at ₹277 per share through a preferential issue, raising ₹450.62 crores. The Fund Raising Committee approved this allotment on August 26, 2025, following in-principle approval from stock exchanges on August 21, 2025. The shares were issued to 21 investors including mutual funds like Motilal Oswal Small Cap Fund, Motilal Oswal Multi Cap Fund, and Bandhan funds, along with various individual and corporate investors. The newly issued shares rank equally with existing equity shares. Post-allotment, the company's paid-up share capital increased from 10,23,88,120 shares to 11,86,56,160 shares.",
            "Sentiment": "positive",
            "PublishDate": 1756205767530,
            "Source": "corporate_action"
        },
        {
            "Title": "Thirumalai Chemicals Reports 87% EBITDA Drop in Q1 FY26 Amid Global Headwinds",
            "Summary": "Thirumalai Chemicals Limited reported significantly weaker quarterly results with total income declining 16% to ₹453 crore and EBITDA falling 87% to ₹7 crore, resulting in a net loss of ₹14 crore compared to a ₹28 crore profit in the previous year. The specialty chemicals manufacturer faced lower spreads due to global headwinds, softer volumes from geopolitical factors, and increased interest expenses from its USA project borrowings. The company's Dahej plant operated at low utilization during its ramp-up phase, though it reached 75%+ average throughput in June with 175 TPD production capacity. Thirumalai Chemicals completed re-catalysation of its Phthalic Anhydride reactor P144 in May and achieved highest quarterly Fumaric Acid production at its Ranipet plant. The company expects improved utilization at the Dahej plant to 85-90% from Q2 FY26 onwards and remains on track to launch its USA project by December 2025. The global chemical industry faced challenges including soft demand, inflation in energy and raw material costs, excess capacity, and geopolitical trade frictions during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755447576496,
            "Source": "earnings"
        },
        {
            "Title": "Thirumalai Chemicals Reports Loss in Q1, Announces Key Leadership Changes and Investment Increase",
            "Summary": "Thirumalai Chemicals Limited reported unaudited financial results for the quarter ended June 30, 2025. The company posted a standalone loss of ₹1,383 lakhs compared to a profit of ₹2,814 lakhs in the same quarter last year. Revenue from operations declined to ₹44,550 lakhs from ₹53,364 lakhs year-over-year. The consolidated loss widened to ₹5,996 lakhs versus a profit of ₹509 lakhs in the previous year. The Board approved several leadership changes: R. Pramod Kumar resigned as Company Secretary and Compliance Officer effective August 18, 2025, with Aditya Sharma appointed as his replacement on the same date. R. Sampath resigned as Non-Executive Director due to personal reasons effective August 14, 2025. The company also increased its investment limit in step-down subsidiary TCL Specialties LLC from USD 105 million to USD 165 million through equity or debt.",
            "Sentiment": "negative",
            "PublishDate": 1755180929313,
            "Source": "earnings"
        },
        {
            "Title": "Thirumalai Chemicals Reports Q1 Loss as Revenue Declines",
            "Summary": "Thirumalai Chemicals reported a consolidated net loss of 600 million rupees in Q1, compared to a profit of 51 million rupees in the same period last year. The company's EBITDA turned negative at a loss of 267 million rupees versus a gain of 307 million rupees year-over-year. Revenue declined to 4.5 billion rupees from 5.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755178113926,
            "Source": "earnings"
        },
        {
            "Title": "Thirumalai Chemicals Shareholders Approve All Resolutions at 52nd AGM",
            "Summary": "Thirumalai Chemicals Limited held its 52nd Annual General Meeting on July 25, 2025, through video conferencing. The company has 61,942 total shareholders, with 18 promoters and 53 public shareholders attending the meeting. All nine resolutions were passed with overwhelming majority support. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, re-appointment of R. Sampath as Director, and re-appointment of R. Parthasarathy as Chairman and Managing Director. The meeting also approved appointments of three independent directors: Bhama Krishnamurthy (re-appointment), D. Sabitha, and Meghav Mehta, along with Raj Kataria as Non-Executive Non-Independent Director. Additionally, shareholders approved the appointment of R M Mimani & Associates LLP as Secretarial Auditor for five years and ratified remuneration for cost auditor GSVK and Co. Voting was conducted through e-voting and remote e-voting facilities, with participation rates varying across different shareholder categories.",
            "Sentiment": "positive",
            "PublishDate": 1753546712063,
            "Source": "corporate_action"
        },
        {
            "Title": "Thirumalai Chemicals Clarifies Preferential Issue Proceeds Will Not Fund Subsidiary Investments",
            "Summary": "Thirumalai Chemicals Limited has clarified the utilization of proceeds from its proposed preferential share issue worth ₹450.62 crores, which was approved by shareholders in an extraordinary meeting held on July 14, 2025. The company confirmed that the ₹110.62 crores allocated for General Corporate Purposes will not be used for investments in subsidiaries, joint ventures, or associates. This clarification was provided in response to comments received from BSE and NSE on the company's application for in-principle approval for the share issue. The funds for general corporate purposes may be used for ongoing corporate exigencies, contingencies, company expenses, and other permissible general purposes as decided by the Board.",
            "Sentiment": "neutral",
            "PublishDate": 1753352613874,
            "Source": "corporate_action"
        },
        {
            "Title": "Thirumalai Chemicals Independent Director Arun Ramanathan Completes Final Term",
            "Summary": "Thirumalai Chemicals Limited announced that Mr. Arun Ramanathan will complete his second and final term as an Independent Director on July 21, 2025. Following the completion of his term, he will cease to be a Director of the company at the close of business hours on that date. The change is due to the natural completion of his directorship term rather than resignation or removal.",
            "Sentiment": "neutral",
            "PublishDate": 1753156447761,
            "Source": "corporate_governance"
        },
        {
            "Title": "TCL Specialties LLC Reports Construction Progress on West Virginia Facilities",
            "Summary": "TCL Specialties LLC, a subsidiary of Thirumalai Chemicals, has reported significant construction advancements on its petrochemical and food ingredient facilities in West Virginia. The company aims to complete construction by October-December 2025 and commence operations in 2026.",
            "Sentiment": "positive",
            "PublishDate": 1752575710000,
            "Source": "default"
        },
        {
            "Title": "Thirumalai Chemicals Plans Preferential Share Issue to Raise ₹4.51 Billion",
            "Summary": "Thirumalai Chemicals has announced plans to raise ₹4.51 billion through a preferential issue of shares. The company intends to issue up to 16.3 million shares at a price of ₹277 per share.",
            "Sentiment": "positive",
            "PublishDate": 1750339248000,
            "Source": "default"
        },
        {
            "Title": "Thirumalai Chemicals Schedules Board Meeting to Discuss Equity Share Issuance",
            "Summary": "Thirumalai Chemicals has announced a board meeting scheduled for June 19. The primary agenda for this meeting is to discuss the issuance of equity shares on a preferential basis.",
            "Sentiment": "neutral",
            "PublishDate": 1750090953000,
            "Source": "default"
        },
        {
            "Title": "Thirumalai Chemicals to Double Phthalic Anhydride Production Capacity",
            "Summary": "Thirumalai Chemicals plans to double its production capacity of Phthalic Anhydride in the fiscal year 2027-28. This expansion indicates significant growth plans for the company in its chemical manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1748853563000,
            "Source": "default"
        },
        {
            "Title": "Thirumalai Chemicals to Consider Issuance of 1 Billion Rupees Debentures",
            "Summary": "Thirumalai Chemicals has scheduled a board meeting on May 29 to consider the issuance of debentures worth 1 billion rupees. No further details about the purpose or terms of the debentures were provided in the news article.",
            "Sentiment": "neutral",
            "PublishDate": 1748262604000,
            "Source": "default"
        },
        {
            "Title": "Thirumalai Chemicals Reports Q4 Financial Results",
            "Summary": "Thirumalai Chemicals has released its Q4 financial results. The company reported revenue of 5.23 billion rupees, compared to 5.3 billion rupees in the same quarter last year. The consolidated net loss for Q4 was 141 million rupees, an improvement from the 205 million rupee loss reported in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747385455000,
            "Source": "result"
        },
        {
            "Title": "Thirumalai Chemicals Reports Increased Q3 Consolidated Net Loss",
            "Summary": "Thirumalai Chemicals has reported a consolidated net loss of 420 million rupees for the third quarter, compared to a loss of 230 million rupees in the same period last year. This represents an increase in losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738054749000,
            "Source": "earnings"
        },
        {
            "Title": "Thirumalai Chemicals Reports Improved Q2 EBITDA and Margin",
            "Summary": "Thirumalai Chemicals has announced its Q2 financial results. The company's EBITDA increased to 235 million rupees from 154 million rupees year-over-year. The EBITDA margin also improved, rising to 4.47% from 2.85% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730209103000,
            "Source": "result"
        },
        {
            "Title": "Thirumalai Chemicals Reports Q2 Profit Turnaround",
            "Summary": "Thirumalai Chemicals has reported a consolidated net profit of 49 million rupees in Q2, compared to a loss of 60 million rupees in the same quarter last year. This represents a significant turnaround in the company's financial performance. The profit also increased from 51 million rupees in the previous quarter. However, the company's revenue slightly decreased to 5.25 billion rupees from 5.42 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730209050000,
            "Source": "result"
        }
    ]
}