{
    "Symbol": "TITAN",
    "ISIN": "INE280A01028",
    "News": [
        {
            "Title": "Titan Makes Q3FY26 Analyst Call Recording Available",
            "Summary": "Titan Company has made the audio recording of its analyst call discussing Q3FY26 unaudited financial results available on its website, covering quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770792458678,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Acquires 67% Stake in Damas Jewellery via UAE Unit",
            "Summary": "Titan Company Ltd has acquired a 67% stake in Damas Jewellery through its UAE subsidiary Titan Holdings International FZCO, marking a significant expansion in the Middle East jewellery market.",
            "Sentiment": "positive",
            "PublishDate": 1770368581783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan shares decline 0.67% amid high volume trading",
            "Summary": "Titan Company shares fell 0.67% to Rs 3,994.80 with high trading volume. Q2 FY26 revenue jumped 28.85% YoY to Rs 18,725 crore while net profit surged 59.18% to Rs 1,119 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769510111259,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Company Block Trade Worth Rs. 22.82 Crores",
            "Summary": "Titan Company Ltd. witnessed a significant NSE block trade worth Rs. 22.82 crores involving approximately 57,006 shares at Rs. 4003.10 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769499649492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Intech Allots 60 Lakh Shares, Seeks Postal Ballot",
            "Summary": "Titan Intech Limited's board approved allotment of 60 lakh equity shares through warrant conversion to YOTOA Consultancy and postal ballot for three independent director appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1769242744392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Titan Company Limited has scheduled a board meeting on February 10, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768822320237,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Shareholders Approve Ajoy Chawla's Appointment",
            "Summary": "Titan Company shareholders overwhelmingly approved the appointment of Mr. Ajoy Chawla as Director and Managing Director through postal ballot with 99.43% and 98.20% votes in favor respectively.",
            "Sentiment": "positive",
            "PublishDate": 1768218450387,
            "Source": "stocks"
        },
        {
            "Title": "Titan Appoints Ajoy Chawla as Managing Director",
            "Summary": "Titan Company shareholders approve appointment of Ajoy Chawla as Managing Director through postal ballot with 98.20% votes in favor. Remote e-voting concluded on January 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768217155946,
            "Source": "stocks"
        },
        {
            "Title": "Titan Intech Independent Director Resigns",
            "Summary": "Titan Intech Limited announces resignation of Independent Director Shri Sanjeev Sharma effective January 10, 2026, citing increasing professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1768046351838,
            "Source": "stocks"
        },
        {
            "Title": "Lab-Grown Diamonds Reshape Indian Jewellery Market",
            "Summary": "Deloitte report reveals 44% prefer natural diamonds vs 8% for lab-grown, but LGDs lead gifting segment at 44%. Titan launches beYon brand targeting market expansion while De Beers doubles down on natural stones.",
            "Sentiment": "neutral",
            "PublishDate": 1768035408509,
            "Source": "stocks"
        },
        {
            "Title": "Titan Launches beYon Lab-Grown Diamond Store in Mumbai",
            "Summary": "Titan Company has launched its first lab-grown diamond store under the brand 'beYon – from the House of Titan' in Mumbai, marking its formal retail entry into the fast-emerging LGD jewelry business segment.",
            "Sentiment": "positive",
            "PublishDate": 1767847246716,
            "Source": "stocks"
        },
        {
            "Title": "Titan's Growth Impresses But Valuations Concern Experts",
            "Summary": "Dipan Mehta of Elixir Equities praises Titan's strong quarterly performance and multibagger returns but warns the stock is fully priced at 88 times earnings, despite entering a new growth phase.",
            "Sentiment": "neutral",
            "PublishDate": 1767772517023,
            "Source": "stocks"
        },
        {
            "Title": "Rekha Jhunjhunwala's Titan stake hits ₹20,000 cr",
            "Summary": "Rekha Jhunjhunwala's 5.32% stake in Titan reached ₹20,000 crore as shares hit record high of ₹4,300 following strong Q3 business update showing 40% YoY growth across consumer businesses.",
            "Sentiment": "positive",
            "PublishDate": 1767766745677,
            "Source": "stocks"
        },
        {
            "Title": "Titan Launches Lab-Grown Diamond Brand beYon",
            "Summary": "Titan Company debuts its first lab-grown diamond brand beYon, positioning it as a growth play rather than price substitute. Management focuses on customer adoption while addressing structural market concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1767764755819,
            "Source": "stocks"
        },
        {
            "Title": "Titan hits new 52-week high at ₹4,312 on Q3 beat",
            "Summary": "Titan shares surged 4.09% to ₹4,280, hitting 52-week high of ₹4,312 after Q3 FY26 results beat estimates with 40% revenue growth. Brokerages raise targets with Goldman Sachs at ₹4,850.",
            "Sentiment": "positive",
            "PublishDate": 1767712890289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Company Hits Fresh Record Highs in January 2026",
            "Summary": "Titan Company stock breaks out from multi-year rounding bottom formation, sustaining above key levels. Stock gains 2% weekly, 7% monthly with experts targeting ₹4,500.00 levels.",
            "Sentiment": "positive",
            "PublishDate": 1767699376902,
            "Source": "stocks"
        },
        {
            "Title": "Titan Biotech Sets Share Split Date for Feb 2026",
            "Summary": "Titan Biotech Ltd announces February 20, 2026, as the record date for equity share split, dividing each ₹10.00 share into five ₹2.00 shares in 1:5 ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1767347183872,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Company Appoints New Chairperson",
            "Summary": "Titan Company Ltd has appointed Sandhya Venugopal Sharma, IAS, as the new Chairperson and Additional Director on its Board as TIDCO nominee, replacing Arun Roy who continues as Director.",
            "Sentiment": "neutral",
            "PublishDate": 1767146417783,
            "Source": "stocks"
        },
        {
            "Title": "Titan Company Hits Fresh Record Highs in December",
            "Summary": "Titan Company breaks out from month-long consolidation to hit record highs this week, with experts suggesting potential targets above ₹4,300 in coming months for short-term traders.",
            "Sentiment": "positive",
            "PublishDate": 1767138679108,
            "Source": "stocks"
        },
        {
            "Title": "Titan Appoints New Chairperson Ms. Sandhya Sharma",
            "Summary": "Titan Company Limited announces appointment of Ms. Sandhya Venugopal Sharma, IAS as Chairperson and Additional Director effective January 4, 2026, replacing Mr. Arun Roy as Board Chairperson.",
            "Sentiment": "neutral",
            "PublishDate": 1767095283726,
            "Source": "stocks"
        },
        {
            "Title": "Titan Company Block Trade Worth ₹18.33 Crores",
            "Summary": "Titan Company executed a significant NSE block trade involving 45,967 shares at ₹3,988.50 per share, totaling ₹18.33 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767071216622,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Gets Positive Brokerage Outlook on Diamond Centre",
            "Summary": "Brokerages issue buy ratings on Titan as Tanishq launches Diamond Expertise Centre. Nuvama sets ₹4,672.00 target (17% upside), Morgan Stanley maintains overweight with ₹4,062.00 target.",
            "Sentiment": "positive",
            "PublishDate": 1767064159257,
            "Source": "stocks"
        },
        {
            "Title": "Titan Schedules Conference Call on beYon Brand Launch",
            "Summary": "Titan Company announces conference call on January 7, 2026 to discuss beYon lab-grown diamond brand launch. Call scheduled from 8:15-9:00 AM IST with senior management Q&A session.",
            "Sentiment": "neutral",
            "PublishDate": 1766979796196,
            "Source": "stocks"
        },
        {
            "Title": "Titan Intech Allots 51.5L Equity Shares via Warrant Conversion",
            "Summary": "Titan Intech Limited completed allotment of 51,50,000 equity shares to Nadem Township Private Limited through conversion of convertible equity share warrants on December 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766821637019,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Hits 52-Week High on BeYon Store Launch News",
            "Summary": "Titan shares surge 2.5% to new 52-week high of ₹4,008 following announcement of BeYon lab-grown diamond store launch in Mumbai on December 29, with expansion plans for Delhi stores.",
            "Sentiment": "positive",
            "PublishDate": 1766719723318,
            "Source": "stocks"
        },
        {
            "Title": "Titan Eyes $1B Watch Sales in Two Years",
            "Summary": "Titan Company expects its watch business to cross USD 1 billion in sales within the next two years, marking a significant growth milestone for the segment.",
            "Sentiment": "positive",
            "PublishDate": 1766374021454,
            "Source": "stocks"
        },
        {
            "Title": "Titan Intech Gets ₹125 Cr Term Loan Approval",
            "Summary": "IDBI Bank Limited has granted in-principle approval to Titan Intech Limited for a term loan facility of up to ₹125 crores for its proposed Integrated Electronic Manufacturing Project on December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765949733000,
            "Source": "stocks"
        },
        {
            "Title": "Titan Intech Appoints New Independent Director",
            "Summary": "Titan Intech Limited's Board approved the appointment of Mr. KOSUPIOW as Additional Independent Director effective December 16, 2025, bringing extensive LED display industry expertise.",
            "Sentiment": "positive",
            "PublishDate": 1765891360490,
            "Source": "stocks"
        },
        {
            "Title": "Titan Company Block Trade Worth ₹68.53 Crores on NSE",
            "Summary": "Titan Company witnessed a significant block trade on NSE involving 175,206 shares valued at ₹68.53 crores, executed at ₹3,911.40 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765858791314,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Redeems ₹1,500 Cr Commercial Paper",
            "Summary": "Titan Company successfully redeemed commercial papers worth ₹1,500 crores bearing ISIN INE280A14492, with maturity proceeds paid to all holders as scheduled on December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765450555327,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titan Company Seeks Shareholder Approval for Ajoy Chawla's Appointment as Managing Director",
            "Summary": "Titan Company has issued a postal ballot notice seeking shareholder approval to appoint Ajoy Chawla as Director and Managing Director for a five-year term from January 2026 to December 2030. Chawla, currently CEO of the Jewellery Division and a 34-year Titan veteran, will receive a basic salary range of ₹12-25 lakh per month plus commission of 400-600% of annual basic salary, with remote e-voting scheduled from December 13, 2025 to January 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765357334344,
            "Source": "corporate_action"
        },
        {
            "Title": "Titan Company Redeems ₹2000 Crore Commercial Paper",
            "Summary": "Titan Company has fully redeemed commercial papers worth ₹2000 crore bearing ISIN-INE280A14484 that were issued on 9 September 2025. The maturity proceeds have been paid to all holders, completing the company's debt obligation as per the scheduled redemption.",
            "Sentiment": "neutral",
            "PublishDate": 1765280003417,
            "Source": "corporate_action"
        },
        {
            "Title": "Titan Company Redeems ₹225 Crore Commercial Paper",
            "Summary": "Titan Company has fully redeemed Commercial Papers worth ₹225 crore bearing ISIN-INE280A14476 that were issued on 29 August 2025. The maturity proceeds have been paid to all holders, completing the company's debt obligation as per the scheduled redemption.",
            "Sentiment": "neutral",
            "PublishDate": 1764238897317,
            "Source": "corporate_action"
        },
        {
            "Title": "Titan Company Block Trade Worth Rs. 58.62 Crores Executed on NSE",
            "Summary": "A block trade involving 151,014 shares of Titan Company was executed on NSE at Rs. 3,881.60 per share, totaling Rs. 58.62 crores. The transaction represents a significant institutional or bulk investor activity in the jewelry and watches retailer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764052767069,
            "Source": "order&deals"
        },
        {
            "Title": "Titan Company Reports Strong Q2 Performance Despite High Gold Prices, Managing Director Signs Off After 15 Years",
            "Summary": "Titan Company Limited held its quarterly earnings conference call discussing unaudited financial results for the second quarter and half year ended September 30, 2025. Managing Director C.K. Venkataraman described Q2 FY26 as very satisfying with growth across virtually all businesses, markets, and subsidiaries. The company faced challenges from rising gold prices affecting buyer growth, with overall buyer growth at minus 2% for the quarter, while gold jewelry buyers declined 11% and studded jewelry buyers grew 3%. Gold coins showed exceptional growth driven by strong investment demand. The company launched powerful gold exchange campaigns and introduced lower carat offerings including 18-carat jewelry to stimulate demand. Titan expanded 35 stores in the first half and renovated close to 35 existing stores. International operations, particularly North America, continued strong performance. The company maintained margin guidance despite headwinds from elevated gold prices. This marked Venkataraman's final earnings call after 12-15 years, with him expressing gratitude for analyst support over approximately 50-60 calls during his tenure.",
            "Sentiment": "positive",
            "PublishDate": 1762605399684,
            "Source": "earnings"
        },
        {
            "Title": "Titan Provides Business Guidance Across Jewelry, Eyewear Segments and Store Expansion Plans",
            "Summary": "Titan's management provided guidance on multiple business segments. For the jewelry division, they expect absolute EBIT growth to be slightly slower than revenue growth for the full year due to margin pressures from high gold prices. The company indicated that Q3 year-to-date growth rates should improve compared to first half growth rates. For the eyewear segment, management expects to close the year with 13-14% growth. The company aims to maintain stable margins within their guided range, though some variation may occur due to gold price volatility. Titan is targeting 40 new Tanishq store openings for the year.",
            "Sentiment": "neutral",
            "PublishDate": 1762398813522,
            "Source": "stock"
        },
        {
            "Title": "Titan Company Sustains Strong Growth Momentum with 21% Revenue Jump in Jewellery Division",
            "Summary": "Titan Company's jewellery division reported a 21% year-on-year revenue increase to ₹14,092 crore, driven by festive and wedding demand along with the company's strategy to offer lower karat jewellery. The company is expected to maintain strong momentum for the remainder of the fiscal year, prompting analysts to revise target prices upward by 10-12% and raise EPS estimates by around 3% for FY26 and FY27. International jewellery business nearly doubled to ₹561 crore, with significant contributions from the Middle East and North America. Titan announced plans to acquire a 67% stake in Dubai-based Damas Jewellery to expand across GCC countries. The company added eight new Tanishq stores in October and renovated 35 stores in the first half. Consolidated inventory increased by ₹9,473 crore due to gold price inflation and festive stocking. Motilal Oswal maintained a 'buy' rating while Emkay Global upgraded to 'Add' with a target price of ₹4,100. The stock closed at ₹3,812.9 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1762396347382,
            "Source": "stock"
        },
        {
            "Title": "Titan Reports 59% Profit Jump Despite Gold Price Margin Pressures",
            "Summary": "Titan Co. reported strong quarterly results with net profit rising 59.1% to Rs 1,120 crore and revenue increasing 28.8% to Rs 18,725 crore. CFO Ashok Sonthalia noted the company delivered exceedingly strong performance across subsidiaries and international business. However, rising gold prices are pressuring margins, making it difficult to maintain current levels. The jewellery business grew 29.3% to Rs 16,522 crore, with domestic operations up 18% and CaratLane posting 32% growth. Consumer adjustment to higher gold prices has improved buyer growth during the festive season. The company continues to see premiumisation across brands and expects double-digit growth in analogue categories. For lab-grown diamonds, only the US market shows significant interest. International business is expected to grow strongly through geographical expansion before eventual consolidation.",
            "Sentiment": "positive",
            "PublishDate": 1762359831596,
            "Source": "earnings"
        },
        {
            "Title": "Titan Targets Double-Digit Growth Through Jewelry Leadership and Damas Acquisition",
            "Summary": "Titan aims to achieve continued double-digit growth by strengthening its jewelry business leadership and scaling its watches, eyewear, and emerging lifestyle brands. The company plans to expand into the GCC region through its acquisition of Damas Jewellery, which is expected to drive growth in its global luxury ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1762181049485,
            "Source": "stock"
        },
        {
            "Title": "Titan Reports 59% Profit Growth to Rs 1,120 Crore, Sales Rise 22%",
            "Summary": "Titan Company reported a 59% year-on-year increase in consolidated net profit to Rs 1,120 crore in the second quarter, driven by early festive demand particularly in the jewellery business. Sales grew 22% to Rs 16,461 crore. EBITDA jumped 51% to Rs 1,799 crore due to margin expansion and double-digit growth across most business segments. The jewellery division, including brands Tanishq, Mia, Zoya and CaratLane, generated total income of Rs 14,092 crore (excluding bullion and Digi-Gold), up 21% year-on-year. Growth was supported by strong festive demand, improved studded jewellery mix, and expansion in domestic and overseas markets.",
            "Sentiment": "positive",
            "PublishDate": 1762176154916,
            "Source": "earnings"
        },
        {
            "Title": "Titan Reports Strong Q2 Results with 43% Jump in Net Profit",
            "Summary": "Titan reported quarterly net profit of 10.06 billion rupees, up from 7.05 billion rupees year-over-year, though slightly below analyst estimates of 10.51 billion rupees. Revenue grew to 145 billion rupees from 122.7 billion rupees year-over-year, missing estimates of 150.6 billion rupees. EBITDA increased significantly to 16.2 billion rupees from 11.33 billion rupees year-over-year, coming close to estimates of 16.65 billion rupees. EBITDA margin improved to 11.17% from 9.24% year-over-year, exceeding the estimated 11%.",
            "Sentiment": "positive",
            "PublishDate": 1762175272181,
            "Source": "earnings"
        },
        {
            "Title": "Titan Company Completes INR 1,250 Crore Debenture Redemption and Interest Payment",
            "Summary": "Titan Company Limited has successfully completed the redemption of debentures worth INR 1,250 crore along with interest payment of INR 96.87 crore. The company redeemed 1,25,000 non-convertible debentures (ISIN: INE280A08015) at maturity on November 3, 2025, with the record date being October 17, 2025. The interest payment was made quarterly as scheduled. Both the principal redemption amount and interest were paid to respective debenture holders on the due date without any delays.",
            "Sentiment": "positive",
            "PublishDate": 1762166571286,
            "Source": "corporate_action"
        },
        {
            "Title": "Titan Q2 Profit Expected to Surge 38% YoY Despite Jewellery Growth Moderation",
            "Summary": "Titan Company is expected to report strong quarterly results with net profit projected to jump 38% year-on-year, aided by a low base effect from customs duty adjustments in the previous year. Revenue is forecast to grow around 10% YoY according to six brokerages. However, the jewellery business, which contributes 88% of overall revenue, is expected to see moderated sequential growth due to higher gold prices and delayed festive purchases. Brokerages project consolidated revenue growth of 10-13% YoY, with standalone jewellery sales excluding bullion rising 12-14%. The watches and eyewear divisions are expected to post double-digit growth. Gold prices surged 18% between August and September, likely postponing some festive-season purchases. Jewellery EBIT margins are projected to be around 11-11.5%, slightly lower than last year due to elevated gold prices. The studded jewellery segment is expected to show first signs of recovery after four quarters of decline, with its share staying flat at around 30%. CaratLane revenue is projected to climb 25% YoY with flat margins of 7%.",
            "Sentiment": "positive",
            "PublishDate": 1762068864660,
            "Source": "earnings"
        },
        {
            "Title": "Titan Company Adds Signature Jewellery as Step-Down Subsidiary for Damas Operations",
            "Summary": "Titan Company Limited announced that Signature Jewellery Holding Limited, UAE, has become its step-down subsidiary through wholly-owned arm Titan Holdings International FZCO. The Dubai International Financial Centre registered the share transfer on October 9, 2025, with formal intimation received on October 27. Signature Jewellery will serve as the holding company for Damas' entire jewellery business in GCC countries. This follows Titan's July 2025 announcement to acquire 67 percent of Damas' jewellery operations, with the remaining 33 percent stake to be acquired after December 31, 2029. Titan Holdings International FZCO has acquired all 1,000,000 ordinary shares of $1 each, representing Signature Jewellery's entire issued capital, though shares have not yet been paid up. The transaction is expected to complete on or before January 31, 2026. Titan shares were trading at ₹3,708.50, down ₹31.30 or 0.84 percent on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761646502236,
            "Source": "order&deals"
        },
        {
            "Title": "Rekha Jhunjhunwala Increases Titan Stake by 15 Lakh Shares, Total Holding Reaches 5.3%",
            "Summary": "Rekha Jhunjhunwala purchased an additional 15 lakh shares (0.2%) in Titan Company during the second quarter of FY26, bringing her total holding to 5.3% or 4.7 crore shares. The investment is valued at over Rs 17,000 crore and remains the Jhunjhunwala family's largest listed equity investment. The family initially invested in Titan between 2002-2003 when shares traded in double digits. Titan reported strong quarterly results with domestic business growing 18% year-on-year and international division surging 86%. The jewellery segment grew 19%, led by CaratLane's 30% growth, while emerging businesses posted 37% growth. The company expanded its retail presence with 34 new jewellery stores, bringing the total to 3,377 outlets. Titan shares closed at Rs 3,718, delivering 200% returns over the past five years.",
            "Sentiment": "positive",
            "PublishDate": 1761458301714,
            "Source": "stock"
        },
        {
            "Title": "Titan Doubles Luxury Watch Sales Above ₹25,000 as Company Shifts Focus to Premium Segments",
            "Summary": "Titan Company is strategically pivoting toward premium and luxury watch segments, with volumes for watches priced above ₹25,000 doubling year-on-year. The company has raised its base watch price to ₹3,000 and created five distinct market tiers ranging from mid-market (below ₹10,000) to absolute luxury. Titan launched the Nebula Jalsa limited-edition flying tourbillon at ₹40.5 lakh and the Stellar 3.0 collection priced between ₹96,000 and ₹1.8 lakh, featuring India's first Wandering Hour watch. CEO Kuruvilla Markose attributes this premiumization to rising incomes and consumer demand for exclusive products. The watches division grew 12% year-on-year, with analog segment growth of 17%, while smart wearables declined 23%. The company added 15 new stores and plans to expand internationally using its premium product lines.",
            "Sentiment": "positive",
            "PublishDate": 1761226300738,
            "Source": "stock"
        },
        {
            "Title": "Titan Company Shareholders Approve Board Appointments Through Postal Ballot",
            "Summary": "Titan Company announced the results of its postal ballot conducted through remote e-voting, with voting concluding on October 22, 2025. Shareholders approved two key resolutions: the re-appointment of Mr. Sandeep Singhal as an Independent Director through a special resolution, and the appointment of Mr. Puneet Chhatwal as a Director through an ordinary resolution. The e-voting process ran from September 23 to October 22, 2025, with the company having 812,461 total shareholders as of the record date of September 12, 2025. For Singhal's re-appointment, 99.13% of votes cast were in favor, while Chhatwal's appointment received 98.75% approval from voting shareholders. The resolutions were deemed passed on October 22, 2025, and detailed voting results along with the scrutinizer's report are available on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1761216731400,
            "Source": "corporate_action"
        },
        {
            "Title": "Tanishq Reports Strong Jewellery Demand Surge Despite Gold Prices Hitting Rs 1.30 Lakh Per 10 Grams",
            "Summary": "Tanishq is experiencing a significant increase in jewellery demand during the festive season despite gold prices reaching Rs 1,30,000 per 10 grams. CEO Ajoy Chawla reported that after a slow start, volume growth returned as customers who were waiting for price corrections began purchasing again. The company is seeing particularly strong demand for gold coins and bars, driven by investment interest and fear of missing out as customers expect prices to rise further. While Tanishq has planned adequately for the demand surge, Chawla acknowledged concerns about potential stock shortages due to a bullion shortage in the country.",
            "Sentiment": "positive",
            "PublishDate": 1760511359092,
            "Source": "stock"
        },
        {
            "Title": "Titan Schedules Quarterly Results Review for November 3",
            "Summary": "Titan has announced that it will review its Q2 results on November 3. The company has set this date for the quarterly results review process.",
            "Sentiment": "neutral",
            "PublishDate": 1760435411492,
            "Source": "earnings"
        },
        {
            "Title": "Titan Company Reports Debt Securities Status for Half-Year Ended September 2025",
            "Summary": "Titan Company Limited submitted a report on debt securities issued through private placement for the half-year ended September 30, 2025. The report shows two series of non-convertible debentures, each worth Rs. 1,250 crore with a 7.75% annual coupon rate. Series 1 debentures were fully redeemed on May 5, 2025, with no outstanding amount remaining. Series 2 debentures are scheduled to mature on November 3, 2025, with the full Rs. 1,250 crore amount still outstanding. Both series are rated, listed, unsecured, redeemable, senior, non-cumulative debentures issued in November 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1760094897402,
            "Source": "corporate_action"
        }
    ]
}