{
    "Symbol": "TITAGARH",
    "ISIN": "INE615H01020",
    "News": [
        {
            "Title": "Titagarh Rail Board Meet Set for Feb 12, 2026",
            "Summary": "Titagarh Rail Systems has scheduled a board meeting on February 12, 2026, to consider and approve Q3 FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770040345976,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titagarh Rail Systems Partners with ABB for 25kV Metro",
            "Summary": "Titagarh Rail Systems Limited signs strategic agreement with ABB India for propulsion systems and technology transfer for 25kV driverless metro projects, including TCMS technology and manufacturing transfer under Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1769520527502,
            "Source": "stocks"
        },
        {
            "Title": "Titagarh Rail Gets Approval for Subsidiary Transfer",
            "Summary": "Titagarh Rail Systems receives approval to transfer its shipbuilding and maritime systems operations to a subsidiary company, marking a strategic organizational restructuring move.",
            "Sentiment": "positive",
            "PublishDate": 1767190711751,
            "Source": "stocks"
        },
        {
            "Title": "Titagarh Rail Systems Approves Business Transfer & ESOP",
            "Summary": "Titagarh Rail Systems board approves transfer of shipbuilding business to subsidiary TNSL for ₹114.88 crores and grants 8.75 lakh stock options to employees under ESOP scheme.",
            "Sentiment": "positive",
            "PublishDate": 1767189109474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titagarh Rolls Out First Ahmedabad Metro Trainset",
            "Summary": "Titagarh Rail Systems delivered its first driverless Made in India trainset for Ahmedabad Metro Phase-2, featuring 70-75% local content and Garba-inspired interiors, in presence of Gujarat CM.",
            "Sentiment": "positive",
            "PublishDate": 1766244053360,
            "Source": "stocks"
        },
        {
            "Title": "Titagarh Rail Systems Wins ₹273.24 Cr Railway Order",
            "Summary": "Titagarh Rail Systems secures maiden order worth ₹273.24 crores from Indian Railways for design, manufacture and supply of 62 Rail Borne Maintenance Vehicles, marking strategic entry into safety systems.",
            "Sentiment": "positive",
            "PublishDate": 1765978627321,
            "Source": "co_actions_results"
        },
        {
            "Title": "Titagarh Rail Systems Reports 25% Revenue Decline in Q2 FY26, Secures Rs 2,925 Crore New Orders",
            "Summary": "Titagarh Rail Systems reported standalone revenue of Rs 788.32 crore in Q2 FY26, down 24.82% from Rs 1,048.58 crore in Q2 FY25, with profit after tax declining 42.49% to Rs 51.85 crore. The company secured major new orders worth Rs 2,700 crore during the quarter, including a Rs 2,481 crore Mumbai Metro Line 5 contract and a Rs 445 crore shipbuilding order, maintaining a strong order book of Rs 15,077 crore.",
            "Sentiment": "negative",
            "PublishDate": 1763173714312,
            "Source": "earnings"
        },
        {
            "Title": "Titagarh Rail Guides Strong Multi-Year Growth With ₹15,077 Cr Order Book",
            "Summary": "Titagarh Rail projects strong multi-year growth backed by an order book of ₹15,077 crores plus ₹13,326 crores JV share, while expanding metro coach and wagon capacity across Kolkata and Bharatpur facilities. The company is executing major projects including Vande Bharat Sleeper and Mumbai Metro Line 5 & 6, targeting 30%+ revenue growth with a net-debt-free balance sheet and automation-driven efficiency improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1763135370708,
            "Source": "earnings"
        },
        {
            "Title": "Titagarh Rail Systems Issues ₹199.99 Crore Convertible Warrants to Promoters",
            "Summary": "Titagarh Rail Systems has issued 21,11,932 convertible warrants to its promoters for ₹199.99 crore at ₹947 per warrant. The promoters have 18 months to apply for converting these warrants into shares. This fundraising mechanism allows the company to raise capital while giving promoters the option to increase their shareholding within the specified timeframe.",
            "Sentiment": "neutral",
            "PublishDate": 1762238677911,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Secures ₹24.81 Billion Order from MMRDA",
            "Summary": "Titagarh Rail Systems received a letter of acceptance from Mumbai Metropolitan Region Development Authority (MMRDA) for an order valued at ₹24.81 billion.",
            "Sentiment": "positive",
            "PublishDate": 1762128869561,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Rail Systems Receives 24.81 Billion Rupees Order Acceptance from MMRDA",
            "Summary": "Titagarh Rail Systems has received an acceptance letter from MMRDA (Mumbai Metropolitan Region Development Authority) for an order valued at 24.81 billion rupees. The acceptance letter confirms the company has secured this significant contract from the regional development authority.",
            "Sentiment": "positive",
            "PublishDate": 1761919165039,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Targets 3 Billion Ton Rail Cargo Movement Goal",
            "Summary": "Titagarh has announced its aim to achieve 3 billion ton rail cargo movement. The company has set this target as part of its rail transportation business objectives.",
            "Sentiment": "positive",
            "PublishDate": 1759897274319,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Sets Target to Produce 1,000 Wagons Monthly",
            "Summary": "Titagarh has announced a production target of 1,000 wagons per month. The company appears to be scaling up its manufacturing capacity in the railway wagon segment.",
            "Sentiment": "positive",
            "PublishDate": 1759896892246,
            "Source": "stock"
        },
        {
            "Title": "Cabinet Expected To Approve Railway Projects Worth ₹24,000 Crores",
            "Summary": "The Cabinet is expected to approve railway projects valued at ₹24,000 crores. The projects include Bhusawal-Wardha, Gondia-Dungalgarh, Itarsi-Bhopal-Bina, and Vadodara-Ratlamp railway lines. Companies mentioned in relation to these projects are Titagarh and Ircon.",
            "Sentiment": "positive",
            "PublishDate": 1759816000682,
            "Source": "sectoral"
        },
        {
            "Title": "Titagarh Rail Systems MD Expects Growth From Passenger Rail and Shipbuilding Segments",
            "Summary": "Umesh Chowdhary, vice chairman and managing director of Titagarh Rail Systems Ltd., stated that the company expects real growth to come from passenger rail and shipbuilding segments. The company has reactivated its shipbuilding venture by founding Titagarh Naval Systems Ltd., which will establish a shipyard at Falta, West Bengal. Chowdhary noted limited shipbuilding activity in Eastern India except for Garden Reach, making Falta a strategic location. The company is entering shipbuilding cautiously with an initial order book of 550-600 crore. Titagarh's consolidated net profit declined 54% in the first quarter due to supply chain disruptions, particularly wheel set delivery issues. The MD expects this problem to be resolved through a joint venture with Ramkrishna Forgings Ltd. to establish their own wheel set plant.",
            "Sentiment": "positive",
            "PublishDate": 1758800088868,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Systems Delivers First Diving Support Craft to Indian Navy",
            "Summary": "Titagarh Rail Systems Limited handed over the first indigenously built Diving Support Craft (DSC A20) to the Indian Navy. This vessel is the first in a series of five DSCs being constructed by TRSL under the Ministry of Defence's Make in India initiative. The 32.9-meter catamaran-type vessel is designed to support Navy's Command Clearance Diving Teams in underwater operations and serve as a training platform. It has 72-hour endurance, cruising speed of 11 knots, and can carry 18 personnel. DSC A20 marks the first Indian Naval Commissioned Vessel built and delivered by a private shipyard in Bengal. The company's Board has approved transferring the shipbuilding business into a wholly owned subsidiary, Titagarh Naval Systems, with an order book above 575 crores. TRSL has delivered more than 35 vessels and is establishing a new shipyard at Falta with capacity to handle ships up to 180 meters and produce 12-16 vessels annually.",
            "Sentiment": "positive",
            "PublishDate": 1758129673101,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Systems Launches Third Diving Support Craft for Indian Navy",
            "Summary": "Titagarh Rail Systems Limited launched the third indigenously built Diving Support Craft for the Indian Navy at its Falta shipyard. The vessel is part of a series of five DSCs being built under the Make in India initiative. The catamaran-type craft was launched into the Hooghly River and is designed to support the Navy's Command Clearance Diving Teams in underwater repair, maintenance, and salvage operations. The company's board has approved creating a new entity called Titagarh Naval Systems to house the shipbuilding business, which has an order book above 575 crores. TRSL's shipbuilding division has delivered more than 35 vessels and recently acquired a jetty and adjoining land for expansion of its Falta shipyard. The company also received an LOI from GRSE for construction of 2 Coastal Research Vessels for Geological Survey of India.",
            "Sentiment": "positive",
            "PublishDate": 1757834835940,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Systems and BHEL Inaugurate Vande Bharat Sleeper Train Production Line in Kolkata",
            "Summary": "Titagarh Rail Systems Limited and Bharat Heavy Electricals Limited inaugurated a dedicated production line for Vande Bharat Sleeper Trains at TRSL's manufacturing facility in Uttarpara, Kolkata. The inauguration was led by Umesh Chowdhary, Vice Chairman & Managing Director of TRSL, and Bani Varma, Director of BHEL. The production line follows a contract award from Indian Railways to design and manufacture 80 Vande Bharat Sleeper train sets under a consortium between TRSL and BHEL, valued at around ₹24,000 crore including 35 years of long-term maintenance. The sleeper variant will be India's first long-distance, semi high-speed train with fully indigenous design. Prototype trains are expected to roll out in the next calendar year. The Uttarpara facility features Industry 4.0 technologies and robotic production lines, with current annual capacity of 300 coaches being scaled up to 850 coaches to meet increasing demand.",
            "Sentiment": "positive",
            "PublishDate": 1757077056444,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Systems Approves Rs 5 Crore Investment in Subsidiary TNSPL Through Rights Issue",
            "Summary": "Titagarh Rail Systems Limited's board approved an investment of Rs 5 crore to acquire 50 lakh additional equity shares at par value of Rs 10 each in its wholly-owned subsidiary Titagarh Naval Systems Private Limited (TNSPL) through a rights issue. The investment will not change the company's shareholding percentage in TNSPL, which will remain a wholly-owned subsidiary. TNSPL, incorporated in December 2024, operates in manufacturing, marketing and selling naval systems including shipbuilding and related components. The rights issue proceeds will be used to meet fund requirements for augmenting infrastructure for SMS business. The acquisition is expected to be completed by September 10, 2025, with full cash consideration payable on application.",
            "Sentiment": "neutral",
            "PublishDate": 1757070627556,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Revises Dividend Record Date to September 9, 2025",
            "Summary": "Titagarh Rail Systems Limited has revised its record date for dividend payment from September 8, 2025 to September 9, 2025. The change was made following the Reserve Bank of India's declaration of a clearing/settlement holiday on September 8, 2025, and subsequent directions from NSE and BSE. The dividend is for the financial year ended March 31, 2025, and remains subject to shareholder approval. The revised record date supersedes the date mentioned in the Annual General Meeting notice dated August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757051460289,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Secures ₹91.12 Crore Order from Banaras Locomotive Works",
            "Summary": "Titagarh Rail Systems Limited received a Letter of Acceptance from Banaras Locomotive Works for Complete Shell Assembly for WAG-9HC Locomotives worth ₹91.12 crores including GST. The domestic order is scheduled for completion by August 31, 2026. The contract does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755947078174,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Rail Systems Wins ₹467.25 Crore Contract for Research Vessels",
            "Summary": "Titagarh Rail Systems has secured a Letter of Intent (LOI) worth ₹467.25 crore from Garden Reach Shipbuilders & Engineers (GRSE) for the construction of two research vessels. The vessels will be built for the Geological Survey of India.",
            "Sentiment": "positive",
            "PublishDate": 1755794166450,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Rail Systems Releases Q1FY26 Earnings Call Transcript",
            "Summary": "Titagarh Rail Systems Limited conducted its quarterly earnings call on August 12, 2025, and has made the transcript available to stakeholders and regulatory bodies. The earnings call was held at 03:30 P.M. (IST) and the full transcript can be accessed on the company's website. The provided document serves as a cover letter for the earnings call transcript rather than containing the actual financial data or management commentary from the call.",
            "Sentiment": "neutral",
            "PublishDate": 1755611716850,
            "Source": "earnings"
        },
        {
            "Title": "Titagarh Rail Systems Aims for 1,500 Monthly Wagon Production by FY26",
            "Summary": "Titagarh Rail Systems is targeting monthly wagon production of 1,500 units in FY26, up from its current capacity of 1,000-1,200 wagons, according to Vice Chairman and MD Umesh Chowdhary. The company has a freight rail order book of Rs 4,114 crore for 10,772 wagons and expects new private sector tenders and Indian Railways requirements. The company faced wheelset supply shortages in the past two quarters from Rail Wheel Factory, but this issue appears resolved as of late July-early August. The company's business mix has shifted significantly, with passenger rail becoming a key growth driver. Out of the total order book of Rs 26,000 crore, only Rs 4,000 crore is for freight rail systems while the balance covers other segments. Shares closed 0.31% lower at Rs 811 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755402917689,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Systems Faces Risk of ₹173 Crore Loss from Italian Subsidiary Firema",
            "Summary": "Titagarh Rail Systems' auditor has identified a significant risk of potential losses exceeding ₹173 crore related to the company's Italian subsidiary Firema. The exact financial impact of this risk remains uncertain at this time.",
            "Sentiment": "negative",
            "PublishDate": 1754972782791,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Systems Shares Rise 4% Despite 54% Profit Drop in Q1",
            "Summary": "Titagarh Rail Systems shares gained over 4% following the release of quarterly results. The company's consolidated net profit declined 54% to Rs 30.86 crore compared to Rs 67.01 crore in the same period last year, attributed to reduced wagon dispatches due to lower wheelset supply from Rail Wheel Factory. The company secured new orders worth Rs 2,092 crore, bringing its total order book to Rs 26,000 crore. Shares traded at Rs 808, up 4.10%, outperforming the NSE Nifty 50's 0.17% gain. The stock has declined 43.53% over the past 12 months and 26.07% year-to-date. Seven out of eight analysts maintain a 'buy' rating with one 'hold' recommendation, with price targets suggesting 41.5% potential upside.",
            "Sentiment": "neutral",
            "PublishDate": 1754972462356,
            "Source": "earnings"
        },
        {
            "Title": "Titagarh Rail Systems Reports Decline in Q1 Financial Performance",
            "Summary": "Titagarh Rail Systems reported Q1 net profit of 427.5 million rupees, down from 713 million rupees in the same period last year. Revenue decreased to 6.79 billion rupees from 9.03 billion rupees year-over-year. EBITDA fell to 725.5 million rupees compared to 1.02 billion rupees previously. The company's EBITDA margin slightly declined to 11.08% from 11.28% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754957781139,
            "Source": "earnings"
        },
        {
            "Title": "Titagarh Rail Systems Reports Q1FY26 Results, Secures New Orders Worth INR 2,469 Crores",
            "Summary": "Titagarh Rail Systems delivered 1,628 wagons in Q1FY26, down from 2,455 in the previous quarter due to poor wheelset supplies from Rail Wheel Factory, Bangalore, which has since normalized. The company secured new orders worth INR 2,469 crores including GST during the period, bringing total order book to approximately INR 26,000 crores excluding GST. Key developments include approval for issuing 21,11,932 convertible warrants to promoter group entities totaling INR 199.99 crores, and entering a 99-year lease for 40.009 acres of land adjacent to its Uttarpara factory for INR 137 crores. The company received significant metro coach orders including 108 coaches for MMRDA Line 6 worth INR 1,599 crores and 36 additional coaches for Pune Metro valued at INR 431 crores. Titagarh's first train for Bangalore metro was inaugurated by the Prime Minister. The Freight Rail Segment achieved 11.16% EBIT margin compared to 12.12% in FY25. The company plans to transfer its shipbuilding business to wholly-owned subsidiary Titagarh Naval Systems Private Limited to focus on core railway operations. Management expects to recover Q1 production losses and match FY25's delivery of 9,431 wagons.",
            "Sentiment": "positive",
            "PublishDate": 1754929313047,
            "Source": "earnings"
        },
        {
            "Title": "Titagarh Rail Systems Establishes Naval Subsidiary and Reports Quarterly Results",
            "Summary": "Titagarh Rail Systems Limited approved the establishment of wholly owned subsidiary Titagarh Naval Systems Private Limited for Rs. 10,000 and plans to transfer its Shipbuilding and Maritime Systems business to this new entity. The company delegated power to evaluate growth strategies for its Defence and Bridges business, including potential strategic partnerships. For the quarter ended June 30, 2025, the company reported revenue from operations of Rs. 679.30 crores and profit after tax of Rs. 42.75 crores on standalone basis. The company also approved convertible warrants worth Rs. 199.99 crores to promoter group members and scheduled its 28th Annual General Meeting for September 15, 2025. The company faces uncertainty regarding its investments in Italian associate Titagarh Firema SpA, which has filed for protection under Italian Crisis Code due to financial difficulties.",
            "Sentiment": "neutral",
            "PublishDate": 1754927814110,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Conducts EGM to Approve Warrant Issuance to Promoter Group",
            "Summary": "Titagarh Rail Systems Limited held an Extra-Ordinary General Meeting on August 8, 2025, via video conferencing from 11:30 AM to 12:03 PM. The meeting was chaired by J P Chowdhary, Chairperson of the Board, with the primary agenda being the approval of a special resolution for the issuance of up to 21,11,932 warrants convertible into equity shares to members of the promoter group on a preferential basis. The company provided remote e-voting facility through NSDL from August 4-7, 2025, with additional e-voting available for 15 minutes post-meeting conclusion. The cut-off date for eligible voting members was August 1, 2025. Registered speakers addressed queries during the meeting, which were responded to by Umesh Chowdhary, Vice Chairman & Managing Director. Sushil Goyal of Sushil Goyal & Co. served as the appointed scrutinizer for the e-voting process. The voting results and scrutinizer's report will be submitted to stock exchanges within statutory timelines and made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754660499703,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Schedules Board Meeting on August 11 for Quarterly Results",
            "Summary": "Titagarh Rail Systems Limited has scheduled a Board of Directors meeting for August 11, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The meeting will review both standalone and consolidated financial results. The trading window for designated persons has been closed since July 1, 2025, and will remain closed until 48 hours after the financial results are declared.",
            "Sentiment": "neutral",
            "PublishDate": 1754475929988,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Secures ₹1,600 Crore Mumbai Metro Contract from NCC",
            "Summary": "Titagarh Rail Systems Ltd. won a ₹1,598.55 crore order from NCC Ltd. for the Mumbai Metro Rail project. The contract covers design, manufacturing, supply, installation, integration, testing and commissioning of rolling stock for Line 6 (Swamy Samarth Nagar to Vikhroli), including seven years of maintenance services. The design and build period is set at 104 weeks. The company also received a ₹312 crore order from the Ministry of Railways for manufacturing 780 BVMC-C Wagons, to be completed in nine months. Additionally, the board approved raising up to ₹200 crore through preferential issuance of 21.16 lakh warrants at ₹945 each to promoter entities. Despite these order wins, the stock has declined 10.93% in the past month and 24.36% year-to-date, closing at ₹838.35.",
            "Sentiment": "positive",
            "PublishDate": 1754271947096,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Rail Systems Wins ₹1,598.55 Crore Mumbai Metro Contract",
            "Summary": "Titagarh Rail Systems has secured a rolling stock contract worth ₹1,598.55 crore for Mumbai Metro Line 6, where the company will serve as a specialized subcontractor for the project.",
            "Sentiment": "positive",
            "PublishDate": 1754270889104,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Systems Secures INR 1,598.55 Crore Mumbai Metro Contract",
            "Summary": "Titagarh Rail Systems Limited received a Letter of Acceptance from NCC Limited for a contract worth INR 1,598.55 crores. The project involves designing, manufacturing, supplying, installing, and commissioning 108 metro coaches (18 trains of 6 cars each) for Line 6 of the Mumbai Metro Rail Project, covering the Swami Samarth Nagar to Vikhroli route. The contract includes a 104-week design-build period, followed by 2 years of defect liability maintenance and 5 years of comprehensive maintenance. The order is from a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1754242409553,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Rail Systems Issues Corrigendum for EGM on Rs 200 Crore Preferential Warrant Issue",
            "Summary": "Titagarh Rail Systems Limited has issued a corrigendum to its Extra-Ordinary General Meeting notice scheduled for August 8, 2025. The company modified key details of its proposed preferential issue of convertible warrants following observations from NSE and BSE. The revised proposal involves issuing up to 21,11,932 fully convertible warrants at Rs 947 per warrant to promoter group members - Rashmi Chowdhary (15,83,951 warrants) and Prithish Chowdhary (5,27,981 warrants) - for an aggregate amount of Rs 199.99 crores. Each warrant can be converted into one equity share of Rs 2 face value at a premium of Rs 945 per share within 18 months of allotment. The proceeds will be used for reimbursement of Rs 50 crores towards land acquisition at Uttarpara, West Bengal, costing Rs 126.63 crores. Post-issue, promoter group shareholding will increase from 40.46% to 41.38%. The warrant issue price of Rs 947 is above the minimum floor price of Rs 946.29 as per SEBI ICDR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753880833626,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Shares Rise on Rs 312.69 Crore Railway Order",
            "Summary": "Titagarh Rail Systems received a Rs 312.69 crore order from the Ministry of Railways for manufacturing and supplying 780 BVCM-C wagons, to be executed within nine months. The Kolkata-based company specializes in freight wagons, passenger coaches, metro train components, and rolling stock for domestic and international markets. Shares rose 1.40% to Rs 939 before paring gains. The stock has declined 42.14% over the past 12 months. Seven out of eight analysts maintain a 'buy' rating with one 'hold' recommendation, and the average 12-month consensus price target suggests 19% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1753084091507,
            "Source": "stock"
        },
        {
            "Title": "Titagarh Rail Wins ₹312.7 Crore Contract for 780 Railway Wagons",
            "Summary": "Titagarh Rail has secured a ₹312.7 crore order from Indian Railways for manufacturing 780 BVCM-C wagons. This contract represents a significant business win for the railway equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1753081534183,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Rail Systems: Land Acquisition Boosts Vande Bharat Train Testing Capacity",
            "Summary": "Titagarh Rail Systems has signed a 99-year lease for 40 acres in Uttarpara, West Bengal, for Rs 126.63 crore. This expansion will enable on-site testing of Vande Bharat trains and increase coach production capacity. The company aims to reach a capacity of 1,200 cars annually within 4-5 years. Additionally, Titagarh is raising Rs 200 crore through promoter group warrants for investments and working capital.",
            "Sentiment": "positive",
            "PublishDate": 1752650958000,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Acquires 40 Acres in Bengal for ₹126 Crore",
            "Summary": "Titagarh Rail has purchased 40 acres of land in Bengal for ₹126 crore. The acquisition is aimed at expanding the company's operations. No further details about the specific location or intended use of the land were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752463929000,
            "Source": "default"
        },
        {
            "Title": "Titagarh Rail Systems: Land Acquisition to Boost Vande Bharat Coach Production",
            "Summary": "Titagarh Rail Systems acquired 40 acres of land on a 99-year lease from West Bengal government for Rs 126 crore. The land will be used to expand production of Vande Bharat coaches and metro cars at Uttarpara facility. The company aims to increase production capacity from 300 to 850 cars annually by FY28. Additionally, Titagarh plans to raise Rs 200 crore through preferential issue of warrants to promoter group.",
            "Sentiment": "positive",
            "PublishDate": 1752460908000,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems Plans to Raise 2 Billion Rupees Through Preferential Warrants",
            "Summary": "Titagarh Rail Systems has announced plans to raise up to 2 billion rupees by issuing preferential warrants. This move suggests the company is seeking additional capital, potentially for expansion or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1752161843000,
            "Source": "default"
        },
        {
            "Title": "Titagarh Rail Systems Ltd: Board Approves ₹200 Crore Fund Raise via Preferential Warrants",
            "Summary": "Titagarh Rail Systems' board approved raising ₹200 crore by issuing 21.16 lakh preferential warrants at ₹945 each to promoter entities. The warrants are convertible into equity shares within 18 months. An EGM is scheduled for August 8, 2025, to seek shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1752112058000,
            "Source": "corporate_action"
        },
        {
            "Title": "Titagarh Rail Systems to Explore Fundraising Options",
            "Summary": "Titagarh Rail Systems has announced plans to explore various fundraising options on July 9. The company will consider different securities for raising funds, including preferential issue, qualified institutional placement, and rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1751635090000,
            "Source": "default"
        },
        {
            "Title": "Titagarh Rail Systems Wins Order for Pune Metro Trainsets",
            "Summary": "Titagarh Rail Systems has secured an order worth ₹430.53 crore from Maharashtra Metro Rail. The order is for 12 additional Pune Metro trainsets. The company is required to execute this order within a timeframe of 30 months.",
            "Sentiment": "positive",
            "PublishDate": 1751241466000,
            "Source": "default"
        },
        {
            "Title": "Titagarh Rail Systems: Secures Rs 430 Crore Metro Contract",
            "Summary": "Titagarh Rail Systems Ltd. has won a Rs 430.53 crore contract from Maharashtra Metro Rail Corp. for supplying 12 additional trainsets. The project, to be completed in 30 months, involves design, manufacture, supply, testing, and commissioning of passenger rolling stock.",
            "Sentiment": "positive",
            "PublishDate": 1751110862000,
            "Source": "order&deals"
        },
        {
            "Title": "Titagarh Rail Systems Secures ₹430.53 Crore Order for Pune Metro Trainsets",
            "Summary": "Titagarh Rail Systems has received an order worth ₹430.53 crore from Maharashtra Metro Rail. The order is for 12 additional trainsets for the Pune Metro. The project is expected to be completed within 30 months.",
            "Sentiment": "positive",
            "PublishDate": 1751108805000,
            "Source": "default"
        },
        {
            "Title": "Titagarh Stock in Trading Ban",
            "Summary": "The stock of Titagarh has been placed under a trading ban. No further details about the reason for the ban or its duration were provided in the given news data.",
            "Sentiment": "negative",
            "PublishDate": 1750810139000,
            "Source": "normal_news"
        },
        {
            "Title": "Titagarh Rail Systems: Analysts Bullish Despite Recent Stock Decline",
            "Summary": "Titagarh Rail Systems Ltd. stock has fallen 18.64% year-to-date, but analysts maintain a positive outlook with a consensus 12-month target price of Rs 1,123.83, implying a 25.4% upside. The company aims to increase annual wagon production capacity to 12,000 and targets 12-13% EBITDA margin in freight business. Recent order book includes 11,500 wagons and 1,583 Metro and Vande Bharat coaches.",
            "Sentiment": "positive",
            "PublishDate": 1750143378000,
            "Source": "normal_news"
        },
        {
            "Title": "Titagarh Rail Systems: Ambitious Revenue Targets on Expanded Production",
            "Summary": "Titagarh Rail Systems Ltd. aims for Rs 8,500 crore annual revenue from passenger trains segment due to increased wagon production capacity. The company plans to produce 1,000 wagons monthly, potentially generating Rs 4,000-4,500 crore annually. They're also expanding into shipbuilding and have acquired land in Falta, West Bengal to overcome previous constraints. The company reports stabilizing wheelset availability issues.",
            "Sentiment": "positive",
            "PublishDate": 1749603720000,
            "Source": "normal_news"
        },
        {
            "Title": "Titagarh Rail Systems: Q4 Results Disappoint, Systematix Downgrades to 'Hold'",
            "Summary": "Titagarh Rail Systems reported weak Q4 results with margin contraction. The company faces challenges including wheelset supply issues and delayed orders. Passenger car manufacturing capacity is expected to reach 20 cars/month in FY26 and 40 cars/month in FY27. However, increased contribution from low-margin PRS may keep pressure on margins.",
            "Sentiment": "negative",
            "PublishDate": 1748939753000,
            "Source": "earnings"
        }
    ]
}