{
    "Symbol": "TMB",
    "ISIN": "INE668A01016",
    "News": [
        {
            "Title": "Tamilnad Mercantile Bank Q3 Net Profit Rises 13.3%",
            "Summary": "Tamilnad Mercantile Bank reported net profit of 3.4 billion rupees in Q3, marking a 13.3% increase from 3 billion rupees in the same quarter last year, demonstrating strong financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1770189535946,
            "Source": "co_actions_results"
        },
        {
            "Title": "TMB Appoints John J Mathews as Chief Security Officer",
            "Summary": "Tamilnad Mercantile Bank Limited announces the appointment of Major General (Retd.) John J Mathews as Chief Security Officer effective January 19, 2026, on a three-year contractual basis.",
            "Sentiment": "positive",
            "PublishDate": 1768830211832,
            "Source": "stocks"
        },
        {
            "Title": "TMB Offers 7.50% FD Rate to Senior Citizens",
            "Summary": "Tamilnad Mercantile Bank announces special 456-day fixed deposit scheme offering 7.50% interest to senior citizens and 7.10% to regular depositors, with rates ranging from 4% to 7.50% across various tenors.",
            "Sentiment": "positive",
            "PublishDate": 1768292097859,
            "Source": "stocks"
        },
        {
            "Title": "TMB Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "Tamilnad Mercantile Bank has scheduled its board meeting for February 4, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1-6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768230773244,
            "Source": "co_actions_results"
        },
        {
            "Title": "TMB Faces ₹17.88L GST Penalty from Authorities",
            "Summary": "Tamilnad Mercantile Bank receives monetary penalty of ₹17.88 lakh from CGST authorities for GST non-payment issues during April 2018 to March 2021. Bank plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767343220463,
            "Source": "stocks"
        },
        {
            "Title": "TMB Q3 FY26: Total Business Grows 14.28% to ₹1.07L Cr",
            "Summary": "Tamilnad Mercantile Bank reports Q3 FY26 business update with total business at ₹1,07,470 crore, advances up 16.30% and deposits growing 12.53% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1767258410937,
            "Source": "co_actions_results"
        },
        {
            "Title": "TMB Launches Online EPF Payment Facility",
            "Summary": "Tamilnad Mercantile Bank launches online EPF payment facility through internet banking with direct EPFO portal integration, enabling MSME units and corporate customers to remit contributions digitally.",
            "Sentiment": "positive",
            "PublishDate": 1766758657585,
            "Source": "stocks"
        },
        {
            "Title": "TMB Opens 5 New Branches, Appoints Data Protection Officer",
            "Summary": "Tamilnad Mercantile Bank opens five new branches across Tamil Nadu, Karnataka, and Gujarat while appointing S Balasubramanian as data protection officer. Q2 total business grew 11.47% YoY to ₹1,02,417 crore.",
            "Sentiment": "positive",
            "PublishDate": 1766754109131,
            "Source": "stocks"
        },
        {
            "Title": "TMB Appoints S. Balasubramanian as Data Protection Officer",
            "Summary": "Tamilnad Mercantile Bank Limited has appointed Thiru. S. Balasubramanian, Deputy Vice President, as Data Protection Officer effective December 26, 2025, bringing over 26 years of IT and cybersecurity experience.",
            "Sentiment": "positive",
            "PublishDate": 1766753063963,
            "Source": "stocks"
        },
        {
            "Title": "TMB Partners for UPI Technology Enhancement",
            "Summary": "Tamilnad Mercantile Bank announces partnerships with Rugr Fintech and Fin Meadows Technologies to strengthen UPI infrastructure and collection capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766469015849,
            "Source": "stocks"
        },
        {
            "Title": "TMB Appoints New RBI-Nominated Additional Director",
            "Summary": "Tamilnad Mercantile Bank announces appointment of Visvanathan Srinivasan as Additional Director by RBI for two-year term starting December 20, 2025, replacing Thomas Mathew.",
            "Sentiment": "neutral",
            "PublishDate": 1766158788472,
            "Source": "stocks"
        },
        {
            "Title": "Tamilnad Mercantile Bank Seeks Shareholder Approval for Director Appointments and Articles Amendment",
            "Summary": "Tamilnad Mercantile Bank has issued a postal ballot notice seeking member approval for appointing S.R. Aravind Kumar and R. Kodeeswaran as Non-Executive Non-Independent Directors for three-year terms from November 19, 2025 to November 18, 2028. The bank also seeks approval for amendments to its Articles of Association to align with regulatory requirements, with remote e-voting scheduled from November 29 to December 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764315614696,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamilnad Mercantile Bank Launches Finnone Neo Digital Platform for Loan Processing",
            "Summary": "Tamilnad Mercantile Bank has introduced a new digital platform called Finnone Neo designed to streamline loan processing operations. The platform aims to provide customers with quicker and easier access to loan services through digital channels.",
            "Sentiment": "positive",
            "PublishDate": 1764249049706,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Appoints Two New Non-Executive Directors",
            "Summary": "Tamilnad Mercantile Bank's Board approved the appointment of S.R. Aravind Kumar and R. Kodeeswaran as Additional Non-Executive Non-Independent Directors for 3-year terms starting November 19, 2025. Both appointments are subject to shareholder approval, with Kumar bringing IT and marketing expertise and Kodeeswaran having experience in FMCG manufacturing and export business.",
            "Sentiment": "positive",
            "PublishDate": 1763560806942,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnad Mercantile Bank Fined Rs. 39.60 Lakhs by RBI for UPI and DEA Fund Violations",
            "Summary": "The Reserve Bank of India imposed a monetary penalty of Rs. 39.60 lakhs on Tamilnad Mercantile Bank for indirectly charging UPI users and failing to credit eligible amounts to the DEA Fund within prescribed periods. The penalty was based on findings from the statutory inspection report IRAR 2024, with the bank stating the penalty is not material in nature and corrective measures have been initiated.",
            "Sentiment": "negative",
            "PublishDate": 1763144110162,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnad Mercantile Bank Receives RBI Approval for Articles of Association Amendments",
            "Summary": "Tamilnad Mercantile Bank received approval from the Reserve Bank of India for proposed amendments to its Articles of Association under the Banking Regulation Act, 1949. The bank will seek shareholder approval for these amendments through a postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1762526651427,
            "Source": "corporate_action"
        },
        {
            "Title": "RBI Approves Changes to Tamilnad Mercantile Bank's Articles of Association",
            "Summary": "The Reserve Bank of India has approved changes suggested in Tamilnad Mercantile Bank's Articles of Association.",
            "Sentiment": "positive",
            "PublishDate": 1762525817794,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnad Mercantile Bank Revises MCLR Rates Across Multiple Tenors",
            "Summary": "Tamilnad Mercantile Bank has revised its Marginal Cost of Funds Based Lending Rate (MCLR) effective November 7, 2025. The bank decreased the three-month MCLR from 8.30% to 8.20%, while increasing the six-month MCLR from 8.70% to 8.75%. The overnight and one-month MCLR rates remain unchanged at 7.50%, and the one-year MCLR stays at 9.25%. The revision affects the bank's lending rates across different tenure categories.",
            "Sentiment": "neutral",
            "PublishDate": 1762453524485,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Implements Oracle HCM Cloud Payroll and AI Agents with Kovaion",
            "Summary": "Tamilnad Mercantile Bank has implemented Oracle HCM Cloud Payroll system along with AI agents in partnership with Kovaion. The implementation provides the bank with cloud-enabled payroll capabilities and AI-driven employee self-service features.",
            "Sentiment": "positive",
            "PublishDate": 1762182627184,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Growth Revival with 11.40% Business Growth in Q2 FY26",
            "Summary": "Tamilnad Mercantile Bank announced quarterly results showing total business growth of 11.40% and deposit growth of 12.32%. The bank opened its 600th branch and added 22 branches in the first six months. CASA share improved by 92 basis points with 9.30% year-on-year growth. Net profit stood at INR 318 crores with quarter-on-quarter growth of 4.14% and year-on-year growth of 4.73%. Gross NPA remained low at 1.01% and net NPA at 0.26%. ROA increased to 1.85% and ROE to 13.77%. The bank guided for 14-15% credit growth and 12-13% deposit growth for FY26. Management expects significant growth momentum in FY27 with projected profit growth of around 20%. The bank is investing INR 250 crores in IT modernization including loan management systems and digital banking platforms. Credit costs remain controlled at 15 basis points with provision coverage ratio at 74.36%.",
            "Sentiment": "positive",
            "PublishDate": 1762007530563,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank Shareholders Approve K. Ramachandran as Part-Time Chairman",
            "Summary": "Tamilnad Mercantile Bank shareholders approved the appointment of K. Ramachandran as Independent Director and Non-Executive Part-Time Chairman through postal ballot voting. The resolution passed with 99.84% votes in favor, with 3.37 crore equity shares supporting the appointment out of 3.38 crore valid votes cast. Ramachandran will receive remuneration of Rs. 18 lakh per annum, payable monthly at Rs. 1.50 lakh. The remote e-voting period ran from October 1-30, 2025, with results declared on October 30. Some shareholders' voting rights were restricted to 4.99% based on RBI orders related to acting in concert provisions under banking regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761995003124,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamilnad Mercantile Bank Announces Senior Management Changes",
            "Summary": "Tamilnad Mercantile Bank has announced two senior management changes effective October 31, 2025. The bank appointed Sathishkumar N as Vice President of Information Technology. Sathishkumar brings 22 years of banking experience in the Information Technology field, is a Certified Information System Banker, and holds a DISA qualification. His previous role was Head IT Application at Karur Vysya Bank Limited. Simultaneously, Natarajan J, Vice President of the Business Intelligence Unit, will retire from the bank's service at the close of business hours on October 31, 2025, due to superannuation.",
            "Sentiment": "neutral",
            "PublishDate": 1761929690550,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnad Mercantile Bank Open to Future Foreign Investment Despite No Current Interest",
            "Summary": "Tamilnad Mercantile Bank CEO Salee S Nair stated that while there is no current foreign investor interest in the bank, nothing can be ruled out for the future. The comments follow Emirates NBD's recent acquisition of a controlling stake in RBL Bank. TMB reported quarterly results showing net profit rose 4.7% to Rs 318 crore. The bank achieved 11.4% growth and deposits increased 12.32%. Asset quality improved with Gross Non-Performing Assets falling to 1.01% from 1.22%, reaching the best level in a decade. Net NPAs improved to 0.26% and Net Interest Margins remained stable at 3.83%. Provisions declined to Rs 20 crore while the bank holds Rs 250 crores in provisions. TMB operates 600 branches across 17 states and aims to maintain GNPA near 1% while expanding to 700 branches by fiscal year 2027.",
            "Sentiment": "positive",
            "PublishDate": 1761642827823,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank Projects ₹1.4 Lakh Crore Business and 2% ROA by FY27",
            "Summary": "Tamilnad Mercantile Bank has projected achieving ₹1.4 lakh crore in business with a 2 percent return on assets (ROA) by FY27. The bank plans to expand its branch network to over 700 branches. The company expects to maintain gross non-performing assets (GNPA) near 1 percent and increase its current account savings account (CASA) ratio above 30 percent.",
            "Sentiment": "positive",
            "PublishDate": 1761580615890,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Q2 Results and Board Changes",
            "Summary": "Tamilnad Mercantile Bank approved its unaudited financial results for the quarter and half year ended September 30, 2025. The bank reported a net profit of ₹31,751 lakhs for the quarter, compared to ₹30,318 lakhs in the same quarter last year. For the half year, net profit reached ₹62,240 lakhs versus ₹59,047 lakhs in the previous year. The bank's operating profit for the quarter was ₹45,243 lakhs. Two Non-Executive Directors, Thiru S.R. Ashok and Thiru D.N. Nirranjan Kani, completed their eight-year tenure and ceased to be directors effective October 27, 2025, as per Banking Regulation Act requirements. The bank's capital adequacy ratio stood at 30.96% under Basel III norms. Gross NPA was ₹47,405 lakhs with a provision coverage ratio of 74.36%.",
            "Sentiment": "positive",
            "PublishDate": 1761575491181,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank to Open New Branch in Kattumannarkoil, Tamil Nadu",
            "Summary": "Tamilnad Mercantile Bank plans to open a new branch in Kattumannarkoil, Tamil Nadu. This represents the bank's expansion of its branch network in the state.",
            "Sentiment": "positive",
            "PublishDate": 1761202445931,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Appoints Davis Jose Thettayil as Executive Vice President for IT",
            "Summary": "Tamilnad Mercantile Bank Limited appointed Davis Jose Thettayil as Executive Vice President (Information Technology) for a three-year term starting October 15, 2025. Thettayil brings 30 years of banking experience in Information and Communication Technology, Digital Banking, Data Science, and Banking Operations. His expertise includes evaluation and procurement of vendor-supplied software solutions and IT infrastructure, with the ability to work across executive and technical teams.",
            "Sentiment": "positive",
            "PublishDate": 1760528444317,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnad Mercantile Bank Receives Rs 11.44 Lakh Penalty Order from Income Tax Authority",
            "Summary": "Tamilnad Mercantile Bank has received a penalty order of Rs 11.44 lakh from the Assistant Commissioner of Income Tax, TDS Circle, Madurai for Assessment year 2013-14. The order was issued under sections 271C and 274 of the Income Tax Act after the Income Tax Appellate Tribunal dismissed the bank's appeal. The penalty relates to the bank paying interest to depositors without deducting TDS on amounts exceeding the maximum non-taxable limit, despite receiving Form 15G/15H from depositors. The bank plans to challenge this order in the appropriate forum within prescribed timelines and expects no significant impact on its financials, operations, or other activities beyond the penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1759494976987,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Double-Digit Growth Across Key Business Metrics in Q2 FY25",
            "Summary": "Tamilnad Mercantile Bank reported growth across its key business segments in Q2 FY25. Total business reached ₹1,02,417 crores, marking an 11.47% yearly increase. The bank's total advances grew to ₹46,996 crores, up 10.49% from the previous year. Total deposits stood at ₹55,421 crores, representing a 12.32% yearly growth.",
            "Sentiment": "positive",
            "PublishDate": 1759472954184,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank Partners with Wegofin for Payment Aggregator Business",
            "Summary": "Tamilnad Mercantile Bank has formed a strategic partnership with Wegofin Digital Solutions to launch Banking-as-a-Payment Aggregator (BAPA) services targeting MSMEs, startups, and enterprises. Wegofin will serve as a Technology Service Provider, enabling TMB to offer UPI merchant acquiring, automated payouts, and fraud risk management through AcquireX and DisburseX platforms. The partnership features an AI-powered risk engine with 83.21% fraud detection accuracy and sub-minute flagging capabilities. TMB's MD & CEO Salee S Nair described this as a pivotal step in the bank's digital transformation journey, while Wegofin's Founder & CEO Prabhu Kumar emphasized advancing financial inclusion. The collaboration aims to drive CASA growth and create new non-interest income streams for TMB, which operates 594 branches across 17 states and 4 Union Territories serving over 5.30 million customers.",
            "Sentiment": "positive",
            "PublishDate": 1759244989493,
            "Source": "order&deals"
        },
        {
            "Title": "Tamilnad Mercantile Bank Opens New NRI Branch in Kochi",
            "Summary": "Tamilnad Mercantile Bank Limited opened a new NRI branch in Kochi, Ernakulam District, Kerala on September 23, 2025. The branch is located at D.No: 67/6169, 1st Floor, Elizabeth Alexander Memorial Building, Marine Drive, Kochi, Kerala. The bank notified stock exchanges about this branch expansion through its Company Secretary & Compliance Officer, Swapnil Yelgaonkar.",
            "Sentiment": "positive",
            "PublishDate": 1758553033997,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Board Approves Amendments to Articles of Association",
            "Summary": "Tamilnad Mercantile Bank's Board of Directors approved amendments to the Bank's Articles of Association during a meeting held on September 18, 2025. The key amendments include: modifying director age eligibility requirements to between 35 and 75 years (except for Whole-Time Directors), updating sitting fees structure for directors attending Board or Committee meetings with Board discretion within regulatory limits, and revising notice delivery methods to include electronic means alongside traditional post/courier services. The amendments also specify that notice service through electronic means or post shall be deemed effective when properly addressed and sent, or after 48 hours for meeting notices. These changes require approval from the Reserve Bank of India and shareholders through a Special Resolution via Postal Ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1758213603157,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamilnad Mercantile Bank Appoints K. Ramachandran as Non-Executive Chairman",
            "Summary": "Tamilnad Mercantile Bank received Reserve Bank of India approval for the appointment of K. Ramachandran as Non-Executive (Part-Time) Chairman. The appointment is effective from August 14, 2025 to June 11, 2028, with a fixed remuneration of Rs. 18 lakh per annum plus sitting fees and reimbursement of incidental expenses for attending Board and Board Committee meetings. The approval was granted under section 10B(1A)(i) of the Banking Regulation Act, 1949.",
            "Sentiment": "positive",
            "PublishDate": 1755184908494,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnad Mercantile Bank Partners with Bajaj Allianz General Insurance to Expand Non-Life Insurance Offerings",
            "Summary": "Tamilnad Mercantile Bank has entered into a partnership with Bajaj Allianz General Insurance to enhance its non-life insurance product portfolio for customers.",
            "Sentiment": "positive",
            "PublishDate": 1754914210983,
            "Source": "order&deals"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports 6.13% Net Profit Growth in Q1 FY26, Deposits Surge 9.38%",
            "Summary": "Tamilnad Mercantile Bank delivered quarterly results with net profit growing 6.13% and deposits increasing 9.38% year-on-year to INR 53,803 crores. Total business crossed INR 98,923 crores, up 9.86%. The bank's CASA ratio improved by 34 basis points to 26.78%, with year-on-year CASA growth of 4.51%. RAM portfolio grew 11.93% to INR 42,100 crores. Net Interest Margin compressed to 3.84% from previous levels, with management guiding NIM between 3.80%-3.90% for the fiscal year. GNPA improved to 1.22%, down 22 basis points, while NNPA halved to 33 basis points. The bank upfronted performance-based incentives of INR 41.27 crores in the quarter, impacting operating profit. Capital adequacy ratio stands at over 32% with leverage ratio at 12.44%. Management expects deposit growth of 10-12% and advances growth of around 15% for the full year, focusing on MSME segment expansion through new loan management systems and credit management centers.",
            "Sentiment": "positive",
            "PublishDate": 1753965596602,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports 6.3% Growth in Quarterly Net Profit",
            "Summary": "Tamilnad Mercantile Bank reported net profit of 3.05 billion rupees for the quarter, up from 2.87 billion rupees in the same period last year. Revenue increased to 13.9 billion rupees from 12.81 billion rupees year-over-year. The bank's asset quality improved with gross non-performing assets (GNPA) declining to 1.22% from 1.25% in the previous quarter, while net non-performing assets (NNPA) decreased to 0.33% from 0.36% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753662660275,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank Outlines Growth Strategy Focused on Retail Advances and Digital Transformation",
            "Summary": "Tamilnad Mercantile Bank has outlined its strategic growth plan centered on expanding retail advances and improving CASA (Current Account Savings Account) ratios through technology implementation. The bank is focusing on enhancing asset quality while pursuing digital transition initiatives. Key strategic elements include implementing a RAM (Retail, Agriculture, and MSME) strategy and cost-saving measures. These initiatives are designed to improve the bank's earnings per share (EPS) and return on equity (ROE) metrics.",
            "Sentiment": "positive",
            "PublishDate": 1753458435560,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Higher Q1 Profit and Improved Asset Quality",
            "Summary": "Tamilnad Mercantile Bank reported Q1 net profit of 3.05 billion rupees, up from 2.87 billion rupees year-over-year. Revenue increased to 13.9 billion rupees from 12.81 billion rupees in the same period last year. The bank's asset quality improved with gross non-performing assets (GNPA) declining to 1.22% from 1.25% quarter-over-quarter, while net non-performing assets (NNPA) decreased to 0.33% from 0.36% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753448468656,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank Crosses Rs 1 Lakh Crore Business Milestone",
            "Summary": "Tamilnad Mercantile Bank Limited achieved a business milestone by crossing Rs 1 lakh crore as of July 24, 2025. The bank thanked its stakeholders, customers, and employees for their partnership in reaching this achievement and fostering mutual growth. The milestone was communicated to stock exchanges through a regulatory filing.",
            "Sentiment": "positive",
            "PublishDate": 1753446223262,
            "Source": "stock"
        },
        {
            "Title": "Tamilnad Mercantile Bank: Q1 Business Grows 9.86% YoY, Nears ₹99,000 Crore",
            "Summary": "Tamilnad Mercantile Bank reported a 9.86% YoY increase in total business to ₹98,923 crore for Q1 FY26. Deposits grew 9.4% to ₹53,803 crore, while gross advances rose 10.4% to ₹45,120 crore. CASA deposits increased 4.5% to ₹14,411 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751447799000,
            "Source": "result"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Growth in Deposits, CASA, and Advances",
            "Summary": "Tamilnad Mercantile Bank has reported significant growth across key financial metrics. Total deposits increased by 9.38% to ₹53,803 crore. Current Account Savings Account (CASA) grew by 4.51% to ₹14,411 crore. Gross advances rose by 10.44% to ₹45,120 crore. The bank's overall business expanded by 9.86% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1751443000000,
            "Source": "default"
        },
        {
            "Title": "Tamilnad Mercantile Bank: Targets 13-14% Growth in FY26",
            "Summary": "Tamilnad Mercantile Bank aims for 13-14% credit and deposit growth in FY26. The bank plans to maintain a net interest margin of 3.8-3.9% and a cost of deposits around 5.9-6%. It will focus on retail, agriculture, and MSME segments, open 50 new branches, and increase IT capital expenditure for modernization. The bank expects 10-12% profit growth while keeping the cost-to-income ratio below 50%.",
            "Sentiment": "positive",
            "PublishDate": 1745729275000,
            "Source": "normal_news"
        },
        {
            "Title": "Tamilnad Mercantile Bank Projects 15-18% Loan Growth for FY'26",
            "Summary": "Tamilnad Mercantile Bank's management has provided guidance for loan growth in the fiscal year 2026. The bank expects its loan portfolio to grow between 15% and 18% during this period, indicating a positive outlook for the bank's lending activities.",
            "Sentiment": "positive",
            "PublishDate": 1745552091000,
            "Source": "default"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Q4 Profit Growth and Dividend Declaration",
            "Summary": "Tamilnad Mercantile Bank announced its Q4 results, showing a net profit increase to 2.92 billion rupees from 2.53 billion rupees year-over-year. Revenue rose to 13.42 billion rupees from 12.54 billion rupees. The bank's asset quality improved with GNPA at 1.25% and NNPA at 0.36%, both decreasing quarter-over-quarter. Provisions increased to 172.2 million rupees. The bank also recommended a final dividend of 11 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745453495000,
            "Source": "default"
        },
        {
            "Title": "Tamilnad Mercantile Bank: Q4 Profit Rises 15%, Asset Quality Improves",
            "Summary": "Tamilnad Mercantile Bank reported a 15.3% YoY increase in Q4 net profit to ₹291.9 crore. NII remained flat at ₹567.9 crore. Asset quality improved with GNPA falling to 1.25% and NNPA to 0.35% QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1745414498000,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Q4 Results and Dividend",
            "Summary": "Tamilnad Mercantile Bank announced its Q4 financial results, showing improvements in key metrics. The bank's net profit increased to 2.92 billion rupees, up from 2.53 billion rupees year-over-year. Revenue rose to 13.42 billion rupees from 12.54 billion rupees. The bank's asset quality improved with GNPA at 1.25% and NNPA at 0.36%, both down from the previous quarter. The bank also recommended a final dividend of 11 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745411554000,
            "Source": "result"
        },
        {
            "Title": "Tamilnad Mercantile Bank to Consider Q4 Results on April 23",
            "Summary": "Tamilnad Mercantile Bank has announced that it will consider its fourth quarter (Q4) financial results on April 23. This indicates the bank is preparing to disclose its performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744124159000,
            "Source": "result"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Growth in Advances and Deposits",
            "Summary": "Tamilnad Mercantile Bank has announced financial updates for the period ending March 31. The bank reported an 11% year-over-year increase in gross advances. Additionally, total deposits grew by 8.43% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1743984484000,
            "Source": "result"
        },
        {
            "Title": "Tamilnad Mercantile Bank Reports Growth in Advances and Deposits",
            "Summary": "Tamilnad Mercantile Bank has announced financial updates as of March 31. The bank reported an 11% year-over-year increase in gross advances. Additionally, total deposits grew by 8.43% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1743852361000,
            "Source": "result"
        },
        {
            "Title": "Tamilnad Mercantile Bank: Expands Network with Six New Branches",
            "Summary": "Tamilnad Mercantile Bank has opened six new branches across India, including locations in Coimbatore, Tiruppur, Tuticorin, Telangana, and Ayodhya. The bank now has 578 branches and 12 regional offices across 17 states and 4 Union Territories. CEO Salee S Nair announced plans for further expansion.",
            "Sentiment": "positive",
            "PublishDate": 1743253325000,
            "Source": "corporate_action"
        }
    ]
}