{
    "Symbol": "TMCV",
    "ISIN": "INE1TAE01010",
    "News": [
        {
            "Title": "Tata Motors Indonesia Wins 70,000 Vehicle Order",
            "Summary": "PT Tata Motors Distribusi Indonesia secures major order for 35,000 Yodha pick-ups and 35,000 Ultra T.7 trucks to support agricultural activities and rural logistics across Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1770721076421,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors CV January Sales Jump 30% to 41,549 Units",
            "Summary": "Tata Motors commercial vehicle division reported strong January sales of 41,549 units, marking a significant 30% increase from 31,988 units in the previous year and exceeding analyst estimates.",
            "Sentiment": "positive",
            "PublishDate": 1769925509767,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors CV Jan Sales Jump 30% to 41,549 Units",
            "Summary": "Tata Motors commercial vehicle division reported strong January sales of 41,549 units, marking a significant 30% year-on-year growth from 31,988 units in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769925442862,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Q3: Revenue Up 16%, Profit Drops 48%",
            "Summary": "Tata Motors reports mixed Q3 results with consolidated revenue rising to ₹218.5 billion from ₹188.2 billion YoY, while net profit declined to ₹7.05 billion from ₹13.6 billion in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1769690120465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Board Approves Merger with Two Subsidiaries",
            "Summary": "Tata Motors Limited board approves composite scheme to merge wholly owned subsidiaries TMF Holdings Limited and TMF Business Services Limited, aimed at simplifying corporate structure and reducing costs.",
            "Sentiment": "positive",
            "PublishDate": 1769687903824,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Sets ₹417 Target for Tata Motors",
            "Summary": "Motilal Oswal maintains neutral rating on Tata Motors Commercial Vehicle segment with target price of ₹417, reflecting cautious outlook on the stock's near-term performance prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768967602135,
            "Source": "stocks"
        },
        {
            "Title": "BNP Paribas buys ₹152 cr Tata Motors CV stake",
            "Summary": "French bank BNP Paribas acquired 35.43 lakh shares of Tata Motors Commercial Vehicle for ₹152 crore from Goldman Sachs at ₹429.30 per share, representing a 2.70% discount to previous close.",
            "Sentiment": "neutral",
            "PublishDate": 1768923486035,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Q3FY26 Results Call on Jan 29",
            "Summary": "Tata Motors Limited announces investor conference call scheduled for January 29, 2026 at 6:30 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768825674383,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Board Meet Set for Jan 29 for Q3 Results",
            "Summary": "Tata Motors Limited has scheduled its board meeting for January 29, 2026, to consider and approve Q3FY26 financial results. The company will also host an analyst call post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1768223273524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Acquires 26% Stake in Traveltime E-Mobility",
            "Summary": "Tata Motors Commercial Vehicles division has acquired a 26% ownership stake in Chennai-based Traveltime E-Mobility, making it an associate company in the electric mobility sector.",
            "Sentiment": "positive",
            "PublishDate": 1767882981480,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Q3FY26 Sales Jump 21% to 1.16 Lakh Units",
            "Summary": "Tata Motors Limited reported strong Q3FY26 performance with 1,15,577 units sold, marking 21% year-on-year growth. Commercial vehicle domestic sales grew 18% driven by construction and mining recovery.",
            "Sentiment": "positive",
            "PublishDate": 1767259053883,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nomura Initiates 'Buy' on Tata Motors CV at ₹481",
            "Summary": "Nomura Securities has initiated coverage on Tata Motors Commercial Vehicle segment with a 'Buy' rating and price target of ₹481 per share.",
            "Sentiment": "positive",
            "PublishDate": 1766375278816,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors CV Sales Jump 29% to 35,539 Units in November, Beating Estimates",
            "Summary": "Tata Motors reported commercial vehicle sales of 35,539 units in November, representing a 29% increase from 27,636 units in the same month last year. The sales performance exceeded market estimates of 31,300 units, indicating stronger than expected demand in the commercial vehicle segment.",
            "Sentiment": "positive",
            "PublishDate": 1764579712616,
            "Source": "stock"
        },
        {
            "Title": "Tata Motors Receives BBB/Stable Credit Rating from S&P Global Ratings",
            "Summary": "S&P Global Ratings assigned BBB/Stable long-term issuer credit ratings to Tata Motors Limited and its wholly owned subsidiaries TML CV Holdings B.V. and TML CV Holdings Pte. Ltd. The rating assignment affects the company and its subsidiaries, providing investors with an assessment of their creditworthiness and financial stability.",
            "Sentiment": "positive",
            "PublishDate": 1764080406956,
            "Source": "stock"
        },
        {
            "Title": "Tata Motors Commercial Vehicle Business Lists Separately, Reports Strong Q2 Performance",
            "Summary": "Tata Motors successfully completed the demerger of its commercial vehicle business, which is now listed as Tata Motors Limited with ticker TMCV on BSE and NSE, following the effective date of October 1st. The newly listed entity reported robust quarterly results with revenue of ₹18,400 crores (up 6.6% Y-o-Y), EBITDA margin of 12.2%, and record free cash flow of ₹2,200 crores, driven by 12% volume growth and margin expansion across product lines.",
            "Sentiment": "negative",
            "PublishDate": 1763448762804,
            "Source": "stock"
        },
        {
            "Title": "Tata Motors (CV) Reports Rs 867 Crore Net Loss in First Quarterly Results Post Independent Listing",
            "Summary": "Tata Motors (Commercial Vehicles) reported a consolidated net loss of Rs 867 crore for the second quarter, contrasting with a Rs 498 crore profit in the same quarter last year, primarily due to Rs 2,000 crore mark-to-market losses on Tata Capital investments. Despite the loss, the company showed operational strength with 12% growth in commercial vehicle wholesales to 96,800 units and improved EBITDA margins of 12.2%.",
            "Sentiment": "negative",
            "PublishDate": 1763090944586,
            "Source": "earnings"
        },
        {
            "Title": "Tata Motors CV Shares Drop 5% in Two Days After Market Debut",
            "Summary": "Tata Motors (Commercial Vehicles) shares declined over 5% in two trading sessions following its market debut. The stock listed at Rs 335 on NSE with a 28.5% premium to its implied value of Rs 260.75, but fell to Rs 316.5 on Thursday. The demerged entity reported revenue of Rs 75,055 crore and EBITDA of Rs 8,856 crore with an 11.8% margin. Analysts remain optimistic about long-term prospects, with SAMCO Securities estimating fair value around Rs 310-320 per share. SBI Securities valued the company between Rs 320-470 per share. The demerger separates the commercial vehicle business from passenger vehicles, allowing focused investment in each segment. Analysts cite improving freight activity, commodity cost easing, and GST rate cuts as positive factors for commercial vehicle demand.",
            "Sentiment": "neutral",
            "PublishDate": 1763012105422,
            "Source": "stock"
        }
    ]
}