{
    "Symbol": "TMPV",
    "ISIN": "INE155A01022",
    "News": [
        {
            "Title": "JLR Plans Range Rover Electric & New Jaguar Launches",
            "Summary": "Jaguar Land Rover announces exciting new vehicle launches this year, including Range Rover Electric and new Jaguar model as part of expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1770348358469,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Plans INR 4,200-4,300 Cr Investment",
            "Summary": "Tata Motors passenger car business targets investments of INR 4,200 to 4,300 crores this year, expecting Q4 growth of 13% to 14% and anticipating around 40% growth with mid-teen growth projected for FY'26.",
            "Sentiment": "positive",
            "PublishDate": 1770348277361,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Co-CEO Forecasts Mid-Teens Growth",
            "Summary": "Tata Motors Co-CEO predicts mid-teens growth for India car sales in FY26, indicating positive outlook for domestic automotive market performance.",
            "Sentiment": "positive",
            "PublishDate": 1770295149936,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Plans EU, UK Car Exports Sans Trade Deal",
            "Summary": "Tata Motors Co-CEO announces company's strategy to export Indian-manufactured vehicles to European Union and United Kingdom markets, including electric vehicles, without relying on trade agreements.",
            "Sentiment": "positive",
            "PublishDate": 1770295087990,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Expands JLR Operations in Tamil Nadu",
            "Summary": "Tata Motors Co-CEO announces new operations at Tamil Nadu plant for Jaguar Land Rover models, marking expansion of manufacturing capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1770293715090,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Plants Operating at Full Capacity",
            "Summary": "Tata Motors CFO reports that the company's Solihull and Nitra manufacturing plants are currently operating at full capacity, indicating strong production levels.",
            "Sentiment": "positive",
            "PublishDate": 1770293168318,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Plans Sierra SUV Production Increase",
            "Summary": "Tata Motors Co-CEO announces plans to scale up Sierra SUV production in response to market demand, signaling the company's strategic focus on expanding its SUV portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770292048573,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors PV Reports Q3 Net Loss of 35B Rupees",
            "Summary": "Tata Motors' passenger vehicles division swung to a consolidated net loss of 35 billion rupees in Q3, compared to a profit of 54 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770288328318,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors JLR UK Sales Drop 9.7% in January",
            "Summary": "Jaguar Land Rover UK sales declined to 5,305 units in January from 5,872 units in the same period last year, marking a year-on-year decrease for the luxury automotive brand.",
            "Sentiment": "negative",
            "PublishDate": 1770282495704,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors PV Sales Jump 47% to 71,066 Units in Jan",
            "Summary": "Tata Motors passenger vehicle division reported strong January sales of 71,066 units, marking a significant 47% year-on-year growth and exceeding analyst estimates of 62,020 units.",
            "Sentiment": "positive",
            "PublishDate": 1769921032490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors launches Xpres petrol, CNG fleet variants",
            "Summary": "Tata Motors expands Xpres fleet portfolio with petrol variant at ₹5.59 lakh and twin-cylinder CNG at ₹6.59 lakh, targeting commercial mobility segments with competitive pricing against Hyundai's Prime range.",
            "Sentiment": "positive",
            "PublishDate": 1769148616393,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Q3FY26 Call Feb 5",
            "Summary": "Tata Motors Passenger Vehicles Limited schedules investor conference call for February 5, 2026 at 6:30 PM IST to discuss Q3FY26 financial results with senior management team.",
            "Sentiment": "neutral",
            "PublishDate": 1769085468144,
            "Source": "co_actions_results"
        },
        {
            "Title": "BNP Paribas Buys ₹152 Cr Stake in Tata Motors CV",
            "Summary": "BNP Paribas acquired 35.43 lakh shares of Tata Motors Commercial Vehicles at ₹429.30 per share through block deal, while stock trades down 2.5% at ₹421.25 amid strong institutional interest.",
            "Sentiment": "neutral",
            "PublishDate": 1768982974575,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Prioritizes Profitability Over Market Share",
            "Summary": "Tata Motors shifts focus from pure market share gains to comprehensive metrics including dealer profitability and cash flow, despite losing 3% market share to rivals in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768955789777,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors launches 17 trucks with European safety norms",
            "Summary": "Tata Motors unveils next-generation portfolio spanning 7-55 tonnes, featuring new Azura series, expanded EV range, and industry-first European crash safety compliance across entire truck lineup.",
            "Sentiment": "positive",
            "PublishDate": 1768903085121,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Eyes 6,000 Electric Bus Tender",
            "Summary": "Tata Motors is preparing to bid for a major Indian government tender involving up to 6,000 electric buses, positioning itself in the growing public transportation electrification sector.",
            "Sentiment": "positive",
            "PublishDate": 1768899678323,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors PV Drops 4.5% on Trump Tariff Threats",
            "Summary": "Tata Motors PV shares fell 4.5% to Rs 338 after Trump threatened 10% tariffs on European countries. JLR faces pressure with US contributing 22% of global sales amid existing challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768796787340,
            "Source": "stocks"
        },
        {
            "Title": "Tata Punch Facelift Launched at ₹5.9-9.95 Lakh",
            "Summary": "Tata Motors launches updated Punch micro-SUV with enhanced features, new design elements, and improved engine options. Six variants available with bookings now open.",
            "Sentiment": "positive",
            "PublishDate": 1768302864789,
            "Source": "stocks"
        },
        {
            "Title": "Tata Punch facelift launched at ₹5.59 lakh with turbo",
            "Summary": "Tata Motors launches 2026 Punch facelift with new turbo engine, expanded CNG options, and enhanced features. Company expects sales recovery after model slipped from top position.",
            "Sentiment": "positive",
            "PublishDate": 1768286922576,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Board Meet Feb 5",
            "Summary": "Tata Motors Passenger Vehicles Limited has scheduled a board meeting on February 5, 2026, to consider Q3FY26 financial results. Trading window remains closed until 48 hours post announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1768215544110,
            "Source": "co_actions_results"
        },
        {
            "Title": "Auto wrap: Tata Safari, Harrier Petrol & Mahindra XUVs",
            "Summary": "Major automotive launches this week include Tata Safari and Harrier petrol variants starting at ₹12.89 lakh, Mahindra XUV 3XO EV at ₹13.89 lakh, and XUV 7XO from ₹13.66 lakh, alongside new electric scooters and premium bikes.",
            "Sentiment": "positive",
            "PublishDate": 1768016256691,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Reduces Stake in TP Paarthav to 12.89%",
            "Summary": "Tata Motors has reduced its shareholding in TP Paarthav Limited to 12.89% following the implementation of a composite scheme of arrangement, marking a significant change in the company's investment structure.",
            "Sentiment": "neutral",
            "PublishDate": 1767882961687,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors PV reduces stake in TP Paarthav to 12.89%",
            "Summary": "Tata Motors Passenger Vehicles Limited's stake in TP Paarthav Limited reduced from 26% to 12.89% following composite scheme arrangement, causing TPPL to cease being an associate company effective January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767880832276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Q3 FY26 Performance",
            "Summary": "Tata Motors Passenger Vehicles reports strong Q3 FY26 growth with total production rising 21.71% to 165,841 units and domestic sales increasing 24.73% to 168,616 units compared to Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1767698803915,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors Land Rover UK Sales Rise 7.6% in December",
            "Summary": "Tata Motors' Land Rover brand recorded 3,906 units in UK sales for December, marking a 7.6% increase compared to 3,630 units in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1767690939153,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors PV shares rise despite JLR volume decline",
            "Summary": "Tata Motors Passenger Vehicles shares gained 0.86% despite JLR's Q3 FY26 wholesale volumes falling 43.3% YoY due to cyber attack disruptions and US tariffs affecting production and exports.",
            "Sentiment": "neutral",
            "PublishDate": 1767663452925,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors PV Shares Drop 3% On Weak JLR Q3 Data",
            "Summary": "Tata Motors Passenger Vehicles shares fell over 3% to ₹360 after JLR reported 43.30% decline in Q3 wholesale sales due to cyber attack impact and production disruptions across global markets.",
            "Sentiment": "negative",
            "PublishDate": 1767630029005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors Shares Hit Record High on Strong Dec Sales",
            "Summary": "Tata Motors shares surge 4.1% to record ₹443.95 after reporting 25.5% growth in CV sales and robust passenger vehicle performance in December.",
            "Sentiment": "positive",
            "PublishDate": 1767258382834,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors PV December Sales Rise 14.1% to 50,519 Units",
            "Summary": "Tata Motors Passenger Vehicles reported December sales of 50,519 units, up 14.1% YoY, with domestic sales at 50,046 units and EV sales surging 24.2% to 6,906 units, achieving record annual sales of 587,218 units.",
            "Sentiment": "positive",
            "PublishDate": 1767257906389,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Motors PV Q3 FY26 Sales Surge 22% to 171,013 Units",
            "Summary": "Tata Motors Passenger Vehicles achieved record Q3 FY26 sales of 171,013 units with 22.3% growth, driven by strong SUV demand and EV adoption rising 49.5% to 24,103 units.",
            "Sentiment": "positive",
            "PublishDate": 1767257371042,
            "Source": "stocks"
        },
        {
            "Title": "TMPV unveils ₹18,000 cr EV expansion roadmap",
            "Summary": "Tata Motors Passenger Vehicles announces five new EV models by FY30, including premium Avinya range, with ₹16,000-18,000 crore investment to strengthen its 66% market leadership in India's electric vehicle segment.",
            "Sentiment": "positive",
            "PublishDate": 1766586418554,
            "Source": "stocks"
        },
        {
            "Title": "Tata Motors EV Sales Hit 250K Units Milestone",
            "Summary": "Tata Motors Passenger Vehicles achieves significant electric vehicle milestone with overall EV sales reaching 250,000 units, while popular Nexon EV model crosses 100,000 sales mark.",
            "Sentiment": "positive",
            "PublishDate": 1766473183572,
            "Source": "stocks"
        },
        {
            "Title": "NHTSA Reviews 29,688 Jaguar Land Rover Cars for Seatbelt Issues",
            "Summary": "US safety regulator NHTSA initiates preliminary review of nearly 30,000 Jaguar Land Rover vehicles owned by Tata Motors due to potential seatbelt manufacturing defects affecting passenger safety.",
            "Sentiment": "negative",
            "PublishDate": 1765540607433,
            "Source": "stocks"
        },
        {
            "Title": "JLR UK Sales Drop 17% to 4,598 Units in November",
            "Summary": "Jaguar Land Rover recorded 4,598 vehicle sales in the UK during November, representing a decline from 5,558 units sold in the same month last year. The 960-unit decrease reflects a 17% year-over-year drop in JLR's UK market performance for Tata Motors' luxury automotive segment.",
            "Sentiment": "negative",
            "PublishDate": 1764839244308,
            "Source": "stock"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Reports 25.6% Sales Growth in November 2025",
            "Summary": "Tata Motors Passenger Vehicles Ltd. recorded total sales of 59,199 units in November 2025, marking a 25.6% increase from 47,117 units in November 2024. The company showed strong performance across domestic and international markets, with electric vehicle sales growing 52.1% to 7,911 units.",
            "Sentiment": "positive",
            "PublishDate": 1764577923730,
            "Source": "stock"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Seeks Shareholder Approval for Key Board Appointments via Postal Ballot",
            "Summary": "Tata Motors Passenger Vehicles Limited has issued a postal ballot notice seeking shareholder approval for the appointment of three directors, including Shailesh Chandra as Managing Director & CEO with annual remuneration up to ₹4 crore basic salary plus performance bonuses. The e-voting period runs from November 29 to December 28, 2025, following the company's recent demerger that separated passenger and commercial vehicle businesses into distinct entities.",
            "Sentiment": "neutral",
            "PublishDate": 1764337458231,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Reports Rs 5,500 Cr Loss in Q2 FY26 Due to JLR Cyber Attack",
            "Summary": "Tata Motors Passenger Vehicles Limited posted a consolidated PBT loss of Rs 5,500 Cr for Q2 FY26, primarily driven by a cyber incident at Jaguar Land Rover that shut down production for the entire month of September, causing 24% revenue drop. The India passenger vehicle business showed recovery with 15% revenue growth and 10% volume increase, while JLR expects EBIT margin of 0-2% for the full year with free cash flow between negative GBP 2.2-2.5 billion.",
            "Sentiment": "negative",
            "PublishDate": 1763642834749,
            "Source": "earnings"
        },
        {
            "Title": "Tata Motors Shares Plunge 7.2% as Jaguar Land Rover Cuts Margin Targets After Cyberattack",
            "Summary": "Tata Motors Passenger Vehicles shares fell 7.2% to a seven-month low of ₹363 after the company reduced Jaguar Land Rover's fiscal 2026 margin target from 5-7% to 0-2% following cyberattack disruptions. JLR posted an EBITDA loss of £78 million in the September quarter with production losses of 20,000 units, expecting another 30,000 unit loss in the third quarter, while brokerages turned cautious with multiple downgrades citing structural headwinds including China market challenges and aging model lineup.",
            "Sentiment": "negative",
            "PublishDate": 1763363161845,
            "Source": "earnings"
        },
        {
            "Title": "Tata Sons Acquires 42.71% Stake in Tata Motors Through Corporate Restructuring",
            "Summary": "Tata Sons Private Limited and its group companies acquired 1,57,27,48,901 shares representing 42.71% stake in Tata Motors Limited through a composite scheme of arrangement between Tata Motors, TML Commercial Vehicles Limited and Tata Motors Passenger Vehicles Limited. The acquisition was completed pursuant to the scheme sanctioned by the National Company Law Tribunal Mumbai Bench, with the equity shares listed on stock exchanges on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763362336111,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Motors Issues Mixed Guidance: India PV Growth Expected, JLR Faces Production Challenges",
            "Summary": "Tata Motors management expects double-digit growth in India's passenger vehicle industry for the second half and full-year growth around 5% (+/- 2%). JLR anticipates significant Q3 production losses with recovery only in Q4, projecting EBIT margin of 0-2% and negative free cash flow of £2.2-2.5 billion for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763216759774,
            "Source": "earnings"
        },
        {
            "Title": "Tata Motors Appoints New Chief Investor Relations Officer and Updates Corporate Disclosure Code",
            "Summary": "Tata Motors Limited has appointed Ms. Sneha Gavankar as Chief Investor Relations Officer and submitted its updated Code of Corporate Disclosure Practices to stock exchanges. The code establishes comprehensive guidelines for handling unpublished price sensitive information, analyst interactions, and disclosure procedures to ensure regulatory compliance and prevent insider trading.",
            "Sentiment": "neutral",
            "PublishDate": 1763139736819,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Motors Sets Ambitious Growth Targets with 3.5 Million Production Goal by FY30",
            "Summary": "Tata Motors Passenger Vehicles announced plans to achieve 3.5 million annual production by FY30, targeting 30% EV penetration under TATA EV Universe with ₹8,000 crore capex for electric platforms and battery localization. The company aims to expand its global export footprint and premium SUV portfolio while targeting double-digit EBITDA margins through product mix optimization.",
            "Sentiment": "positive",
            "PublishDate": 1763137014469,
            "Source": "stock"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Appoints Dhiman Gupta as Chief Financial Officer",
            "Summary": "Tata Motors Passenger Vehicles Limited's Board of Directors approved the appointment of Dhiman Gupta as Chief Financial Officer effective November 17, 2025. The company disclosed the changes in Key Managerial Personnel including Managing Director Shailesh Chandra and Company Secretary Maloy Kumar Gupta to stock exchanges under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763134830943,
            "Source": "corporate_governance"
        },
        {
            "Title": "JLR Reports Regional Demand Challenges While Maintaining Unused Government Credit Facility",
            "Summary": "Jaguar Land Rover executives reported oversupply issues due to low demand in China and vulnerability in European markets, while North America and MENA regions remain stable. The luxury automaker has not utilized its £1.5 billion government-backed bank facility and continues managing supply chain challenges including the Nexperia situation.",
            "Sentiment": "negative",
            "PublishDate": 1763126476656,
            "Source": "earnings"
        },
        {
            "Title": "Tata Motors CFO Forecasts Mixed Q3 Performance with Strong Q4 Recovery Expected",
            "Summary": "Tata Motors CFO indicated that Q3 will be robust despite low ICE profitability, with plans for significant inventory adjustments during the quarter. The executive expects a strong recovery in Q4, suggesting improved business performance ahead.",
            "Sentiment": "neutral",
            "PublishDate": 1763122740064,
            "Source": "stock"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Reports Mixed Q2 Results Amid JLR Cyber Impact",
            "Summary": "Tata Motors Passenger Vehicles Limited reported consolidated revenue of ₹72,349 crores (down 13.5%) for Q2 FY26, with domestic PV business growing 15.6% while JLR suffered significant losses due to a cyber incident that halted production in September. The company completed its demerger from commercial vehicles business and expects improved performance in H2 FY26 as JLR operations have returned to normal levels.",
            "Sentiment": "negative",
            "PublishDate": 1763117665603,
            "Source": "earnings"
        },
        {
            "Title": "Tata Motors Passenger Vehicles Reports 826B Rupees Exceptional Gain from Discontinued Operations Disposal",
            "Summary": "Tata Motors Passenger Vehicles recorded an exceptional gain of 826 billion rupees from disposing discontinued operations, while reporting a loss after tax of 64 billion rupees from continuing operations. The continuing operations shifted from a 31 billion rupees profit in the previous year to the current loss, marking a significant year-over-year decline in core business performance.",
            "Sentiment": "neutral",
            "PublishDate": 1763114844961,
            "Source": "earnings"
        },
        {
            "Title": "Tata Motors' Commercial Vehicle Unit Excluded from NSE, BSE Indices Following Demerger",
            "Summary": "Tata Motors' commercial vehicle business (TMCV) will be excluded from NSE and BSE indices after its separate listing, following the company's demerger into passenger vehicle (TMPV) and commercial vehicle entities. The exclusion aligns with index rebalancing norms requiring sufficient trading history, while TMPV retains its Nifty 50 position and both entities are expected to attract distinct investor bases.",
            "Sentiment": "neutral",
            "PublishDate": 1763059125702,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Motors Reports Strong Growth with 15% YoY Passenger Vehicle Delivery Increase",
            "Summary": "Tata Motors reported 15% year-over-year growth in passenger vehicle segment deliveries and provided guidance for sustained margin expansion driven by its strong electric vehicle pipeline. The company is targeting near-zero net debt by FY27 while focusing on commercial vehicle export growth through defense and infrastructure demand, and scaling Jaguar Land Rover's electrification strategy to enhance global profitability.",
            "Sentiment": "negative",
            "PublishDate": 1763051822647,
            "Source": "earnings"
        },
        {
            "Title": "Tata Motors Targets April 2026 for Iveco Deal Completion, Expects Higher Single-Digit Growth",
            "Summary": "Tata Motors aims to finalize its deal with Iveco by April 2026. A company executive indicated expectations of higher single-digit demand growth across all business segments in the second half.",
            "Sentiment": "positive",
            "PublishDate": 1763036021556,
            "Source": "order&deals"
        }
    ]
}