{
    "Symbol": "TNPETRO",
    "ISIN": "INE148A01019",
    "News": [
        {
            "Title": "TPL Invests ₹7.33 Cr in Solar Power Venture",
            "Summary": "Tamilnadu Petroproducts Limited announces equity investment of up to ₹7,32,60,000 in Navia Three Power Private Limited to procure 19.8 MWp solar power capacity for captive generation.",
            "Sentiment": "positive",
            "PublishDate": 1770390819571,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tamilnadu Petroproducts Q3FY26 Results Announced",
            "Summary": "Tamilnadu Petroproducts Limited reported Q3FY26 financial results with net profit of ₹1,764 lakhs standalone and ₹1,988 lakhs consolidated for quarter ended 31st December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770223625855,
            "Source": "co_actions_results"
        },
        {
            "Title": "TPL Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "Tamilnadu Petroproducts Limited has scheduled its Board of Directors meeting for February 4, 2026, to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769616302413,
            "Source": "co_actions_results"
        },
        {
            "Title": "TNPETRO Appoints IAS Officer as New Chairperson",
            "Summary": "Tamilnadu Petroproducts Limited appoints Ms. Sandhya Venugopal Sharma, IAS as Additional Director and Chairperson effective January 14, 2026. The 1995 batch IAS officer brings extensive experience from state and central government roles.",
            "Sentiment": "positive",
            "PublishDate": 1768405440525,
            "Source": "stocks"
        },
        {
            "Title": "Tamilnadu Petroproducts Chairperson Resigns",
            "Summary": "Ms. Mariam Pallavi Baldev steps down as Chairperson and Director of Tamilnadu Petroproducts Limited effective December 31, 2025, following withdrawal of nomination by TIDCO.",
            "Sentiment": "neutral",
            "PublishDate": 1767181312227,
            "Source": "stocks"
        },
        {
            "Title": "Tamilnadu Petroproducts Begins 6-7 Week Plant Shutdown",
            "Summary": "Tamilnadu Petroproducts commenced planned shutdown of Heavy Chemicals Division plant on December 23, 2025, for capacity expansion to 250 TPD from existing 150 TPD.",
            "Sentiment": "positive",
            "PublishDate": 1766476819146,
            "Source": "stocks"
        },
        {
            "Title": "TNPETRO Gets Credit Rating Reaffirmation from CARE",
            "Summary": "Tamilnadu Petroproducts receives reaffirmed CARE A- Stable rating on enhanced bank facilities worth ₹421 crores, with long-term facilities increased to ₹316 crores from ₹291 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766473444402,
            "Source": "stocks"
        },
        {
            "Title": "TNPETRO Gets Pollution Board Nod for LAB Plant",
            "Summary": "Tamilnadu Petroproducts receives consent to operate expanded Linear Alkyl Benzene plant from Tamil Nadu Pollution Control Board, valid until March 2030.",
            "Sentiment": "positive",
            "PublishDate": 1765877808850,
            "Source": "stocks"
        },
        {
            "Title": "TPL Expands LAB Capacity to 145 KTPA with Plant Shutdown",
            "Summary": "Tamilnadu Petroproducts announces final phase of LAB plant capacity expansion from 120 KTPA to 145 KTPA, with 8-9 week shutdown starting December 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765431759469,
            "Source": "stocks"
        },
        {
            "Title": "Tamilnadu Petroproducts Seeks Shareholder Approval for Director Appointment Through Postal Ballot",
            "Summary": "Tamilnadu Petroproducts Limited has initiated a postal ballot process seeking shareholder approval for the appointment of Mrs. Sweta Suman, IAS (DIN: 11292451) as Director, who was appointed as Additional Director on November 11, 2025. The e-voting period runs from November 30, 2025 to December 29, 2025, with results to be announced by December 31, 2025, affecting all eligible shareholders as of the November 21, 2025 cut-off date.",
            "Sentiment": "neutral",
            "PublishDate": 1764328242923,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnadu Petroproducts Appoints New Director and Reports Quarterly Results",
            "Summary": "Tamilnadu Petroproducts Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company appointed Mrs. Sweta Suman, a 2020 batch IAS officer, as an Additional Director under Non-Executive Non-Independent category effective November 11, 2025. Mrs. Suman serves as Executive Director at Tamilnadu Industrial Development Corporation (TIDCO) and holds additional charge as CEO of Chennai Metro Asset Management Limited. She was nominated by TIDCO, which is a promoter of the company. The company will seek member approval for her appointment through a postal ballot process. Mrs. Suman is not related to any other directors and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1762892408723,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Strong Q2 Performance with 465% Jump in Net Profit",
            "Summary": "Tamilnadu Petroproducts delivered robust Q2 results with consolidated net profit surging to 342 million rupees from 47 million rupees year-over-year. The company's EBITDA increased significantly to 413 million rupees compared to 73 million rupees in the same period last year. EBITDA margin expanded substantially to 9.06% from 1.63% year-over-year. Revenue grew modestly to 4.56 billion rupees from 4.49 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762864150045,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnadu Petroproducts Limited Announces Director Resignation",
            "Summary": "Tamilnadu Petroproducts Limited announced that Mr. Sandeep Nanduri, IAS (DIN: 07511216), Non-Executive & Non-Independent Director, has resigned from the company's board. His resignation follows the withdrawal of his nomination by Tamilnadu Industrial Development Corporation Limited (TIDCO), which had originally nominated him to the position. The resignation became effective on October 25, 2025, the date when the company received the resignation letter from TIDCO. The company has informed both BSE Limited and National Stock Exchange of India about this directorate change in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761401691380,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamilnadu Petroproducts Approves Q1 Results and Sets AGM Date with ₹1.20 Dividend Recommendation",
            "Summary": "Tamilnadu Petroproducts Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company scheduled its 40th Annual General Meeting for September 17, 2025, to be conducted through video conferencing at 2:00 PM IST. The Board recommended a dividend of ₹1.20 per equity share of ₹10 each for the financial year ended March 31, 2025, subject to shareholder approval at the AGM. The record date for dividend payment is set for September 9, 2025, and the register of members will remain closed from September 10-17, 2025. Upon approval, the dividend will be paid within 30 days from the AGM date.",
            "Sentiment": "positive",
            "PublishDate": 1755005595065,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Strong Q1 Performance with EBITDA Nearly Doubling Year-over-Year",
            "Summary": "Tamilnadu Petroproducts delivered robust Q1 results with EBITDA rising to 473 million rupees compared to 259 million rupees in the same quarter last year. The company's EBITDA margin expanded significantly to 10.22% from 5.70% year-over-year. On a quarterly basis, consolidated net profit increased to 352.5 million rupees from 269 million rupees in the previous quarter. Revenue grew to 4.63 billion rupees compared to 4.54 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755000719030,
            "Source": "earnings"
        },
        {
            "Title": "India Imposes Anti-Dumping Duty on Linear Alkyl Benzene Imports",
            "Summary": "The Indian government has implemented a five-year anti-dumping duty on imports of Linear Alkyl Benzene from Iran and Qatar. This measure is aimed at protecting the local industry, including companies like TamilNadu PetroProducts.",
            "Sentiment": "positive",
            "PublishDate": 1750735370000,
            "Source": "default"
        },
        {
            "Title": "Tamilnadu Petroproducts Declares Dividend",
            "Summary": "Tamilnadu Petroproducts has announced a dividend of 1.2 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746542407000,
            "Source": "result"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Strong Q4 Financial Performance",
            "Summary": "Tamilnadu Petroproducts has reported significant year-over-year improvements in its Q4 financial results. The company's EBITDA increased to 259 million rupees from 116.8 million rupees, with EBITDA margin rising to 5.70% from 2.67%. Revenue grew to 4.5 billion rupees from 4.37 billion rupees. Consolidated net profit surged to 269 million rupees, up from 122.9 million rupees in the same quarter last year and 117 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746542355000,
            "Source": "result"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Q3 FY24 Financial Results",
            "Summary": "Tamilnadu Petroproducts announced its Q3 FY24 consolidated financial results. The company reported a net profit of 117 million rupees, up from 45 million rupees year-over-year and 47 million rupees quarter-over-quarter. Revenue increased to 4.6 billion rupees from 3.54 billion rupees in the same quarter last year. The company recorded an exceptional item of 145 million rupees in Q3 FY24. Profit before the exceptional item was 170 million rupees, compared to 202 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738714796000,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Q3FY24 Results with Exceptional Item",
            "Summary": "Tamilnadu Petroproducts has reported an exceptional item of 145 million rupees in its Q3FY24 results. The company's profit before the exceptional item for Q3 stands at 170 million rupees, compared to 202 million rupees in the same quarter last year, indicating a year-over-year decline.",
            "Sentiment": "neutral",
            "PublishDate": 1738676455000,
            "Source": "result"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Tamilnadu Petroproducts has reported its Q3 financial results. The company's EBITDA decreased to 186 million rupees from 199 million rupees year-over-year. Additionally, the EBITDA margin declined to 4.05% from 5.77% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738676344000,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Significant Profit Growth in Q3",
            "Summary": "Tamilnadu Petroproducts has reported a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 117 million rupees, compared to 45 million rupees in the same quarter last year, marking a year-over-year growth. The profit also increased from 47 million rupees in the previous quarter, indicating quarter-over-quarter growth. Additionally, the company's revenue for Q3 reached 4.6 billion rupees, up from 3.54 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738676270000,
            "Source": "earnings"
        },
        {
            "Title": "Tamilnadu Petroproducts Revises Expansion Costs Upward",
            "Summary": "Tamilnadu Petroproducts has announced a revision in its expansion costs. The cost for LAB (Linear Alkyl Benzene) expansion has been increased from ₹240 crore to ₹310 crore, while the cost for HCD (Heavy Chemicals Division) expansion has been raised from ₹165 crore to ₹214 crore. The company expects these expansion projects to be completed by the financial year 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1731376144000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Significant Drop in Q2 EBITDA",
            "Summary": "Tamilnadu Petroproducts has reported a substantial decrease in its Q2 EBITDA, which fell to 73 million rupees from 201 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 1.63% from 4.65% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731313715000,
            "Source": "result"
        },
        {
            "Title": "Tamilnadu Petroproducts Reports Significant Drop in Q2 Net Profit",
            "Summary": "Tamilnadu Petroproducts Limited has reported a consolidated net profit of 28 million rupees for the second quarter, down from 158 million rupees in the same period last year. This represents a substantial year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1731313574000,
            "Source": "result"
        }
    ]
}