{
    "Symbol": "TNPL",
    "ISIN": "INE107A01015",
    "News": [
        {
            "Title": "TNPL Appoints Independent Director via Postal Ballot",
            "Summary": "Tamil Nadu Newsprint and Papers Limited successfully appointed Thiru Sriganesh Padmanabhan as Independent Director through postal ballot with 99.99% votes in favour from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1769775738614,
            "Source": "stocks"
        },
        {
            "Title": "TNPL Board Meeting Set for January 29, 2026",
            "Summary": "Tamil Nadu Newsprint and Papers Limited announces board meeting on January 29, 2026, to consider Q3 FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769162245052,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tamil Nadu attracts ₹12.16L cr investments since 2021",
            "Summary": "Tamil Nadu secured over 1,176 MoUs worth ₹12.16 lakh crore since 2021, with 80% under execution. State focuses on new sectors like space, maritime manufacturing, and blue economy.",
            "Sentiment": "positive",
            "PublishDate": 1767509846755,
            "Source": "stocks"
        },
        {
            "Title": "TNPL Appoints New Independent Director",
            "Summary": "Tamil Nadu Newsprint & Papers Limited appoints Thiru Sriganesh Padmanabhan as Additional Independent Director for three years, effective December 23, 2025, subject to shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1766486834795,
            "Source": "stocks"
        },
        {
            "Title": "Tamil Nadu Newsprint and Papers Limited Appoints Mathew Thomas as Independent Director",
            "Summary": "Tamil Nadu Newsprint and Papers Limited shareholders approved the appointment of Thiru Mathew Thomas (DIN: 09688311) as an Independent Director through postal ballot with remote e-voting, with 99.97% of votes cast in favor. The appointment is for a three-year term from October 27, 2025, to October 26, 2028, following regulatory requirements and board recommendations.",
            "Sentiment": "positive",
            "PublishDate": 1764589187257,
            "Source": "corporate_governance"
        },
        {
            "Title": "TNPL Seeks Shareholder Approval for Mathew Thomas as Independent Director Through Postal Ballot",
            "Summary": "Tamil Nadu Newsprint and Papers Limited (TNPL) has initiated a postal ballot process to seek shareholder approval for the appointment of Mathew Thomas (DIN: 09688311) as an Independent Director. The Board of Directors appointed Thomas as an Additional Independent Director on October 27, 2025, for a three-year term ending October 26, 2028. The 55-year-old mechanical engineering graduate brings over three decades of IT industry experience, having worked with Oracle, SAP, Wipro, and Ernst & Young. The remote e-voting period runs from October 31, 2025, at 9:00 AM to November 29, 2025, at 5:00 PM, with results to be declared by December 2, 2025. The appointment requires approval through a special resolution, and Thomas has submitted declarations confirming he meets independence criteria under the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1761835667398,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports 212% Jump in Q2 Net Profit Despite Margin Decline",
            "Summary": "Tamil Nadu Newsprint & Papers reported net profit of 81 million rupees in Q2, marking a significant increase from 26 million rupees in the same period last year. Revenue grew to 11.1 billion rupees from 9.14 billion rupees year-over-year. However, EBITDA remained relatively flat at 1.23 billion rupees compared to 1.24 billion rupees previously. The company's EBITDA margin compressed to 11.09% from 13.57% in the prior year period, indicating pressure on profitability despite higher revenues.",
            "Sentiment": "neutral",
            "PublishDate": 1761578918255,
            "Source": "earnings"
        },
        {
            "Title": "TNPL Appoints New Statutory Auditors and Announces Completion of Independent Directors' Terms",
            "Summary": "Tamil Nadu Newsprint and Papers Limited (TNPL) announced key board changes at its September 18, 2025 meeting. The company appointed M/s. A. John Moris & Co., Chartered Accountants as statutory auditors for FY 2025-26, following designation by the Comptroller and Auditor General of India. The firm, established in 1996 with 31 partners and 23 branches across India, has three decades of experience in audit and assurance services. Additionally, two independent directors completed their terms: Dr. M. Arumugam (DIN: 01439166) and Thiru P. B. Santhanakrishnan (DIN: 03213653) ceased their roles after completing their second consecutive three-year terms. Dr. Arumugam also stepped down as Chairman of the Risk Management Committee and Corporate Social Responsibility Committee, while Thiru Santhanakrishnan ceased being Chairman of the Audit Committee. The board meeting ran from 12:00 PM to 6:45 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1758202831859,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamil Nadu Newsprint and Papers Limited Re-appoints Dr N Sundaradevan as Independent Director",
            "Summary": "Tamil Nadu Newsprint and Papers Limited shareholders approved the re-appointment of Dr N Sundaradevan, I.A.S., (Retd.) as an Independent Director through a postal ballot conducted on August 30, 2025. The resolution received overwhelming support with 99.97% of votes cast in favor, representing 33,089,373 shares, while only 0.03% voted against with 10,135 shares. A total of 357 shareholders participated in the e-voting process out of 53,337 total shareholders. Dr Sundaradevan will serve a new term from September 12, 2025, to September 1, 2027. His previous term as Independent Director began on September 12, 2022, following his appointment at the Annual General Meeting held on September 27, 2022. The postal ballot was conducted electronically with voting open from August 1 to August 30, 2025, and was scrutinized by R Sridharan & Associates, Company Secretaries.",
            "Sentiment": "positive",
            "PublishDate": 1757412528947,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tamil Nadu Newsprint and Papers Revises Record Date for Dividend Payment",
            "Summary": "Tamil Nadu Newsprint and Papers Limited has announced a revised record date of Friday, September 12, 2025, for the declaration and payment of dividend for the financial year ended March 31, 2025. The dividend payment is subject to shareholder approval at the company's 45th Annual General Meeting scheduled for September 19, 2025. This revision follows earlier communications dated June 19 and 20, 2025, regarding the AGM and related dates.",
            "Sentiment": "neutral",
            "PublishDate": 1757136084574,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamil Nadu Newsprint and Papers Seeks Shareholder Approval for Independent Director Re-appointment",
            "Summary": "Tamil Nadu Newsprint and Papers Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Dr N Sundaradevan as an Independent Director. Dr Sundaradevan, who was initially appointed on September 12, 2022 for a three-year term, is proposed to be re-appointed for a period from September 12, 2025 to September 1, 2027. The 72-year-old retired IAS officer holds a Master's degree in Chemistry and Ph.D in Sociology, with over three decades of administrative experience across various government departments. The Board of Directors has recommended this resolution based on his skills, experience, knowledge and performance evaluation. Remote e-voting will commence on August 1, 2025 at 9:00 AM and end on August 30, 2025 at 5:00 PM, with results to be declared by September 2, 2025. The company has appointed Thiru R Sridharan as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1753968406994,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamil Nadu Newsprint and Papers Limited Reschedules 45th Annual General Meeting to September 18, 2025",
            "Summary": "Tamil Nadu Newsprint and Papers Limited has rescheduled its 45th Annual General Meeting to September 18, 2025, at 12:30 PM through video conferencing. The company has set September 11, 2025, as the record date for determining members eligible for voting rights and dividend payment. A final dividend of Rs. 3 per equity share will be considered for declaration at the meeting. Remote e-voting will be available from September 15 to September 17, 2025, for members holding shares in physical or demat form as of the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1753456653852,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports Q1 Net Loss of 74M Rupees",
            "Summary": "Tamil Nadu Newsprint & Papers reported a net loss of 74 million rupees in Q1, compared to a profit of 219 million rupees in the same period last year. Revenue increased to 11.4 billion rupees from 11.2 billion rupees year-over-year. EBITDA declined to 1 billion rupees from 1.5 billion rupees, with EBITDA margin dropping to 8.76% from 13.34% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753449835782,
            "Source": "earnings"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports Q4 Results and Dividend",
            "Summary": "Tamil Nadu Newsprint & Papers has announced its Q4 financial results and dividend recommendation. The company's Q4 net profit decreased to 221 million rupees from 330 million rupees year-over-year, while revenue increased to 13.4 billion rupees from 12.31 billion rupees. EBITDA for Q4 was 1 billion rupees, down from 1.62 billion rupees, with EBITDA margin falling to 7.70% from 13.15%. The company has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747147248000,
            "Source": "result"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers: Q3 FY25 Reports ₹42.89Cr Loss, Revenue Down 9.28% YoY",
            "Summary": "Tamil Nadu Newsprint & Papers reported a loss of ₹42.89 crore in Q3 FY25, compared to a profit of ₹16.2 crore in Q3 FY24. Revenue decreased by 9.28% YoY but increased 23.09% QoQ. Operating income fell 136.04% YoY. EPS stood at -₹6.2, down 364.96% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653162000,
            "Source": "earnings"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports Q3 Net Loss and Revenue Decline",
            "Summary": "Tamil Nadu Newsprint & Papers has reported a net loss of 429 million rupees in Q3, compared to a loss of 160 million rupees in the same quarter last year and 26 million rupees in the previous quarter. The company's revenue for Q3 stood at 11.1 billion rupees, down from 12.4 billion rupees in the corresponding period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739492255000,
            "Source": "earnings"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports Significant Decline in Q3 EBITDA",
            "Summary": "Tamil Nadu Newsprint & Papers has reported a substantial decrease in its Q3 EBITDA, which fell to 550 million rupees from 1.36 billion rupees year-over-year. The company's EBITDA margin also declined significantly, dropping to 4.88% from 10.99% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739451406000,
            "Source": "earnings"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports Q3 Financial Results",
            "Summary": "Tamil Nadu Newsprint & Papers Limited has reported its financial results for the third quarter. The company experienced a net loss of 429 million rupees, which is higher compared to both the previous year (160 million rupees) and the previous quarter (26 million rupees). Revenue for Q3 stood at 11.1 billion rupees, down from 12.4 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739451358000,
            "Source": "earnings"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports Q2 EBITDA Decline",
            "Summary": "Tamil Nadu Newsprint & Papers Limited (TNPL) has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.25 billion rupees from 1.57 billion rupees year-over-year. Additionally, the EBITDA margin dropped to 13.66% from 16.37% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731504876000,
            "Source": "result"
        },
        {
            "Title": "Tamil Nadu Newsprint & Papers Reports Significant Drop in Q2 Profit",
            "Summary": "Tamil Nadu Newsprint & Papers Limited has reported a substantial decrease in its Q2 net profit, falling to 26 million rupees from 303 million rupees year-over-year. The company's revenue also declined to 9.14 billion rupees from 9.58 billion rupees in the same period last year. Compared to the previous quarter, the net profit decreased from 219 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731504825000,
            "Source": "result"
        }
    ]
}