{
    "Symbol": "TOKYOPLAST",
    "ISIN": "INE932C01012",
    "News": [
        {
            "Title": "Tokyo Plast Q3FY26 Results: Revenue Drops 10% YoY",
            "Summary": "Tokyo Plast International reported Q3FY26 revenue of ₹1,714.40 lakhs, down 10% YoY from ₹1,905.36 lakhs. Net profit declined to ₹7.54 lakhs vs ₹8.12 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1768376707414,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tokyo Plast Q3FY26 Results: Revenue Drops 10% YoY",
            "Summary": "Tokyo Plast International reported Q3FY26 revenue of ₹1,714.40 lakhs, down 10.02% YoY. The company posted a standalone net loss of ₹1.07 lakhs compared to ₹8.12 lakhs profit in Q3FY25, while nine-month profits grew 51.04% to ₹128.24 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1768373507994,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tokyo Plast Q3FY26 Results: Revenue Declines 10%",
            "Summary": "Tokyo Plast International reported Q3FY26 revenue of ₹1,714.40 lakhs, down 10% YoY. Standalone operations posted a net loss of ₹1.07 lakhs vs profit of ₹8.12 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1768317570940,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tokyo Plast Board Meet on Jan 13 for Q3FY26 Results",
            "Summary": "Tokyo Plast International Limited has scheduled a board meeting on January 13, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767702085562,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tokyo Plast International Holds EGM to Approve Sale of Immovable Property",
            "Summary": "Tokyo Plast International Limited conducted an Extraordinary General Meeting on December 10, 2025, through video conferencing with 53 shareholders in attendance. The meeting focused on approving the sale of the company's immovable property as special business, with Haresh Velji Shah chairing the proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1765361422990,
            "Source": "corporate_action"
        },
        {
            "Title": "Tokyo Plast International Schedules EGM to Approve Sale of Mumbai Property for ₹15.01 Crore",
            "Summary": "Tokyo Plast International Limited has called an Extraordinary General Meeting on December 10, 2025, to seek shareholder approval for selling its idle immovable property in Mumbai's Andheri East to Afitaplus Ventures LLP for ₹15,01,00,000. The company plans to use proceeds from the 817.50 sq. metres property sale to pay off debts, enhance working capital, and reinvest in business areas aligned with growth objectives.",
            "Sentiment": "positive",
            "PublishDate": 1763102979409,
            "Source": "corporate_action"
        },
        {
            "Title": "Tokyo Plast International Board Approves Sale of Mumbai Property for ₹15.01 Crore",
            "Summary": "Tokyo Plast International Limited's Board of Directors approved the sale of immovable property located at Andheri (East), Mumbai, measuring approximately 817.50 square metres, to M/s Afitaplus Ventures LLP for ₹15.01 crore. The property represents approximately 20% of the company's net worth as per audited financial statements for FY2024-25 and does not contribute to turnover or revenue. The sale requires shareholder approval through a special resolution at an Extraordinary General Meeting scheduled for December 10, 2025. The buyer does not belong to the promoter or promoter group, and the transaction does not fall under related party transactions. The sale is expected to be completed within 6 months of receiving shareholder approval and execution of final documents.",
            "Sentiment": "neutral",
            "PublishDate": 1762768107430,
            "Source": "corporate_action"
        },
        {
            "Title": "Tokyo Plast International and JSW Infrastructure Report Quarterly Financial Results",
            "Summary": "Tokyo Plast International Limited submitted its unaudited financial results for the quarter ended September 30, 2025, to stock exchanges. The company published these results in newspapers on October 17, 2025. JSW Infrastructure reported its standalone and consolidated financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported total income of ₹143.03 crore for the quarter, with net profit after tax of ₹119.02 crore and earnings per share of ₹0.57. On a consolidated basis, total income was ₹1,265.59 crore for the quarter, with net profit after tax of ₹368.81 crore and earnings per share of ₹1.74. The company's paid-up equity share capital stood at ₹416.28 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1760699837380,
            "Source": "earnings"
        },
        {
            "Title": "Tokyo Plast International Limited Approves Quarterly Financial Results for Quarter Ended September 30, 2025",
            "Summary": "Tokyo Plast International Limited's Board of Directors approved the unaudited financial results for the quarter ended September 30, 2025, covering both standalone and consolidated statements. The board meeting was held on October 15, 2025, from 5 pm to 7 pm. The company submitted these results along with a limited review report to BSE and NSE exchanges. The consolidated results include the parent company Tokyo Plast International Limited and its subsidiary Pinnacle Drinkware Private Limited. The subsidiary reported total assets of Rs. 12,715.45 lakhs, zero revenue for the quarter, and a net loss of Rs. 7.87 lakhs for both the quarter and six-month periods. The results will be published in newspapers and are available on the company's website and stock exchange platforms.",
            "Sentiment": "neutral",
            "PublishDate": 1760536174497,
            "Source": "earnings"
        },
        {
            "Title": "Tokyo Plast International Reports 75% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Tokyo Plast International reported a net profit of 1 million rupees in Q1, down from 4 million rupees in the same quarter last year, representing a 75% decline. However, the company's revenue increased to 182 million rupees from 178 million rupees year-over-year, showing a modest growth of 2.2%.",
            "Sentiment": "negative",
            "PublishDate": 1753113730650,
            "Source": "earnings"
        },
        {
            "Title": "Tokyo Plast Approves New Factory for Subsidiary",
            "Summary": "Tokyo Plast has approved the establishment of a new factory on its owned premises for its wholly owned subsidiary, Pinnacle Drinkware Pvt Ltd. This move is aimed at leveraging growth opportunities in the evolving mobility space.",
            "Sentiment": "positive",
            "PublishDate": 1730356777000,
            "Source": "corporate_action"
        }
    ]
}