{
    "Symbol": "TOLINS",
    "ISIN": "INE0RWQ01014",
    "News": [
        {
            "Title": "Tolins Tyres Board Meet Set for Feb 13 Q3FY26 Results",
            "Summary": "Tolins Tyres Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed until February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770643932542,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tolins Tyres Opens New Depot in Gujarat",
            "Summary": "Tolins Tyres announced the opening of a new depot in Gujarat starting December 1. The expansion represents the company's growth strategy to strengthen its distribution network in the western region.",
            "Sentiment": "positive",
            "PublishDate": 1764248117988,
            "Source": "stock"
        },
        {
            "Title": "Tolins Tyres Targets 25%+ YoY Growth Through Export Expansion and Capacity Enhancement",
            "Summary": "Tolins Tyres is pursuing export-led growth with a new product range in off-road and industrial tyres while expanding manufacturing capacity in Kerala and focusing R&D on high-performance retread compounds. The company is targeting over 25% year-on-year growth through global distribution partnerships, positioning itself for significant business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763056156479,
            "Source": "stock"
        },
        {
            "Title": "Tolins Tyres Reports Mixed Q2FY26 Results with Revenue Growth Despite Margin Pressure",
            "Summary": "Tolins Tyres Limited achieved consolidated revenue growth to Rs. 155.85 crore in H1FY26 (28.71% YoY) but faced margin compression with EBITDA margin declining to 14.34% from 19.60% in H1FY25. The company attributed Q2 sales slowdown to customer deferrals ahead of anticipated GST rate revisions on tyres, while maintaining PAT margin at 10.41% through cost control measures.",
            "Sentiment": "negative",
            "PublishDate": 1763054020809,
            "Source": "earnings"
        },
        {
            "Title": "Tolins Tyres Schedules Q2 H1 FY26 Earnings Conference Call for November 18, 2025",
            "Summary": "Tolins Tyres Limited has announced an earnings conference call scheduled for Tuesday, November 18, 2025, at 4:30 PM IST. The call will discuss the company's operational and financial performance for the quarter and half-year ended September 30, 2025. Key participants include Dr. K.V Tolin (Chairman and Managing Director), Mr. C.S Sojan (Chief Financial Officer), and Mr. Sankarakrishnan Ramalingam (Non-Executive Director). The company has provided multiple dial-in numbers for different regions and a Diamond Pass registration link for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762908804828,
            "Source": "earnings"
        },
        {
            "Title": "Tolins Tyres Secures Rs 40-50 Crore Order from Institute of Road Transport",
            "Summary": "Tolins Tyres Limited received an order worth approximately Rs 40-50 crores from The Institute of Road Transport (IRT) for supplying Precured Tread Rubber, Bonding Gum, and Black Vulcanizing Cement. The contract involves supply to all State Transport Undertakings (STUs) in Tamil Nadu and is scheduled to be executed until March 31, 2026, or finalization of the next tender, whichever is later. The company confirmed that promoters have no interest in the awarding entity and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762159563316,
            "Source": "order&deals"
        },
        {
            "Title": "Tolins Tyres Targets 17-20% EBITDA Margins Over Next Three Years",
            "Summary": "Tolins Tyres is targeting EBITDA margins of 17% to 20% over the next two to three years, with PAT margins of 10% to 11.5%, according to Whole Time Director Sankarakrishnan Ramalingam. The company aims to balance revenue streams equally between its traditional retreading business and new tyre segment within three years. Tolins is targeting 70% capacity utilization and expects a 50-50 revenue split or 45-55% in favor of new tyres. The company has diversified its new tyre portfolio from two-wheelers to include three-wheelers, SUVs, and agricultural tyres. Ramalingam expressed confidence in maintaining 20-25% revenue CAGR under various market conditions. The company welcomed the GST reduction on tyres from 28% to 18% and is advocating for retreading sector GST reduction from 18% to 5%. Tolins Tyres shares closed 2.28% higher at Rs 192.5.",
            "Sentiment": "positive",
            "PublishDate": 1757759506674,
            "Source": "stock"
        },
        {
            "Title": "Tolins Tyres Launches Heavy-Duty Tractor Rear Tyres to Expand Agricultural Business",
            "Summary": "Tolins Tyres has launched heavy-duty tractor rear tyres to complement its existing agricultural product lineup of tractor trailer tyres, front tyres, and tiller tyres. The new products will be available in late September for the 2025 harvest season through the company's network of over 1,200 dealers across India. Whole Time Director Sankarakrishnan Ramalingam stated this provides a comprehensive tyre solution for tractors. Currently, retreading materials account for 60-65% of company revenue while new tyres make up 35-40%. Management aims to shift this ratio to 50-50 or 45-55 in favor of new tyres over the next few years, focusing on agricultural vehicles, Light Commercial Vehicles, and 2/3 wheelers. The company expanded production capacity from 100 to 5,000 new tyres per day after acquiring a Kochi plant in 2023. With IPO funds, Tolins expects to reach 70-80% capacity utilization within two to three years. The company's IPO was fully subscribed within hours and ended the first day with 1.80 times over-subscription.",
            "Sentiment": "positive",
            "PublishDate": 1757696338344,
            "Source": "stock"
        },
        {
            "Title": "Tolins Tyres Limited Changes Statutory Auditors, Appoints P T Joseph & Co for 5-Year Term",
            "Summary": "Tolins Tyres Limited announced changes to its statutory auditors following a board meeting held on September 3, 2025. M/s. Krishnan Retna & Associates resigned from their position as statutory auditors, effective from the conclusion of the upcoming Annual General Meeting. The resignation was based on the company's request to appoint group auditors to streamline the audit process. The board approved the appointment of M/s. P T Joseph & Co., a Chartered Accountants firm with over 40 years of experience, as the new statutory auditors for a term of 5 consecutive years, commencing from the conclusion of the ensuing Annual General Meeting until the 27th Annual General Meeting. The appointment is subject to shareholder approval at the 22nd Annual General Meeting scheduled for September 30, 2025, which will be conducted through video conferencing. The company has set September 23, 2025 as the cut-off date for shareholders to exercise their voting rights.",
            "Sentiment": "neutral",
            "PublishDate": 1756982796894,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tolins Tyres Launches Heavy-Duty Tractor Rear Tyres, Completes Full Tractor Range",
            "Summary": "Tolins Tyres has launched heavy-duty tractor rear tyres, which completes the company's full tractor tyre range and strengthens its agricultural portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1756130375764,
            "Source": "stock"
        },
        {
            "Title": "Tolins Tyres Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "Tolins Tyres reported Q1 consolidated net profit of 93 million rupees compared to 89 million rupees in the previous year. Revenue increased to 897 million rupees from 763 million rupees year-over-year. However, EBITDA declined to 134 million rupees from 148 million rupees, while EBITDA margin compressed to 14.97% from 19.38% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1755097839536,
            "Source": "earnings"
        },
        {
            "Title": "Tolins Tyres Receives Termination Notice from Monitoring Agency, Seeks New SEBI-Registered Replacement",
            "Summary": "Tolins Tyres Limited received a termination notice from its monitoring agency dated August 8, 2025, regarding the termination of their monitoring agency agreement from August 27, 2024. The monitoring agency cited operational reasons for the termination. The company is currently identifying and appointing a new SEBI registered monitoring agency to meet applicable regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754662495044,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tolins Tyres Incorporates Wholly Owned Subsidiary Terra Rubber for Rubber Recycling Business",
            "Summary": "Tolins Tyres Limited has incorporated a wholly owned subsidiary named Terra Rubber Private Limited on July 28, 2025. The subsidiary was established with an authorized and subscribed capital of Rs. 1,00,000 divided into 10,000 equity shares of Rs. 10 each. Terra Rubber will operate in the rubber industry, focusing on collection, segregation, processing, recycling, and disposal of used tyres and rubber products through environmentally sustainable methods. The company will also manufacture and deal in reclaim rubber, crumb rubber, rubber powder, pyrolysis oil, carbon black, steel wire, and other by-products from tyre recycling. The subsidiary aims to provide backward integration for Tolins Tyres as powdered rubber is a raw material, ensure recycled rubber meets company standards, and help with EPR compliance. Terra Rubber is incorporated in Kerala, India, and Tolins Tyres holds 100% shareholding in the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753774568864,
            "Source": "corporate_action"
        },
        {
            "Title": "Tolins Tyres Incorporates Subsidiary for Rubber Recycling Expansion",
            "Summary": "Tolins Tyres has announced the incorporation of a wholly owned subsidiary named Terra Rubber Pvt Ltd. This new entity has been established with the purpose of expanding the company's presence in the rubber recycling industry.",
            "Sentiment": "positive",
            "PublishDate": 1752019586000,
            "Source": "default"
        },
        {
            "Title": "Tolins Tyres Establishes New Subsidiary for Rubber Recycling",
            "Summary": "Tolins Tyres has announced the creation of a new wholly owned subsidiary named Terra Rubber Pvt Ltd. This strategic move is aimed at expanding the company's presence in the rubber recycling industry. The establishment of Terra Rubber Pvt Ltd demonstrates Tolins Tyres' commitment to growth and diversification within the rubber sector.",
            "Sentiment": "positive",
            "PublishDate": 1751988225000,
            "Source": "default"
        },
        {
            "Title": "Tolins Tyres Achieves Record Monthly Production in May 2025",
            "Summary": "Tolins Tyres has reported a record monthly output of 816 metric tons in May 2025. This production milestone represents a significant achievement for the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1749566180000,
            "Source": "default"
        },
        {
            "Title": "Tolins Tyres Reports Q4 Financial Results",
            "Summary": "Tolins Tyres has released its Q4 financial results. The company's EBITDA increased to 695.3 million rupees from 138.7 million rupees year-over-year. The EBITDA margin improved to 19.51% from 16% year-over-year. However, revenue decreased to 695.3 million rupees from 866.4 million rupees year-over-year. The consolidated net profit rose to 92.8 million rupees, up from 70 million rupees year-over-year and 108.9 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748453026000,
            "Source": "result"
        },
        {
            "Title": "Tolins Tyres Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Tolins Tyres has reported a decrease in its third quarter EBITDA, which fell to 126 million rupees from 155 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 18.08% from 20.53% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739284255000,
            "Source": "earnings"
        },
        {
            "Title": "Tolins Tyres Reports Q3 Financial Results",
            "Summary": "Tolins Tyres has announced its Q3 financial results. The company reported a consolidated net profit of 109 million rupees, slightly up from 108 million rupees in the same quarter last year. However, revenue decreased to 697 million rupees from 755 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739284134000,
            "Source": "earnings"
        },
        {
            "Title": "Tolins Tyres: Share Price Drops 2.48% Amid Market Decline",
            "Summary": "Tolins Tyres shares are trading at ₹165.1, down 2.48% from the previous close. The stock has ranged between ₹163.8 and ₹172 today. Nifty is down 0.98% and Sensex is down 0.58%. The company has a ROE of 43.36%.",
            "Sentiment": "negative",
            "PublishDate": 1729835512000,
            "Source": "normal_news"
        },
        {
            "Title": "Tolins Tyres: Share Price Rises 1.79% Amid Market Gains",
            "Summary": "Tolins Tyres shares are trading at ₹173.5, up 1.79% from the previous close. The stock hit a high of ₹174.35 and a low of ₹170.65. Sensex is up 0.48% at ₹80,607.49, while Nifty is up 0.23%. The company has a ROE of 43.36%.",
            "Sentiment": "positive",
            "PublishDate": 1729661661000,
            "Source": "normal_news"
        },
        {
            "Title": "Tolins Tyres: Share Price Dips 2.22% Amid Market Decline",
            "Summary": "Tolins Tyres shares are trading at ₹176.4, down 2.22% from the previous close. The stock has ranged between ₹175.45 and ₹181.4 today. Nifty and Sensex are also down by 0.33% and 0.21% respectively. The company has a ROE of 43.36%.",
            "Sentiment": "negative",
            "PublishDate": 1729575400000,
            "Source": "normal_news"
        },
        {
            "Title": "Tolins Tyres: Shares Surge 7.34% Amid Market Uptick",
            "Summary": "<p><span class='positive'>Tolins Tyres</span> shares are trading at <span class='positive'>₹201.05, up 7.34%</span> from the previous close. The stock hit a <b>high</b> of ₹211 and a <b>low</b> of ₹188.85. It's trading <span class='positive'>above short and long-term moving averages</span>. The company has a <span class='positive'>ROE of 43.36%</span>. <br/> Nifty and Sensex are <span class='positive'>up 0.3% and 0.17%</span> respectively.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728539373000,
            "Source": "normal_news"
        },
        {
            "Title": "Tolins Tyres: Share Price Dips Amid Market Gains",
            "Summary": "<p><span class='negative'>Tolins Tyres shares are down 0.62%</span> to ₹184.5, while <span class='positive'>Nifty and Sensex are up 0.47% and 0.57% respectively</span>. The stock has ranged between ₹183 and ₹186.75 today. It's <span class='positive'>trading above most SMAs</span> except <span class='neutral'>5 and 10-day</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728365929000,
            "Source": "normal_news"
        }
    ]
}