{
    "Symbol": "TORNTPHARM",
    "ISIN": "INE685A01028",
    "News": [
        {
            "Title": "Torrent Pharma Completes JB Chemicals Acquisition",
            "Summary": "Torrent Pharmaceuticals has completed its acquisition of JB Chemicals shares, now holding 48.80% stake with 7,83,57,892 equity shares after acquiring final 92,490 shares from employee.",
            "Sentiment": "positive",
            "PublishDate": 1770136913883,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Sees ₹24.83 Cr Block Trade on NSE",
            "Summary": "Torrent Pharmaceuticals witnessed a significant block trade worth ₹24.83 crores on NSE involving 61,261 shares at ₹4,053.50 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770091991585,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Board Meet on Feb 13 for Q3 Results",
            "Summary": "Torrent Pharmaceuticals has scheduled its board meeting for February 13, 2026, to approve Q3FY26 financial results and consider interim dividend payment for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1770006281130,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Dahej Facility Clears USFDA Inspection",
            "Summary": "Torrent Pharmaceuticals' Dahej manufacturing facility successfully completed a USFDA inspection from January 19-23, 2026, with zero observations, demonstrating strong regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1769171134473,
            "Source": "stocks"
        },
        {
            "Title": "Torrent Pharma completes ₹11,917 cr JB Pharma takeover",
            "Summary": "Torrent Pharmaceuticals completed acquisition of 46.39% stake in JB Chemicals for ₹11,917 crore, triggering major board changes and leadership overhaul including CEO transition.",
            "Sentiment": "positive",
            "PublishDate": 1769010537381,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Allots ₹1,100 Cr NCDs in Four Series",
            "Summary": "Torrent Pharmaceuticals completes allotment of four series of non-convertible debentures worth ₹1,099.61 crores with tenures ranging from 2 to 5 years and interest rates between 7.45% to 7.80%.",
            "Sentiment": "neutral",
            "PublishDate": 1768842492413,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Issues ₹1,500 Cr Commercial Papers",
            "Summary": "Torrent Pharmaceuticals has issued commercial papers worth ₹1,500 crores with 337-day tenure at 7.20% discount rate, maturing in December 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768841741954,
            "Source": "stocks"
        },
        {
            "Title": "Torrent Pharma Gets Govt Nod for Semaglutide Study",
            "Summary": "Government committee accepts Torrent Pharmaceuticals' Phase 3 clinical trial study report on Semaglutide, marking a significant regulatory milestone for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1768806207526,
            "Source": "stocks"
        },
        {
            "Title": "Torrent Pharma Plans ₹12,500 Cr Bond Sale for Acquisition",
            "Summary": "Torrent Pharmaceuticals is preparing a massive ₹12,500 crore debt sale next week to fund its acquisition of JB Chemicals & Pharmaceuticals through commercial paper and non-convertible debentures.",
            "Sentiment": "positive",
            "PublishDate": 1768018684568,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharmaceuticals Block Trade Worth ₹28.91 Cr",
            "Summary": "Torrent Pharmaceuticals executed a significant NSE block trade worth ₹28.91 crores involving 72,154 shares at ₹4,006.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767939226884,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma plans $1.4bn bond sale for acquisition",
            "Summary": "Torrent Pharmaceuticals to raise ₹12,500 crores through bond sales in January to fund JB Chemicals acquisition, marking largest rated fund-raising this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1767851361106,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Board Approves ₹12,500 Cr Fundraise",
            "Summary": "Torrent Pharmaceuticals' board approved raising up to ₹12,500 crore through non-convertible debentures on private placement basis. The Securities Transfer Committee approved the issuance in one or more tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1767632381251,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Gets Credit Rating Reaffirmation",
            "Summary": "ICRA Limited reaffirmed Torrent Pharmaceuticals' long-term credit rating at [ICRA] AA+ (Stable) for banking facilities and NCDs, while maintaining [ICRA] A1+ rating for commercial paper programme.",
            "Sentiment": "positive",
            "PublishDate": 1767614986248,
            "Source": "stocks"
        },
        {
            "Title": "Torrent Pharma STSRC Approves ₹12,500 Cr NCDs Issue",
            "Summary": "Torrent Pharmaceuticals' Securities Transfer and Stakeholders Relationship Committee approved issuance of secured, rated, listed, redeemable non-convertible debentures worth up to ₹12,500 crores through private placement. Stock ended 0.25% down at ₹3,875.10.",
            "Sentiment": "neutral",
            "PublishDate": 1767591898972,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharma Redeems ₹142.84 Cr NCDs",
            "Summary": "Torrent Pharmaceuticals has redeemed and repaid ₹142.84 crores worth of secured non-convertible debentures out of total NCDs worth ₹1,000 crores on December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765535593320,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Pharmaceuticals Gets ESG Rating of 70",
            "Summary": "NSE Sustainability Ratings assigns ESG rating of 70 to Torrent Pharmaceuticals. SEBI-registered provider independently evaluates company's environmental, social and governance performance.",
            "Sentiment": "positive",
            "PublishDate": 1765382761297,
            "Source": "stocks"
        },
        {
            "Title": "Torrent Pharmaceuticals Acquires Additional Stake in J.B. Chemicals Through Open Offer",
            "Summary": "Torrent Pharmaceuticals acquired 1,317 equity shares of J.B. Chemicals & Pharmaceuticals Limited on December 5, 2025, at INR 1,639.18 per share through an open offer to public shareholders. The acquisition was conducted under SEBI takeover regulations, continuing Torrent's previously announced plan to increase its stake in the pharmaceutical company.",
            "Sentiment": "neutral",
            "PublishDate": 1764941405172,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharmaceuticals Block Trade Worth Rs. 88.09 Crores on NSE",
            "Summary": "Torrent Pharmaceuticals executed a block trade on NSE involving 231,969 shares at Rs. 3,797.50 per share, totaling Rs. 88.09 crores. The transaction represents a significant institutional trade in the pharmaceutical company's shares at the specified price level.",
            "Sentiment": "neutral",
            "PublishDate": 1764841338589,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharmaceuticals Faces ₹41.33 Crore GST Penalty Over Export Refund Dispute",
            "Summary": "Joint Commissioner of Central GST, Ahmedabad South imposed a penalty of ₹41,33,84,165 on Torrent Pharmaceuticals under Section 74 of the Central GST Act, 2017 for alleged erroneous refund on export of goods. The company plans to file an appeal and expects no material financial impact, expressing confidence in a favorable outcome.",
            "Sentiment": "negative",
            "PublishDate": 1764317568300,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharmaceuticals Reports Strong Q2 Growth with 30% Jump in Net Profit",
            "Summary": "Torrent Pharmaceuticals delivered robust quarterly results with consolidated net profit rising to 5.9 billion rupees from 4.53 billion rupees year-over-year. Revenue increased to 33 billion rupees compared to 28.9 billion rupees in the same period last year. EBITDA grew to 10.8 billion rupees from 9.4 billion rupees, while EBITDA margin improved slightly to 32.80% from 32.5% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762733530845,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Pharmaceuticals Redeems ₹100 Crore Non-Convertible Debentures",
            "Summary": "Torrent Pharmaceuticals Limited has redeemed and repaid ₹100 crore worth of Secured Redeemable Non-Convertible Debentures (NCDs) on November 7, 2025. This represents a partial redemption from the total NCDs of ₹500 crore issued under ISIN: INE685A07124. The company informed BSE and NSE about this partial redemption as part of its regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762567819020,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Pharmaceuticals Reports Higher Q2 EBITDA and Margin Growth",
            "Summary": "Torrent Pharmaceuticals reported Q2 EBITDA of 10.8 billion rupees compared to 9.4 billion rupees in the same period last year. The company's EBITDA margin improved to 32.80% from 32.5% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762518916382,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Pharmaceuticals Reports 30% Jump in Quarterly Net Profit to 5.9 Billion Rupees",
            "Summary": "Torrent Pharmaceuticals reported consolidated net profit of 5.9 billion rupees for the quarter, compared to 4.53 billion rupees in the same period last year. The company's revenue increased to 33 billion rupees from 28.9 billion rupees year-over-year, representing growth in both profitability and top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1762518447019,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Pharma Plans Rs 14,000 Crore Bond Issue Following JB Chemicals Acquisition Approval",
            "Summary": "Torrent Pharmaceuticals will proceed with a bond sale worth up to Rs 14,000 crore ($1.6 billion) after receiving competition regulator approval for its acquisition of JB Chemicals & Pharmaceuticals. The bond issue represents the largest rated issuance this financial year and follows a trend of acquisitions being funded through domestic bond offerings. The company plans to sell multiple tenor bonds with maturities ranging from 15 to 42 months, aiming to close the sale before mid-December. Barclays and Standard Chartered Bank are among the arrangers for the bond sale. India Ratings and Research has assigned an AA+ rating to the bond issue, expecting the merger to elevate Torrent Pharma's market position from seventh to fifth largest in the Indian pharmaceutical market by market share.",
            "Sentiment": "positive",
            "PublishDate": 1761216012665,
            "Source": "stock"
        },
        {
            "Title": "CCI Approves Torrent Pharma's Rs 19,500 Crore Acquisition of JB Chemicals",
            "Summary": "The Competition Commission of India approved Torrent Pharmaceuticals' acquisition of a majority stake in JB Chemicals and Pharmaceuticals, subject to voluntary modifications by both companies. The deal involves acquiring a 46.39% stake from promoters Tau Investment Holdings (KKR affiliate) for Rs 11,917 crore, a 2.80% stake from employees for Rs 719 crore, and an open offer for an additional 26% stake worth Rs 6,842.8 crore. The total transaction value of Rs 19,500 crore makes it the second-largest acquisition in India's pharmaceutical sector after Sun Pharma's 2015 Ranbaxy acquisition. Upon completion, the acquisition will involve JB Chemicals' amalgamation into Torrent Pharma, potentially making Torrent India's second-most valued pharma company. Torrent Pharma operates with annual revenues exceeding Rs 11,500 crore, while JB Chemicals specializes in pharmaceutical formulations, APIs, and CDMO services.",
            "Sentiment": "positive",
            "PublishDate": 1761193174720,
            "Source": "order&deals"
        },
        {
            "Title": "CCI Approves Torrent Pharma's ₹19,500 Crore Acquisition of JB Chemicals",
            "Summary": "The Competition Commission of India approved Torrent Pharmaceuticals' proposed acquisition of JB Chemicals and Pharmaceuticals in a ₹19,500-crore deal, subject to voluntary modifications. The transaction involves Torrent acquiring a 46.39% stake from promoters Tau Investment Holdings (KKR affiliate) for ₹11,917 crore, an additional 2.80% from employees for ₹719 crore, and making an open offer for 26% stake totaling ₹6,842.8 crore. Following completion, JB Pharma will merge into Torrent, making Torrent India's second most valued pharma company. This represents the second biggest pharma sector deal ever, behind Sun Pharmaceutical's 2015 Ranbaxy acquisition. Torrent Pharma has annual revenues exceeding ₹11,500 crore and is part of the Torrent Group with ₹45,000 crore in group revenues. CCI also separately approved the acquisition of up to 15% shareholding in Edelweiss Asset Management and Edelweiss Trusteeship Company by Setu AIF Trust, Konark Trust and MMPL Trust.",
            "Sentiment": "positive",
            "PublishDate": 1761058782389,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharma Plans ₹14,000 Crore Bond Sale to Finance JB Chemicals Acquisition",
            "Summary": "Torrent Pharmaceuticals is planning a ₹14,000 crore bond sale to finance its acquisition of JB Chemicals & Pharmaceuticals. The company is in discussions with HSBC, Standard Chartered Bank, and Barclays for the funding package. The bonds will be non-convertible debentures (NCDs) priced around 7.5% with AA+ rating, with repayment beginning from March 2027 and average maturity of up to three years. The acquisition involves purchasing 46.39% of JB Chemicals' equity from KKR and 2.41% from employees, with total acquisition value estimated at ₹12,532 crore. The transaction triggers a mandatory open offer to acquire up to 26% from public shareholders at ₹1,639.18 per share, valued at ₹6,843 crore. Following acquisition, Torrent plans to merge JB Chemicals through a scheme of arrangement, offering JB shareholders 51 TPL shares for every 100 JB shares held. The proposed merger awaits approvals from Competition Commission of India, National Company Law Tribunal, and other regulators.",
            "Sentiment": "neutral",
            "PublishDate": 1760576253899,
            "Source": "order&deals"
        },
        {
            "Title": "CCI Raises Concerns Over JB Chemicals And Torrent Pharma Agreement",
            "Summary": "The Competition Commission of India has raised concerns regarding an agreement between JB Chemicals and Torrent Pharma. The regulatory body's concerns suggest potential competition-related issues with the arrangement between the two pharmaceutical companies.",
            "Sentiment": "negative",
            "PublishDate": 1759986088282,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharmaceuticals Issues ₹200 Crores Commercial Papers with 90-Day Tenure",
            "Summary": "Torrent Pharmaceuticals Limited has issued Commercial Papers worth ₹200 crores with a 90-day tenure and 5.93% per annum interest rate. The papers were allotted on September 24, 2025, with maturity date of December 23, 2025. The Commercial Papers are unsecured and proposed to be listed on the National Stock Exchange of India. Interest payment is scheduled upfront, while principal payment will be made on maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1758720161515,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharmaceuticals Receives South African Regulatory Approval for J.B. Chemicals Acquisition",
            "Summary": "Torrent Pharmaceuticals Limited has received approval from the Competition Commission of South Africa for its acquisition of a controlling stake in J.B. Chemicals & Pharmaceuticals from KKR. The approval was granted on September 22, 2025. This follows the initial media release about the acquisition dated June 29, 2025. The company stated it is committed to continuing relationships with all customers on fair and consistent terms.",
            "Sentiment": "positive",
            "PublishDate": 1758640862652,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharmaceuticals Redeems ₹200 Crore Commercial Papers on Maturity",
            "Summary": "Torrent Pharmaceuticals Limited has fully redeemed and repaid Commercial Papers worth ₹200 crores on their maturity date of September 18, 2025. The CPs were issued under ISIN: INE685A14146. The company notified stock exchanges BSE and NSE about the completion of this redemption.",
            "Sentiment": "neutral",
            "PublishDate": 1758192011477,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Pharma Issues Commercial Papers Worth 2 Billion Rupees",
            "Summary": "Torrent Pharma has released commercial papers valued at 2 billion rupees. Commercial papers are short-term debt instruments that companies use to meet immediate funding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1758118480249,
            "Source": "stock"
        },
        {
            "Title": "Indian Patent Office Cancels Novartis' Patent for Cardiac Drug Vymada, Opening Market for Generic Versions",
            "Summary": "The Indian Patent Office has cancelled Novartis' patent for Vymada (Entresto), a cardiac drug. This decision allows generic drug manufacturers to enter the market with their versions of the medication. The patent cancellation removes the exclusivity protection that Novartis previously held for this cardiac treatment in India.",
            "Sentiment": "neutral",
            "PublishDate": 1758002263813,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharma Acquires 26% Stake in Torrent Urja 27 for Gujarat Renewable Energy Project",
            "Summary": "Torrent Pharma is acquiring a 26% stake in Torrent Urja 27 Pvt Ltd for a captive hybrid power project combining solar and wind energy in Gujarat. The project aims to provide renewable energy solutions for the pharmaceutical company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1757501657338,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharma Announces Rs 6,843 Crore Open Offer for JB Chemicals Stake",
            "Summary": "Torrent Pharmaceutical announced an open offer to acquire a 26% stake in JB Chemicals and Pharmaceuticals for Rs 6,843 crore at Rs 1,639.18 per share. This follows the company's earlier announcement to acquire a controlling stake from KKR in a deal valued at Rs 25,689 crore on a fully diluted basis. Torrent had signed agreements in June to acquire 46.39% equity in JB Pharma at Rs 1,600 per share for Rs 11,917 crore, which triggers the mandatory open offer. The company has sought regulatory approvals from CCI and Competition Commission of South Africa. Torrent also intends to acquire up to 2.80% equity from JB Pharma employees at the same price as KKR. Following the acquisition, Torrent plans to merge JB Pharma through a scheme of arrangement, with JB Pharma shareholders receiving 51 Torrent shares for every 100 shares held. Once completed, Torrent Pharmaceuticals will become India's second most valued pharma company.",
            "Sentiment": "positive",
            "PublishDate": 1756988144561,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharmaceuticals' Vizag Facility Clears USFDA Inspection Without Observations",
            "Summary": "Torrent Pharmaceuticals announced that the USFDA has completed its inspection of the company's Vizag facility with no observations. This indicates that the facility met all regulatory standards during the inspection process.",
            "Sentiment": "positive",
            "PublishDate": 1754120553896,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharmaceuticals Shareholders Approve All 12 Resolutions at 52nd AGM",
            "Summary": "Torrent Pharmaceuticals held its 52nd Annual General Meeting on July 28, 2025 via video conferencing, where shareholders approved all 12 proposed resolutions. Key approvals included adoption of standalone and consolidated financial statements for the year ended March 31, 2025, confirmation of interim dividend of ₹26 per share and declaration of final dividend of ₹6 per share. Shareholders also approved the appointment of Aman Mehta as Managing Director and his remuneration, with 99.80% voting in favor of his appointment and 97.41% approving his compensation package. The company received approval to enhance borrowing limits from ₹15,000 crore to ₹26,000 crore and authorization for loan, guarantee and investment enhancements under Section 186. Other approved matters included ratification of cost auditors' remuneration for 2025-26, appointment of secretarial auditors, and issuance of equity shares including convertible bonds/debentures. The voting process included both remote e-voting from July 24-27, 2025 and e-voting during the AGM, with scrutinizer Rajesh Parekh overseeing the process.",
            "Sentiment": "positive",
            "PublishDate": 1753786413935,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Pharma Shares Fall Despite 20% Profit Growth and Citi Price Target Hike",
            "Summary": "Torrent Pharmaceutical reported a 20% increase in profit to Rs 548 crore for the April-June quarter, compared to Rs 457 crore in the same period last year. The company's Germany business revenue grew 9% to Rs 308 crore, while its Brazil portfolio increased 11% to Rs 218 crore. Following these results, Citi Research raised its price target to Rs 4,380 from Rs 4,000 and maintained a 'buy' rating, citing healthy quarterly performance and solid market traction. Despite the positive results and analyst upgrade, Torrent Pharma shares fell nearly 2% on Tuesday, trading at Rs 3,708.20. The stock has gained 15.55% over the past 12 months and 10.12% year-to-date. Among 32 analysts covering the stock, 20 recommend 'buy', 10 suggest 'hold', and two advise 'sell', with the average consensus price target indicating a 4.2% upside potential.",
            "Sentiment": "neutral",
            "PublishDate": 1753767158456,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharma Reports Mixed Outlook with Germany Supply Issues and US-Brazil Expansion Plans",
            "Summary": "Torrent Pharma is experiencing growth challenges in Germany due to supply disruptions from a third-party manufacturer, which are expected to continue for several more quarters. Despite this setback, the company has outlined ambitious expansion plans, targeting 8-10 new product launches annually in Brazil and 10 launches in the US this fiscal year. The pharmaceutical company expects to maintain an effective tax rate of 25-26% for the full year and projects an adjusted operating margin of at least 32.9% for Q1 FY26, which is anticipated to remain steady throughout the year. To support its growth strategy, Torrent Pharma plans to expand its sales force by hiring approximately 200 additional medical representatives by Q3, aiming to reach a total of 6,900-7,000 representatives by the end of FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1753759010776,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharma Plans Global Expansion with U.S. Strategy and Specialty R&D Focus",
            "Summary": "Torrent Pharma is pursuing global scale-up through a renewed U.S. market strategy, maintaining chronic leadership in India, and focusing on specialty R&D to drive sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1753711579867,
            "Source": "stock"
        },
        {
            "Title": "Torrent Pharmaceuticals Appoints Aman Mehta as Managing Director for 5-Year Term",
            "Summary": "Torrent Pharmaceuticals shareholders approved the appointment of Aman Mehta as Managing Director and Whole-time Key Managerial Personnel for a 5-year term beginning August 1, 2025. Mehta, who holds an economics degree from Boston University and MBA from Columbia University, has been with Torrent for over 10 years in leadership roles across Power and Pharma divisions. During his tenure as Whole-time Director, he led the field force expansion from 3,600 to 6,400 medical representatives, improved the cardiac portfolio performance, increased diabetes portfolio ranking from 11th to 6th position, launched the Consumer Health Division, and oversaw R&D and operations functions. He played key roles in integrating acquisitions including Unichem and Curatio Healthcare. Mehta is a relative of Samir Mehta, Executive Chairman of the company.",
            "Sentiment": "positive",
            "PublishDate": 1753704384153,
            "Source": "corporate_governance"
        },
        {
            "Title": "Torrent Pharma Issues Non-Convertible Debentures via Private Placement",
            "Summary": "Torrent Pharma has issued non-convertible debentures through a private placement. The pharmaceutical company completed this debt fundraising exercise, though specific details about the amount raised, tenure, or interest rates were not disclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1753700011844,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Pharmaceuticals Reports Strong Q1 Growth with 20% Jump in Net Profit",
            "Summary": "Torrent Pharmaceuticals delivered robust quarterly results with consolidated net profit rising to 5.48 billion rupees from 4.57 billion rupees year-over-year. Revenue increased to 31.78 billion rupees compared to 28.6 billion rupees in the same period last year. The company's EBITDA grew to 10.32 billion rupees from 9.04 billion rupees, while EBITDA margin improved to 32.47% from 31.62% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1753699300372,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Pharmaceuticals Schedules Investor Call for July 28 to Discuss Quarterly Results",
            "Summary": "Torrent Pharmaceuticals Limited has scheduled a teleconference with investors and analysts on July 28, 2025, at 6:30 PM to discuss the company's financial performance for the quarter ended June 30, 2025. The company has provided dial-in numbers for various countries including India's toll-free number and international access numbers for multiple regions including the US, UK, Australia, Germany, and several Asian markets. A Diamond Pass registration link has been made available for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753160419774,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Pharmaceuticals Block Trade Worth Rs. 51.64 Crores on NSE",
            "Summary": "Torrent Pharmaceuticals executed a block trade on the National Stock Exchange involving approximately 148,146 shares at Rs. 3,486 per share, totaling Rs. 51.64 crores. The transaction represents a significant institutional trade in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1753158876994,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharmaceuticals Plans Private Debenture or Bond Issuance Discussion",
            "Summary": "Torrent Pharmaceuticals will discuss the private issuance of debentures or bonds. The company is considering this debt financing option through private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1753105737018,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Pharmaceuticals Block Trade Worth Rs. 35.58 Crores on NSE",
            "Summary": "Torrent Pharmaceuticals Ltd. executed a block trade on the National Stock Exchange (NSE) involving approximately 101,074 shares at a price of Rs. 3,520.50 per share. The total transaction value amounted to Rs. 35.58 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1753084444767,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharmaceuticals: Block Trade of Rs. 111.55 Crores on NSE",
            "Summary": "A block trade of Torrent Pharmaceuticals Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 335,372 shares at a price of Rs. 3326.10 per share, totaling Rs. 111.55 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751965756000,
            "Source": "block_details"
        },
        {
            "Title": "Torrent Pharmaceuticals: Acquires Additional Stake in JB Chemicals for ₹620 Crore",
            "Summary": "Torrent Pharma signs agreement to acquire 2.41% additional stake in JB Chemicals for ₹620 crore at ₹1,600 per share. This follows a recent deal to buy 46.39% controlling stake for ₹11,917 crore. Post-acquisition, JB Chemicals will merge into Torrent Pharma.",
            "Sentiment": "positive",
            "PublishDate": 1751569173000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Pharmaceuticals Ltd: BofA Raises Target Price on Margin Synergies Post JB Deal",
            "Summary": "BofA Securities upgrades Torrent Pharma's target price to Rs 3,500 from Rs 3,300, citing potential margin synergies following the JB Pharma acquisition. The deal is expected to boost Torrent's domestic franchise and provide new growth avenues. Analysts project 250-300 basis points of synergies by FY27-28, with improved earnings per share expected in the first year post-merger.",
            "Sentiment": "positive",
            "PublishDate": 1751339811000,
            "Source": "corporate_action"
        }
    ]
}