{
    "Symbol": "TORNTPOWER",
    "ISIN": "INE813H01021",
    "News": [
        {
            "Title": "Torrent Power Q3FY26 Results: Strong Performance",
            "Summary": "Torrent Power reports robust Q3FY26 results with net profit of ₹712.16 crore, up 93.15% YoY. Board approves ₹15 interim dividend and ₹7,000 crore NCD fundraising plan.",
            "Sentiment": "positive",
            "PublishDate": 1770725961424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Power Gets IND AA+/Stable Rating on NCDs",
            "Summary": "India Ratings affirmed Torrent Power's credit ratings with IND AA+/Stable for NCDs worth ₹1875 crore and assigned same rating to proposed ₹2000 crore NCDs. Short-term commercial paper rating affirmed at IND A1+.",
            "Sentiment": "positive",
            "PublishDate": 1770290695970,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Power Block Trade Worth Rs. 38.14 Crores",
            "Summary": "Torrent Power witnessed a significant NSE block trade worth Rs. 38.14 crores involving approximately 271,740 shares at Rs. 1403.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770274829511,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Power Q3FY26 Earnings Call on Feb 10",
            "Summary": "Torrent Power schedules earnings conference call for February 10, 2026 at 6:30 pm IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770212321044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Torrent Power Attributes Share Price Movement to Market",
            "Summary": "Torrent Power clarifies that recent share price movements are entirely attributed to prevailing market conditions rather than company-specific factors.",
            "Sentiment": "neutral",
            "PublishDate": 1767976626021,
            "Source": "stocks"
        },
        {
            "Title": "Torrent Power clarifies ₹1 lakh crore investment news",
            "Summary": "Torrent Power responds to stock exchange queries about media reports on investment plans, stating no undisclosed information exists that could impact share price behavior.",
            "Sentiment": "neutral",
            "PublishDate": 1767976146110,
            "Source": "stocks"
        },
        {
            "Title": "Torrent Power Signs 10-Year LNG Supply Deal with Japan's JERA",
            "Summary": "Torrent Power Limited has signed a long-term Sales and Purchase Agreement with JERA Co., Inc., Japan's largest power generation company, for supply of up to 0.27 MMTPA of LNG for 10 years starting from 2027. The LNG will be used to operate TPL's 2,730 MW Combined Cycle Gas-Based Power Plants in India and support Torrent Gas Ltd's City Gas Distribution operations, strengthening India's energy security and supporting the government's goal of increasing natural gas share in energy mix to 15% by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1765180871664,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Power Nears $1.2 Billion Acquisition of L&T's Thermal Power Business",
            "Summary": "Torrent Power is close to finalizing the acquisition of L&T's thermal power business, with the deal valued at USD 1.2 billion including debt and expected to conclude by year-end. The acquisition will expand Torrent Power's thermal power portfolio while allowing L&T to divest from this business segment.",
            "Sentiment": "positive",
            "PublishDate": 1764213297978,
            "Source": "order&deals"
        },
        {
            "Title": "Axis Mutual Fund Reduces Stake in Torrent Power to 3.06%",
            "Summary": "Axis Mutual Fund disposed of 0.11% equity shares (5,64,876 shares) in Torrent Power on November 12, 2025, reducing its total holding from 3.17% to 3.06% of the company's equity share capital. The disposal was conducted through open market transactions as part of ordinary portfolio investment activities by various Axis MF schemes, triggering mandatory disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763100412503,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Targets 500-600 MW Renewable Capacity Addition This Year",
            "Summary": "Torrent Power expects to add 500-600 MW of renewable energy capacity this year, with 67 MW already completed. The company plans to finish most of its renewable projects within the next 1.5-2 years.",
            "Sentiment": "positive",
            "PublishDate": 1762918732532,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Reports 48% Jump in Q2 Total Comprehensive Income to ₹730 Crores",
            "Summary": "Torrent Power's Total Comprehensive Income increased 48% to ₹730 crores in Q2 FY2025-26 compared to ₹492 crores in Q2 FY2024-25. The strong operational performance was driven by increased contribution from merchant power sales, including LNG sales from gas-based power plants, and reduction in finance costs. However, this was partially offset by higher depreciation costs due to commissioning of additional renewable generation capacity. The company operates 5.0 GW of capacity across thermal and renewable sources, with plans to expand to 10.1 GW. Torrent Power maintains distribution losses of just 2.34% in licensed areas with 99.9% power availability. The company has a robust pipeline including 1,600 MW coal-based capacity under development and 3 GW pumped storage hydro project with ₹14,000 crore investment.",
            "Sentiment": "positive",
            "PublishDate": 1762884952082,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Guides FY26 Revenue at ₹64,502 Crore with 5% Growth, Targets Net Zero by 2045",
            "Summary": "Torrent Power has provided guidance for FY26 revenue of ₹64,502 crore, representing a 5% year-over-year increase, with EBITDA projected at ₹14,468 crore. The company's renewable capacity stands at 26.3 GW with a 66% green energy mix. The capital expenditure pipeline includes 10.4 GW of renewable projects and 2.8 GW of pumped hydro projects. The company is expanding its EV charging network and green hydrogen assets while focusing on grid modernization and energy storage growth. Torrent Power has committed to achieving net zero emissions by 2045 and water neutrality by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1762874970254,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Reports Strong Q2 Performance with 50% Jump in Net Profit",
            "Summary": "Torrent Power delivered robust quarterly results with consolidated net profit rising to 7.24 billion rupees from 4.81 billion rupees year-over-year. Revenue increased to 78.76 billion rupees compared to 71.76 billion rupees in the same period last year. EBITDA grew to 15.06 billion rupees from 12.07 billion rupees, while EBITDA margin expanded to 19.12% from 16.82% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762862311268,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Power Sees Block Trade Worth Rs. 174.52 Crores on NSE",
            "Summary": "Torrent Power executed a block trade on the National Stock Exchange involving approximately 1,454,855 shares at a price of Rs. 1,199.60 per share. The total transaction value amounted to Rs. 174.52 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1759744930330,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Power Acquires Land Assets Worth ₹211 Crore for Thermal Power Project in Madhya Pradesh",
            "Summary": "Torrent Power Limited acquired equity stakes in two companies - 49% of Newzone India Private Limited and 100% of Newzone Power Projects Private Limited - for ₹211 crore. The acquisition provides Torrent Power control over approximately 922 acres of land in Annupur District, Madhya Pradesh, comprising private and government leased land. The companies being acquired have no turnover and hold no assets other than the land. Torrent Power plans to use this land for implementing a coal-based thermal power project. The transaction was completed on September 23, 2025, with an indicative completion timeline of 4 months for the acquisition process.",
            "Sentiment": "positive",
            "PublishDate": 1758635143103,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Power Shares Rally 2.53% on ₹22,000 Crore Thermal Power Plant Project Win",
            "Summary": "Torrent Power shares gained 2.53% to ₹1,258.30 with heavy trading volumes of 28.52 lakh shares worth ₹359.97 crore. The company received a Letter of Award from MP Power Management Company Limited for a ₹22,000 crore thermal power plant project in Madhya Pradesh at a tariff of ₹5.829 per kWh. The project involves developing a greenfield 2x800 MW Ultra-Supercritical power plant under the Design, Build, Finance, Own, and Operate model, with commissioning expected within 72 months. This represents the Torrent Group's largest investment in the power sector and will increase the company's total locked-in generation capacity to approximately 9.6 GW. Morgan Stanley maintained its Overweight rating with a target price of ₹1,444, expecting the plant to generate internal returns of 15-17% with a 70:30 debt-equity ratio. The brokerage noted Torrent Power's strong balance sheet with net debt-to-EBITDA of 1.4x and net debt-to-equity of 0.4x.",
            "Sentiment": "positive",
            "PublishDate": 1756714325793,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Secures Contract for 1,600 MW Coal Power Plant in Madhya Pradesh",
            "Summary": "Torrent Power has secured a Letter of Award (LOA) from MP Power Management Co. Ltd. for developing a 1,600 MW coal-based ultra supercritical power plant in Madhya Pradesh. The project includes a 25-year Power Purchase Agreement (PPA) and is estimated to generate approximately ₹6,500 crore in annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1756686121887,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Gets Approval for 1,600 MW Coal Power Plant in Madhya Pradesh",
            "Summary": "Torrent Power has secured approval for a 1,600 MW coal-based power plant in Madhya Pradesh. The project comes with a 25-year agreement and is expected to generate approximately ₹6,500 crore in annual revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1756546940426,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Inaugurates India's First Green Hydrogen Plant in Uttar Pradesh",
            "Summary": "Torrent Power Limited announced the inauguration of its Green Hydrogen Plant in Gorakhpur by Uttar Pradesh Chief Minister Yogi Adityanath. The plant, developed jointly by Torrent Power and Torrent Gas, has an annual production capacity of 72 TPA. The green hydrogen will be blended with natural gas up to 2% concentration in Torrent Gas' City Gas Distribution infrastructure and supplied to domestic households, CNG stations, and industries through existing natural gas pipelines. This is the first green hydrogen plant in Uttar Pradesh and the largest green hydrogen and natural gas blending project in India's City Gas Distribution sector. Torrent Gas operates 32 CNG stations and serves over 12,000 households and 73 industrial establishments in the region. The project supports India's National Green Hydrogen Mission 2030 and Uttar Pradesh's target of 1 mmtpa green hydrogen production. Torrent Group has revenues of approximately Rs 45,000 crores and operates across pharmaceuticals, power, city gas distribution, and sports sectors.",
            "Sentiment": "positive",
            "PublishDate": 1755435683602,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Releases Earnings Call Transcript for Quarter Ended June 30, 2025",
            "Summary": "Torrent Power Limited has made available the transcript of its earnings conference call with analysts and investors discussing the unaudited financial results for the quarter ended June 30, 2025. The transcript is accessible on the company's website and covers both consolidated and standalone financial results. The company notified stock exchanges BSE and NSE about the availability of this transcript.",
            "Sentiment": "neutral",
            "PublishDate": 1754552233001,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Power Plans Major Capex Ramp-Up with 3 GW Solar Pipeline",
            "Summary": "Torrent Power reported renewable energy capex of Rs 350 crores in Q1, with plans for significant acceleration in the second half of the year. The company has 3 gigawatts of solar projects in its pipeline. Management expects total capex of Rs 7,000-8,000 crores for FY26, with a slightly higher amount projected for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754451956926,
            "Source": "stock"
        },
        {
            "Title": "Torrent Power Reports Decline in Q1 Profit and Revenue",
            "Summary": "Torrent Power reported consolidated net profit of 7.3 billion rupees for Q1, down from 9.7 billion rupees in the same period last year. The company's revenue also decreased to 73.1 billion rupees compared to 90.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754394514795,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Power in Talks to Acquire L&T's Thermal Power Unit for $1 Billion",
            "Summary": "Torrent Power Ltd. is in discussions to acquire Larsen & Toubro Ltd.'s thermal business unit for approximately $1 billion, including debt. Both companies are working with advisers on the potential transaction. The disposal would help L&T raise cash to reduce its debt burden. L&T has been evaluating the sale of its thermal unit to focus on its core engineering and construction business, having previously held talks in 2021 to merge the asset with Sembcorp Industries' Indian arm. The deliberations are ongoing and may change, with talks potentially falling apart or other bidders emerging. Torrent Power, owned by the Torrent Group, provides power generation, transmission, distribution services, and manufactures power cables. Torrent Power shares have declined around 9% this year, with the company maintaining a market value of nearly $8 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1753354618603,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharma Issues Commercial Papers Worth 3 Billion Rupees",
            "Summary": "Torrent Pharmaceuticals has issued commercial papers valued at 3 billion Indian rupees. Commercial papers are short-term, unsecured debt instruments typically used by companies for immediate financing needs.",
            "Sentiment": "neutral",
            "PublishDate": 1750948410000,
            "Source": "default"
        },
        {
            "Title": "MERC to Consider Approval for Parallel Discom Services in Pune and Nagpur",
            "Summary": "The Maharashtra Electricity Regulatory Commission (MERC) is set to grant approval for parallel distribution company (discom) services in Pune and Nagpur. Torrent Power is mentioned in relation to this development, suggesting their potential involvement in providing these services.",
            "Sentiment": "neutral",
            "PublishDate": 1750827296000,
            "Source": "default"
        },
        {
            "Title": "Torrent Power Subsidiary Secures 300 MW Solar Project from SECI",
            "Summary": "Torrent Power's subsidiary, Torrent Green Energy Pvt Ltd, has received a Letter of Award (LoA) from Solar Energy Corporation of India (SECI) for developing a 300 MW solar project. The project will be executed at a tariff of ₹3.97 per unit, with an estimated investment of 26.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1749774475000,
            "Source": "default"
        },
        {
            "Title": "Torrent Power: Secures 300 MW Wind Project, Plans ₹2,650 Crore Investment",
            "Summary": "Torrent Power's subsidiary won a 300 MW wind power project from SECI at ₹3.97 per unit tariff. The company plans to invest ₹2,650 crore, with commissioning expected within 24 months of PPA signing. This increases Torrent's renewable capacity under development to 3.3 GWp.",
            "Sentiment": "positive",
            "PublishDate": 1749739599000,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Power Subsidiary Secures 300 MW Solar Project from SECI",
            "Summary": "Torrent Power's subsidiary, Torrent Green Energy Pvt Ltd, has been awarded a 300 MW solar project by Solar Energy Corporation of India (SECI). The project will be developed at a tariff of ₹3.97 per unit, with an estimated investment of ₹26.5 billion.",
            "Sentiment": "positive",
            "PublishDate": 1749732996000,
            "Source": "default"
        },
        {
            "Title": "Torrent Power: Signs 10-Year LNG Supply Deal with BP",
            "Summary": "Torrent Power has signed a 10-year agreement with BP Singapore to purchase up to 0.41 million tonnes of LNG annually from 2027 to 2036. The LNG will be used for power generation and city gas distribution in India.",
            "Sentiment": "positive",
            "PublishDate": 1748871017000,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Power Signs LNG Supply Agreement with BP Singapore",
            "Summary": "Torrent Power has entered into a long-term Sales and Purchase Agreement (SPA) with BP Singapore Pte. Ltd., a subsidiary of BP, for the supply of up to 0.41 MMTPA of LNG. The agreement covers a period from 2027 to 2036.",
            "Sentiment": "positive",
            "PublishDate": 1748866328000,
            "Source": "default"
        },
        {
            "Title": "Torrent Power Reports Strong Q4 Results, Announces Dividend and Fundraising Plans",
            "Summary": "Torrent Power's Q4 consolidated net profit surged to 10.6 billion rupees, up from 4.3 billion year-over-year. Revenue slightly decreased to 64.6 billion rupees. The company declared a dividend of 5 rupees per equity share and plans to raise up to 30 billion rupees through non-convertible debentures via private placement. A deferred tax of 5.9 billion rupees was reported.",
            "Sentiment": "positive",
            "PublishDate": 1747267819000,
            "Source": "default"
        },
        {
            "Title": "Torrent Power to Raise Funds Up to 30 Billion Rupees",
            "Summary": "Torrent Power has announced plans to raise funds up to 30 billion rupees through the issuance of non-convertible debentures via private placement.",
            "Sentiment": "positive",
            "PublishDate": 1747230259000,
            "Source": "default"
        },
        {
            "Title": "Torrent Power: Q4 Profit Soars 146% to ₹1,060 Crore, Declares ₹5 Dividend",
            "Summary": "Torrent Power's Q4 FY25 net profit jumped 146.3% YoY to ₹1,059.6 crore, driven by higher contributions from gas-based plants, distribution business growth, and a one-time tax reversal. Revenue slightly decreased to ₹6,456.3 crore. The company recommended a final dividend of ₹5 per share and approved raising up to ₹3,000 crore through NCDs.",
            "Sentiment": "positive",
            "PublishDate": 1747229769000,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Power Announces Q4 Results and Dividend",
            "Summary": "Torrent Power has recommended a dividend of 5 rupees per equity share. The company reported Q4 PBT of 6.2 billion rupees, slightly up from 6.17 billion year-over-year. Q4 EBITDA increased to 11.3 billion rupees from 11.09 billion, with EBITDA margin improving to 17.50% from 16.99%. The company also reported a deferred tax of 5.9 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747228589000,
            "Source": "result"
        },
        {
            "Title": "Torrent Power Reports Significant Profit Growth in Q4",
            "Summary": "Torrent Power announced its Q4 financial results, showing a substantial increase in consolidated net profit to 10.6 billion rupees, up from 4.3 billion rupees year-over-year. However, revenue slightly decreased to 64.6 billion rupees from 65.29 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747228442000,
            "Source": "result"
        },
        {
            "Title": "Torrent Power to Consider Q4 Results on May 14",
            "Summary": "Torrent Power has announced that it will consider and approve its financial results for the fourth quarter on May 14.",
            "Sentiment": "neutral",
            "PublishDate": 1746791835000,
            "Source": "default"
        },
        {
            "Title": "Torrent Power's Subsidiary Incorporates New Renewable Energy Company",
            "Summary": "Torrent Power's unit, Torrent Green Energy, has incorporated a new company called Torrent Urja Projects Pvt Ltd (TUPPL). TUPPL will focus on developing renewable energy projects and providing EPC (Engineering, Procurement, and Construction) solutions for various infrastructure projects, including thermal, hydro, wind, solar, and green hydrogen initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1744329890000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Subsidiary Establishes New Renewable Energy Company",
            "Summary": "Torrent Green Energy, a subsidiary of Torrent Power, has incorporated a new company called Torrent Urja Projects Pvt Ltd (TUPPL). TUPPL will focus on developing renewable energy projects and providing EPC (Engineering, Procurement, and Construction) solutions for various infrastructure projects, including thermal, hydro, wind, solar, and green hydrogen initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1744296098000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Sells Equity Shares in Subsidiaries to Torrent Green Energy",
            "Summary": "Torrent Power has sold equity shares in four of its subsidiaries to its unit Torrent Green Energy. The transaction is valued at ₹467.41 crore. This move appears to be an internal restructuring within the Torrent Power group.",
            "Sentiment": "neutral",
            "PublishDate": 1743089299000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power's Subsidiary Incorporates New Company",
            "Summary": "Torrent Power Limited has announced that its subsidiary, Torrent Green Energy, has incorporated a new company called Torrent Urja 46 Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1743089277000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Sells Equity Shares of 10 Subsidiaries to Torrent Green Energy",
            "Summary": "Torrent Power has announced the sale of equity shares from 10 of its subsidiaries to its wholly owned subsidiary, Torrent Green Energy. The transaction is valued at ₹474.26 crore and is expected to be completed by March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1743000931000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Sells Subsidiary Equity Shares for 4.24 Billion Rupees",
            "Summary": "Torrent Power has announced the sale of equity shares in its subsidiary, resulting in a receipt of 4.24 billion rupees (approximately $51 million USD). This transaction represents a significant corporate action that may impact the company's financial structure and future operations.",
            "Sentiment": "positive",
            "PublishDate": 1742567319000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Incorporates New Unit for Renewable Energy Business",
            "Summary": "Torrent Power has announced the incorporation of a new unit dedicated to its renewable energy business. This move suggests the company is expanding its focus on sustainable energy sources and potentially diversifying its power generation portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1742526257000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Establishes Two New Subsidiaries for Renewable Energy Expansion",
            "Summary": "Torrent Power has incorporated two new step-down subsidiaries to support its expansion in the renewable energy sector. This strategic move indicates the company's commitment to growing its presence in the renewable energy market and potentially diversifying its energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1742439946000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power: Morgan Stanley Downgrades Stock, Cuts Target Price by 30%",
            "Summary": "Morgan Stanley has downgraded Torrent Power from 'Overweight' to 'Equal weight' and reduced its 12-month target price from ₹2,026 to ₹1,413. The stock has underperformed in 2025, falling 10% year-to-date and 32% from October highs. Despite this, Morgan Stanley remains positive on the power sector, expecting demand to improve from Q2F26.",
            "Sentiment": "negative",
            "PublishDate": 1739246052000,
            "Source": "normal_news"
        },
        {
            "Title": "Torrent Power Launches Major Green Hydrogen Blending Project in UP",
            "Summary": "Torrent Power has initiated a pilot project for blending green hydrogen with CNG (Compressed Natural Gas) in Uttar Pradesh. This project is reported to be one of the largest private sector blending initiatives in India, showcasing the company's commitment to sustainable energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1738725494000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power Reports Q3 FY2024-25 Results and Declares Interim Dividend",
            "Summary": "Torrent Power announced its Q3 consolidated net profit of 4.76 billion rupees, up from 3.60 billion rupees year-over-year. The company's revenue increased to 64.99 billion rupees from 63.66 billion rupees in the same period. Additionally, Torrent Power declared an interim dividend of 14 rupees per equity share for the fiscal year 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1738714868000,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Power Declares Interim Dividend for FY 2024-25",
            "Summary": "Torrent Power has announced an interim dividend of Rs 14 per equity share for the fiscal year 2024-25. This declaration of dividend represents a significant corporate action that will directly benefit the company's shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1738675364000,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Power: Q3 Profit Surges 31%, Declares Interim Dividend",
            "Summary": "Torrent Power reported a 30.8% YoY increase in Q3 FY25 net profit to ₹489.3 crore. Revenue rose 2.1% to ₹6,499.4 crore. EBITDA grew 6.5% to ₹1,111.6 crore. The company declared an interim dividend of ₹14 per share. Gains were driven by higher contributions from gas-based power plants and sale of non-current investments, partially offset by lower renewable business contribution.",
            "Sentiment": "positive",
            "PublishDate": 1738674235000,
            "Source": "earnings"
        },
        {
            "Title": "Torrent Power Unit Achieves Full Commissioning of 300 MW Capacity",
            "Summary": "Torrent Power's subsidiary, Torrent Saurya Urja 2 Pvt Ltd (TSU2), has received certification from the Gujarat Energy Development Agency confirming the full commissioning of its 300 MW capacity. This development marks a significant milestone in the company's renewable energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1738251161000,
            "Source": "corporate_action"
        }
    ]
}