{
    "Symbol": "TPHQ",
    "ISIN": "INE065J01024",
    "News": [
        {
            "Title": "Teamo Productions HQ Reports Strong Q3 FY26 Results",
            "Summary": "Teamo Productions HQ Limited posted impressive Q3 FY26 results with net profit surging to ₹511.65 lakhs, marking significant growth from ₹46.66 lakhs in Q3 FY25. Revenue reached ₹1,785.17 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1768390562399,
            "Source": "co_actions_results"
        },
        {
            "Title": "Teamo Productions HQ Limited Approves Quarterly Results and Dissolves CSR Committee",
            "Summary": "Teamo Productions HQ Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 5,103.35 lakhs for the quarter, compared to Rs 2,253.95 lakhs in the same quarter last year. Net profit for the quarter was Rs 50.91 lakhs versus Rs 149.80 lakhs in the previous year quarter. For the half year, revenue reached Rs 7,930.67 lakhs with net profit of Rs 122.01 lakhs. The Board also dissolved the Corporate Social Responsibility Committee as the company does not meet the prescribed threshold limits under Section 135 of the Companies Act, 2013 for the financial year 2024-25, making CSR Committee constitution non-mandatory. The company operates through three segments: dealing in shares/securities, film division, and trading division-infrastructure.",
            "Sentiment": "neutral",
            "PublishDate": 1760349401665,
            "Source": "earnings"
        },
        {
            "Title": "Teamo Productions HQ Limited Reports 71.09 Lakh Net Profit in Q1 Results",
            "Summary": "Teamo Productions HQ Limited announced its quarterly financial results with total income of ₹2,906.32 lakhs, up from ₹773.57 lakhs in the same quarter last year. The company reported a net profit of ₹71.09 lakhs compared to ₹147.16 lakhs in the previous year quarter. Revenue from operations increased significantly to ₹2,827.31 lakhs from ₹667.79 lakhs year-over-year. The company operates across four segments: Dealing in Shares/Securities, Engineering Based Services, Trading Division - Infrastructure, and Film Division. The Trading Division - Infrastructure contributed the majority of revenue at ₹2,817.98 lakhs. Basic earnings per share stood at ₹0.01. The company has initiated the process of incorporating wholly owned overseas subsidiaries as part of its growth strategy, though equity subscription has not yet occurred.",
            "Sentiment": "positive",
            "PublishDate": 1755070364863,
            "Source": "earnings"
        },
        {
            "Title": "Teamo Productions Plans to Raise Up to 3 Billion Rupees Through Securities Funding",
            "Summary": "Teamo Productions has announced plans to raise up to 3 billion rupees through securities funding. The company intends to use this method to secure additional capital for its operations or expansion. No further details about the specific type of securities or the purpose of the funding were provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1752066932000,
            "Source": "default"
        },
        {
            "Title": "Teamo Productions HQ: Raises Rs. 17.44 Crore via Preferential Issue",
            "Summary": "Teamo Productions HQ has raised Rs. 17,43,75,000 through a preferential issue between August 20 and September 10, 2024. The funds will be used for working capital, repayments, capital expenditure, and general corporate purposes. The company issued 15,50,00,000 equity shares upon conversion of warrants.",
            "Sentiment": "positive",
            "PublishDate": 1731237321000,
            "Source": "corporate_action"
        },
        {
            "Title": "Teamo Productions HQ: Net Profit Soars 435.71% in Q2 FY2025",
            "Summary": "<p>Teamo Productions HQ reported a <span class='positive'>significant increase</span> in <b>net profit</b> for Q2 FY2025, <span class='positive'>rising 435.71%</span> to Rs 1.50 crore compared to Rs 0.28 crore in Q2 FY2024. <b>Sales</b> also <span class='positive'>improved</span>, <span class='positive'>growing 20.94%</span> to Rs 145.55 crore from Rs 120.35 crore in the same period last year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728992280000,
            "Source": "result"
        }
    ]
}