{
    "Symbol": "TPLPLASTEH",
    "ISIN": "INE413G01022",
    "News": [
        {
            "Title": "TPL Plastech Q3FY26 Results Show Strong Growth",
            "Summary": "TPL Plastech reported robust Q3FY26 performance with revenue rising 22.15% YoY to ₹11,122.21 lakhs and net profit growing 25.42% to ₹869.34 lakhs, driven by strong operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770818322888,
            "Source": "co_actions_results"
        },
        {
            "Title": "TPL Plastech Reports 27.8% Jump in Q2 Net Profit to 68.5 Million Rupees",
            "Summary": "TPL Plastech delivered strong quarterly results with net profit rising to 68.5 million rupees from 53.6 million rupees year-over-year. Revenue grew to 1.07 billion rupees compared to 889 million rupees in the same period last year. EBITDA increased to 118.6 million rupees from 97.3 million rupees, while EBITDA margin improved slightly to 11.1% from 10.94% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762957220868,
            "Source": "earnings"
        },
        {
            "Title": "TPL Plastech Sets September 2, 2025 as Record Date for Final Dividend Eligibility",
            "Summary": "TPL Plastech Limited has set September 2, 2025 as the record date for determining shareholders eligible to receive the final dividend for financial year 2024-2025. The dividend payment is subject to declaration at the company's 32nd Annual General Meeting. Shareholders holding equity shares with a face value of Rs. 2 each will be eligible for the dividend based on their holdings on the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1755013302585,
            "Source": "corporate_action"
        },
        {
            "Title": "TPL Plastech Reports 22% Revenue Growth in Q1, Schedules AGM for September 9",
            "Summary": "TPL Plastech Limited reported quarterly results for the period ended June 30, 2025, showing revenue from operations of Rs. 9,039.51 lakhs compared to Rs. 7,715.88 lakhs in the same quarter last year. The company posted a profit after tax of Rs. 547.45 lakhs versus Rs. 447.66 lakhs in the previous year quarter. Earnings per share stood at Rs. 0.70 compared to Rs. 0.57 in the corresponding period. The Board announced the 32nd Annual General Meeting will be held on September 9, 2025, at 12:00 noon via video conferencing. Book closure dates are set from September 3-9, 2025, for AGM purposes and dividend payment. The company also approved material related party transactions for 2026-2027 with Time Technoplast Limited for up to Rs. 425 crores and Avion Exim Private Limited for up to Rs. 110 crores, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754661997225,
            "Source": "earnings"
        },
        {
            "Title": "TPL Plastech Shareholders Approve Related Party Transactions with Time Technoplast and Avion Exim for FY2026",
            "Summary": "TPL Plastech Limited announced that shareholders have approved two material related party transactions through postal ballot voting. The first transaction involves Time Technoplast Limited, the holding company, and the second involves Avion Exim Private Limited for Financial Year 2025-2026. The remote e-voting was conducted from June 27 to July 26, 2025, with results declared on July 28, 2025. Both ordinary resolutions received overwhelming approval with 99.9908% votes in favor and only 0.0092% against. Out of 33,559 total shareholders on record date June 20, 2025, a total of 1,526,168 votes were polled representing 1.9566% of outstanding shares. The voting was conducted electronically through MUFG Intime India Private Limited, with Arun Dash & Associates serving as the scrutinizer for the process.",
            "Sentiment": "positive",
            "PublishDate": 1753713373085,
            "Source": "corporate_action"
        },
        {
            "Title": "TPL Plastech Reports Q4 Results and Recommends Dividend",
            "Summary": "TPL Plastech has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 113 million rupees from 98 million rupees year-over-year, with EBITDA margin improving to 12.29% from 11.8%. Net profit for Q4 rose to 68 million rupees from 60.7 million rupees year-over-year and 69 million rupees quarter-on-quarter. Revenue for Q4 grew to 922 million rupees from 827 million rupees year-over-year. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748009585000,
            "Source": "result"
        },
        {
            "Title": "TPL Plastech Reports Improved Q3 EBITDA and Margin",
            "Summary": "TPL Plastech has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 110 million rupees, up from 99 million rupees in the same quarter last year. The EBITDA margin also saw a slight improvement, rising to 12.04% from 12.01% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739197820000,
            "Source": "earnings"
        },
        {
            "Title": "TPL Plastech Reports Increased Q3 Net Profit and Revenue",
            "Summary": "TPL Plastech has announced its financial results for the third quarter. The company's net profit increased to 69 million rupees, up from 59 million rupees year-over-year and 54 million rupees quarter-over-quarter. Revenue also saw growth, reaching 910 million rupees compared to 826 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739197772000,
            "Source": "earnings"
        },
        {
            "Title": "TPL Plastech Reports Q2 EBITDA Growth",
            "Summary": "TPL Plastech announced its Q2 financial results. The company's EBITDA increased to 97 million rupees from 87 million rupees year-over-year. However, the EBITDA margin slightly decreased to 10.94% from 11.14% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731077730000,
            "Source": "result"
        },
        {
            "Title": "TPL Plastech Reports Q2 FY24 Financial Results",
            "Summary": "TPL Plastech announced its Q2 financial results. The company's net profit increased to 54 million rupees, up from 43 million rupees year-over-year and 45 million rupees quarter-over-quarter. Revenue for Q2 rose to 889 million rupees, compared to 784 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731077657000,
            "Source": "result"
        }
    ]
}