{
    "Symbol": "TRACXN",
    "ISIN": "INE0HMF01019",
    "News": [
        {
            "Title": "Tracxn Allots 21,214 Shares Under ESOP 2016",
            "Summary": "Tracxn Technologies allotted 21,214 equity shares under its Employee Stock Option Plan 2016 at Re. 1/- per share, increasing paid-up capital to 10,67,00,533 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770629189332,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tracxn Technologies Q3 FY26 Results: Loss Widens",
            "Summary": "Tracxn Technologies reported Q3 FY26 net loss of Rs. 81.38 lakhs vs profit of Rs. 141.99 lakhs in Q3 FY24. Revenue declined to Rs. 2,103.98 lakhs from Rs. 2,139.31 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770287930716,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tracxn Technologies Allots 149,737 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Tracxn Technologies' Nomination and Remuneration Committee approved the allotment of 149,737 equity shares at Re. 1/- per share under TRACXN Employee Stock Option Plan 2016 to eligible grantees. The allotment increases the company's paid-up share capital from 10,64,47,953 shares to 10,65,97,690 shares, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764995896934,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Technologies Grants 143,140 Employee Stock Options Under ESOP 2016 Plan",
            "Summary": "Tracxn Technologies' Nomination and Remuneration Committee approved the grant of 143,140 stock options to eligible employees under the TRACXN Employee Stock Option Plan 2016 at an exercise price of Re. 1/- each. The options are exercisable within five years from vesting date, with each option convertible into one fully paid-up equity share of face value Re. 1/-.",
            "Sentiment": "positive",
            "PublishDate": 1764243855092,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Technologies Allots 61,871 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Tracxn Technologies has allotted 61,871 equity shares under its Employee Stock Option Plan 2016 to eligible grantees at an exercise price of Re. 1 per share. The Nomination and Remuneration Committee approved the allotment through a circular resolution dated November 10, 2025. The newly allotted shares rank equally with existing equity shares of the company. Following this allotment, the company's paid-up share capital increased from 10,63,86,082 shares to 10,64,47,953 shares. The company realized Rs. 61,871 from the exercise of these options. The diluted earnings per share for the quarter ended September 30, 2025 is Rs. (0.52) per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762837121823,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Technologies Reports 1% Revenue Growth in Q2 FY26 with Strong Customer Account Expansion",
            "Summary": "Tracxn Technologies Limited reported revenue from operations of Rs 21.2 crores for Q2 FY26 and Rs 42.4 crores for H1 FY26, representing 1% year-on-year growth. The data and software platform for global private markets achieved significant customer account growth of 41% year-on-year, reaching 2,143 accounts by end of Q2. The company maintained profitability with PAT of Rs 1.6 crores for the quarter and 4% PAT margin. Free cash flow for H1 FY26 was Rs 1.6 crores, with cash equivalents standing at over Rs 90 crores. International revenue contributed 56% of total revenue in H1 FY26, spanning over 50 countries. The company launched multiple vertical teams for different customer segments, with India business unit showing 16% revenue growth. Tracxn entered into a partnership with TMX Datalinx for North American market expansion and continues investing in AI-driven data production and regulatory datasets expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1762792774600,
            "Source": "earnings"
        },
        {
            "Title": "Tracxn Technologies Reports Wider Net Loss and Lower EBITDA Margin in Q2 Results",
            "Summary": "Tracxn Technologies reported a net loss of 55.6 million rupees in Q2, compared to a loss of 46.5 million rupees in the same period last year. Revenue declined slightly to 212.4 million rupees from 214 million rupees year-over-year. EBITDA dropped significantly to 6.6 million rupees from 23 million rupees, while EBITDA margin compressed to 3.10% from 10.71% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762332894944,
            "Source": "earnings"
        },
        {
            "Title": "Tracxn Technologies Reports Loss and Completes Share Buyback in Latest Results",
            "Summary": "Tracxn Technologies reported a net loss of Rs 89.19 lakhs for the six months ended September 30, 2025, compared to a loss of Rs 89.31 lakhs in the same period last year. Revenue from operations increased to Rs 42.06 crores for the six-month period from Rs 39.98 crores in the previous year. The company completed a buyback of 1,066,666 equity shares at Rs 75 per share during the quarter. The company reversed deferred tax assets of Rs 600.21 lakhs related to carry-forward business losses due to reassessment of recoverability. Employee benefit expenses rose to Rs 37.09 crores for the six-month period. The company allotted 309,001 equity shares to employees under ESOP schemes during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762330860011,
            "Source": "earnings"
        },
        {
            "Title": "Tracxn Technologies Partners with TMX Datalinx as Exclusive Canadian Provider of Private Market Intelligence",
            "Summary": "Tracxn Technologies announced a strategic agreement with TMX Datalinx to serve as their exclusive Canadian provider for delivering private market intelligence to financial institutions. The collaboration will enable institutional investors in TMX Datalinx's network to access Tracxn's comprehensive global private market data through subscriptions, including insights on startups, companies, emerging sectors, private company financial performance, and transactions. Tracxn uses an AI-powered and human-in-the-loop approach to aggregate data across over 2,000 emerging sectors, covering more than 5 million companies and 60 million legal entities across 20+ countries. The platform serves over 2,000 organizations across 50+ countries, including venture capital funds, private equity firms, corporate strategy teams, and investment banks. TMX Datalinx aims to combine Tracxn's private market data with their public market expertise to offer clients a comprehensive investment landscape view.",
            "Sentiment": "positive",
            "PublishDate": 1760702474201,
            "Source": "stock"
        },
        {
            "Title": "Tracxn Tech Targets SaaS Growth Through Global Expansion and AI Integration",
            "Summary": "Tracxn Tech aims to accelerate its Software-as-a-Service (SaaS) driven growth through multiple strategic initiatives. The company plans to deepen its global customer base, scale its data intelligence offerings, and capitalize on artificial intelligence-led opportunities within private market analytics.",
            "Sentiment": "positive",
            "PublishDate": 1755623364365,
            "Source": "stock"
        },
        {
            "Title": "Tracxn Technologies Schedules Analyst Meetings for August 20-21, 2025",
            "Summary": "Tracxn Technologies Limited has scheduled meetings with analysts and institutional investors on August 20 and 21, 2025, and submitted an investor presentation for these meetings. The company operates as a global private market intelligence SaaS platform serving venture capital firms, private equity firms, investment banks, and corporate M&A teams across 50+ countries. As of June 30, 2025, Tracxn profiles 4.9 million+ entities, covers 965,000+ transactions, and serves 2,030 customer accounts with 5,376 users. The company reported revenue growth from ₹43.8 Cr in FY21 to ₹84.5 Cr in FY25 at 17.9% CAGR, though FY25 showed 2.1% YoY growth. Tracxn achieved EBITDA of ₹0.8 Cr with 1.0% margin and PAT of ₹4.9 Cr with 5.8% margin in FY25. The company maintains ₹94.6 Cr in cash and cash equivalents as of March 31, 2025, up 25.7% YoY, with a debt-free business model.",
            "Sentiment": "neutral",
            "PublishDate": 1755609699082,
            "Source": "stock"
        },
        {
            "Title": "Tracxn Technologies Completes Buyback Program, Extinguishes 10.67 Lakh Equity Shares",
            "Summary": "Tracxn Technologies Limited has completed the extinguishment of 10,66,666 equity shares as part of its buyback program. The company's paid-up share capital has been reduced from 10,72,09,725 shares to 10,61,43,059 shares, with each share valued at INR 1. The buyback tendering period ran from July 24, 2025 to July 30, 2025. All extinguished shares were in demat form, with no physical shares involved in the process. The Buyback Committee approved the extinguishment on August 13, 2025. Following the buyback completion, the promoter and promoter group's shareholding increased from 33.95% to 34.29%, while the total number of shares held by other categories including foreign investors, financial institutions, and public shareholders decreased proportionally. The extinguishment was confirmed by Central Depository Services (India) Limited and certified by the company's registrar and secretarial auditor.",
            "Sentiment": "neutral",
            "PublishDate": 1755102761326,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Technologies Reports 3.2% Revenue Growth in Q1 FY26 with Strong Customer Addition",
            "Summary": "Tracxn Technologies reported revenue from operations of ₹21.2 crores for Q1 FY26, representing 3.2% year-on-year growth. The data and software platform for global private markets achieved positive PAT of ₹1.1 crores with 5.3% margin and generated positive free cash flow of ₹2.6 crores. Customer accounts grew significantly by 43.7% to 2,030 accounts, with the company adding 104 net new accounts during the quarter. Cash and cash equivalents increased to ₹98.6 crores, up 22.7% year-on-year. The company expanded its vertical sales teams across different customer segments including universities, startups, investment banking, and corporates, with India revenue growing 15% and customer accounts increasing 58% year-on-year. International markets showed improvement with 25% account growth compared to negative 5% in FY24. The platform now tracks 4.9 million company profiles and serves customers across over 50 countries, with 57% of revenue coming from outside India.",
            "Sentiment": "positive",
            "PublishDate": 1755096090703,
            "Source": "earnings"
        },
        {
            "Title": "Tracxn Tech Expands Internationally with AI and Automation Focus",
            "Summary": "Tracxn Tech is expanding its operations internationally while implementing AI and automation technologies to enhance its operations. The company is adopting a global growth strategy as part of its expansion efforts.",
            "Sentiment": "positive",
            "PublishDate": 1754571520819,
            "Source": "stock"
        },
        {
            "Title": "Tracxn Technologies Reports Q1 FY26 Results with Revenue Growth and Return to Profitability",
            "Summary": "Tracxn Technologies announced its quarterly results with revenue from operations reaching Rs 2,120.33 lakhs, showing growth from Rs 2,053.96 lakhs in the same quarter last year. The company returned to profitability with a net profit of Rs 111.97 lakhs compared to a loss of Rs 757.95 lakhs in the previous quarter. Employee benefit expenses increased to Rs 1,895.14 lakhs from Rs 1,767.40 lakhs year-over-year. The company recorded Rs 62.60 lakhs as employee stock option expense with 4,132,803 ESOPs outstanding. Basic earnings per share improved to Rs 0.10 from a loss of Rs 0.71 in the previous quarter. The Board approved a share buyback during the quarter, with shareholder approval received through postal ballot on July 3, 2025. The company operates in a single reportable segment of Platform Subscription.",
            "Sentiment": "positive",
            "PublishDate": 1754561697556,
            "Source": "earnings"
        },
        {
            "Title": "Tracxn Technologies Completes Buyback of 10.67 Lakh Shares at INR 75 Per Share",
            "Summary": "Tracxn Technologies Limited has completed its buyback of 10,66,666 equity shares at INR 75 per share, utilizing INR 8 crores. The buyback received strong response with 4,425 valid bids for 69.86 lakh shares, representing 6.55 times oversubscription. The tendering period ran from July 24 to July 30, 2025, with settlement completed on August 5, 2025. The buyback constituted 23.70% of the company's paid-up capital and free reserves and 1% of pre-buyback equity share capital. Post-buyback, the paid-up capital will reduce from INR 10.72 crores to INR 10.61 crores after extinguishment of shares. Major participants included Franklin India Technology Fund and Gaurav Agrawal, each accepting over 76,000 shares. The promoter group's shareholding increased from 33.95% to 34.29% post-buyback.",
            "Sentiment": "positive",
            "PublishDate": 1754556479140,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Technologies Announces Share Buyback of 10.67 Lakh Shares at INR 75 Per Share",
            "Summary": "Tracxn Technologies Limited has announced a buyback of 10,66,666 fully paid-up equity shares at INR 75 per share through tender offer route, with total value not exceeding INR 7.99 crores. The buyback is open from July 24, 2025 to July 30, 2025, with July 18, 2025 as the record date. Eligible shareholders will receive entitlement of 5 equity shares for every 332 shares held, with separate categories for small shareholders and general shareholders. The buyback will be conducted through NSE as the designated stock exchange using proportionate basis under SEBI regulations. Letters of offer have been sent electronically to shareholders, and tender forms must be submitted by July 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753348952309,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Technologies Announces Share Buyback of 10.67 Lakh Shares at Rs 75 Per Share",
            "Summary": "Tracxn Technologies Limited has announced a buyback of 10,66,666 fully paid-up equity shares at Rs 75 per share through tender offer, representing 0.99% of total paid-up equity capital. The buyback amount totals Rs 7.99 crores, constituting 23.70% of aggregate paid-up equity capital and free reserves. The buyback opens on July 24, 2025 and closes on July 30, 2025, with Friday, July 18, 2025 as the record date. The buyback price represents a 38.57% premium over the three-month volume weighted average price on NSE. Promoters holding 33.95% stake have expressed intention not to participate in the buyback. The company aims to return surplus cash to shareholders and optimize capital structure through this buyback program.",
            "Sentiment": "positive",
            "PublishDate": 1753189070812,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Technologies Increases Buyback Price, Reduces Share Count",
            "Summary": "Tracxn Technologies has announced changes to its share buyback program. The company has raised the buyback price to 75 rupees per share. Additionally, Tracxn has lowered the maximum number of shares to be bought back to 1,066,666.",
            "Sentiment": "positive",
            "PublishDate": 1752765925000,
            "Source": "default"
        },
        {
            "Title": "Tracxn Technologies: Share Buyback Approved at 21% Premium",
            "Summary": "Tracxn Technologies shareholders approved a share buyback of up to 11,42,857 shares at Rs 70 per share, a 21% premium. The buyback, capped at Rs 7.99 crore, represents 1.07% of total equity and will be conducted via tender offer. The record date is set for July 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1752129153000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tracxn Tech Reports Q4 Results and Announces Share Buyback",
            "Summary": "Tracxn Tech reported a net loss of 75.8 million rupees in Q4, compared to a profit of 14.3 million rupees in the same quarter last year. Revenue increased to 211.4 million rupees from 203 million rupees year-over-year. The company also announced a share buyback program, planning to repurchase up to 1.1 million shares at 70 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748304357000,
            "Source": "default"
        },
        {
            "Title": "Tracxn Tech Announces Share Buyback and Q4 Financial Results",
            "Summary": "Tracxn Tech has announced a share buyback of up to 1.1 million shares at 70 rupees per share. The company also reported its Q4 financial results: EBITDA decreased to 7.4 million rupees from 19 million rupees year-over-year, with EBITDA margin falling to 3.48% from 9.36%. Revenue increased slightly to 211.4 million rupees from 203 million rupees year-over-year. The company reported a net loss of 75.8 million rupees for Q4, compared to a profit of 14.3 million rupees in the same quarter last year and a profit of 14.2 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748259292000,
            "Source": "result"
        },
        {
            "Title": "Tracxn Technologies Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Tracxn Technologies has reported a decrease in its third-quarter EBITDA, which fell to 19 million rupees from 28.8 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 8.88% from 13.62% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739192451000,
            "Source": "earnings"
        },
        {
            "Title": "Tracxn Technologies Reports Q3 FY2024 Financial Results",
            "Summary": "Tracxn Technologies has announced its financial results for the third quarter. The company reported a net profit of 14.2 million rupees, which is a decrease from 22.2 million rupees in the same quarter of the previous year. Revenue for Q3 stood at 214 million rupees, slightly up from 211.4 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739192446000,
            "Source": "earnings"
        },
        {
            "Title": "Tracxn Technologies Reports Q2 FY25 Financial Results",
            "Summary": "Tracxn Technologies has reported a deferred tax of 69 million rupees in Q2 FY25. The company's Profit Before Tax (PBT) for the quarter was 23 million rupees, compared to 30 million rupees in the same quarter of the previous year, indicating a year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731069062000,
            "Source": "result"
        },
        {
            "Title": "Tracxn Technologies Reports Q2 Financial Results",
            "Summary": "Tracxn Technologies has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 23 million rupees, down from 30 million rupees in the same quarter last year. The EBITDA margin has also decreased to 10.71% from 13.91% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731068994000,
            "Source": "result"
        },
        {
            "Title": "Tracxn Technologies Reports Q2 Financial Results",
            "Summary": "Tracxn Technologies announced its Q2 financial results. The company reported a net loss of 47 million rupees, which has increased from 22 million rupees year-over-year and 13 million rupees quarter-over-quarter. Revenue for Q2 was 214 million rupees, slightly down from 215 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731068917000,
            "Source": "result"
        }
    ]
}