{
    "Symbol": "TRANSWORLD",
    "ISIN": "INE757B01015",
    "News": [
        {
            "Title": "Transworld Shipping Completes TILPL Acquisition",
            "Summary": "Transworld Shipping Lines Limited successfully completed the acquisition of 100% paid-up share capital of Transworld Integrated Logistik Private Limited for ₹39.70 crores on January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769799470601,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transworld Shipping Gets Court Release Order for Vessel",
            "Summary": "Gujarat High Court grants release order for SSL Visakhapatnam vessel, allowing it to sail from Hazira port after ₹7.50 crore security deposit in cargo delivery dispute case.",
            "Sentiment": "positive",
            "PublishDate": 1768490889991,
            "Source": "stocks"
        },
        {
            "Title": "Transworld Shipping Vessel Arrested by Gujarat HC",
            "Summary": "Transworld Shipping Lines faces vessel arrest order from Gujarat High Court over alleged cargo misdelivery dispute, requiring ₹7.44 crore security deposit.",
            "Sentiment": "negative",
            "PublishDate": 1768311715716,
            "Source": "stocks"
        },
        {
            "Title": "Transworld Shipping Lines Completes TLPL Acquisition",
            "Summary": "Transworld Shipping Lines Limited successfully completed the acquisition of 100% shareholding in Transworld Logistics Private Limited on December 31, 2025, making it a wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1767170257195,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transworld Shipping Faces ₹10.26 Cr GST Demand",
            "Summary": "Transworld Shipping Lines receives GST order demanding ₹10.26 crores for FY2021-22 audit proceedings. Company plans to appeal, expects no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1765799888380,
            "Source": "stocks"
        },
        {
            "Title": "Transworld Shipping Lines Reports Q2 Loss as Revenue and EBITDA Decline",
            "Summary": "Transworld Shipping Lines reported a net loss of 92 million rupees in Q2, compared to a profit of 213 million rupees in the same quarter last year. The company's revenue fell to 981 million rupees from 1.25 billion rupees year-over-year. EBITDA dropped significantly to 157 million rupees from 485 million rupees, while EBITDA margin compressed to 15.96% from 38.86% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762875859036,
            "Source": "earnings"
        },
        {
            "Title": "Transworld Shipping Lines Vessel SSL Brahmaputra Cleared to Sail After Gujarat High Court Release Order",
            "Summary": "Transworld Shipping Lines Limited received an oral release order from the Gujarat High Court on September 15, 2025, allowing their vessel SSL Brahmaputra to sail from Mundra Port. The vessel was detained following a fire incident on January 1, 2024, which resulted in multiple legal claims against the company. The latest case involves total damage to containerized cargo belonging to Fair Exports (India) Private Limited due to power outage caused by the fire. The company must submit a bank guarantee or cash security of INR 1.71 crore by October 13, 2025. Transworld expects no financial liability from potential cargo claims as the vessel is adequately insured, and the liability insurers will address the security amount.",
            "Sentiment": "positive",
            "PublishDate": 1758020667029,
            "Source": "stock"
        },
        {
            "Title": "Transworld Shipping's Vessel SSL Brahmaputra Arrested by Gujarat High Court Over Fire-Related Cargo Claim",
            "Summary": "The Gujarat High Court issued an arrest order for Transworld Shipping Lines' vessel SSL Brahmaputra on September 12, 2025, following a plea by Fair Exports (India) Private Limited. The claim relates to cargo damage from a fire incident that occurred on the vessel on January 1, 2024, which caused power outage and total damage to containerized cargo. Fair Exports is seeking INR 1.71 crore (excluding interest) in damages. This marks the seventh case against the company related to the same fire incident, with six previous cases already pending in courts. The vessel operates under a long-term charter with Avana Logistek Limited and is insured with International Group of Protection and Indemnity Club for third-party liability including cargo claims. Transworld Shipping expects no financial liability as the matter will be handled by the vessel's liability insurers.",
            "Sentiment": "negative",
            "PublishDate": 1757764283336,
            "Source": "stock"
        },
        {
            "Title": "Transworld Shipping Lines Receives Clearance for SSL Sabarimalai Vessel Departure from Haldia Port",
            "Summary": "Transworld Shipping Lines has obtained clearance for its vessel SSL Sabarimalai to depart from Haldia Port. The clearance allows the shipping company's vessel to proceed with its departure from the port facility.",
            "Sentiment": "positive",
            "PublishDate": 1757039920055,
            "Source": "stock"
        },
        {
            "Title": "Transworld Shipping Lines Vessel SSL Sabarimalai Resumes Operations After MMD Clearance",
            "Summary": "Transworld Shipping Lines' vessel SSL Sabarimalai has been cleared by MMD Kolkata and has resumed operations following a 15-day off-hire period. The vessel is now back in service after receiving the necessary regulatory clearance.",
            "Sentiment": "positive",
            "PublishDate": 1756819168558,
            "Source": "stock"
        },
        {
            "Title": "Transworld Shipping Lines Shareholders Approve All Resolutions at 37th AGM Including 15% Dividend",
            "Summary": "Transworld Shipping Lines Limited held its 37th Annual General Meeting on August 22, 2025, where shareholders approved all agenda items with requisite majority. The approved resolutions included adoption of audited standalone and consolidated financial statements for the year ended March 31, 2025, re-appointment of Mr. Ritesh Sivaswamy Ramakrishnan as Non-Executive, Non-Independent Director, and declaration of 15% dividend at Rs. 1.50 per equity share with face value of Rs. 10 each. Under special business, shareholders approved re-appointment of two Non-Executive Independent Directors - Mr. Ajit George Paul and Mr. Ratnagiri Sivaram Krishnan, along with appointment of Mr. B Durgaprasad Rai as Secretarial Auditor. The meeting was conducted through video conferencing with 43 shareholders attending virtually. Total voting participation reached 70.43% of outstanding shares, with all resolutions receiving 100% approval except for one resolution which received 99.89% support.",
            "Sentiment": "positive",
            "PublishDate": 1755946045394,
            "Source": "corporate_action"
        },
        {
            "Title": "Transworld Shipping Lines' Vessel SSL Sabarimalai Detained at Haldia Port",
            "Summary": "Transworld Shipping Lines Limited disclosed that their vessel SSL Sabarimalai has been detained by the Mercantile Marine Department at Haldia Port on August 13, 2025. The Principal Officer of MMD Kolkata issued a provisional detention order under Flag State Inspection, citing certain deficiencies under the Indian Merchant Shipping Act, 1958. The company is evaluating the deficiencies and assessing the impact of the detention order on its operations.",
            "Sentiment": "negative",
            "PublishDate": 1755096912080,
            "Source": "stock"
        },
        {
            "Title": "Transworld Shipping Lines Reports Loss in Q1 FY26, Announces Strategic Acquisitions and Joint Venture",
            "Summary": "Transworld Shipping Lines Limited reported a consolidated net loss of Rs. 781 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs. 197 lakhs in the same quarter last year. Revenue remained flat at Rs. 9,489 lakhs versus Rs. 9,390 lakhs year-on-year. The company's Board approved the acquisition of 100% stakes in Transworld Integrated Logistek Private Limited for Rs. 39.70 crores and Transworld Logistics Private Limited for Rs. 2.25 crores, making them wholly owned subsidiaries. Additionally, the Board approved a joint venture with Bainbridge Navigation DMCC in the UAE, where Transworld will hold a 60% stake with an investment not exceeding Rs. 75 lakhs. The joint venture will focus on establishing a shipping pool company for the Handysize vessel segment in the dry bulk shipping market. All transactions are expected to be completed by December 31, 2025. The company operates a fleet of 12 vessels comprising 10 container feeder vessels and 2 dry bulk vessels.",
            "Sentiment": "negative",
            "PublishDate": 1755013145082,
            "Source": "earnings"
        },
        {
            "Title": "Transworld Shipping Lines Forms Joint Venture With Bainbridge In UAE",
            "Summary": "Transworld Shipping Lines has established a joint venture partnership with Bainbridge in the UAE. The collaboration represents an expansion of business operations in the United Arab Emirates market.",
            "Sentiment": "positive",
            "PublishDate": 1755009779894,
            "Source": "order&deals"
        },
        {
            "Title": "Transworld Shipping Lines Recommends Dividend",
            "Summary": "Transworld Shipping Lines, also known as Shreyas Shipping and Logistics, has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748354158000,
            "Source": "result"
        }
    ]
}