{
    "Symbol": "TRAVELFOOD",
    "ISIN": "INE103V01028",
    "News": [
        {
            "Title": "Travel Food Services Board Meet on Feb 12 for Q3 Results",
            "Summary": "Travel Food Services Limited has scheduled a board meeting on February 12, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770300091158,
            "Source": "co_actions_results"
        },
        {
            "Title": "Travel Food Services shares worth ₹10,029 cr unlock",
            "Summary": "87.2 million shares of Travel Food Services become eligible for trading as lock-in period expires, representing 66% of outstanding equity valued at ₹10,029 crore based on Friday's closing price.",
            "Sentiment": "neutral",
            "PublishDate": 1768180550202,
            "Source": "stocks"
        },
        {
            "Title": "TFS Delhi T3 Signs Licensing Deal With DIAL",
            "Summary": "Travel Food Services has entered into a licensing agreement with Delhi International Airport Limited for operations at Delhi T3 terminal, marking a strategic expansion in airport food services.",
            "Sentiment": "positive",
            "PublishDate": 1767961130221,
            "Source": "stocks"
        },
        {
            "Title": "Travel Food Services Extends Delhi Airport License",
            "Summary": "Travel Food Services' subsidiary TFS Delhi T3 extends its license agreement with Delhi International Airport Limited to operate 28 F&B outlets at Terminal 3 until September 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767954643454,
            "Source": "co_actions_results"
        },
        {
            "Title": "Travel Food Services VP-HR Conrad Alves Resigns",
            "Summary": "Travel Food Services Limited announces resignation of Vice President-Human Resources Conrad Alves, effective March 13, 2026, as he pursues career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1766312702231,
            "Source": "stocks"
        },
        {
            "Title": "Travel Food Services faces ₹40.20 cr tax demand",
            "Summary": "Travel Food Services receives tax demand of ₹13.40 cr plus ₹26.80 cr penalty from CGST authorities over alleged ITC mismatches. Company plans to file appeal citing strong case merits.",
            "Sentiment": "negative",
            "PublishDate": 1766233535617,
            "Source": "stocks"
        },
        {
            "Title": "CBI Files FIR Against Travel Food Services' Former Subsidiaries Over Airport Contract Irregularities",
            "Summary": "The Central Bureau of Investigation has filed an FIR alleging irregularities in the 2012-2013 tender processes for food and beverage contracts at Chennai and Kolkata airports, naming two former subsidiaries of Travel Food Services Limited that merged with the company in September 2024. The investigation involves certain entities and government officials regarding the master concessionaire contracts for these airports.",
            "Sentiment": "negative",
            "PublishDate": 1765098420814,
            "Source": "stock"
        },
        {
            "Title": "Travel Food Services Reports 18.4% System-Wide Sales Growth Despite Passenger Traffic Decline in Q2 FY26",
            "Summary": "Travel Food Services achieved system-wide sales of INR 7.3 billion with 18.4% year-on-year growth and consolidated PAT of INR 979 million (15.3% growth) in Q2 FY26, despite a 3.5% decline in passenger traffic at consolidated airports due to India-Pakistan conflict and reduced flight schedules. The company expanded to over 500 outlets and lounges system-wide, secured new contracts at Cochin International Airport and Delhi Terminal 2, and expects performance to benefit from recovering passenger traffic trends in the seasonally stronger second half.",
            "Sentiment": "positive",
            "PublishDate": 1763623019224,
            "Source": "earnings"
        },
        {
            "Title": "Travel Food Services Reports 18.4% System-Wide Sales Growth and 15.3% PAT Increase in Q2FY26",
            "Summary": "Travel Food Services Limited reported strong quarterly results with system-wide sales growing 18.4% year-over-year in Q2FY26 and 22.4% in H1FY26. Consolidated PAT increased 15.3% to Rs. 979 million in Q2FY26 and 17.2% to Rs. 1,929 million in H1FY26 on an adjusted basis. The company now operates 500 Travel QSR outlets and lounges system-wide as of September 30, 2025. Like-for-like sales growth of 9.2% in Q2FY26 was achieved despite passenger traffic declining marginally by 1% due to reduced flight schedules following additional maintenance and safety procedures after an aircraft accident in Ahmedabad. The company won new FRB concessions at Cochin Airport domestic terminal and Delhi IGI Airport Terminal 2. Travel Food Services maintains a debt-free position with cash balance of Rs. 7,490 million. The company expanded its brand portfolio to 135 brands and operates 464 Travel QSR outlets and 37 lounges across domestic and international airports. Managing Director Varun Kapur noted the company crossed the 500-outlet milestone and successfully enabled a new technology platform for direct integration with banks and card networks for lounge access.",
            "Sentiment": "positive",
            "PublishDate": 1762998788371,
            "Source": "earnings"
        },
        {
            "Title": "Travel Food Services Reports Mixed Q2 Results with Revenue Decline but Improved Margins",
            "Summary": "Travel Food Services reported Q2 consolidated net profit of 957.7 million rupees, down from 1.07 billion rupees in the same period last year. Revenue fell to 3.56 billion rupees from 5 billion rupees year-over-year. EBITDA decreased to 1.35 billion rupees from 1.6 billion rupees. However, EBITDA margin improved to 37.99% compared to 31.96% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762958905943,
            "Source": "earnings"
        },
        {
            "Title": "Travel Food Services Subsidiary Secures 3-Year License for 14 F&B Outlets at Delhi Airport Terminal 2",
            "Summary": "TFS Gurgaon Airport Services Private Limited, a wholly-owned subsidiary of Travel Food Services Limited, has entered into a License Agreement with Delhi International Airport Limited. The agreement, dated October 3rd, 2025, grants TFS Gurgaon the rights to design, develop, set up, operate, manage and maintain 14 Food & Beverage outlets at Terminal 2 of Indira Gandhi International Airport, New Delhi. The license has been granted for a term of 3 years and includes payment of license fees, minimum guarantee amount and other related charges as per the agreement terms. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1760094531843,
            "Source": "order&deals"
        },
        {
            "Title": "Travel Food Services Shareholders Approve Articles of Association Amendments Granting Director Nomination Rights",
            "Summary": "Travel Food Services Limited shareholders approved amendments to the company's Articles of Association through a special resolution passed via postal ballot on September 24, 2025, with results declared on September 26, 2025. The amendments add Articles 104A and 104B, granting SSP Asia Pacific Holdings Limited and Kapur Family Trust the right to nominate up to two directors each to the board. These nomination rights are tied to shareholding thresholds - each entity can nominate one director if their shareholding falls below 20% but remains above 10%, and loses nomination rights entirely if shareholding drops below 10%. The nomination rights also extend to board committees, subject to compliance with applicable laws and listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758889913613,
            "Source": "corporate_governance"
        },
        {
            "Title": "Travel Food Services Limited Incorporates Step-Down Subsidiary in Indonesia",
            "Summary": "Travel Food Services Limited established PT Travel Food Services Indonesia as a step-down subsidiary in South Jakarta, Indonesia on September 23, 2025. The new entity was incorporated by Travel Food Services Worldwide – FZCO, a wholly owned subsidiary of the company. PT Travel Food Services Indonesia has an authorized capital of IDR 10 billion divided into 10,000 shares with a nominal value of IDR 1 million each. Travel Food Services Worldwide – FZCO will hold 99.99% of the share capital, with remaining shareholdings as per Indonesian law requirements. The subsidiary was established to explore opportunities for operating outlets at travel locations in Indonesia. Share subscription has not yet been completed and will be done according to local Indonesian requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758797237643,
            "Source": "corporate_action"
        },
        {
            "Title": "Travel Food Services Secures 5-Year Operating License at Cochin Airport",
            "Summary": "Travel Food Services has been awarded a license to operate at Cochin Airport for a period of 5 years. The license includes an option for extension by an additional 2 years.",
            "Sentiment": "positive",
            "PublishDate": 1757895099445,
            "Source": "stock"
        },
        {
            "Title": "Travel Food Services Wins 5-Year License to Operate F&B Outlets at Cochin International Airport",
            "Summary": "Travel Food Services Limited has been awarded a license by Cochin International Airport Limited to set up, operate, maintain, and manage food and beverage outlets, lounge, and bar in the security hold area of Domestic Terminal (T1). The license is granted for 5 years, extendable by another 2 years. TFS will operate 12 units comprising 11 Travel QSR outlets and 1 lounge. Cochin International Airport is the 8th busiest airport in India, handling more than 11 million passengers in FY2024-25. With this contract, TFS increases its presence to 14 of the 15 largest airports in India. The company operates 454 Travel QSRs and 37 lounges at a system-wide level across India, Malaysia and Hong Kong.",
            "Sentiment": "positive",
            "PublishDate": 1757593115949,
            "Source": "order&deals"
        },
        {
            "Title": "Travel Food Services Terminates Lounge Access Agreement with Dreamfolks Services",
            "Summary": "Travel Food Services Limited has issued a notice to terminate its extended arrangement with Dreamfolks Services Limited for providing lounge access services, effective September 15, 2025. The original Lounge Services Agreement was executed on July 1, 2024, with an effective date of April 1, 2024, and was extended beyond its March 31, 2025 expiry date. Dreamfolks acted as an aggregator for banks and networks in relation to lounge access services for various lounges operated by Travel Food Services. The termination follows unsuccessful attempts to re-negotiate commercial terms. Travel Food Services, through its wholly owned subsidiary Eliteassist Technology and Services Private Limited, has initiated direct engagements with banks and networks. The company states the termination will not impact its business operations and will enable it to enhance service efficiency for customers.",
            "Sentiment": "neutral",
            "PublishDate": 1756991576161,
            "Source": "stock"
        },
        {
            "Title": "Travel Food Services Reports 26.7% Growth in System-Wide Sales for Q1 FY2026",
            "Summary": "Travel Food Services Limited reported strong quarterly results with system-wide sales reaching INR 7.15 billion, marking a 26.7% year-over-year increase. The company's consolidated revenue grew 6.3% to INR 3.75 billion, while consolidated profit after tax rose 19.3% to INR 950 million. EBITDA margin improved by approximately 400 basis points year-over-year to the 38-39% range, and gross margin increased to 83%. The company operates 454 travel QSR outlets and 37 lounges, holding 26% market share in travel QSR and 45% in airport lounges. Travel Food Services opened new brand partnerships including Nando's at Delhi T3 and announced upcoming Gordon Ramsay concepts. The company expanded internationally with new lounges in Malaysia and Hong Kong. Management expects to mobilize 50+ new units in FY26 and anticipates air passenger traffic to normalize by the end of the first half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755596861230,
            "Source": "earnings"
        },
        {
            "Title": "Travel Food Services Partners with Gordon Ramsay to Launch Street Burger at Delhi Airport",
            "Summary": "Travel Food Services has partnered with celebrity chef Gordon Ramsay to open Street Burger at IGI Airport Terminal 1 in Delhi. This marks the first Gordon Ramsay restaurant in India. The restaurant's menu includes local flavors alongside signature dishes.",
            "Sentiment": "positive",
            "PublishDate": 1755504519699,
            "Source": "stock"
        },
        {
            "Title": "Travel Food Services Board Approves Articles of Association Changes to Grant Promoter Nomination Rights",
            "Summary": "Travel Food Services Limited's Board of Directors approved alterations to the Articles of Association on August 11, 2025, granting nomination rights to promoters SSP Asia Pacific Holdings Limited and the Kapur Family Trust. These rights allow them to appoint directors and observers to the Board based on their respective shareholding in the company. The changes require shareholder approval through a postal ballot. The postal ballot will also seek approval for ratification of the Travel Food Services Employee Stock Option Plan 2024 and extending its benefits to employees of the company, subsidiary, associate, or holding companies. The postal ballot notice will be published and communicated in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1754935687248,
            "Source": "corporate_action"
        },
        {
            "Title": "Travel Food Services Reports 10.7% Revenue Growth in Q1 FY2026 Quarterly Results",
            "Summary": "Travel Food Services Limited reported quarterly results for the period ended June 30, 2025. On a standalone basis, the company recorded revenue from operations of Rs 3,130.02 million compared to Rs 2,985.51 million in the same quarter last year, representing growth of 4.8%. Profit after tax increased to Rs 810.96 million from Rs 685.42 million year-over-year. On a consolidated basis, revenue from operations reached Rs 3,750.54 million versus Rs 4,098.64 million in the prior year quarter, while consolidated profit after tax grew to Rs 949.63 million from Rs 595.46 million. The company's earnings per share on a standalone basis was Rs 6.16 compared to Rs 5.21 in the same quarter last year. The company completed its IPO of 18,182,802 equity shares at Rs 1,100 per share, with shares listed on NSE and BSE on July 14, 2025. During the quarter, the company granted 284,522 stock options to employees under its Employee Stock Plan 2024.",
            "Sentiment": "positive",
            "PublishDate": 1754908982690,
            "Source": "earnings"
        },
        {
            "Title": "Travel Food Services: IPO Debuts with 2% Premium on Stock Exchanges",
            "Summary": "Travel Food Services Ltd. listed at Rs 1,125 on NSE and Rs 1,126 on BSE, a 2% premium over its IPO price of Rs 1,100. The IPO, consisting of an OFS of Rs 2,000 crore, was subscribed 2.88 times overall, with strong interest from QIBs.",
            "Sentiment": "positive",
            "PublishDate": 1752467675000,
            "Source": "normal_news"
        }
    ]
}