{
    "Symbol": "TREEHOUSE",
    "ISIN": "INE040M01013",
    "News": [
        {
            "Title": "Tree House Education Seeks Shareholder Approval for MD",
            "Summary": "Tree House Education & Accessories Ltd. issues postal ballot notice for re-appointment of Managing Director Rajesh Doulatram Bhatia for 3-year term with ₹84 lakh annual remuneration. E-voting period: Jan 22-Feb 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768826726129,
            "Source": "stocks"
        },
        {
            "Title": "TreeHouse Education Settles Arbitration Dispute with Vidya Bharti Samiti",
            "Summary": "TreeHouse Education Accessories Limited resolved an arbitration dispute with Vidya Bharti Samiti through consent terms dated September 30, 2025, receiving Rs. 11 lakh settlement payment while agreeing to waive Rs. 80.97 lakh in bad debts. The company will recover its Rs. 29 crore refundable deposit over 30 years as per the arbitral award dated December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765364681573,
            "Source": "stock"
        },
        {
            "Title": "TreeHouse Education Accessories Promoter Acquires Additional 1.05% Stake",
            "Summary": "Abhishek Bhatia, a promoter group member of TreeHouse Education Accessories Ltd, acquired 4,46,250 equity shares (1.05%) through open market transactions between December 1-2, 2025. The acquisition increased the promoter group's total shareholding from 22.49% to 23.54% in the educational accessories company.",
            "Sentiment": "positive",
            "PublishDate": 1764762643211,
            "Source": "corporate_action"
        },
        {
            "Title": "TreeHouse Education Accessories Settles Arbitration Dispute for Rs 3 Crore",
            "Summary": "TreeHouse Education Accessories Limited and Janodhar Shikshan Prasarak Mandal have amicably settled their arbitration dispute through consent terms at Bombay High Court for Rs 3,00,00,000. The settlement includes immediate payments of Rs 2,50,00,000 and two post-dated cheques of Rs 25,00,000 each due in April and September 2026, with the company recovering an outstanding refundable deposit without impact on profit/loss.",
            "Sentiment": "positive",
            "PublishDate": 1764160849998,
            "Source": "stock"
        },
        {
            "Title": "TreeHouse Education Reports Mixed Quarterly Results, Appoints New Company Secretary",
            "Summary": "TreeHouse Education Accessories Limited announced unaudited financial results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 106 lakhs for the quarter, compared to Rs 250 lakhs in the same period last year. The company posted a net loss of Rs 10 lakhs for the current quarter versus a loss of Rs 70 lakhs in the previous year's corresponding quarter. For the half-year period, revenue stood at Rs 427 lakhs compared to Rs 714 lakhs in the previous year. The Board approved the appointment of Ms. Raksha Mahesh Jain as Company Secretary and Compliance Officer effective November 11, 2025. She is an Associate Member of Institute of Company Secretaries of India with experience in corporate law, governance and compliance functions. The company operates in the educational services segment and has entered into a new partnership with Aaviv Tutorials for coaching class services with an investment of Rs 51,000. The company has also entered into settlement terms with educational institute Vidya Bharti Samiti, pending final approval of the Sole Arbitrator.",
            "Sentiment": "neutral",
            "PublishDate": 1762906685583,
            "Source": "earnings"
        },
        {
            "Title": "Tree House Education Invests Rs. 51,000 for 51% Stake in AAVIV TUTORIALS",
            "Summary": "Tree House Education & Accessories Limited has invested Rs. 51,000 to acquire a 51% stake in partnership firm AAVIV TUTORIALS through cash consideration. The target entity operates in the education coaching and tuition industry, which aligns with Tree House Education's main business line. AAVIV TUTORIALS was incorporated on September 5, 2025, with the primary objective of providing coaching and tutorial services to students. The acquisition does not fall under related party transactions as no promoter or group companies have interest in the acquired entity. The company expects to complete the acquisition within 30 days of disclosure and aims to expand its business in educational coaching and tuition services. No governmental or regulatory approvals are required for this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1757068729693,
            "Source": "corporate_action"
        }
    ]
}