{
    "Symbol": "TREJHARA",
    "ISIN": "INE00CA01015",
    "News": [
        {
            "Title": "Trejhara Solutions Reports Share Acquisition Post-Merger",
            "Summary": "Trejhara Solutions Limited discloses acquisition of 55,46,022 shares (23.59%) by three entities following merger with LP Logistics Plus Chemical SCM Private Limited under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770352064368,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trejhara Solutions clarifies EGM terminology",
            "Summary": "Trejhara Solutions Limited issues clarification on terminology change in EGM explanatory statement following stock exchange directives, replacing 'Subscription Shares' with 'Specified Securities'.",
            "Sentiment": "neutral",
            "PublishDate": 1769396899195,
            "Source": "stocks"
        },
        {
            "Title": "Trejhara Solutions Shareholders Approve Share Capital Increase and Preferential Allotment Resolutions",
            "Summary": "Trejhara Solutions Limited shareholders approved three key resolutions at their Extra-Ordinary General Meeting held on December 03, 2025, including increasing authorized share capital and issuing equity shares on preferential basis. All three resolutions passed with 99.99% approval through e-voting, with 5 members casting 781,802 votes for the ordinary resolution and varying vote counts for the special resolutions on preferential allotments.",
            "Sentiment": "positive",
            "PublishDate": 1764848722219,
            "Source": "corporate_action"
        },
        {
            "Title": "Trejhara Solutions Approves $9.5 Million Acquisition of LP Logistics",
            "Summary": "Trejhara Solutions has approved the purchase of LP Logistics for $9.5 million. The acquisition represents a strategic expansion move by Trejhara Solutions into the logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1764601012837,
            "Source": "order&deals"
        },
        {
            "Title": "Trejhara Solutions Issues Corrigendum for Preferential Share Issue EGM",
            "Summary": "Trejhara Solutions Limited issued a corrigendum modifying the explanatory statement for its December 3, 2025 EGM regarding the preferential issue of 6,11,112 equity shares and 79,97,000 convertible warrants at INR 216 per share. The amendments include detailed fund utilization plans totaling INR 75.93 crores for strategic acquisitions, capital expenditure, working capital, and general corporate purposes, along with updated allottee information and lock-in provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1764066246646,
            "Source": "corporate_action"
        },
        {
            "Title": "Trejhara Solutions Reports Strong Q2 Performance with 31% Revenue Growth and Completes Major Merger",
            "Summary": "Trejhara Solutions Limited posted consolidated revenue of INR 3,392.81 lakhs for Q2 FY2025, up from INR 2,578.15 lakhs in Q2 FY2024, with profit after tax rising to INR 447.97 lakhs from INR 92.54 lakhs. The company completed its merger with LP Logistics Plus Chemical SCM Private Limited and approved issuance of 6.11 lakh equity shares and 79.97 lakh warrants at INR 216 per share on preferential basis.",
            "Sentiment": "positive",
            "PublishDate": 1763173798560,
            "Source": "earnings"
        },
        {
            "Title": "Trejhara Solutions Shareholders Approve Director Re-appointment and Related Party Transactions via Postal Ballot",
            "Summary": "Trejhara Solutions Limited announced the results of its postal ballot voting process. Shareholders approved two key resolutions: the re-appointment of Mr. Tushar Ranpara as an Independent Director for a second consecutive five-year term, which received 99.01% approval, and the approval of related party transactions, which garnered 97.89% support. The e-voting process was conducted through NSDL from October 9 to November 7, 2025, with the cut-off date set as October 3, 2025. The postal ballot notice was dispatched electronically to shareholders on October 8, 2025. CS Harshvardhan Tarkas served as the scrutinizer for the voting process and confirmed that both resolutions were passed with the requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1762897908860,
            "Source": "corporate_action"
        },
        {
            "Title": "Trejhara Solutions Allots 89.89 Lakh Shares via Amalgamation, Proposes Rs 186 Crore Preferential Issue",
            "Summary": "Trejhara Solutions Limited's Board approved the allotment of 89,89,344 equity shares to shareholders of LP Logistics Plus Chemical SCM Private Limited through an approved amalgamation scheme in a 2:1 ratio. The company's paid-up share capital increased to Rs 23.51 crore comprising 2.35 crore shares. The authorized share capital was raised from Rs 15.50 crore to Rs 35 crore to accommodate future capital requirements. The Board approved a preferential issue comprising 6,11,112 equity shares at Rs 216 per share worth Rs 13.20 crore and 79,97,000 convertible warrants at Rs 216 per warrant totaling Rs 172.74 crore. The warrants are convertible within 18 months with 25% payment at allotment and 75% on conversion. An Extra-Ordinary General Meeting is scheduled for December 3, 2025, to seek shareholder approval for the capital increase and preferential issue.",
            "Sentiment": "positive",
            "PublishDate": 1762382180904,
            "Source": "corporate_action"
        },
        {
            "Title": "Trejhara Solutions Sets Record Date for LP Logistics Plus Chemical SCM Merger",
            "Summary": "Trejhara Solutions Limited has fixed November 04, 2025 as the record date for its merger with LP Logistics Plus Chemical SCM Private Limited. Under the approved scheme, shareholders of LP Logistics Plus Chemical SCM will receive 2 fully paid-up equity shares of Trejhara Solutions (face value Rs. 10 each) for every 1 share held in the transferor company. The new shares will be listed on BSE Limited and National Stock Exchange of India Limited, subject to regulatory approvals. The merger committee meeting was held on October 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761228803855,
            "Source": "corporate_action"
        },
        {
            "Title": "Trejhara Solutions Completes Merger with LP Logistics Plus Chemical SCM, Authorized Capital Rises to Rs. 20.50 Crores",
            "Summary": "Trejhara Solutions Limited completed its merger with LP Logistics Plus Chemical SCM Private Limited. The National Company Law Tribunal Mumbai Bench sanctioned the amalgamation scheme on October 14, 2025, with the merger becoming effective on October 16, 2025. The appointed date for the scheme is April 1, 2024. Following the merger, Trejhara Solutions' authorized share capital increased to Rs. 20.50 crores, divided into 2.05 crore equity shares of Rs. 10 each. The certified copy of the NCLT order was filed with the Registrar of Companies Mumbai by both companies on October 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760799924467,
            "Source": "corporate_action"
        },
        {
            "Title": "Trejhara Solutions Receives NCLT Approval for Amalgamation with LP Logistics Plus Chemical SCM",
            "Summary": "Trejhara Solutions Limited has received approval from the National Company Law Tribunal (NCLT) Mumbai Bench for its amalgamation with LP Logistics Plus Chemical SCM Private Limited. The NCLT order was dated October 14, 2025, with the appointed date set as April 1, 2024. The scheme was approved by equity shareholders and unsecured creditors with requisite majority in meetings held on February 4, 2025. The amalgamation aims to diversify market presence and product offerings in the logistics sector, enhance cross-selling capabilities, and achieve greater financial strength through integration of operations. LP Logistics, incorporated in 2018, operates as a freight forwarding company, while Trejhara Solutions, incorporated in 2017 and listed on BSE and NSE, provides logistics solutions including warehousing, freight forwarding, and IT consulting services. The tribunal dismissed an objection filed by minority shareholder Weld & Fasteners (India) Pvt. Ltd., holding 0.34% shares, for not meeting the 10% threshold requirement and imposed a cost of Rs. 2,00,000 for abuse of legal process. The Regional Director and Official Liquidator expressed no objections to the scheme.",
            "Sentiment": "positive",
            "PublishDate": 1760510510991,
            "Source": "corporate_action"
        },
        {
            "Title": "Trejhara Solutions Reports 27% Decline in Quarterly Profit Despite Revenue Growth",
            "Summary": "Trejhara Solutions Limited reported consolidated revenue from operations of Rs. 864.65 lakhs for the quarter ended June 30, 2025, compared to Rs. 604.76 lakhs in the same period last year. However, profit after tax declined to Rs. 67.03 lakhs from Rs. 91.42 lakhs year-over-year. On a standalone basis, revenue increased to Rs. 583.28 lakhs from Rs. 328.30 lakhs, while profit after tax decreased to Rs. 25.62 lakhs from Rs. 36.30 lakhs. The company operates primarily in software consultancy and license services. Employee benefits expense rose significantly to Rs. 321.02 lakhs in consolidated results compared to Rs. 293.12 lakhs in the previous year. The company is proceeding with a scheme of amalgamation with LP Logistics Plus Chemical SCM Private Limited, which has been approved by shareholders and creditors and is currently pending before the National Company Law Tribunal.",
            "Sentiment": "neutral",
            "PublishDate": 1754997440862,
            "Source": "earnings"
        }
    ]
}