{
    "Symbol": "TREL",
    "ISIN": "INE0O3901029",
    "News": [
        {
            "Title": "Transindia Real Estate Q3 Profit Rises 24% YoY",
            "Summary": "Transindia Real Estate reported Q3 consolidated net profit of ₹109 million, up 24% from ₹88 million last year, though revenue declined 10% to ₹211 million from ₹234 million in the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1769784186465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Transindia Real Estate Reports Mixed Quarterly Results Amid Income Tax Investigation",
            "Summary": "Transindia Real Estate Limited announced its quarterly results for the quarter and six months ended September 30, 2025. The company reported total income of Rs. 25.26 crores for the quarter, compared to Rs. 26.83 crores in the same period last year. Profit after tax from continuing operations was Rs. 8.70 crores for the quarter. The company operates in two main segments: Logistics Park and commercial properties, and Equipment Hiring (Non-crane). The auditors highlighted an ongoing Income Tax Authority search operation at the company's office, certain subsidiaries, and key managerial personnel premises. The company received a notice under Section 158BC of the Income-tax Act, 1961, requiring it to file a return before November 18, 2025. Management is processing the response and does not expect material adjustments to the financial results. The Board has also approved the merger of wholly-owned subsidiary Madanahatti Logistics and Industrial Parks Private Limited with the parent company, with the next hearing scheduled for November 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762868798920,
            "Source": "earnings"
        },
        {
            "Title": "Transindia Real Estate Board Approves Merger with Subsidiary, Appoints Ram Walase as Executive Director",
            "Summary": "Transindia Real Estate Limited's Board approved a merger scheme with its wholly-owned subsidiary Madanahatti Logistics and Industrial Parks Private Limited, subject to regulatory approvals including National Company Law Tribunal approval. The company reported quarterly results for the period ended June 30, 2025, with standalone profit after tax of Rs 742 lakhs compared to Rs 1,549 lakhs in the same quarter last year. The Board appointed Ram Walase, the company's Chief Executive Officer, as Additional Director and Executive Director for a 3-year term starting August 7, 2025. Other key appointments include M/s. AVS & Associates as Secretarial Auditor for five years (2025-26 to 2029-30), Sourav Dasgupta as Chief Information Officer, and Vishal Maheshwari as Senior General Manager. The company operates in logistics parks, commercial properties, and equipment hiring segments, with consolidated revenue of Rs 2,096 lakhs for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754568966847,
            "Source": "corporate_action"
        },
        {
            "Title": "Transindia Real Estate Board Approves Quarterly Results, Subsidiary Merger, and Key Executive Appointments",
            "Summary": "Transindia Real Estate Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing standalone profit after tax of Rs 742 lakhs compared to Rs 82 lakhs in the previous quarter. The company reported total income of Rs 2,005 lakhs for the quarter. The Board also approved a merger scheme with wholly-owned subsidiary Madanahatti Logistics and Industrial Parks Private Limited, subject to regulatory approvals including National Company Law Tribunal. Key appointments include Ram Walase as Additional Director and Executive Director for three years, M/s. AVS & Associates as Secretarial Auditor for five years, Sourav Dasgupta as Chief Information Officer, and Vishal Maheshwari as Senior General Manager. The auditor's report noted a search operation by Income Tax Authorities at company offices and subsidiaries, with no communication received regarding investigation findings.",
            "Sentiment": "positive",
            "PublishDate": 1754566483168,
            "Source": "earnings"
        },
        {
            "Title": "TransIndia Real Estate Reports Q4 Financial Results",
            "Summary": "TransIndia Real Estate has reported its Q4 consolidated net profit at 325 million rupees, compared to 1.59 billion rupees year-over-year and 88 million rupees quarter-over-quarter. The company's Q4 revenue stood at 205 million rupees, slightly up from 201 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747321471000,
            "Source": "result"
        },
        {
            "Title": "TransIndia Real Estate Reports Q3 EBITDA and Margin",
            "Summary": "TransIndia Real Estate announced its Q3 financial results. The company reported an EBITDA of 152 million rupees, slightly down from 154 million rupees in the same quarter last year. However, the EBITDA margin improved to 65% from 60.40% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738242448000,
            "Source": "earnings"
        },
        {
            "Title": "TransIndia Real Estate Reports Q3 Financial Results",
            "Summary": "TransIndia Real Estate has announced its Q3 consolidated financial results. The company reported a net profit of 88 million rupees, up from 68.2 million rupees year-over-year and 66 million rupees quarter-over-quarter. However, revenue for Q3 decreased to 234 million rupees from 256 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738242407000,
            "Source": "earnings"
        }
    ]
}