{
    "Symbol": "TRENT",
    "ISIN": "INE849A01020",
    "News": [
        {
            "Title": "Trent's Wesness Fun Run Mumbai Draws 3,500+ Women",
            "Summary": "Trent Limited's Wesness hosted its fifth Fun Run edition in Mumbai with over 4,000 registrations and 3,500+ participants, marking the largest gathering for the women-only wellness community.",
            "Sentiment": "positive",
            "PublishDate": 1770826926173,
            "Source": "stocks"
        },
        {
            "Title": "Trent Q3 FY26 Results: Revenue Up 16% to ₹5,259 Cr",
            "Summary": "Trent Limited reports strong Q3 FY26 performance with revenue rising 16% YoY to ₹5,259.46 crore and net profit growing 36% to ₹639.71 crore, despite exceptional charges of ₹25.79 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770204233610,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trent Subsidiary Amalgamation Gets NCLT Approval",
            "Summary": "Trent Limited announces completion of amalgamation between step-down subsidiary THPL Support Services Limited and Booker India Limited, effective February 1, 2026, following NCLT approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769928527304,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trent Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "Trent Limited has scheduled its board meeting for February 4, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from Dec 25, 2025 to Feb 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768370572240,
            "Source": "co_actions_results"
        },
        {
            "Title": "Macquarie Sets ₹4,900 Target for Trent with Buy Rating",
            "Summary": "Macquarie initiates coverage on Trent with Buy rating and ₹4,900 target price, citing 21% upside potential. Brokerage views current weakness as cyclical buying opportunity driven by temporary factors.",
            "Sentiment": "positive",
            "PublishDate": 1768279820790,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Cuts Trent Target Price to ₹4,900",
            "Summary": "Macquarie maintains Outperform rating on Trent while reducing target price to ₹4,900, reflecting revised valuation expectations for the retail chain operator.",
            "Sentiment": "neutral",
            "PublishDate": 1768189415663,
            "Source": "stocks"
        },
        {
            "Title": "Trent Plans High Store Density in Mature Markets",
            "Summary": "Tata-owned Trent focuses on store portfolio growth and optimization as CEO P Venkatesalu outlines strategy for selective density increases across key markets amid gradual consumer sentiment recovery.",
            "Sentiment": "positive",
            "PublishDate": 1768180235105,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Cuts Trent Target Price by 18% to ₹4,900",
            "Summary": "Despite reducing target price from ₹6,000 to ₹4,900, Macquarie maintains Outperform rating on Trent, citing cyclical slowdown with recovery expected in H2 CY26.",
            "Sentiment": "neutral",
            "PublishDate": 1768017955098,
            "Source": "stocks"
        },
        {
            "Title": "Trent Q3 Revenue Growth Declines 17% YoY",
            "Summary": "Trent's Q3FY26 standalone revenue declined 17% year-on-year, missing analyst expectations amid continued store-level cannibalization despite 28% increase in store count with 65 new store additions.",
            "Sentiment": "negative",
            "PublishDate": 1767946527902,
            "Source": "stocks"
        },
        {
            "Title": "Retail sector faces mixed fortunes amid competition",
            "Summary": "Trent shares fall 8% on slower growth outlook while DMart shows stability. Nykaa and Jubilant FoodWorks emerge as preferred bets in discretionary space according to analyst review.",
            "Sentiment": "neutral",
            "PublishDate": 1767787166291,
            "Source": "stocks"
        },
        {
            "Title": "Trent shares fall 10% in two sessions, near 52-week low",
            "Summary": "Trent shares declined 10% over two sessions after Q3 revenue growth of 17% missed management's 25% guidance. Stock trades below ₹4,000, near 52-week low of ₹3,933.",
            "Sentiment": "negative",
            "PublishDate": 1767744970979,
            "Source": "stocks"
        },
        {
            "Title": "Trent shares fall 8% despite strong Q3 revenue growth",
            "Summary": "Trent led Nifty 50 losers with over 8% decline despite reporting 17% revenue growth in Q3. Market faced broad selloff with Sensex down 400+ points on profit-booking and global concerns.",
            "Sentiment": "negative",
            "PublishDate": 1767685821781,
            "Source": "stocks"
        },
        {
            "Title": "Trent Ltd. Sees ₹21.00 Cr NSE Block Trade",
            "Summary": "Trent Ltd. recorded a new block trade on NSE worth ₹21.00 crores involving 51,971 shares at ₹4,040.80 per share, indicating continued institutional activity in the retail sector stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767672505525,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trent Shares Crash 8% Despite 17% Q3 Revenue Growth",
            "Summary": "Trent shares plunged 8.3% wiping out ₹13,000 crore market value despite 17% Q3 revenue growth to ₹5,220 crores. Investors concerned over weakening same-store sales and declining revenue per square foot.",
            "Sentiment": "negative",
            "PublishDate": 1767619499518,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trent Clarifies Share Volume Movement to Exchanges",
            "Summary": "Trent Limited responds to BSE inquiry on recent share volume movement, confirming all material information disclosed per regulations with no undisclosed developments affecting performance.",
            "Sentiment": "neutral",
            "PublishDate": 1767605068837,
            "Source": "stocks"
        },
        {
            "Title": "Trent Gets Low ESG Risk Rating of 17.8 from Morningstar",
            "Summary": "Trent Limited receives Environmental, Social and Governance risk rating of 17.8 from Morningstar Sustainalytics, placing the retail company in the Low Risk category as of December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766148597564,
            "Source": "stocks"
        },
        {
            "Title": "Trent Insider Files Trading Plan for 6,000 Shares",
            "Summary": "Rajnikant A. Shah, Strategic Properties-Advisor at Trent Limited, has filed a trading plan to sell 6,000 equity shares between May 5-8, 2026, following SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765378508033,
            "Source": "stocks"
        },
        {
            "Title": "NCLT Approves Merger of Trent's Subsidiaries Fiora Hypermarket and Fiora Online",
            "Summary": "The National Company Law Tribunal has approved the merger of Trent's two subsidiaries, Fiora Hypermarket and Fiora Online, with the scheme set to become effective on December 1, 2025. This corporate restructuring will consolidate Trent's retail operations under a unified entity, potentially streamlining business operations and improving operational efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1764600477511,
            "Source": "corporate_action"
        },
        {
            "Title": "Trent Ltd. Sees Rs. 53.05 Crore Block Trade on NSE",
            "Summary": "Trent Ltd. witnessed a block trade worth Rs. 53.05 crores involving approximately 123,201 shares executed at Rs. 4,306.20 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the retail company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764131074679,
            "Source": "order&deals"
        },
        {
            "Title": "Trent Limited Sells Stake in Associate Company ITRIPL Through Buyback for Rs 146.35 Crore",
            "Summary": "Trent Limited sold 94,900 equity shares in associate company Inditex Trent Retail India Private Limited (ITRIPL) through a buyback offer at Rs 15,421.85 per share, receiving Rs 146.35 crore consideration. Following the transaction, Trent's shareholding in ITRIPL has reduced to 20%, with ITRIPL contributing 5.72% to consolidated income and 4.22% to net worth in the previous financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1763718632602,
            "Source": "corporate_action"
        },
        {
            "Title": "Trent Stock Falls 50% from October Highs as Growth Momentum Slows, Analyst Confidence Erodes",
            "Summary": "Trent shares closed at ₹4,283.70, down 7.4% and marking their lowest level since April 2024. The stock has declined nearly 50% from October 2024 highs and is down 40% year-to-date. Analyst sentiment has deteriorated significantly - while all 11 analysts rated it 'Buy' in July 2019, currently only 16 of 27 analysts recommend purchase, with 6 issuing 'Sell' ratings. Revenue growth has moderated over three quarters due to high base effect and softening discretionary spending. For September 2025 quarter, net profit rose 6.5% to ₹451 crore while revenue increased 17.1% to ₹4,036 crore - the slowest growth since March 2021. Like-for-like growth in fashion portfolio was limited to low single digits amid rising competition. Beauty, personal care, innerwear and footwear segments contributed 21% of revenues, while online sales grew 56% and account for over 6% of Westside revenues. Citi downgraded the stock from Buy to Sell, citing concerns about growth acceleration needed to sustain valuation multiples.",
            "Sentiment": "negative",
            "PublishDate": 1762786814912,
            "Source": "stock"
        },
        {
            "Title": "Trent Ltd. Sees Rs. 129.40 Crore Block Trade on NSE",
            "Summary": "Trent Ltd. recorded a block trade worth Rs. 129.40 crores on the National Stock Exchange. The transaction involved approximately 302,474 shares executed at a price of Rs. 4,278.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762758235152,
            "Source": "order&deals"
        },
        {
            "Title": "Trent Shares Drop 6.5% as Revenue Growth Misses Guidance, Jefferies Cuts Target Price",
            "Summary": "Trent shares declined 6.50% following softer revenue growth in the second quarter. The company reported 17% revenue growth, below its guided range of 20-25%. Growth deceleration continued due to expansion into tier-2 markets and new store formats requiring longer gestation periods. Muted consumer sentiment and unseasonal rains also impacted sales. Star Bazaar revenue declined 2% year-on-year due to ongoing store upgrades. Trent announced it will sell approximately 15% of its Zara India stake for Rs 150 crore, reducing its holding to 20%. Jefferies lowered its target price to Rs 5,000 from Rs 6,000, citing continued growth deceleration in the fashion segment. Like-for-like growth in fashion categories remained in low single digits, though non-apparel categories performed well and online sales gained share for Westside. The stock has fallen 30.94% in the last 12 months and 38.93% year-to-date. Among 27 analysts, 16 maintain 'buy' ratings, five recommend 'hold,' and six suggest 'sell.'",
            "Sentiment": "negative",
            "PublishDate": 1762748297433,
            "Source": "stock"
        },
        {
            "Title": "Trent Reports 11% Net Profit Growth in Q2 with Revenue Up 16% YoY",
            "Summary": "Trent Ltd posted consolidated net profit of Rs 377 crore for Q2, representing 11% year-on-year growth. Revenue increased 16% YoY to Rs 4,818 crore, though declined sequentially from Rs 4,883 crore in the June quarter. Total income including other sources reached Rs 4,845 crore, up 15% YoY. Total expenses rose to Rs 4,367 crore from Rs 3,915 crore in the same quarter last year. Operating profit before exceptional items increased to Rs 478 crore compared to Rs 461 crore in the prior year period, but dropped from Rs 555 crore in Q1 due to seasonal factors. For the first half, consolidated revenue surged 18% YoY to Rs 9,701 crore while net profit rose 21% to Rs 798 crore from Rs 662 crore. The company reported consistent growth across retail formats driven by momentum in affordable fashion and lifestyle segments. The board approved a proposal to tender its entire 94,900 equity shares stake in joint venture Inditex Trent Retail India as part of a proposed share buyback plan.",
            "Sentiment": "positive",
            "PublishDate": 1762743454782,
            "Source": "earnings"
        },
        {
            "Title": "Trent Reports Q2 Net Profit of 4.5 Billion Rupees, Beats Estimates",
            "Summary": "Trent reported quarterly net profit of 4.5 billion rupees, up from 4.23 billion rupees year-over-year and above the estimated 4.32 billion rupees. Revenue reached 47.24 billion rupees compared to 40.36 billion rupees in the previous year, slightly below the estimate of 47.62 billion rupees. EBITDA increased to 8.13 billion rupees from 6.43 billion rupees year-over-year, surpassing the estimated 7.67 billion rupees. EBITDA margin improved to 17.21% from 15.94% in the same period last year, exceeding the estimated 16.1%.",
            "Sentiment": "positive",
            "PublishDate": 1762733520686,
            "Source": "earnings"
        },
        {
            "Title": "Trent Limited Reports 17% Revenue Growth and Launches New Brand Burnt Toast",
            "Summary": "Trent Limited announced its quarterly results for the quarter and half-year ended September 30, 2025, showing revenue growth of 17% and operating profit growth of 16%. The company launched a new youth-focused fashion brand called Burnt Toast, featuring bold apparel and accessories with positive initial customer response. Trent now operates over 1,000 large-box fashion stores across 251 cities. During the quarter, the company opened 19 Westside and 44 Zudio stores (including 1 in UAE) while consolidating 6 Westside and 4 Zudio stores. As of September 30, the store portfolio included 261 Westside stores, 806 Zudio stores (including 3 in UAE), and 34 stores across other lifestyle concepts, with a total footprint of over 14 million square feet. Operating EBIT margin for the quarter was 10.2% compared to 11.0% in the previous year. The Star business consists of 77 stores with 3 store additions and 4 closures during the half-year. Chairman Noel N Tata noted steady performance during the quarter and emphasized focus on portfolio growth and enhancing customer experience.",
            "Sentiment": "positive",
            "PublishDate": 1762567773984,
            "Source": "earnings"
        },
        {
            "Title": "Trent Opens 200+ Stores Across Zara, Westside, and Zudio Brands in FY25",
            "Summary": "Trent opened over 200 stores across its Zara, Westside, and Zudio brands in FY25 as part of its aggressive expansion strategy. The company targets 25-30% annual growth by penetrating Tier 2-3 cities. Trent is focusing on increasing private label mix, supply chain digitization, and improving store productivity. The retailer aims to enhance profit margins through omni-channel integration and back-end efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1762527758843,
            "Source": "stock"
        },
        {
            "Title": "Trent Reports 11.3% Profit Growth and 16% Revenue Increase in Q2",
            "Summary": "Trent Ltd reported net profit of ₹373 crore, up 11.3% from ₹335 crore in the same period last year. Revenue increased 15.9% to ₹4,817 crore compared to ₹4,156 crore previously. The growth was driven by strong performance across flagship retail brands Westside and Zudio. EBITDA rose 26.5% to ₹816.9 crore from ₹645.9 crore, with operating margin improving to 17% from 15.5%. Trent shares closed 1.3% lower at ₹4,618.50 ahead of the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1762515943331,
            "Source": "earnings"
        },
        {
            "Title": "Trent Reports Q2 Net Profit of 4.5 Billion Rupees, Beats Estimates",
            "Summary": "Trent reported quarterly net profit of 4.5 billion rupees compared to 4.23 billion rupees year-over-year, exceeding estimates of 4.32 billion rupees. Revenue reached 47.24 billion rupees versus 40.36 billion rupees in the previous year, slightly below estimates of 47.62 billion rupees. EBITDA grew to 8.13 billion rupees from 6.43 billion rupees year-over-year, surpassing estimates of 7.67 billion rupees. EBITDA margin improved to 17.21% from 15.94% in the previous year, beating estimates of 16.1%.",
            "Sentiment": "positive",
            "PublishDate": 1762514867009,
            "Source": "earnings"
        },
        {
            "Title": "Trent Q2 Preview: Revenue Growth Expected at 17-21% YoY Driven by Store Expansion",
            "Summary": "Trent will announce its September quarter earnings on Friday. Four brokerages estimate revenue growth of 17-21% YoY, ranging from Rs 4,722 crore to Rs 5,016 crore, driven by store expansion across Zudio and Westside formats. Net profit growth estimates vary widely between 3% and 33% YoY. The company added 31 Zudio and 6 Westside stores during the quarter. EBITDA is projected to grow 21-32% YoY, with margins expected around 16.5-17.5%. Operating performance is expected to remain firm with scale efficiencies and RFID-led cost savings. Margins may face pressure from higher Zudio mix and festive seasonality. Key focus areas include management commentary on demand trends, same-store sales growth guidance, and store expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1762424982212,
            "Source": "earnings"
        },
        {
            "Title": "Radhakishan Damani Exits Decade-Long Stake in Trent as Stock Faces 36% Decline",
            "Summary": "Radhakishan Damani has exited his stake in Trent, with his holding through Derive Trading and Resorts Private Limited dropping below 1% in the September 2025 quarter from 1.2% in June. Damani initially acquired a 2.74% stake around 2010 in the Tata Group retail company. Trent has delivered strong financial performance with sales growing from Rs 3,486 crore in FY20 to Rs 17,135 crore in FY25 at 38% CAGR, while net profit jumped from Rs 106 crore to Rs 1,534 crore at 67% CAGR. The stock surged over 650% from Rs 635 in October 2020 to Rs 4,788.55 as of October 24, 2025, but has declined 36% from its October 2024 peak near Rs 7,500. Trent trades at 108 times earnings versus industry median of 42 times, with a price-to-book ratio of 31.2 times. The company operates retail brands including Westside, Zudio, Star, and Landmark, and is valued at Rs 1.70 lakh crore.",
            "Sentiment": "neutral",
            "PublishDate": 1761478213873,
            "Source": "stock"
        },
        {
            "Title": "Trent Ltd. Sees Rs. 81.55 Crore Block Trade on NSE",
            "Summary": "Trent Ltd. witnessed a block trade worth Rs. 81.55 crores on the National Stock Exchange. The transaction involved approximately 171,411 shares executed at a price of Rs. 4,757.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1760595032126,
            "Source": "order&deals"
        },
        {
            "Title": "Westside Expands Lab-Grown Diamond Business With 20 Stores to Target Gen Z Fashion Trends",
            "Summary": "Trent Ltd.-operated apparel retailer Westside is expanding its lab-grown diamond business as a fashion proposition to capitalize on growing consumer trends. The company operates 20 lab diamond stores within its Westside portfolio and launched products online ahead of Diwali. Westside COO Shailina Parti emphasized the company views this as a fashion business rather than fine jewelry, targeting younger consumers driving demand growth. Lab-grown diamonds serve as a cheaper alternative to natural diamonds, with India's lab-grown diamond exports tripling between 2019 and 2022. Westside operates 261 stores and opened 13 new locations in the latest quarter. The company plans to increase online sales contribution to 20% over the next 2-3 years from the current 7-10%, implementing AI to accelerate processes and leveraging its supply chain capabilities to bring products to market within weeks.",
            "Sentiment": "positive",
            "PublishDate": 1760508938810,
            "Source": "stock"
        },
        {
            "Title": "Trent Schedules Quarterly Results Review for November 7",
            "Summary": "Trent has announced plans to review its quarterly results on November 7. The company will be examining its financial performance during this scheduled review session.",
            "Sentiment": "neutral",
            "PublishDate": 1760508478695,
            "Source": "earnings"
        },
        {
            "Title": "Trent Reports Minor Business Slowdown After GST Changes",
            "Summary": "Trent has reported experiencing a minor slowdown in its business operations following changes to GST regulations. The retail company has indicated that these tax policy modifications have had a measurable impact on its performance.",
            "Sentiment": "negative",
            "PublishDate": 1760503753200,
            "Source": "stock"
        },
        {
            "Title": "Trent Reports 17% Revenue Growth to ₹5,002 Crores in Q2FY26",
            "Summary": "Trent reported a 17% increase in revenue to ₹5,002 crores in Q2FY26. For the first half of FY26, the company's revenue grew by 19% to ₹10,063 crores. The retailer's store count reached 1,101 stores, which includes 3 stores in the UAE.",
            "Sentiment": "positive",
            "PublishDate": 1759743855639,
            "Source": "earnings"
        },
        {
            "Title": "Trent Stock Falls 33% Year-to-Date Despite Analyst Optimism on Growth Prospects",
            "Summary": "Trent has become the worst performer in the Nifty 50 this year, declining 33% year-to-date and 43% since joining the benchmark index. The stock's growth has slowed from 50% to 20% over the last four quarters due to densification leading to cannibalization, consumer slowdown, and high base effects. Trading at a PE of 83x, valuations remain elevated despite falling from 101x at the start of 2025. Foreign institutional investor holdings have decreased from 24.4% in March 2023 to 18.4% by June 2025. However, 17 of 26 analysts maintain Buy ratings with an average return potential of 27%, citing expectations of 20-25% sales CAGR and margin expansion. Operationally, Trent maintains revenue per sq ft above ₹15,000, operating cash flows grew from Rs. 455 crore in FY23 to over Rs. 1,120 crore in FY25, and ROCE improved from 9% in 2022 to 31% in 2025. Zudio has become India's first $1 billion apparel label with 2.5% market share, leaving room for expansion compared to international peers.",
            "Sentiment": "neutral",
            "PublishDate": 1759235357377,
            "Source": "stock"
        },
        {
            "Title": "Trent Ltd. Sees Rs. 75.81 Crore Block Trade on NSE",
            "Summary": "Trent Ltd. witnessed a block trade worth Rs. 75.81 crores on the National Stock Exchange. The transaction involved approximately 157,812 shares executed at a price of Rs. 4,804.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758781507289,
            "Source": "order&deals"
        },
        {
            "Title": "Trent Ltd. Sees Rs. 99.42 Crore Block Trade on NSE",
            "Summary": "Trent Ltd. recorded a block trade worth Rs. 99.42 crores on the National Stock Exchange. The transaction involved approximately 203,738 shares at a price of Rs. 4,880.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758604187727,
            "Source": "order&deals"
        },
        {
            "Title": "Trent's Westside Launches Game-Changer Program for Fashion Creators, Partners with NIFT",
            "Summary": "Trent's Westside has launched the Young New Game-Changer Program designed to support future fashion creators. The company is partnering with NIFT (National Institute of Fashion Technology) to revamp its brands Bombay Paisley and ETA. The initiative featured an event showcasing bold collections inspired by Gen Z fashion trends.",
            "Sentiment": "positive",
            "PublishDate": 1757651174990,
            "Source": "stock"
        },
        {
            "Title": "Trent Limited Incorporates New Step-Down Subsidiary Netria Property Holdings Limited",
            "Summary": "Trent Limited announced the incorporation of Netria Property Holdings Limited as a step-down wholly owned subsidiary through its subsidiary Nahar Retail Trading Services Limited on September 4, 2025. The new entity has an authorized share capital of ₹5 lakh divided into 50,000 equity shares of ₹10 each, with a paid-up capital of ₹1 lakh comprising 10,000 equity shares. Netria Property Holdings Limited will focus on investing and deploying funds in real estate activities including acquisition, purchase, development, construction, leasing, and sale of real estate properties. Nahar Retail Trading Services Limited holds 100% shareholding in the new subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1756991144829,
            "Source": "corporate_action"
        },
        {
            "Title": "Trent Limited Launches New Fashion Brand 'Burnt Toast' with First Store in Bangalore",
            "Summary": "Trent Limited launched its new fashion brand 'Burnt Toast' with the opening of its first store in Bangalore. The 2,500 sq. ft. store is located at MM Complex, No. 23, 100 Feet Ring Road, Banashankari. The brand targets the youth fashion segment with affordable, trend-forward pieces designed for fashion-conscious consumers. Managing Director P. Venkatesalu stated that Bangalore's dynamic youth culture makes it an ideal location for the brand's debut. The store features signature bestsellers, seasonal collections, and statement pieces with striking interiors designed to create a vibrant community atmosphere. Burnt Toast offers a range of apparel and accessories catering to various preferences and budgets, positioning itself as both a fashion label and cultural movement. The company has plans to expand the brand across more cities.",
            "Sentiment": "positive",
            "PublishDate": 1754906778620,
            "Source": "stock"
        },
        {
            "Title": "Trent Launches Youth-Focused Fashion Brand Burnt Toast with First Store in Bangalore",
            "Summary": "Trent has launched a new fashion brand called Burnt Toast that targets young consumers. The company has opened the first store for this brand in Bangalore.",
            "Sentiment": "positive",
            "PublishDate": 1754635656662,
            "Source": "stock"
        },
        {
            "Title": "Trent Reports 24% Profit Growth, Beats Analyst Estimates",
            "Summary": "Trent Ltd. reported a 24% increase in standalone net profit to Rs 422.59 crore in the first quarter, exceeding analyst expectations of Rs 389.50 crore. The Tata Group fashion retailer's revenue grew 19.8% to Rs 4,781.25 crore, slightly below the estimated Rs 4,848.10 crore. EBITDA surged 37% to Rs 837.73 crore, significantly above the Rs 741.50 crore estimate. The company's margin expanded to 17.5% from 15.3% in the previous year, outperforming the estimated 15.29%.",
            "Sentiment": "positive",
            "PublishDate": 1754485874367,
            "Source": "earnings"
        },
        {
            "Title": "Trent Reports Strong Q1 Results with EBITDA Rising to 8.48B Rupees",
            "Summary": "Trent delivered robust quarterly performance with EBITDA reaching 8.48 billion rupees, significantly higher than the previous year's 6.12 billion rupees and surpassing estimates of 5.6 billion rupees. The company's EBITDA margin expanded to 17.36% from 14.94% year-over-year, also beating the estimated 11%. Consolidated net profit grew to 4.29 billion rupees from 3.92 billion rupees, exceeding expectations of 2.88 billion rupees. Revenue came in at 48.83 billion rupees compared to 41 billion rupees in the prior year, though slightly below the estimated 50.61 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1754482934587,
            "Source": "earnings"
        },
        {
            "Title": "Trent Stock Down 36% from Peak Ahead of Q1 Earnings; Analysts See Mixed Outlook",
            "Summary": "Trent shares have declined 36% from their 52-week high of Rs 8,345 and are currently in oversold territory ahead of quarterly earnings. The stock has shown negative returns over one year but gained 6% in the past week. Technical analysts suggest buying opportunities around Rs 5,000-5,100 with targets of Rs 5,800-6,000. The stock trades below its 50-day and 200-day moving averages of Rs 5,584 and Rs 5,879 respectively. For quarterly results, brokerages expect strong revenue growth up to 36% driven by store expansion, particularly Zudio format stores. However, EBITDA margins are likely to contract due to soft same-store sales growth, cost inflation, and competitive pressures. Analysts are divided on profit expectations, with two out of four estimates indicating a decline in profit after tax while others forecast low single-digit growth. Brokerage recommendations vary, with PhillipCapital maintaining a negative view, Motilal Oswal giving a Buy rating with Rs 6,600 target, and Kotak Institutional Equities suggesting Reduce with Rs 5,300 target.",
            "Sentiment": "neutral",
            "PublishDate": 1754466393676,
            "Source": "stock"
        },
        {
            "Title": "Trent Ltd. Executes Rs. 27.68 Crore Block Trade on NSE",
            "Summary": "Trent Ltd. completed a block trade on the National Stock Exchange worth Rs. 27.68 crores. The transaction involved approximately 51,729 shares at a price of Rs. 5,350 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754459951018,
            "Source": "order&deals"
        },
        {
            "Title": "Trent Stock Rises 6% Ahead of Quarterly Results Despite Margin Pressure Expectations",
            "Summary": "Trent Ltd. shares gained 6% over three sessions before reporting quarterly results. The company's standalone revenue grew 20% year-on-year to ₹5,061 crore for the quarter. This growth rate falls short of Trent's historical 35% CAGR, with management indicating 25% revenue CAGR would be sustainable - a statement that previously led to a 12% stock decline. The company expanded by adding one Westside store and 11 Zudio stores during the quarter. Analyst expectations suggest EBITDA may grow 17% to ₹717 crore, but margins could narrow 70 basis points to 14.2%. Net profit is expected to decline 6.5% to ₹365 crore. Trent shares closed 1.3% higher at ₹5,320, though remain down 4% over the past month and 25% year-to-date. The stock trades at 82 times financial year 2027 earnings despite a 36% correction from its 52-week high.",
            "Sentiment": "neutral",
            "PublishDate": 1754437783217,
            "Source": "earnings"
        },
        {
            "Title": "Trent to Announce Q1 FY26 Results on August 6",
            "Summary": "Trent Ltd., the retail arm of the Tata Group, will announce its Q1 FY26 financial results for the quarter ended June 30, 2025, on Wednesday, August 6. The company's Board of Directors will consider and approve both standalone and consolidated unaudited financial results during the meeting. The trading window for designated persons has been closed since June 24 and will remain closed until August 8, reopening on August 9. In Q4 FY25, Trent reported a 29% year-on-year increase in standalone revenue to Rs 4,106 crore, with Ebitda growing 38% to Rs 656 crore and margins improving to 16%. However, net profit declined 47% to Rs 350 crore. Trent operates across multiple segments including fashion apparel, footwear, and accessories. The stock has gained 5.02% in the last five trading sessions but declined 25.72% year-to-date, with shares trading at Rs 5,250 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754367359568,
            "Source": "earnings"
        },
        {
            "Title": "Trent and TCS Lead Nifty Declines with Over 25% Losses in 2025",
            "Summary": "Trent and TCS have emerged as the worst-performing Nifty50 stocks in 2025, with TCS down around 25% and Trent falling nearly 30% year-to-date. TCS faces sector-wide challenges including weaker US client spending, macroeconomic uncertainties, and AI transformation pressures. The company announced layoffs of approximately 12,000 employees and reported revenue that missed consensus estimates, falling 3.3% quarter-on-quarter in constant currency terms. Deal wins totaled $9.4 billion with no mega deals included. Multiple brokerages have downgraded TCS, with Nomura cutting EPS estimates and lowering target price to Rs 3,780. Trent's standalone revenue growth slowed to 20% in Q1 FY26, significantly below its five-year CAGR of 35%. The company guided for around 20% growth in its core fashion business, falling short of its previous 25%+ growth aspirations. Supply chain disruptions from Bangladesh and soft demand environment contributed to the slowdown. Nuvama downgraded Trent to 'HOLD' and cut target price to Rs 5,884, while HSBC maintained 'Buy' but reduced target to Rs 6,600.",
            "Sentiment": "negative",
            "PublishDate": 1753761248769,
            "Source": "stock"
        }
    ]
}