{
    "Symbol": "TRF",
    "ISIN": "INE391D01019",
    "News": [
        {
            "Title": "TRF Limited Reports Strong Q3 FY26 Performance",
            "Summary": "TRF Limited delivered impressive Q3 FY26 results with standalone net profit of ₹1,169.20 lakhs, driven by exceptional items and operational improvements across both business segments.",
            "Sentiment": "positive",
            "PublishDate": 1769688005380,
            "Source": "co_actions_results"
        },
        {
            "Title": "TRF Limited Receives Tax Demand Order Worth ₹283.35 Lakh",
            "Summary": "TRF Limited disclosed receiving a demand order from Odisha State Tax Officer for alleged suppression of taxable turnover during 2021-22, imposing tax, interest and penalty totaling ₹283.35 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1767177077052,
            "Source": "stocks"
        },
        {
            "Title": "TRF Limited Appoints New CFO Animesh Upadhyay",
            "Summary": "TRF Limited announces leadership transition with Anand Chand resigning as CFO to pursue opportunities within Tata Steel Group, replaced by Animesh Upadhyay effective December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765456854420,
            "Source": "stocks"
        },
        {
            "Title": "TRF Limited Shareholders Approve Re-appointment of Managing Director Through Postal Ballot",
            "Summary": "TRF Limited shareholders passed a special resolution through remote e-voting to re-appoint Mr. Umesh Kumar Singh as Managing Director for three years from October 1, 2025 to September 30, 2028. The postal ballot conducted from November 1-30, 2025 received overwhelming support with 93.06% votes in favor, ensuring leadership continuity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764592387074,
            "Source": "corporate_action"
        },
        {
            "Title": "TRF Limited Seeks Shareholder Approval for Managing Director Re-appointment via Postal Ballot",
            "Summary": "TRF Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mr. Umesh Kumar Singh as Managing Director for three years from October 1, 2025 to September 30, 2028. Singh, who has over 30 years of experience in the steel industry, was previously appointed as MD from October 1, 2022 through September 30, 2025. The company will conduct remote e-voting from November 1, 2025 at 9:00 AM to November 30, 2025 at 5:00 PM through NSDL platform. Singh is on deputation from Tata Steel Limited with an annual remuneration of ₹1,84,33,785. The company reported a turnover of ₹12,073.48 lakh in FY2024-25 and has shown improvement in business performance with support from Tata Steel.",
            "Sentiment": "neutral",
            "PublishDate": 1761898773758,
            "Source": "corporate_governance"
        },
        {
            "Title": "TRF Limited Reports Net Loss of Rs 666.94 Lakhs in Q2 FY2026 Due to Employee Separation Costs",
            "Summary": "TRF Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported a net loss of Rs 666.94 lakhs compared to a profit of Rs 634.37 lakhs in the previous quarter. Revenue from operations declined to Rs 2,234.06 lakhs from Rs 2,341.74 lakhs in the prior quarter. The loss was primarily attributed to exceptional items worth Rs 1,130.95 lakhs related to an Employee Separation Scheme where 52 employees voluntarily separated from the company effective September 1, 2025. For the six-month period, the company achieved a net profit of Rs 1,033.18 lakhs. The company operates in two business segments: Projects & Services and Products & Services. Basic earnings per share for the quarter was negative Rs 6.06. The Board of Directors approved these audited standalone and unaudited consolidated financial results in their meeting held on October 28, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761640687299,
            "Source": "earnings"
        },
        {
            "Title": "TRF Limited Re-appoints Umesh Kumar Singh as Managing Director for Three Years",
            "Summary": "TRF Limited's Board of Directors unanimously approved the re-appointment of Umesh Kumar Singh as Managing Director and Key Managerial Personnel for a three-year term from October 1, 2025 to September 30, 2028. The decision was made based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Singh's current tenure as Managing Director concludes on September 30, 2025. Singh has over 30 years of experience in procurement management, project management, and supply chain management in the steel industry. He joined TRF Limited as Managing Director on October 1, 2022, after previously serving as Managing Director of Tata Pigments Limited and holding various positions at Tata Steel since 1993. The Board confirmed that Singh has no inter-se relations with other Board members and is not debarred from holding directorship by any regulatory authorities.",
            "Sentiment": "positive",
            "PublishDate": 1756383100741,
            "Source": "corporate_governance"
        },
        {
            "Title": "TRF Reports 15% Decline in Q1 Net Profit Despite Improved EBITDA Margin",
            "Summary": "TRF reported Q1 net profit of 34 million rupees, down from 40 million rupees in the same period last year. Revenue declined significantly to 234 million rupees from 376 million rupees year-over-year. However, the company's EBITDA margin improved to 16.48% from 13.50% in the previous year, while absolute EBITDA decreased to 39 million rupees from 51 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1753704936748,
            "Source": "earnings"
        },
        {
            "Title": "TRF Reports Improved Q4 Financial Results",
            "Summary": "TRF has announced its Q4 financial results, showing significant improvements year-over-year. The company's EBITDA increased to 51 million rupees from 41 million rupees in the previous year, with EBITDA margin expanding to 18.74% from 10.84%. Net profit rose to 69 million rupees from 41 million rupees year-over-year and 104 million rupees quarter-over-quarter. However, revenue decreased to 271 million rupees from 380 million rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746194505000,
            "Source": "result"
        },
        {
            "Title": "TRF Ltd Reports Mixed Q3 Financial Results",
            "Summary": "TRF Ltd has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 115 million rupees, compared to 121 million rupees in the same quarter last year, showing a slight year-over-year decrease. However, the EBITDA margin improved significantly, rising to 49.25% from 42.09% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738242145000,
            "Source": "earnings"
        },
        {
            "Title": "TRF Limited Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "TRF Limited has reported its financial results for the third quarter. The company's net profit decreased to 104 million rupees, down from 189 million rupees year-over-year and 63 million rupees quarter-over-quarter. Revenue also declined to 233 million rupees from 288 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738242073000,
            "Source": "earnings"
        },
        {
            "Title": "TRF Reports Q2 EBITDA of 79M Rupees, Down from 91M YoY",
            "Summary": "TRF has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter is 79 million rupees, compared to 91 million rupees in the same quarter last year. Despite the decrease in EBITDA, the EBITDA margin has improved to 24.13% from 23.20% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729687897000,
            "Source": "result"
        },
        {
            "Title": "TRF Reports Significant Decline in Q2 Net Profit",
            "Summary": "TRF Limited has reported a substantial decrease in its second quarter net profit, which fell to 63 million rupees from 165 million rupees year-over-year. The company also experienced a decline in revenue, dropping to 327 million rupees from 393 million rupees in the same quarter last year. Sequentially, the net profit increased from 40 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729687808000,
            "Source": "result"
        }
    ]
}