{
    "Symbol": "TRIDENT",
    "ISIN": "INE064C01022",
    "News": [
        {
            "Title": "Trident Limited CSA Score Jumps 16 Points to 72",
            "Summary": "Trident Limited achieves S&P Global CSA Score of 72, marking a significant 16-point increase from previous year. Environment score improved by 23 points to 76, reflecting strong sustainability commitment.",
            "Sentiment": "positive",
            "PublishDate": 1770735548490,
            "Source": "stocks"
        },
        {
            "Title": "Trident Limited Approves New Subsidiary & Divestment",
            "Summary": "Trident Limited's board approved incorporation of new wholly owned subsidiary Trident Global Industries Limited for overseas market expansion and disinvestment of MYTRIDENT.COM LIMITED for INR 1,00,000.",
            "Sentiment": "positive",
            "PublishDate": 1770633166144,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trident Board Meeting Set for Q3FY26 Results",
            "Summary": "Trident Limited schedules board meeting on February 09, 2026 to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769573117589,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trident Realty launches ₹1,200-cr township in Panipat",
            "Summary": "Trident Realty announces Trident Parktown, a 125-acre integrated township in Panipat with ₹1,200 crore investment, featuring 400+ residential plots as developers expand beyond metros to tier-2 cities.",
            "Sentiment": "positive",
            "PublishDate": 1768794698452,
            "Source": "stocks"
        },
        {
            "Title": "Trident Acquires Mytrident.com as Subsidiary",
            "Summary": "Trident has completed the acquisition of Mytrident.com Limited as a domestic wholly owned subsidiary, expanding its corporate structure through strategic investment.",
            "Sentiment": "positive",
            "PublishDate": 1767882670587,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trident Completes MYTRIDENT.COM Acquisition",
            "Summary": "Trident Limited successfully acquired MYTRIDENT.COM LIMITED as its domestic wholly owned subsidiary on January 08, 2026, following board approval received on January 06, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767880198490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trident Acquires MyTrident.com for ₹1 Lakh",
            "Summary": "Trident Limited's board approves acquisition of MyTrident.com Limited as wholly owned subsidiary for ₹1.00 lakh to enhance brand presence and marketing in overseas markets, particularly the US.",
            "Sentiment": "positive",
            "PublishDate": 1767709252171,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trident CFO Rahul Roongta Resigns Effective Jan 2026",
            "Summary": "Trident Limited announces resignation of Group Chief Financial Officer Mr. Rahul Roongta effective January 02, 2026, citing personal reasons in his resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1767358738023,
            "Source": "stocks"
        },
        {
            "Title": "Trident Lifeline Acquires 9.04% Stake in Trident Mediquip",
            "Summary": "Trident Lifeline has acquired an additional 9.04% stake in Trident Mediquip for approximately ₹44.20 million, strengthening its position in the medical equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1767274914321,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trident Group Announces ₹2,000 Crore Expansion Plan for Punjab",
            "Summary": "Trident Group outlined a ₹2,000 crore investment strategy for Punjab, with ₹1,500 crore allocated to Barnala for scaling Terry Towel production and modernizing paper manufacturing facilities, and ₹500 crore for establishing a corporate office and capacity-building center in Mohali. The expansion is expected to generate 2,000 employment opportunities, focusing on engaging semi-skilled rural women and advancing women's empowerment across the textile and paper manufacturer's operations.",
            "Sentiment": "positive",
            "PublishDate": 1763714745241,
            "Source": "stock"
        },
        {
            "Title": "Trident Announces Multi-Segment Expansion Strategy With 20% Capacity Increase",
            "Summary": "Trident outlined growth plans across home textiles, paper, and energy segments, expanding terry towel and bed linen capacity by 20% to meet export demand while diversifying into hygiene and sustainable paper products. The company is investing in renewable power integration to reduce energy costs and targets mid-teen revenue CAGR with margin expansion through operational efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1763135358530,
            "Source": "stock"
        },
        {
            "Title": "Trident Limited Reports Quarterly Results with Income Tax Search Proceedings Update",
            "Summary": "Trident Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board meeting was held on November 13, 2025, where directors approved the standalone and consolidated financial results. The company's auditors issued a limited review report with an emphasis of matter regarding an income tax search conducted by the Income Tax Department at certain company locations including manufacturing facilities and Indian subsidiaries. During the quarter ended September 30, 2025, Trident invested INR 2,500 million in Trident Global Corp Limited (TGCL) through a fresh equity issue, acquiring a 30.42% stake, making TGCL an associate company. The company faces risks from international trade dynamics including recent increases in export duties to the United States, particularly affecting its Towel and Sheeting divisions. Trident is monitoring developments concerning tariff impositions by the US Government on textile imports and engaging with customers through various pricing strategies.",
            "Sentiment": "neutral",
            "PublishDate": 1763029325764,
            "Source": "earnings"
        },
        {
            "Title": "Trident Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA Margin",
            "Summary": "Trident reported Q2 revenue of 17.9 billion rupees, up from 17.1 billion rupees year-over-year. The company's consolidated net profit increased to 909 million rupees from 832 million rupees in the same period last year. However, EBITDA declined to 2.14 billion rupees from 2.2 billion rupees year-over-year, while EBITDA margin compressed to 11.98% from 13.21% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1763027291986,
            "Source": "earnings"
        },
        {
            "Title": "Trident Techlabs Reports Strong H1 Performance with 177% Revenue Growth",
            "Summary": "Trident Techlabs reported net profit of 97 million rupees for H1, compared to 35 million rupees in the same period last year. The company's H1 revenue reached 635 million rupees, significantly higher than 211 million rupees recorded in the previous year's corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1762875979536,
            "Source": "earnings"
        },
        {
            "Title": "Trident Realty Launches 199 Plots in Panchkula Project, Targets Rs 1,200 Crore Revenue",
            "Summary": "Trident Realty launched 199 housing plots for sale in its 'Central Vista' project, part of the 200-acre integrated township 'Trident Hills' in Panchkula. The company expects to generate approximately Rs 1,200 crore in revenue from this luxury housing project. CEO Parvinder Singh stated that over 500 units have already been delivered in this township. The Delhi-NCR-based developer has partnered with DLF Ltd for a residential project in Mumbai. Established in 2008, Trident Realty has delivered over 20.34 million sq ft of residential and commercial space, with another 10.97 million sq ft under construction across residential, retail, and hospitality segments.",
            "Sentiment": "positive",
            "PublishDate": 1762687087541,
            "Source": "stock"
        },
        {
            "Title": "Trident Limited Shareholders Reject Material Related Party Transaction with Trident Global Corp",
            "Summary": "Trident Limited's shareholders voted against an ordinary resolution regarding material related party transactions with Trident Global Corp Limited through a postal ballot process. The voting results showed 2,249 members cast 2,72,44,682 votes (17.87%) in favor of the resolution, while the majority voted against it, leading to the resolution's rejection. The remote e-voting period ran from September 30, 2025, to October 29, 2025. Bhupesh Gupta served as the scrutinizer for the postal ballot process, confirming that the ordinary resolution was not passed by shareholders.",
            "Sentiment": "negative",
            "PublishDate": 1761911889678,
            "Source": "corporate_action"
        },
        {
            "Title": "Trident Gets Relief as GST Authorities Drop ₹518.66 Crore Tax Demand",
            "Summary": "Trident received relief as GST authorities dropped tax demand proceedings worth ₹518.66 crore related to FY 2018-19 and FY 2020-21. The company is no longer facing these specific tax demands from the authorities.",
            "Sentiment": "positive",
            "PublishDate": 1758370517882,
            "Source": "stock"
        },
        {
            "Title": "Trident Limited Acquires 30.42% Stake in Trident Global Corp for INR 250 Crore",
            "Summary": "Trident Limited has invested INR 249,99,99,936 to acquire a 30.42% stake in Trident Global Corp Limited. The company was allotted 2,23,21,428 equity shares of Trident Global Corp on September 09, 2025. This investment was made following board approval for investment of up to INR 250 crore, which was previously communicated on September 02, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757489448781,
            "Source": "order&deals"
        },
        {
            "Title": "Trident Techlabs Forms Strategic Alliance with Kaynes Semicon for Semiconductor Solutions",
            "Summary": "Trident Techlabs has entered into a strategic alliance with Kaynes Semicon Private Limited to provide comprehensive semiconductor solutions. The partnership aims to enhance technology capabilities and support India's semiconductor industry development.",
            "Sentiment": "positive",
            "PublishDate": 1756805078646,
            "Source": "order&deals"
        },
        {
            "Title": "Trident Limited Appoints Two New Independent Directors Including Former Cricket Captain Kapil Dev",
            "Summary": "Trident Limited's Board of Directors has approved the appointment of two new Non-Executive Independent Directors. Mr. Pramod Agrawal, a former IAS officer and ex-Chairman and Managing Director of Coal India Limited, has been appointed for a two-year term from August 9, 2025 to August 8, 2027. Mr. Kapil Dev Nikhanj, the former Indian cricket captain who led India to its first Cricket World Cup victory in 1983, has also been appointed as an Independent Director for the same term. Both appointments are subject to shareholder approval. The appointments were made based on recommendations from the Nomination & Remuneration Committee. Mr. Agrawal currently serves as an Independent Director at Tata Steel Limited, Tata Power Company Limited and Century Plyboards (India) Limited. Mr. Kapil Dev holds directorships in eight companies and has transitioned into entrepreneurship and business roles after his cricket career.",
            "Sentiment": "positive",
            "PublishDate": 1753964103007,
            "Source": "corporate_governance"
        },
        {
            "Title": "Trident Targets Export Growth with 2,300+ Product Registrations and Off-Patent Molecule Entry",
            "Summary": "Trident is pursuing long-term export growth strategy backed by over 2,300 product registrations. The company reports strong profit margins and is entering the off-patent molecules segment. The growth plan involves hybrid manufacturing approach and leveraging deep market reach capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753887935073,
            "Source": "stock"
        },
        {
            "Title": "Trident Targets ₹10,000 Crore Revenue Through Premium Home Textiles and Digital Strategy",
            "Summary": "Trident has set a revenue target of ₹10,000 crore through strategic focus on premium home textiles, online sales expansion, and global branding initiatives. The company plans to leverage artificial intelligence, ESG advantages, and export growth to enhance long-term profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1753458412126,
            "Source": "stock"
        },
        {
            "Title": "Indian Textile Stocks Rally Up to 6% on India-UK FTA Tariff Elimination",
            "Summary": "Indian textile stocks surged up to 6% following the India-UK Free Trade Agreement that eliminated 10-12% tariffs on Indian textile and apparel exports to the UK. Trident led gains with a 6% jump, while SP Apparels, Redtape, and TCNS Clothing each rose around 2%. The agreement removes duties that previously disadvantaged Indian exporters compared to Bangladesh, Pakistan, and Cambodia. India currently exports $1.79 billion worth of textiles to the UK out of total UK textile imports of $26.95 billion, creating significant expansion potential. Analysts project Indian textile exports to the UK could double over the next five to six years with an anticipated 11% CAGR. The textile sector covers 1,143 tariff lines under the zero-duty arrangement, representing 11.7% of the agreement's scope. India expects to capture at least 5% additional UK market share within one to two years. The FTA is projected to boost bilateral trade from $60 billion to $120 billion by 2030, with an estimated $34 billion annual trade increase.",
            "Sentiment": "positive",
            "PublishDate": 1753418797602,
            "Source": "stock"
        },
        {
            "Title": "Trident Shares Worth Rs 10.23 Crore Traded in NSE Block Deal",
            "Summary": "Trident witnessed a block trade on NSE involving approximately 3,119,677 shares valued at Rs 10.23 crore. The shares were traded at Rs 32.79 per share at market opening.",
            "Sentiment": "neutral",
            "PublishDate": 1753415939061,
            "Source": "order&deals"
        },
        {
            "Title": "Trident Limited Reports Strong Q1 Results with 89% Jump in Net Profit, Plans INR 500 Crore Debenture Issue",
            "Summary": "Trident Limited's Board approved quarterly results for the quarter ended June 30, 2025, showing consolidated net profit after tax of INR 1,399.6 million compared to INR 738.9 million in the same quarter last year. Consolidated revenue from operations stood at INR 17,068.9 million versus INR 17,427.1 million in the previous year. The company declared and paid an interim dividend of 50% (INR 0.50 per equity share). The Board also approved raising funds up to INR 500 crore through non-convertible debentures via public or private offering. During the quarter, the company divested its entire shareholding in subsidiary Trident Home Textiles Limited for INR 10.69 million. The auditor's report highlighted an ongoing income tax search under Section 132 of the Income Tax Act conducted in October 2023 at company locations and subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1753355893582,
            "Source": "earnings"
        },
        {
            "Title": "Trident Ltd: Shares Surge 6% on US Tariff Move and Regulatory Update",
            "Summary": "Trident shares rose 6.3% to Rs 33.10 intraday on BSE due to US imposing 35% tariff on Bangladesh textile imports and the company's regulatory compliance update. Trident submitted a certificate under SEBI regulations, confirming dematerialisation data sharing for Q2 2025.",
            "Sentiment": "positive",
            "PublishDate": 1751954621000,
            "Source": "normal_news"
        },
        {
            "Title": "Trident Receives GST Notice for Alleged Tax Issues",
            "Summary": "Trident has received a GST notice alleging tax issues amounting to 518.7 million rupees. The notice pertains to alleged discrepancies in the company's tax filings or payments.",
            "Sentiment": "negative",
            "PublishDate": 1751381202000,
            "Source": "default"
        },
        {
            "Title": "Trident Reduces Net Debt by INR 635 Crore",
            "Summary": "Trident has reported a reduction in its net debt by INR 635 crore in FY25. The company made this announcement, highlighting an improvement in its financial position. No further details about the company's overall financial performance or the reasons for the debt reduction were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747835610000,
            "Source": "default"
        },
        {
            "Title": "Trident Ltd: Net Profit Doubles, Stock Surges 16% on Q4 Results",
            "Summary": "Trident Ltd's Q4 net profit more than doubled to ₹133.2 crore. Revenue increased 11% to ₹1,864.3 crore. EBITDA rose 19.3% to ₹245 crore. Finance costs reduced significantly to ₹2.6 crore. Company declared interim dividend of ₹0.5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747819716000,
            "Source": "earnings"
        },
        {
            "Title": "Trident Reports Improved Q4 Financial Results",
            "Summary": "Trident has announced its Q4 financial results, showing improvements across key metrics. The company's EBITDA increased to 2.45 billion rupees from 2.06 billion rupees year-over-year. EBITDA margin rose to 13.14% from 12.21% in the same period. Revenue grew to 18.6 billion rupees from 16.8 billion rupees year-over-year. Consolidated net profit saw a significant increase, reaching 1.3 billion rupees compared to 566 million rupees in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747818579000,
            "Source": "result"
        },
        {
            "Title": "Trident Ltd: Rs 1,000 Crore Capex Plan, Aims to Triple Domestic Sales by FY27",
            "Summary": "Trident Ltd plans to triple its domestic business by FY27, targeting 50-60% CAGR. The company will invest Rs 1,000 crore in capex for FY25, with Rs 650 crore allocated for sustainability. Trident is launching a luxury segment 'Luxehome' and plans to add 500 premium retail stores this year. The company is also focusing on boosting online sales and sees increased export orders, particularly from the US market.",
            "Sentiment": "positive",
            "PublishDate": 1740057307000,
            "Source": "corporate_action"
        },
        {
            "Title": "Trident Ltd: Q3 Profit Drops 26.7%, Stock Hits Two-Year Low",
            "Summary": "Trident Ltd's Q3 net profit fell 26.7% year-on-year to Rs 80.1 crore. Revenue decreased 9.18% to Rs 1,667 crore. Operating profit declined 21.1% to Rs 206 crore. Share price hit a nearly two-year low, declining 9.85% to Rs 28.00 before recovering slightly.",
            "Sentiment": "negative",
            "PublishDate": 1737956009000,
            "Source": "earnings"
        },
        {
            "Title": "Trident Ltd: Q3 Profit Drops 27%, Revenue Falls 9% Year-on-Year",
            "Summary": "Trident Ltd reported a 26.8% decline in Q3 FY25 net profit to ₹80 crore, down from ₹109 crore last year. Revenue fell 9.2% to ₹1,667 crore. EBITDA decreased 18.8% to ₹213.6 crore, with margins contracting to 12.8% from 14.3%.",
            "Sentiment": "negative",
            "PublishDate": 1737724666000,
            "Source": "earnings"
        },
        {
            "Title": "Trident Group Enterprises Acquires THTL Trading",
            "Summary": "Trident Group Enterprises has acquired THTL Trading for AED 38,500. This acquisition represents a strategic move by Trident Group to expand its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1736860985000,
            "Source": "corporate_action"
        },
        {
            "Title": "Trident Ltd: Share Price Surges on Rs 3,000 Crore Madhya Pradesh Investment Plan",
            "Summary": "Trident Ltd.'s share price rose nearly 6% on Tuesday, following a 14% surge on Monday, after announcing a Rs 3,000 crore investment in Madhya Pradesh's textile sector. The expansion will increase exports and create 3,000 new jobs, with 50% reserved for women.",
            "Sentiment": "positive",
            "PublishDate": 1733809180000,
            "Source": "corporate_action"
        },
        {
            "Title": "Trident Ltd: Share Price Surges on Rs 3,000 Crore Investment Plan in Madhya Pradesh",
            "Summary": "Trident Ltd.'s share price rose 14% intraday after Chairman Rajinder Gupta announced plans to invest an additional Rs 3,000 crore in Madhya Pradesh's textile sector. This investment is expected to increase the company's workforce in the state from 12,000 to over 15,000, with 50% of new jobs for women. The company has already invested Rs 5,000 crore in the state and exports to 122 countries.",
            "Sentiment": "positive",
            "PublishDate": 1733736034000,
            "Source": "corporate_action"
        },
        {
            "Title": "Trident Reports Q2 EBITDA and Margin Decline",
            "Summary": "Trident's Q2 EBITDA decreased to 2.2 billion rupees from 2.4 billion rupees year-over-year. The company's Q2 EBITDA margin also slightly declined to 13.21% from 13.37% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730883787000,
            "Source": "result"
        },
        {
            "Title": "Trident Reports Q2 Revenue Decline",
            "Summary": "Trident, an Indian company, has reported its second quarter revenue for the current fiscal year. The revenue stands at 17.1 billion rupees, which is lower compared to 17.97 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730883740000,
            "Source": "result"
        },
        {
            "Title": "Trident Reports Q2 Net Profit Decline",
            "Summary": "Trident Limited, an Indian textile manufacturing company, reported a consolidated net profit of 832 million rupees for the second quarter, down from 907 million rupees in the same period last year. This represents a year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1730883712000,
            "Source": "result"
        }
    ]
}