{
    "Symbol": "TRIGYN",
    "ISIN": "INE948A01012",
    "News": [
        {
            "Title": "Trigyn Technologies Q3FY26 Results Show Mixed Performance",
            "Summary": "Trigyn Technologies reported consolidated revenue of Rs. 25,803.19 Lakhs for Q3FY26, up from Rs. 24,195.14 Lakhs in Q2FY26. However, quarterly profit declined to Rs. 69.12 Lakhs from Rs. 527.21 Lakhs in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770736325124,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trigyn Technologies CEO Vikram Chandna Steps Down",
            "Summary": "Vikram Chandna ceased to be the Chief Executive Officer of Trigyn Technologies Limited on November 21, 2025, following a mutual understanding between the company and him. The Board of Directors acknowledged his cessation at their meeting and placed on record their appreciation for his services during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1763744737965,
            "Source": "corporate_governance"
        },
        {
            "Title": "Trigyn Technologies Reports Leadership Changes and Q2 FY26 Financial Results",
            "Summary": "Trigyn Technologies' Board approved unaudited financial results for Q2 and H1 FY26 ended September 30, 2025, while accepting Company Secretary Prachi Deshpande's resignation effective November 13, 2025, and appointing Anmol Chaturvedi as her replacement from November 14, 2025. The company posted consolidated net profit of Rs 827.21 lakhs for Q2 FY26 compared to Rs 36.30 lakhs in Q2 FY25, with standalone operations showing a net loss of Rs 149 lakhs for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763062950675,
            "Source": "earnings"
        },
        {
            "Title": "Trigyn Technologies Receives Exchange Approval for 4.5 Lakh Equity Shares Under Employee Stock Option Plan 2025",
            "Summary": "Trigyn Technologies Limited has received in-principle approval from NSE and BSE for listing up to 4,50,000 equity shares of Rs. 10 each under its Employee Stock Option Plan 2025. The approval letters were issued on August 12, 2025, with NSE reference NSE/LIST/49438 and BSE reference DCS/AMAL/RG/IP/3741/2025-26. The exchanges have granted approval for the equity shares to be allotted to employees upon exercise of options, subject to various listing conditions including compliance with SEBI regulations, receipt of statutory approvals, and submission of required documentation. The exchanges reserve the right to withdraw approval if submitted information is found incomplete or misleading.",
            "Sentiment": "positive",
            "PublishDate": 1755008657140,
            "Source": "corporate_action"
        },
        {
            "Title": "Trigyn Technologies Reports Rs 460.86 Crore Loss in Q1 FY26, Appoints New Executive Vice Chair",
            "Summary": "Trigyn Technologies Limited reported a consolidated net loss of Rs 460.86 crore for the quarter ended June 30, 2025, compared to a profit of Rs 761.38 crore in the same quarter last year. Revenue from operations declined to Rs 22,449.99 crore from Rs 24,194.44 crore year-on-year. The company's Board approved the appointment of Mrs. Bhavana Rao Potluri as Executive Vice Chair, transitioning from her role as Executive Director. Her new position will focus on strategic planning, long-term vision, and operational oversight of Indian Government business. The Board also approved the incorporation of a wholly owned subsidiary in Dubai through existing subsidiary TTI. The company faces several ongoing legal challenges including arbitration proceedings with Nashik Municipal Smart City Development Corporation and a GST demand notice of Rs 9.08 crore. Trigyn has not recognized Rs 80 crore in quarterly guaranteed revenue due to collection uncertainties and maintains significant ECL provisions totaling Rs 55.27 crore.",
            "Sentiment": "negative",
            "PublishDate": 1754928361800,
            "Source": "earnings"
        },
        {
            "Title": "Trigyn Technologies: Former Birlasoft Executive Takes Over as CEO",
            "Summary": "Vikram Chandna, former global head of BFSI and hi-tech verticals at Birlasoft, has been appointed as the new CEO of Trigyn Technologies. Chandna aims to double the company's revenue over the next three years through digital modernization and expansion into new markets.",
            "Sentiment": "positive",
            "PublishDate": 1745855296000,
            "Source": "corporate_governance"
        }
    ]
}