{
    "Symbol": "TRITURBINE",
    "ISIN": "INE152M01016",
    "News": [
        {
            "Title": "Triveni Turbines Q3: Revenue Up 32%, Profit Drops 21%",
            "Summary": "Triveni Turbines reported mixed Q3 results with revenue rising 32% to ₹5.8 billion while net profit declined 21% to ₹952 million compared to the previous year period.",
            "Sentiment": "neutral",
            "PublishDate": 1770123767524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Triveni Turbine Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Triveni Turbine Limited has scheduled its board meeting for February 3, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769255110338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Triveni Turbines Allots 4,187 Shares Under ESOP",
            "Summary": "Triveni Turbines allotted 4,187 equity shares under Employee Stock Unit Plan 2023, increasing paid-up capital to ₹31.79 crores with shares exercised at ₹1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1767620521641,
            "Source": "co_actions_results"
        },
        {
            "Title": "Triveni Turbines Inaugurates Centre of Excellence at IISc Bengaluru for Energy Transition Research",
            "Summary": "Triveni Turbine Limited inaugurated the Triveni Turbines Centre of Excellence at the Indian Institute of Science, Bengaluru, marking a significant milestone in advancing energy transition technologies and turbomachinery research. The new R&D facility aims to develop sustainable, high-efficiency systems to help industries improve process performance, enhance energy efficiency, and reduce carbon emissions through academia-industry collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1763710678109,
            "Source": "stock"
        },
        {
            "Title": "Triveni Turbine Reports Record Order Booking of ₹6.52 Billion Despite Flat Revenue Growth in Q2 FY26",
            "Summary": "Triveni Turbine achieved record quarterly order booking of ₹6.52 billion (14% YoY growth) driven by robust domestic demand, bringing total order book to all-time high of ₹22.20 billion. Revenue remained flat at ₹5.06 billion with aftermarket segment contributing 35% to turnover, while the company expects back-ended growth in H2 FY26 following Q1 inspection delays.",
            "Sentiment": "positive",
            "PublishDate": 1763470347295,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Block Trade Worth Rs. 79.25 Crores Executed on NSE",
            "Summary": "A block trade involving 1,485,674 shares of Triveni Turbine Ltd was executed on NSE at Rs. 533.40 per share, totaling Rs. 79.25 crores. The large-volume transaction indicates significant institutional or bulk investor activity in the industrial equipment manufacturer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763438624423,
            "Source": "order&deals"
        },
        {
            "Title": "Triveni Turbine Limited Allots 6,000 Equity Shares Under Employee Stock Unit Plan",
            "Summary": "Triveni Turbine Limited allotted 6,000 equity shares of Re. 1 face value each on November 17, 2025, arising from the exercise of vested options under its Employee Stock Unit Plan 2023. The allotment increased the company's issued and paid-up share capital from Rs. 31,78,80,270 to Rs. 31,78,86,270, comprising 31,78,86,270 equity shares of Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763382750257,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Turbine Limited Announces Resignation of Head - Investor Relations",
            "Summary": "Triveni Turbine Limited announced that Ms. Surabhi Chandna, Head-Investor Relations and Value Creation, has resigned from her position. She will be relieved from her services with effect from closure of business hours on November 12, 2025. Ms. Chandna cited pursuing external career opportunities as the reason for her resignation. She had been associated with the company for 4.5 years and expressed gratitude to the Board of Directors, Management and colleagues for their support during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1762956668817,
            "Source": "corporate_governance"
        },
        {
            "Title": "Triveni Turbines Management Forecasts Higher Revenue Growth in Q3 and Q4",
            "Summary": "Triveni Turbines management has predicted higher revenue growth in the third and fourth quarters during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762931994681,
            "Source": "stock"
        },
        {
            "Title": "Triveni Turbine Reports Record Order Booking and Completes South Africa Acquisition",
            "Summary": "Triveni Turbine achieved record order booking of ₹6.52 billion, representing a 14% year-over-year increase, with total order book reaching ₹22.2 billion, up 24% year-over-year. The aftermarket segment contributed 35% of turnover with ₹1.99 billion in orders. The company acquired the remaining 30% stake in TSE Engineering South Africa to strengthen its global presence. Domestic demand remains strong in steel, sugar, and cement sectors. The company expressed confidence in back-ended FY26 growth.",
            "Sentiment": "positive",
            "PublishDate": 1762788117852,
            "Source": "stock"
        },
        {
            "Title": "Triveni Turbine Reports Flat Q2 Profit at ₹91 Crore, Revenue Up 1%",
            "Summary": "Triveni Turbine Ltd reported consolidated net profit of ₹91.2 crore for the September quarter, up 0.3% from ₹90.9 crore in the previous year. Revenue from operations increased 1% to ₹506.2 crore from ₹501.1 crore. EBITDA grew 2.3% to ₹114.2 crore with margins at 22.6% versus 22.3% last year. The board approved shifting the registered office to Noida and reappointed Ernst & Young LLP as internal auditor for three years. Shares closed 2.8% higher but have declined nearly 30% year-to-date. In Q1, the industrial steam turbine manufacturer saw net profit fall 19.3% to ₹64.5 crore and revenue drop 19.9% to ₹371.3 crore, with EBITDA declining 22.1% to ₹73.8 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1762783759218,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Reports Growth in Q2 Financial Performance",
            "Summary": "Triveni Turbine reported quarterly financial results showing growth across key metrics. Net profit increased to 955 million rupees from 900 million rupees in the same period last year. Revenue rose to 4.79 billion rupees compared to 4.69 billion rupees year-over-year. EBITDA grew to 1.19 billion rupees from 1.1 billion rupees, while EBITDA margin improved to 24.78% from 23.31% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762778469025,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine to Fully Acquire TSE Engineering for ZAR 10.97 Million",
            "Summary": "Triveni Turbine Limited announced that its wholly owned subsidiary Triveni Turbines DMCC-Dubai has executed a Sale of Shares Agreement to acquire the remaining 30% equity shares of TSE Engineering Pty. Ltd. for ZAR 10.97 million in cash consideration. The acquisition is expected to be completed by November 4, 2025. TSE Engineering, incorporated in South Africa in 2015, specializes in high precision engineering repairs and servicing of machinery in sugar and other industrial plants in the South African Development Community region. The company reported turnover of ZAR 38.56 million in FY23, ZAR 57.45 million in FY24, and ZAR 108.68 million in FY25. Following this acquisition, TSE will become a wholly owned step-down subsidiary of Triveni Turbine. The company stated the acquisition aims to consolidate ownership, strengthen operational control, achieve full ownership to simplify group structure, enhance decision-making agility, and realize operational synergies through unified management.",
            "Sentiment": "positive",
            "PublishDate": 1761917681130,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Turbine Q1 FY26 Revenue Falls 20% to ₹3.71 Billion Due to Geopolitical Conflicts",
            "Summary": "Triveni Turbine reported disappointing Q1 FY26 results with revenue declining 20% year-on-year to ₹3.71 billion, primarily due to deferment of orders and dispatches caused by geopolitical conflicts. EBITDA fell 17% to ₹958 million, though margins improved 100 basis points to 25.8%. PAT declined 20% to ₹644 million. Despite the weak quarter, the company maintains a strong order book of ₹20.74 billion, up 20% year-on-year. Domestic enquiry pipeline surged 130% while international pipeline declined 5%. The company launched India's first CO2-based high-temperature ultra-efficient heat pump developed with IISc. Management expects back-ended growth in FY26 with improved performance in the second half, driven by domestic market revival in sectors like steel, cement, and process cogeneration.",
            "Sentiment": "negative",
            "PublishDate": 1754924441225,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Expects Revenue Growth in FY26 Despite Execution Delays",
            "Summary": "Triveni Turbine anticipates revenue and order book growth for FY26, though the company expects flat performance in the first half compared to the previous year. Growth is projected to begin after 9 months, with notable growth expected in Q4. The company indicated that revenue will be delayed in FY26 due to order execution timing issues. Despite challenges in Q1, management remains optimistic about long-term growth prospects. The company plans to provide updates on the Organic Rankine Cycle market during its upcoming earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1754450732377,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbines Launches India's First CO₂ Heat Pump",
            "Summary": "Triveni Turbines has launched India's first CO₂ heat pump technology. This represents a significant milestone for the company in the clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1754317718764,
            "Source": "stock"
        },
        {
            "Title": "Triveni Turbine Sets September 1, 2025 Record Date for Rs. 2 Final Dividend",
            "Summary": "Triveni Turbine Limited has fixed September 1, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 2 per equity share of Re. 1 each for the financial year ended March 31, 2025. The dividend recommendation requires approval at the Annual General Meeting scheduled for September 8, 2025. If approved, the dividend payment will be made on or before October 7, 2025, subject to tax deduction at source.",
            "Sentiment": "positive",
            "PublishDate": 1754312288841,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Turbine Reports Q1 FY26 Results with Consolidated Revenue of ₹3,713 Million",
            "Summary": "Triveni Turbine Limited announced its quarterly results for the period ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹3,713 million compared to ₹4,633 million in the same quarter last year. Consolidated profit after tax stood at ₹644 million versus ₹804 million in the previous year quarter. On a standalone basis, revenue from operations was ₹3,446 million against ₹3,954 million in the corresponding quarter of the previous year, while standalone profit after tax was ₹670 million compared to ₹694 million. The company's earnings per share on a consolidated basis was ₹2.03 for the quarter. The Board of Directors approved these unaudited financial results in their meeting held on August 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754309976420,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Schedules Q1 FY 2025-26 Earnings Conference Call for August 5",
            "Summary": "Triveni Turbine Limited will host an earnings conference call on August 5, 2025, at 12:30 PM IST to discuss Q1 FY 2025-26 financial results. The virtual meeting will be conducted over a call with senior management team members present. The company operates in industrial heat and power solutions and decentralized steam-based renewable turbines up to 100 MW size. Investors can pre-register for the call through a provided link, and multiple international dial-in numbers are available including options for Singapore, Hong Kong, USA, and UK participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753706933006,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbines Anticipates Strong Growth in FY '26",
            "Summary": "Triveni Turbines expresses confidence in revenue growth for FY '26, despite potential volatility in Q1. The company expects FY '26 to be another record year for their performance.",
            "Sentiment": "positive",
            "PublishDate": 1747105846000,
            "Source": "default"
        },
        {
            "Title": "Triveni Turbine Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Triveni Turbine has announced its Q4 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the previous year. The company's EBITDA increased to 1.2 billion rupees from 898 million rupees year-over-year, while the EBITDA margin improved to 22.38% from 19.60%. Additionally, the company has declared a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746972519000,
            "Source": "result"
        },
        {
            "Title": "Triveni Turbine Reports Strong Q4 Financial Results",
            "Summary": "Triveni Turbine has announced its Q4 consolidated net profit of 939 million rupees, showing a year-over-year increase from 760 million rupees and a quarter-over-quarter increase from 924 million rupees. The company's Q4 revenue also rose to 5.4 billion rupees from 4.6 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1746972113000,
            "Source": "result"
        },
        {
            "Title": "Triveni Turbine: Q4 Profit Surges 23.6%, Declares ₹2 Dividend",
            "Summary": "Triveni Turbine reported Q4 FY25 net profit of ₹93.9 crore, up 23.6% YoY. Revenue increased 17.5% to ₹538 crore. EBITDA rose 34.25% to ₹120.4 crore. Export sales grew 27% to ₹280 crore. FY25 revenue hit record ₹2,006 crore, up 21% YoY. Board recommends final dividend of ₹2 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746900688000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine: Q4 Profit Soars 60% to Rs 94 Crore",
            "Summary": "Triveni Turbine reported a 60.44% increase in standalone profit to Rs 93.7 crore for Q4 FY25. Total income rose to Rs 508.1 crore. Full-year profit increased to Rs 374.4 crore. The company recommended a final dividend of Rs 2 per share. Annual revenue grew 21% to Rs 20.06 billion, with EBITDA and PBT growing 36% and 37% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1746895333000,
            "Source": "result"
        },
        {
            "Title": "Triveni Turbine to Consider Q4 Results on May 10",
            "Summary": "Triveni Turbine has announced that it will consider its fourth quarter financial results on May 10. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1746188728000,
            "Source": "default"
        },
        {
            "Title": "Triveni Turbine: Record Q3 Revenue, Profit Surge, and Dividend Declared",
            "Summary": "Triveni Turbine reported a 35.5% YoY increase in Q3 FY25 net profit to ₹92.4 crore. Revenue rose 16.6% to ₹503.4 crore. The company achieved all-time high quarterly revenue and EBITDA, with EBITDA up 30.4% to ₹109.3 crore. Order book reached a record ₹1,819 crore. An interim dividend of ₹2 per share was declared with a record date of February 6.",
            "Sentiment": "positive",
            "PublishDate": 1738334778000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Declares Dividend of 2 Rupees per Share",
            "Summary": "Triveni Turbine has announced a dividend of 2 rupees per equity share for its shareholders. This corporate action represents a return of profits to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1738331485000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Turbine Reports Strong Q3 EBITDA Growth",
            "Summary": "Triveni Turbine has reported significant year-over-year improvements in its third quarter financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 992 million rupees, up from 715 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 22.51%, compared to 19.42% in the year-ago period, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738331443000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Reports Strong Q3 Financial Results",
            "Summary": "Triveni Turbine has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 1.2 billion rupees, up from 587 million rupees in the same quarter last year and 900 million rupees in the previous quarter. Revenue also saw growth, reaching 4.4 billion rupees compared to 3.68 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738331380000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Secures ₹2.9 Billion Order from NTPC for CO2-Based Energy Storage System",
            "Summary": "Triveni Turbine has been awarded a significant order worth ₹2.9 billion from NTPC (National Thermal Power Corporation) for a CO2-based standalone energy storage system project. The project will be implemented at NTPC's facility in Kudgi, Karnataka. This order represents a major development in sustainable energy storage solutions and highlights Triveni Turbine's capabilities in advanced power technologies.",
            "Sentiment": "positive",
            "PublishDate": 1738137848000,
            "Source": "order&deals"
        },
        {
            "Title": "Triveni Turbine to Consider Q3 Results on January 31",
            "Summary": "Triveni Turbine has announced that it will consider and approve its financial results for the third quarter on January 31. This indicates the company is preparing to disclose its performance for the most recent fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737638911000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Turbine Reports Strong Q2 Financial Results",
            "Summary": "Triveni Turbine has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit for Q2 reached 900 million rupees, up from 486 million rupees in the same quarter last year and 694 million rupees in the previous quarter. Revenue also increased to 4.7 billion rupees from 3.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731335672000,
            "Source": "result"
        }
    ]
}