{
    "Symbol": "TRIVENI",
    "ISIN": "INE256C01024",
    "News": [
        {
            "Title": "Triveni Engineering Approves ₹1.50 Dividend",
            "Summary": "Triveni Engineering & Industries has approved a dividend payment of ₹1.50 per share for its shareholders, marking a significant corporate action by the diversified engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1769781582473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Triveni Engineering Q3 Profit Jumps 74.7% YoY",
            "Summary": "Triveni Engineering & Industries reports strong Q3 performance with consolidated net profit rising to ₹841 million from ₹481.2 million year-on-year, while revenue grows to ₹18 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769781540944,
            "Source": "co_actions_results"
        },
        {
            "Title": "Triveni Engineering Board Meet Set for Jan 30, 2026",
            "Summary": "Triveni Engineering & Industries Limited has scheduled its board meeting for January 30, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769174613045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Triveni Engineering Issues IEPF Transfer Notice",
            "Summary": "Triveni Engineering & Industries notifies shareholders about transfer of unclaimed equity shares to IEPF under regulatory compliance, with March 10, 2025 deadline for claims.",
            "Sentiment": "neutral",
            "PublishDate": 1766044314834,
            "Source": "co_actions_results"
        },
        {
            "Title": "Triveni Engineering Industries Shareholders and Creditors Approve Composite Scheme of Arrangement",
            "Summary": "Triveni Engineering Industries Limited's equity shareholders, secured creditors, and unsecured creditors approved a composite scheme of arrangement involving Sir Shadi Lal Enterprises Limited and Triveni Power Transmission Limited through meetings held on December 7, 2025. The scheme received overwhelming support with 98.37% of equity shareholders voting in favor, 100% approval from secured creditors representing Rs. 718.56 crores debt, and 99.74% approval from unsecured creditors representing Rs. 194.54 crores debt.",
            "Sentiment": "neutral",
            "PublishDate": 1765193863129,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering Reports 18.4% Revenue Growth in H1 FY26, Driven by Sugar and Distillery Operations",
            "Summary": "Triveni Engineering Industries Limited reported revenues from operations increased by 18.4% to over ₹3,300 crore in H1 FY26. Profit Before Tax stood at ₹32 crore versus ₹11.5 crore in the previous corresponding period, while Profit After Tax reached ₹23.5 crore against ₹8.6 crore previously. The growth was supported by a 21% increase in Sugar and allied businesses and an 8% increase in Engineering Businesses. The company's gross debt increased to ₹505 crore compared to ₹383 crore a year ago. Sugar Business revenues for H1 increased by 22%, supported by 14% increase in sugar dispatches and 4% increase in realizations. The Power Transmission Business secured healthy quarterly results with PBIT margins improving by more than 400 basis points due to better product mix and cost optimization. The company registered 9 new OEM customers in the product segment during H1 FY26. Management expects substantial increase in sugar production this year due to higher cane availability and projected recovery improvements. The proposed scheme of arrangement with SSEL and demerger of Power Transmission business has been approved by stock exchanges, with NCLT stakeholder meetings scheduled for end of November and early December.",
            "Sentiment": "positive",
            "PublishDate": 1762912706788,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering Plans ₹1,000+ Cr Investment for Ethanol Capacity Expansion and Revenue Diversification",
            "Summary": "Triveni Engineering has outlined plans for diversified growth across its sugar, distillery, and water businesses. The company is investing over ₹1,000 crores to expand ethanol capacity to 860 KLPD. The engineering division aims to double revenue through water infrastructure projects and turbine exports. The company is focusing on green transition and value chain integration as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762440725215,
            "Source": "stock"
        },
        {
            "Title": "Triveni Engineering Reports Mixed Q2 Results with Sugar Losses Offset by Engineering Gains",
            "Summary": "Triveni Engineering Industries Limited reported quarterly results ended September 30, 2025, showing revenue from operations of ₹1,930.76 crores on standalone basis and ₹2,014.46 crores on consolidated basis. The company posted standalone profit of ₹31.88 crores and consolidated profit of ₹21.38 crores. Sugar business recorded losses of ₹7.02 crores while distillery operations contributed ₹29.26 crores profit. Engineering businesses performed well with power transmission segment generating ₹45.97 crores and water segment ₹2.37 crores profit. Revenue increased due to power tariff revision effective April 1, 2024, adding ₹16.81 crores to current quarter results. The company paid final dividend of 250% (₹2.50 per share) aggregating ₹54.72 crores for financial year ended March 31, 2025. A composite scheme for amalgamation with Sir Shadi Lal Enterprises Limited and demerger of power transmission business is pending regulatory approvals with shareholder meetings scheduled for December 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762438791767,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering Reports Strong Q2 Turnaround with 259M Rupees Profit",
            "Summary": "Triveni Engineering and Industries reported quarterly consolidated net profit of 259 million rupees, marking a significant turnaround from a loss of 192 million rupees in the same period last year. Revenue grew to 20.14 billion rupees compared to 17.48 billion rupees year-over-year. EBITDA surged to 661 million rupees from 46.4 million rupees, while EBITDA margin expanded to 3.28% from 0.27% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762427868570,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering & Industries Announces 89th AGM for September 8, 2025 with FY2025 Annual Report Submission",
            "Summary": "Triveni Engineering & Industries Ltd. has announced its 89th Annual General Meeting scheduled for September 8, 2025, to be conducted via video conferencing at 11:00 A.M. IST. The company has submitted its Annual Report for FY 2024-25 along with the AGM notice to BSE and NSE. The report includes comprehensive Business Responsibility & Sustainability disclosures, with the company's paid-up capital at ₹21.89 crore and turnover of ₹6,655.40 crore. Remote e-voting will be available from September 5-7, 2025, with the cut-off date for member eligibility set as September 1, 2025. The company operates across sugar (49.13% of turnover), distillery (38.86%), power transmission (5.55%), and water business (3.51%) segments, with operations spanning 29 states nationally and 81 countries internationally.",
            "Sentiment": "neutral",
            "PublishDate": 1755596568657,
            "Source": "stock"
        },
        {
            "Title": "Triveni Engineering Receives BSE 'No Adverse Observations' for Composite Scheme of Arrangement",
            "Summary": "Triveni Engineering & Industries Limited has received a 'No Adverse Observations' letter from BSE Limited on August 7, 2025, regarding its proposed Composite Scheme of Arrangement. The scheme involves Triveni Engineering & Industries Limited, Sir Shadi Lal Enterprises Limited, and Triveni Power Transmission Limited. BSE's approval comes with 13 specific conditions including disclosure requirements for ongoing legal proceedings, compliance with SEBI circulars, and ensuring scheme financials are not more than 6 months old. The company had previously received a 'No Objection' from National Stock Exchange on August 6, 2025. The observation letter has a validity of six months, within which the scheme must be submitted to the National Company Law Tribunal. The scheme remains subject to other applicable regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754637858345,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering Receives NSE No-Objection for Composite Scheme Involving Sir Shadi Lal and Triveni Power",
            "Summary": "Triveni Engineering & Industries Limited received a no-objection observation letter from the National Stock Exchange of India Limited on August 6, 2025, for its proposed composite scheme of arrangement involving Sir Shadi Lal Enterprises Limited and Triveni Power Transmission Limited. The scheme was initially approved by Triveni's Board of Directors on December 10, 2024. NSE's approval includes multiple conditions that the company must fulfill, including disclosure requirements for ongoing legal proceedings, compliance with SEBI circulars, and ensuring financial statements are not more than 6 months old. For the listing of Triveni Power Transmission Limited, the company must submit an Information Memorandum, publish newspaper advertisements, and ensure shares remain frozen until trading permission is granted. The observation letter is valid for six months from August 6, 2025, within which the scheme must be submitted to NCLT. The scheme remains subject to other applicable regulatory and statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754571309915,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering Reports Q1 FY26 Results with 23% Revenue Growth Despite Margin Pressures",
            "Summary": "Triveni Engineering & Industries reported Q1 FY26 revenue of ₹1,598 crore, up 23% year-on-year, with PBT of ₹2.9 crore and PAT of ₹2.1 crore. The growth was driven by 53% increase in alcohol dispatches and 14% rise in consolidated sugar dispatches with improved sugar realizations. However, sugar segment profit declined 80% to ₹7.6 crore due to higher production costs from lower gross sugar recovery of 10.8% compared to 11.49% in the previous year. The company achieved record quarterly alcohol production of 6.5 crore litres, though profitability was impacted by 27% of sales coming from lower-margin FCI rice-based ethanol. Power Transmission business showed strong performance with 15% increase in order booking and record closing order book of ₹423 crore, up 38% year-on-year. Overall engineering business order book reached ₹1,975 crore, representing 32% growth. Stand-alone debt increased to ₹1,385 crore from ₹1,150 crore, while consolidated gross debt rose to ₹1,688 crore from ₹1,280 crore. Management expects margin improvements from reduced FCI rice usage, better maize procurement strategies, and operational efficiencies. The company continues to await regulatory approvals for the proposed amalgamation with Sir Shadi Lal and demerger of Power Transmission business, targeting completion in Q1 of next fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1754386734273,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering Plans Production Expansion and Business Segment Separation by FY26",
            "Summary": "Triveni Engineering has announced plans to increase turbine production and expand defense and export engineering orders. The company aims to accelerate value creation through the separation of its distillery, co-generation, and sugar segments by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753799737693,
            "Source": "stock"
        },
        {
            "Title": "Triveni Engineering Q1 Net Profit Drops 86% to 44M Rupees Despite Revenue Growth",
            "Summary": "Triveni Engineering & Industries reported Q1 consolidated net profit of 44 million rupees, down from 313 million rupees in the same period last year. Revenue increased to 19.54 billion rupees from 15.34 billion rupees year-over-year. EBITDA declined significantly to 54 million rupees from 862 million rupees, while EBITDA margin compressed to 2.74% from 5.62% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753787564274,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering Faces Rs 46.78 Crore Export Fee Demand from Excise Department",
            "Summary": "Triveni Engineering & Industries has received letters from the Office of the Assistant Excise Commissioner demanding deposit of export fees on denatured alcohol for the period from August 25, 2018 to June 30, 2025. The demand follows a Supreme Court order dated October 23, 2024, which upheld the State's authority to regulate industrial alcohol. The company has quantified the aggregate amount at Rs 46.78 crores and is contesting the matter through an Industry Association. The latest letter from the excise department was received on July 23, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753365330818,
            "Source": "stock"
        },
        {
            "Title": "Triveni Engineering & Industries Schedules Board Meeting for Q1 FY26 Results on July 29, 2025",
            "Summary": "Triveni Engineering & Industries Limited has announced a Board of Directors meeting scheduled for July 29, 2025, to consider and approve the unaudited financial results for Q1 FY26 ended June 30, 2025. The trading window for company securities remains closed for designated persons until August 1, 2025, continuing the closure that began July 1, 2025. The window will reopen 48 hours after the board meeting outcome is submitted to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753161239750,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering: Q4 Results Show Strong Performance Across Segments",
            "Summary": "Triveni Engineering reported robust Q4 FY25 results, with sugar segment revenue up 16% YoY to Rs 10.8 billion. EBIT in the sugar segment increased 41% YoY to Rs 2.2 billion, with margins expanding by 370 bps to 20.7%. Systematix maintains a 'Buy' rating and has increased the target price.",
            "Sentiment": "positive",
            "PublishDate": 1748524771000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering & Industries: Shares Surge 10% on Strong Q4 Results and Positive Sugar Outlook",
            "Summary": "Triveni Engineering & Industries reported a 16.2% YoY increase in Q4 FY25 net profit to Rs 187.1 crore. Revenue rose 24.4% to Rs 1,925.3 crore. The company's board recommended a final dividend of Rs 2.50 per share. Management expects favorable sugar market dynamics to continue, with healthy price levels and lower national sugar stocks.",
            "Sentiment": "positive",
            "PublishDate": 1748418741000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering Reports Order Book and Expansion Plans",
            "Summary": "Triveni Engineering's outstanding order book as of March 31, 2025, stood at Rs 1600.8 crore, including Rs 1120 crore for long-term O&M contracts. The company also announced expansion plans, including setting up a new multi-modal facility dedicated to defence products.",
            "Sentiment": "positive",
            "PublishDate": 1748415153000,
            "Source": "default"
        },
        {
            "Title": "Triveni Engineering Plans Capacity Expansion for Power Transmission Business",
            "Summary": "Triveni Engineering has announced plans to expand the capacity of its power transmission business. The company aims to increase its gears capacity (excluding defence) to Rs 700 crore by September 2026. This information was shared in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1748414988000,
            "Source": "default"
        },
        {
            "Title": "Triveni Engineering: Q4 Profit Up 14%, Revenue Jumps 24%, Dividend Declared",
            "Summary": "Triveni Engineering reported Q4 net profit of ₹183 crore, up 13.7% YoY. Revenue increased 24.4% to ₹1,925.3 crore. EBITDA rose 25.5% to ₹308 crore. The board recommended a final dividend of ₹2.50 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1748354334000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering & Industries Reports Q4 Results and Dividend Recommendation",
            "Summary": "Triveni Engineering & Industries has reported its Q4 financial results. The company's consolidated net profit increased to 1.87 billion rupees from 1.61 billion rupees year-over-year. Revenue rose to 19.25 billion rupees from 15.84 billion rupees in the same period last year. EBITDA improved to 3.1 billion rupees from 2.46 billion rupees, with the EBITDA margin slightly increasing to 16% from 15.86%. The company has also recommended a dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748351543000,
            "Source": "result"
        },
        {
            "Title": "Explosion at Triveni Engineering's CO2 Plant: No Casualties, Operations Unaffected",
            "Summary": "Triveni Engineering and Industries reported an explosion at their CO2 plant. The company stated that no loss of life or casualties occurred as a result of the incident. Despite the explosion, Triveni Engineering assured that their business operations remain unaffected.",
            "Sentiment": "neutral",
            "PublishDate": 1742256083000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering: Explosion at CO2 Plant, No Casualties Reported",
            "Summary": "An explosion occurred at Triveni Engineering's CO2 plant in Sabitgarh Sugar Unit, Uttar Pradesh, at 3:30 PM. No casualties or injuries were reported. The cause is under investigation. Business operations remain unaffected.",
            "Sentiment": "neutral",
            "PublishDate": 1742224004000,
            "Source": "normal_news"
        },
        {
            "Title": "Explosion at Triveni Engineering's CO2 Plant: No Casualties Reported",
            "Summary": "Triveni Engineering and Industries reported an explosion at their CO2 plant. The company stated that no loss of life or casualties occurred as a result of the incident. Furthermore, Triveni Engineering assured that their business operations remain unaffected by the explosion.",
            "Sentiment": "neutral",
            "PublishDate": 1742219809000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering & Industries Ltd: Mid-Cap Stock Rises 4% Amid Market Crash",
            "Summary": "Triveni Engineering & Industries Ltd's stock gained 4% in intraday trading, reaching ₹398 despite the broader market decline. The stock has gained over 6% in the last 5 trading sessions, showing resilience in a challenging market environment.",
            "Sentiment": "positive",
            "PublishDate": 1740391247000,
            "Source": "normal_news"
        },
        {
            "Title": "Triveni Engineering & Industries Wins International Awards for Premium Whisky Brands",
            "Summary": "Triveni Engineering & Industries has received international recognition for its premium and super premium whisky brands. The company's success in the spirits segment highlights its diversification efforts and potential growth in the alcoholic beverage market.",
            "Sentiment": "positive",
            "PublishDate": 1739872551000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering and Rolls-Royce Sign MOU for Marine Gas Turbine Generators",
            "Summary": "Triveni Engineering has entered into a Memorandum of Understanding (MOU) with Rolls-Royce for the development of 4MW marine gas turbine generators. This collaboration aims to combine Triveni's engineering expertise with Rolls-Royce's advanced turbine technology for marine applications.",
            "Sentiment": "positive",
            "PublishDate": 1738815439000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering & Industries Reports Q3 Financial Results",
            "Summary": "Triveni Engineering & Industries has announced its Q3 consolidated financial results. The company reported a net profit of 481.2 million rupees, which is a decrease compared to 1.37 billion rupees in the same quarter last year. However, the company's revenue increased to 16 billion rupees from 15.54 billion rupees in the corresponding period.",
            "Sentiment": "neutral",
            "PublishDate": 1738714714000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering & Industries Ltd: Q3 Profit Plunges 69%, Revenue Up 3%",
            "Summary": "Triveni Engineering reported a 69% YoY decline in Q3 net profit to ₹42.6 crore, while revenue increased 3% to ₹1,600.3 crore. EBITDA fell 60% to ₹77.1 crore. The company approved reappointment of Dhruv M Sawhney as MD for five years and a ₹60 crore capex for Power Transmission business expansion.",
            "Sentiment": "negative",
            "PublishDate": 1738689120000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering & Industries Reports Significant Decline in Q3 EBITDA",
            "Summary": "Triveni Engineering & Industries has reported a substantial decrease in its Q3 EBITDA, which fell to 771 million rupees from 1.93 billion rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 4.82% from 12.42% in the same period last year. This significant reduction in both EBITDA and EBITDA margin indicates a challenging quarter for the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1738687847000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering & Industries Reports Q3 Revenue Growth",
            "Summary": "Triveni Engineering & Industries has reported a revenue of 16 billion rupees for the third quarter, compared to 15.54 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738687827000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering & Industries Reports Decline in Q3 Net Profit",
            "Summary": "Triveni Engineering & Industries has reported a consolidated net profit of 481.2 million rupees for the third quarter, marking a significant decrease from 1.37 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738687821000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering to Consider Q3 Results on February 4",
            "Summary": "Triveni Engineering has announced that it will consider its third quarter (Q3) financial results on February 4. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737638490000,
            "Source": "earnings"
        },
        {
            "Title": "Triveni Engineering Approves Share Exchange Scheme with Sir Shadi Lal Enterprises",
            "Summary": "Triveni Engineering And Industries has approved a scheme of arrangement with Sir Shadi Lal Enterprises. Under this scheme, shareholders of Sir Shadi Lal Enterprises will receive 100 shares of Triveni Engineering for every 137 shares they hold.",
            "Sentiment": "neutral",
            "PublishDate": 1733875579000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering Approves Share Exchange Scheme with Sir Shadi Lal Enterprises",
            "Summary": "Triveni Engineering and Industries has approved a scheme of arrangement with Sir Shadi Lal Enterprises. Under this arrangement, shareholders of Sir Shadi Lal Enterprises will receive 100 shares of Triveni Engineering for every 137 shares they hold.",
            "Sentiment": "neutral",
            "PublishDate": 1733834981000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering Anticipates Improved Performance in Upcoming Sugar Season",
            "Summary": "Triveni Engineering has expressed optimism for the upcoming sugar season, expecting significantly better performance. The company also shared a positive outlook for its other business segments, including power transmission and water.",
            "Sentiment": "positive",
            "PublishDate": 1730950541000,
            "Source": "normal_news"
        },
        {
            "Title": "Triveni Engineering Announces 200M Rupee Capex for Liquor Business Expansion",
            "Summary": "Triveni Engineering has announced a capital expenditure of 200 million rupees to enhance the production capacity of its liquor business. This investment indicates the company's commitment to growth in the alcoholic beverage sector.",
            "Sentiment": "positive",
            "PublishDate": 1730812213000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering & Industries Reports Significant Drop in Q2 EBITDA",
            "Summary": "Triveni Engineering & Industries has reported a substantial decline in its Q2 EBITDA, which fell to 40 million rupees from 629 million rupees year-over-year. The company's EBITDA margin also decreased significantly, dropping to 0.23% from 3.89% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730811666000,
            "Source": "result"
        },
        {
            "Title": "Triveni Engineering Reports Q2 Financial Results",
            "Summary": "Triveni Engineering & Industries reported a consolidated net loss of 192 million rupees in Q2, compared to a profit of 291 million rupees in the same quarter last year. However, the company showed improvement from the previous quarter, with a profit of 313 million rupees. Q2 revenue increased to 17.5 billion rupees from 16.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730811527000,
            "Source": "result"
        },
        {
            "Title": "Triveni Engineering Launches Two New Whisky Brands",
            "Summary": "Triveni Engineering & Industries has introduced two new whisky products: Matsya Triple Reserve Blended Whisky, priced at INR 690 for a 750 ml bottle, and Crafters Stamp Rare Artisan Blended Whisky, priced at INR 950 for a 750 ml bottle.",
            "Sentiment": "neutral",
            "PublishDate": 1729595529000,
            "Source": "corporate_action"
        },
        {
            "Title": "Triveni Engineering Enters Premium Whisky Market",
            "Summary": "Triveni Engineering & Industries has expanded its business by entering the Indian Made Foreign Liquor (IMFL) segment. The company has launched two new premium whisky brands: Matsya Triple Reserve Blended Whisky and The Crafters Stamp Rare Artisan Blended Whisky. This move marks Triveni's foray into the premium and super-premium whisky categories.",
            "Sentiment": "positive",
            "PublishDate": 1729595522000,
            "Source": "corporate_action"
        }
    ]
}