{
    "Symbol": "TROM",
    "ISIN": "INE0SYV01018",
    "News": [
        {
            "Title": "Trom Industries Secures ₹25.8 Cr Order",
            "Summary": "Trom Industries has won a significant order worth ₹25.8 crores, representing a substantial business development for the company with a market capitalization of ₹71 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767924609685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trom Industries Secures ₹25.8 Crore Order",
            "Summary": "Trom Industries has secured a significant order worth ₹25.8 crores, representing a substantial business development for the company which currently maintains a market capitalization of ₹71 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767884160796,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trom Industries Wins ₹4.45 Cr Solar & Lighting Deals",
            "Summary": "Trom Industries secures contracts worth ₹4.45 crores for solar EPC and municipal lighting projects, strengthening its project execution pipeline and expanding its presence in renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1766132535065,
            "Source": "stocks"
        },
        {
            "Title": "Trom Industries Secures 37.7 Crore Rupee Order from Breda",
            "Summary": "Trom Industries has received an order worth 37.7 crore rupees from Breda. The company's current market capitalization stands at 228 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735172350000,
            "Source": "order&deals"
        },
        {
            "Title": "Trom Industries Secures 376.5 Million Rupee Order from BREDA",
            "Summary": "Trom Industries has received a significant order worth 376.5 million rupees from BREDA (Bihar Renewable Energy Development Agency). This order represents a substantial business opportunity for the company and indicates potential growth in their operations or revenue.",
            "Sentiment": "positive",
            "PublishDate": 1735049688000,
            "Source": "order&deals"
        },
        {
            "Title": "Trom Industries: Q2 Profit Doubles, Stock Surges 15%",
            "Summary": "Trom Industries reported a significant increase in net profit for H1 FY25, jumping to ₹4.13 crore from ₹1.97 crore year-over-year. Revenue nearly doubled to ₹46.23 crore. The company recently secured solar project contracts worth ₹33.10 crore. The stock price rose 15% to ₹260 on NSE SME following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1731577957000,
            "Source": "result"
        },
        {
            "Title": "Trom Industries: 5% Jump on ₹20.70 Crore Gujarat Metro Rail Order",
            "Summary": "Trom Industries' stock rose over 5% after securing a ₹20.70 crore order from Gujarat Metro Rail Corporation for solar power projects on 15 metro stations in Ahmedabad.",
            "Sentiment": "positive",
            "PublishDate": 1730350513000,
            "Source": "normal_news"
        }
    ]
}