{
    "Symbol": "TRU",
    "ISIN": "INE615R01029",
    "News": [
        {
            "Title": "TruCap Finance Reports Rs 4,222.51 Cr Loss in Q3FY26",
            "Summary": "TruCap Finance Limited reported a net loss of Rs 4,222.51 crores for Q3FY26, with revenue declining to Rs 1,509.96 crores. The company faces financial stress with inadequate security cover.",
            "Sentiment": "negative",
            "PublishDate": 1770815577862,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trucap Finance Open Offer faces SEBI rejection",
            "Summary": "SEBI rejects Marwadi Chandarana's withdrawal request for Trucap Finance open offer. Acquirer appeals to SAT with hearing scheduled February 11, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1770717096343,
            "Source": "co_actions_results"
        },
        {
            "Title": "TruCap Finance Reports Quarterly Loss, Appoints Interim CFO and Grants Stock Options",
            "Summary": "TruCap Finance Limited reported a net loss of Rs 3,258.86 lakhs for the quarter ended September 30, 2025, and appointed Vishal Miglani as interim Chief Financial Officer effective November 14, 2025. The company also granted 19,07,498 stock options under its ESOP Plan 2018 and shifted its registered office within the same building in Mumbai.",
            "Sentiment": "negative",
            "PublishDate": 1763069520270,
            "Source": "earnings"
        },
        {
            "Title": "Wilson Holdings Reduces Stake in TruCap Finance by 0.47%",
            "Summary": "Wilson Holdings Private Limited sold 5,41,591 equity shares of TruCap Finance Limited through open market sale on June 20, 2023. The transaction reduced Wilson Holdings' shareholding from 52.78% to 52.31% of TruCap Finance's total paid-up equity share capital. Combined with Mrs. Minaxi Mehta's holdings, their total stake decreased from 55.18% to 54.71%. The sale was conducted as part of regulatory disclosure requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761795504918,
            "Source": "corporate_action"
        },
        {
            "Title": "TruCap Finance Credit Rating Downgraded to 'D' Following Rs 45.12 Crore Default",
            "Summary": "Infomerics Ratings downgraded TruCap Finance Limited's bank facilities totaling Rs 185 crore from 'IVR C/Negative' to 'IVR D' after the company defaulted on principal repayments of Rs 45.12 crore and interest of Rs 0.48 crore across multiple lenders due on September 30, 2025. The company also defaulted on an unlisted NCD of Rs 0.58 crore issued to Incred Credit Opportunities Fund. With total outstanding borrowings of Rs 277.89 crore and financial indebtedness of Rs 314.82 crore, TruCap faces significant refinancing risks and ongoing liquidity constraints. The rating agency noted the company's poor liquidity position and elevated repayment obligations. For rating upgrade, TruCap would need to demonstrate timely debt servicing for a minimum of 90 days.",
            "Sentiment": "negative",
            "PublishDate": 1761557781502,
            "Source": "corporate_action"
        },
        {
            "Title": "TruCap Finance Completes Final Payment on Non-Convertible Debentures After Liquidity Stress",
            "Summary": "TruCap Finance Limited completed its final payment obligations on non-convertible debentures (NCDs) by paying the remaining 30% principal and interest on September 23, 2025. The payment covered six ISIN series with a total issue size of Rs. 89.49 crores. The company made payments in multiple tranches between July 18 and September 23, 2025, after experiencing delays due to liquidity stress and non-receipt of committed funds. Interest payments totaling Rs. 21.02 lakhs were made along with principal redemption amounts totaling Rs. 21.54 crores. The original due date for redemption was July 16, 2025, but payments were delayed by over two months. All outstanding amounts now stand at zero, fully discharging the company's payment obligations for these listed NCDs.",
            "Sentiment": "neutral",
            "PublishDate": 1761073712469,
            "Source": "corporate_action"
        },
        {
            "Title": "TruCap Finance Completes Final Payment on Non-Convertible Debentures Worth ₹89.49 Crore",
            "Summary": "TruCap Finance Limited completed its final 30% principal payment along with interest on its non-convertible debentures on September 23, 2025, totaling ₹89.49 crore across six ISIN series. The payment was made on a pro-rata basis to debenture holders, discharging the company's entire payment obligation for the listed NCDs. The company had previously made partial payments in multiple tranches between July 18 and August 8, 2025. The final payment was delayed from the original due date of July 16, 2025, which the company attributed to liquidity stress and non-receipt of committed funds for redemption. All outstanding amounts for the NCDs now stand at zero, with total interest payments of ₹21.02 lakh made alongside the principal redemption.",
            "Sentiment": "positive",
            "PublishDate": 1760891524507,
            "Source": "corporate_action"
        },
        {
            "Title": "TruCap Finance Finance Head Saurabh Sethi Resigns",
            "Summary": "Saurabh Sethi, Finance Head of TruCap Finance Limited, resigned from his position effective September 30, 2025. Sethi was designated as Senior Management Personnel of the company. The company notified BSE and NSE about the resignation through Company Secretary Sonal Sharma.",
            "Sentiment": "neutral",
            "PublishDate": 1759243766939,
            "Source": "corporate_governance"
        },
        {
            "Title": "TruCap Finance Terminates Share Purchase and Securities Subscription Agreements with Marwadi Chandarana Intermediaries",
            "Summary": "TruCap Finance Limited announced the termination of agreements with Marwadi Chandarana Intermediaries Brokers Private Limited that were originally executed on May 26, 2025. The terminated agreements included a share purchase agreement for acquisition of 3,68,00,220 equity shares from promoters and a securities subscription agreement for 11,56,80,000 equity shares and 9,37,00,000 convertible warrants. Marwadi Chandarana communicated the termination through a letter dated September 22, 2025. As a result of the termination, the acquirer will no longer be able to gain control over TruCap Finance through promoter classification. The company stated that the termination does not have material impact except for the expected fund infusion from the equity shares and convertible warrants subscription that will no longer occur.",
            "Sentiment": "negative",
            "PublishDate": 1758651138778,
            "Source": "corporate_action"
        },
        {
            "Title": "TruCap Finance Reports Loss of Rs 887 Lakhs in Q1 FY26, Board Approves CEO Reappointment",
            "Summary": "TruCap Finance Limited reported a net loss of Rs 886.97 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 139.34 lakhs in the same quarter last year. Total income decreased to Rs 4,198.85 lakhs from Rs 5,236.04 lakhs year-over-year. Interest income fell to Rs 2,804.09 lakhs from Rs 4,319.94 lakhs. The company's expenses totaled Rs 5,755.61 lakhs, with impairment on financial instruments rising significantly to Rs 1,029.58 lakhs. GNPA increased to 5.49% from 1.42% in the previous year. The Board approved the reappointment of Rohanjeet Singh Juneja as Managing Director and CEO for three years from December 16, 2025. The company also appointed U. Hegde & Associates as Secretarial Auditor for five years and increased authorized share capital from Rs 50 crores to Rs 75 crores.",
            "Sentiment": "negative",
            "PublishDate": 1755184760156,
            "Source": "earnings"
        },
        {
            "Title": "TruCap Finance Credit Ratings Downgraded to 'D' Following Default on Debt Payments",
            "Summary": "TruCap Finance Limited has received significant credit rating downgrades from both CARE Ratings and Infomerics Valuation and Rating Private Limited. CARE Ratings downgraded the company's long-term bank facilities of ₹750 crore and non-convertible debentures worth ₹150 crore to 'CARE D' from 'CARE BB+'. Similarly, Infomerics downgraded bank facilities totaling ₹185 crore to 'IVR C' from 'IVR BBB'. The downgrades followed TruCap's inability to service interest and principal payments of ₹72.28 crore on its non-convertible debentures that were due on July 16, 2025. The company faced severe liquidity pressure due to non-receipt of committed funds from new promoter entity Marwadi Chandarana Intermediaries Brokers Private Limited and premature redemption demands from debenture holders. The ratings remain on watch with developing implications, reflecting uncertainty around the proposed acquisition by the Marwadi Group. TruCap's financial performance showed a net loss of ₹66.61 crore for the latest year compared to a profit of ₹11.71 crore in the previous year, while gross NPAs increased to 3.69% from 1.33%.",
            "Sentiment": "negative",
            "PublishDate": 1753161307438,
            "Source": "stock"
        },
        {
            "Title": "Trucap Finance to Sell Gold Loan Business to Incred Financial Services",
            "Summary": "Trucap Finance has announced the sale of its entire gold loan business to Incred Financial Services. The total consideration for this transaction is approximately 3.3 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740615486000,
            "Source": "corporate_action"
        },
        {
            "Title": "Trucap Finance to Sell Gold Loan Business to InCred Financial Services",
            "Summary": "Trucap Finance has announced the sale of its entire gold loan business to InCred Financial Services. The total consideration for this transaction is approximately 3.3 billion Indian Rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740495375000,
            "Source": "corporate_action"
        }
    ]
}