{
    "Symbol": "TRUALT",
    "ISIN": "INE0MWH01014",
    "News": [
        {
            "Title": "TruAlt Bioenergy Q3FY26 IPO Proceeds Monitoring Report",
            "Summary": "TruAlt Bioenergy utilized Rs 519.63 crore of Rs 750.00 crore IPO proceeds in Q3FY26, with Rs 230.37 crore remaining unutilized. Crisil Ratings found no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1770721834642,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trualt Bioenergy Q3 Revenue Surges 71% Despite Profit Dip",
            "Summary": "Trualt Bioenergy reported Q3 consolidated revenue of ₹7.1 billion, up from ₹4.15 billion YoY, while net profit declined to ₹693 million from ₹752 million in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1770132199277,
            "Source": "co_actions_results"
        },
        {
            "Title": "TruAlt Bioenergy Appoints Interim Company Secretary",
            "Summary": "TruAlt Bioenergy Limited has appointed Mr. Monu Kumar as Interim Company Secretary and Compliance Officer effective January 9, 2026, following board approval and recommendation from the Nomination and Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1767968520143,
            "Source": "stocks"
        },
        {
            "Title": "TruAlt Bioenergy Reports 26% Revenue Decline Due to Strategic Plant Shutdown for Multi-Feed Integration",
            "Summary": "TruAlt Bioenergy's revenue dropped 26% to INR 418 crores in H1 FY26 due to deliberate plant shutdowns for converting 1,300 KLPD capacity to dual-feed operations, though EBITDA margins improved through cost control measures. The company targets 47 crore liters ethanol supply for the year and expects strong recovery in H2 with CBG business showing 65% growth and new partnerships with Sumitomo Corporation and GAIL progressing.",
            "Sentiment": "neutral",
            "PublishDate": 1763561457428,
            "Source": "earnings"
        },
        {
            "Title": "Trualt Bioenergy Signs MoU for ₹2,250-Crore Sustainable Aviation Fuel Plant in Andhra Pradesh",
            "Summary": "Trualt Bioenergy has signed a non-binding memorandum of understanding with the Andhra Pradesh Economic Development Board to explore establishing a sustainable aviation fuel manufacturing facility. The proposed project involves an investment of ₹2,250 crores and would be located in Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1763337290189,
            "Source": "order&deals"
        },
        {
            "Title": "TruAlt Bioenergy Reports Mixed Results as Planned Shutdowns Impact Operations During Dual-Feed Transition",
            "Summary": "TruAlt Bioenergy Limited announced quarterly results showing the impact of planned shutdowns and safety-led commissioning activities across three units as part of a 1,300 KLPD dual-feed integration covering 65% of installed capacity. The company's consolidated total income decreased 26% to Rs 461 crore in H1 FY2025-26, while consolidated PAT improved 17% to Rs -33.27 crore. The CBG segment delivered strong growth with 286% EBITDA increase and margins expanding to 68.29%. The company completed a 3.5-month planned shutdown to transition from 140 to 300-330 operating days annually. TruAlt advanced its partnership with Sumitomo Corporation for CBG joint venture development and signed an MOU with Andhra Pradesh Economic Development Board for a proposed Rs 2,250 crore ethanol-to-SAF facility investment. Managing Director Vijay Nirani described the period as an investment phase in long-term transformation, expecting sequential improvement in volumes and margins as capacities stabilize.",
            "Sentiment": "neutral",
            "PublishDate": 1762940448268,
            "Source": "earnings"
        },
        {
            "Title": "TruAlt Bioenergy Reports Loss in Q2 Results, Announces Joint Venture with Japan's Sumitomo Corporation",
            "Summary": "TruAlt Bioenergy Limited reported a standalone net loss of ₹42.75 crore for the quarter ended September 30, 2025, compared to a loss of ₹16.90 crore in the same period last year. Revenue from operations declined to ₹104.48 crore from ₹382.13 crore year-over-year. The company's ethanol business faced seasonal challenges with only Unit 3 operational during the period, while Units 1, 2, and 4 were under conversion to dual-feed plants. The company announced a joint venture agreement with Japan-based Sumitomo Corporation to develop compressed biogas (CBG) plants, with TruAlt holding 51% and Sumitomo 49% stake in TruAlt Gas Private Limited. The initial phase includes four CBG production facilities. TruAlt's IPO was oversubscribed by 75.02 times, with shares listed on NSE and BSE on October 3, 2025. The company also disclosed plans for an ethanol to sustainable aviation fuel plant in Andhra Pradesh with an investment of ₹2,250 crore.",
            "Sentiment": "negative",
            "PublishDate": 1762892425354,
            "Source": "earnings"
        },
        {
            "Title": "Trualt Bioenergy Reports Wider Q2 Loss and Sharp Revenue Decline",
            "Summary": "Trualt Bioenergy reported a consolidated net loss of 379 million rupees in Q2, compared to a loss of 187 million rupees in the same quarter last year. The company's quarterly revenue dropped significantly to 1.15 billion rupees from 3.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762872722841,
            "Source": "earnings"
        },
        {
            "Title": "Trualt Bioenergy Partners With Sumitomo Corp For CBG Plant Development",
            "Summary": "Trualt Bioenergy has entered into a partnership with Sumitomo Corp to collaborate on the development of CBG (Compressed Bio Gas) plants. The joint effort aims to work together on CBG plant development projects.",
            "Sentiment": "positive",
            "PublishDate": 1762866591501,
            "Source": "order&deals"
        },
        {
            "Title": "TruAlt Bioenergy Schedules Q2 H1 FY26 Earnings Call for November 12, 2025",
            "Summary": "TruAlt Bioenergy Limited has announced an earnings conference call scheduled for November 12, 2025, at 3:30 PM IST to discuss the company's Q2 H1 FY26 financial results. The call will include a management presentation followed by a Q&A session for analysts and investors. The company describes itself as India's largest ethanol producer by installed capacity and a leading integrated biofuels company. TruAlt operates across ethanol, compressed biogas (CBG), and has upcoming ventures in second-generation ethanol, sustainable aviation fuel (SAF), and allied biochemicals. The call will be recorded and both audio recording and transcript will be made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762625471647,
            "Source": "corporate_action"
        },
        {
            "Title": "Trualt Bioenergy Approves Rs 180 Crore Corporate Guarantee and Rs 20 Crore Investment in Subsidiary",
            "Summary": "Trualt Bioenergy Limited's board approved providing a corporate guarantee worth 51% of project cost for a Rs 180 crore term loan from NABARD to its subsidiary Trualt Gas Private Limited (TGPL) for setting up 3 CBG plants with 20 TPD capacity each. The guarantee aligns with joint venture conditions with Sumitomo Corporation, where Trualt will secure 51% and Sumitomo 49% proportionate to their shareholding. The board also approved additional investment of up to Rs 20 crore in TGPL's equity shares at Rs 24 per share, with completion targeted by November 30, 2025. Additionally, the company removed Deepak Kumar Gulati from his position as Company Secretary and Compliance Officer due to prolonged absence and unsatisfactory performance. The investment forms part of a strategic initiative with Sumitomo Corporation to operate TGPL as a joint venture in the compressed biogas sector.",
            "Sentiment": "positive",
            "PublishDate": 1761654467730,
            "Source": "corporate_action"
        },
        {
            "Title": "Trualt Bioenergy Approves Q1 FY26 Results and ₹84.2 Crore Acquisition of 51% Stake in Trualt Gas",
            "Summary": "Trualt Bioenergy Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company also approved acquiring 51% stake in Trualt Gas Private Limited from promoter group company Nirani Holdings Private Limited for ₹84.21 crore in cash. The acquisition involves purchasing 35.08 lakh equity shares at ₹24 per share. Trualt Gas, incorporated in September 2024, operates in the compressed biogas (CBG) sector with zero turnover as it has not commenced commercial operations. The transaction is valued at fair market value determined by an independent registered valuer. Trualt Bioenergy aims to expand its presence in the CBG sector and facilitate a proposed joint venture with SUMITOMO Corporation in the biogas business. The acquisition is expected to be completed by November 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761074084578,
            "Source": "corporate_action"
        },
        {
            "Title": "Trualt Bioenergy Approves Quarterly Results and 51% Acquisition of Trualt Gas Private Limited",
            "Summary": "Trualt Bioenergy Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The Board also approved acquiring 51% equity stake in Trualt Gas Private Limited from promoter group company Nirani Holdings Private Limited for Rs. 8.42 crore. The acquisition involves 35.09 lakh equity shares at Rs. 24 per share. Trualt Gas, incorporated in September 2024, operates in compressed biogas (CBG) sector, processing municipal solid waste and manufacturing compressed biogas products. The company has not yet commenced commercial operations. The acquisition aims to expand Trualt Bioenergy's presence in the CBG sector and facilitate a proposed joint venture with SUMITOMO Corporation in the biogas segment. The transaction is valued at fair market value as determined by an independent registered valuer and is expected to complete by November 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760895724673,
            "Source": "corporate_action"
        },
        {
            "Title": "TruAlt Bioenergy Shares Drop 6.7% from Listing Price in Two Trading Sessions",
            "Summary": "TruAlt Bioenergy shares declined 3.3% to Rs 513.10, falling 6.7% from its listing price of Rs 550 within two trading sessions. The stock had debuted at an 18.5% premium to its issue price following an IPO subscription of over 75 times, but faced selling pressure as investors booked profits. Analysts cite concerns over valuations being aggressive compared to renewable energy peers. The company reported strong financial performance with revenue rising 54% to Rs 1,969 crore and net profit surging nearly fivefold to Rs 147 crore. At the upper price band, TruAlt's valuation translates to roughly 29 times its earnings, which analysts consider higher than established sector players. Swastika Investmart recommended booking partial profits with a stop loss of Rs 520, while Reliance Securities highlighted the company's diversified portfolio and strategic positioning in India's renewable energy sector.",
            "Sentiment": "negative",
            "PublishDate": 1759732622365,
            "Source": "stock"
        }
    ]
}