{
    "Symbol": "TSFINV",
    "ISIN": "INE202Z01029",
    "News": [
        {
            "Title": "Sundaram Finance Holdings Reports Strong Q1 Growth with Revenue Rising to 1.8B Rupees",
            "Summary": "Sundaram Finance Holdings reported Q1 revenue of 1.8 billion rupees compared to 428 million rupees in the same period last year, representing significant year-over-year growth. The company's consolidated net profit increased to 1.6 billion rupees from 1.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754466228085,
            "Source": "earnings"
        },
        {
            "Title": "Sundaram Finance Holdings to Acquire 24.16% Stake in Axles India",
            "Summary": "Sundaram Finance Holdings has approved the acquisition of a 24.16% stake in Axles India. The deal is valued at 1.83 billion Indian Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744295576000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Finance Holdings to Acquire Forge 2000 for 160 Million Rupees",
            "Summary": "Sundaram Finance Holdings has approved the acquisition of a 100% stake in Forge 2000 for 160 million rupees. This move represents a significant corporate action that will likely expand Sundaram Finance Holdings' portfolio and operational capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1740355724000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Finance Holdings to Acquire Forge 2000 for 160 Million Rupees",
            "Summary": "Sundaram Finance Holdings has approved the acquisition of a 100% stake in Forge 2000 for 160 million rupees. This move represents a significant corporate action that will likely expand Sundaram Finance Holdings' portfolio and operations.",
            "Sentiment": "positive",
            "PublishDate": 1740147263000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Finance Holdings to Divest Stake in Delphi-TVS Technologies",
            "Summary": "Sundaram Finance Holdings has announced its decision to sell its entire stake in Delphi-TVS Technologies. The divestment is expected to fetch up to 400 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730814976000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sundaram Finance Holdings Reports Q2 FY24 Results",
            "Summary": "Sundaram Finance Holdings has reported its consolidated net profit for the second quarter of the fiscal year 2024. The company's net profit stood at 889 million rupees, compared to 907 million rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730793907000,
            "Source": "result"
        }
    ]
}