{
    "Symbol": "TTKHLTCARE",
    "ISIN": "INE910C01018",
    "News": [
        {
            "Title": "TTK Healthcare Independent Director Completes Tenure",
            "Summary": "TTK Healthcare announces completion of Mr. N Ramesh Rajan's second and final term as Independent Director effective February 03, 2026, following regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770034686836,
            "Source": "stocks"
        },
        {
            "Title": "TTK Healthcare Appoints V Sundaresan as Independent Director",
            "Summary": "TTK Healthcare Limited successfully completed postal ballot voting for appointing Mr V Sundaresan as Independent Director for 5-year term. Resolution passed with 99.9992% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1769506195450,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTK Healthcare Q3 Net Profit Drops 37% to ₹10.50 Cr",
            "Summary": "TTK Healthcare reported a significant decline in Q3 net profit, falling 37.13% year-on-year to ₹10.50 crores compared to ₹16.70 crores in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1769068089452,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTK Healthcare Board Meet on Jan 22 for Q3FY26 Results",
            "Summary": "TTK Healthcare Limited has scheduled a board meeting on January 22, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window remains closed until January 24, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767345266305,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTK Healthcare Appoints V Sundaresan as Independent Director",
            "Summary": "TTK Healthcare's board approved the appointment of V Sundaresan as Additional Independent Director for a five-year term, subject to shareholder approval through postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1766389652086,
            "Source": "stocks"
        },
        {
            "Title": "TTK Healthcare Reports 19% Growth in Q2 Net Profit Despite EBITDA Margin Decline",
            "Summary": "TTK Healthcare reported Q2 net profit of 204 million rupees, up from 172 million rupees in the previous year, representing an 18.6% increase. Revenue grew marginally to 2 billion rupees from 1.98 billion rupees year-over-year. However, EBITDA declined to 53.3 million rupees from 82.3 million rupees, while EBITDA margin compressed significantly to 2.62% from 4.15% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1760687023723,
            "Source": "earnings"
        },
        {
            "Title": "TTK Healthcare Announces Death of Promoter Group Member T T Venkatesh",
            "Summary": "TTK Healthcare Limited announced the death of Mr. T T Venkatesh, a member of the company's Promoter and Promoter Group, on September 17, 2025. Venkatesh held 14,000 equity shares (0.1% holding) in his personal capacity and was a 14% partner in M/s T T Krishnamachari & Co., which is a promoter holding 95,32,610 equity shares (67.46%) in the company. Following his death, Venkatesh will cease to be part of the Promoter and Promoter Group. His name will remain in the shareholding pattern until the transmission of his shares to his nominees.",
            "Sentiment": "negative",
            "PublishDate": 1758196891206,
            "Source": "corporate_governance"
        },
        {
            "Title": "TTK Healthcare Receives Income Tax Orders Withdrawing ₹2.27 Cr Interest, Plans Appeals",
            "Summary": "TTK Healthcare received income tax orders withdrawing ₹2.27 crore in interest for assessment years 2016-17 and 2017-18. The company plans to file appeals against these orders and expressed confidence in obtaining relief.",
            "Sentiment": "neutral",
            "PublishDate": 1756216645189,
            "Source": "stock"
        },
        {
            "Title": "TTK Healthcare Reports 61% Decline in Q1 EBITDA to 27 Million Rupees",
            "Summary": "TTK Healthcare's Q1 EBITDA dropped significantly to 27 million rupees compared to 69 million rupees in the same period last year, representing a 61% year-over-year decline. The company's EBITDA margin also compressed to 1.18% from 3.32% in the previous year's corresponding quarter, indicating reduced profitability.",
            "Sentiment": "negative",
            "PublishDate": 1754293151607,
            "Source": "earnings"
        },
        {
            "Title": "TTK Healthcare Reports 59% Drop in Net Profit Despite Revenue Growth",
            "Summary": "TTK Healthcare reported net profit of 130 million rupees compared to 315.7 million rupees in the same quarter last year, representing a significant decline. However, the company's revenue increased to 2.3 billion rupees from 2.08 billion rupees year-over-year, showing growth in the top line despite pressure on profitability.",
            "Sentiment": "negative",
            "PublishDate": 1754292736662,
            "Source": "earnings"
        },
        {
            "Title": "TTK Healthcare Reports 6% Revenue Growth to Rs 801.49 Crores, Maintains Rs 10 Dividend",
            "Summary": "TTK Healthcare held its 67th Annual General Meeting via video conferencing, reporting revenue growth of 6% to Rs 801.49 crores for 2024-25 compared to Rs 752.79 crores in the previous year. Pre-tax profit increased to Rs 108.33 crores from Rs 84.12 crores, including one-time income of Rs 19.77 crores from sale of leasehold land and Rs 5.86 crores write-off of male contraceptive inventories. Earnings per share rose to Rs 57.79 from Rs 44.47. The company maintains a cash balance of Rs 900 crores as of March 31, 2025. Business performance varied across segments: Consumer Products remained static with Woodward's Gripe Water facing volume challenges, EVA reported 5% growth, Skore achieved 12% volume growth, and Good Home sustained 15% growth. Animal Welfare Business grew 9%, Medical Devices showed mixed results with Heart Valve Division up 3% and Ortho Division up 18%, Protective Devices grew 9% despite USAID order cancellations, and Foods Business increased 8%. The board recommended maintaining dividend at Rs 10 per share. The AGM adopted financial statements, declared dividend, reappointed directors, and appointed auditors through e-voting.",
            "Sentiment": "positive",
            "PublishDate": 1753430795774,
            "Source": "corporate_action"
        },
        {
            "Title": "TTK Healthcare Reports Q4 Results and Declares Dividend",
            "Summary": "TTK Healthcare announced its Q4 financial results. The company's EBITDA was 120 million rupees, down from 124 million rupees year-over-year. EBITDA margin decreased to 6.31% from 6.86% in the previous year. Revenue increased to 1.9 billion rupees from 1.8 billion rupees year-over-year. The company's net profit declined to 161 million rupees from 183 million rupees in the same quarter last year. TTK Healthcare also declared a dividend of 10 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747988298000,
            "Source": "result"
        },
        {
            "Title": "TTK Healthcare Faces Setback as USAID Cancels Condom Procurement Agreement",
            "Summary": "TTK Healthcare announced the cancellation of its agreement with Chemonics, as USAID will cease current and future condom procurement activities from the company. USAID will not be procuring any goods from TTK Healthcare, leaving the company with unsold inventories valued at 58.6 million rupees. In response, TTK Healthcare plans to pursue possible remedies, including legal actions.",
            "Sentiment": "negative",
            "PublishDate": 1746186239000,
            "Source": "default"
        },
        {
            "Title": "TTK Healthcare Receives 90-Day Stop Work Order from USAID",
            "Summary": "TTK Healthcare has announced that it has been issued a 90-day stop work order by the United States Agency for International Development (USAID). The company states that it is currently unable to quantify the financial implications of this order on its operations.",
            "Sentiment": "negative",
            "PublishDate": 1738714635000,
            "Source": "corporate_action"
        },
        {
            "Title": "TTK Healthcare Receives 90-Day Stop Work Order from USAID",
            "Summary": "TTK Healthcare has announced that it has been issued a stop work order for 90 days by the United States Agency for International Development (USAID). The company states that it is currently unable to quantify the financial implications of this order on its operations.",
            "Sentiment": "negative",
            "PublishDate": 1738672116000,
            "Source": "corporate_action"
        },
        {
            "Title": "TTK Healthcare Reports Q3 Revenue Increase",
            "Summary": "TTK Healthcare announced its third quarter revenue, which rose to 2.05 billion rupees from 1.84 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737705697000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Healthcare Reports Improved Q3 EBITDA and Margin",
            "Summary": "TTK Healthcare has reported its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 77 million rupees from 53.3 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 3.75% from 2.90% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737705685000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Healthcare Reports Increased Q3 Net Profit",
            "Summary": "TTK Healthcare has reported a net profit of 167 million rupees for the third quarter, compared to 129 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737705636000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Healthcare Schedules Board Meeting for Q3 Results",
            "Summary": "TTK Healthcare has announced a board meeting scheduled for January 24 to consider and approve the company's financial results for the third quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1736430528000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TTK Healthcare Reports Q2 EBITDA Decline",
            "Summary": "TTK Healthcare's Q2 EBITDA decreased to ₹82.3 million from ₹95 million year-over-year. The EBITDA margin also fell to 4.15% from 5.13% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729842097000,
            "Source": "result"
        },
        {
            "Title": "TTK Healthcare Reports Q2 FY2024 Financial Results",
            "Summary": "TTK Healthcare announced its financial results for the second quarter of fiscal year 2024. The company reported a net profit of 172 million rupees, up from 160 million rupees in the same quarter last year. Revenue also increased to 1.98 billion rupees from 1.85 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729841992000,
            "Source": "result"
        }
    ]
}