{
    "Symbol": "TTKPRESTIG",
    "ISIN": "INE690A01028",
    "News": [
        {
            "Title": "TTK Prestige Q3FY26 Net Profit Drops 46% to ₹29.45 Cr",
            "Summary": "TTK Prestige reported Q3FY26 net profit of ₹29.45 crores, down 46% YoY, with revenue rising 9.7% to ₹731.71 crores. Exceptional items of ₹24.72 crores impacted profitability.",
            "Sentiment": "negative",
            "PublishDate": 1769672554914,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTK Prestige Q3FY26 Earnings Call Set for Jan 29",
            "Summary": "TTK Prestige Limited announces earnings call on January 29, 2026, at 3:30 PM to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767683708387,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTK Prestige Appoints Bibhas Sarkar as Senior GM",
            "Summary": "TTK Prestige Limited announces the appointment of Mr. Bibhas Sarkar as Senior General Manager for Strategy and Project Management, effective December 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767094997007,
            "Source": "stocks"
        },
        {
            "Title": "TTK Prestige completes share transmission filing",
            "Summary": "TTK Prestige files regulatory disclosure under SEBI SAST Regulations for transmission of 20.81 lakh shares from deceased promoter to legal heir Mukund Thiruvallur Thattai, completed on December 26.",
            "Sentiment": "neutral",
            "PublishDate": 1767013431229,
            "Source": "stocks"
        },
        {
            "Title": "TTK Prestige Opens Special Window for Re-lodgement of Physical Share Transfer Requests",
            "Summary": "TTK Prestige has opened a special six-month window from July 01, 2025 to January 08, 2026 for re-lodgement of physical share transfer requests that were rejected or returned due to deficiencies prior to April 01, 2019. The company published notices in Business Line newspaper and on LinkedIn, encouraging shareholders holding physical shares with pending transfers to utilize this one-time opportunity through their registrar KFin Technologies Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764591370292,
            "Source": "corporate_action"
        },
        {
            "Title": "TTK Prestige Reports Fire Incident at Roorkee Manufacturing Facility",
            "Summary": "TTK Prestige experienced a fire incident at its Roorkee manufacturing facility in the early hours of November 12, 2025. The fire was brought under control with no damage to plant and machinery, though certain raw materials, consumables and finished goods were partially damaged. The affected materials are covered under insurance. Production at the facility has been temporarily suspended for one day to allow for investigation and assessment. The company stated there will be no impact on sales or supplies as adequate finished goods inventory is available to meet current demand. TTK Prestige is taking steps to resume normal operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762941656634,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Allots 1,010 Equity Shares Under Employee Stock Option Plan",
            "Summary": "TTK Prestige Limited has allotted 1,010 equity shares with a face value of Re. 1 each at an issue price of Rs. 1 for Performance Linked Options under its Long Term Incentive (Stock Options) Plan 2023. The allotment was approved by the company's Nomination and Remuneration Committee and follows the exercise of options by eligible employees. The company's paid-up equity share capital increased from Rs. 13,69,49,974 to Rs. 13,69,50,984, consisting of 13,69,50,984 equity shares. The company had reserved 13,86,140 shares for allotment under this plan, which was approved by shareholders. Out of these, 26,410 options were vested with eligible employees, and 1,010 options have now been exercised, realizing Rs. 1,010 for the company. The newly allotted shares rank pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762928406651,
            "Source": "corporate_action"
        },
        {
            "Title": "TTK Prestige Introduces Voluntary Retirement Scheme at Hosur Factory",
            "Summary": "TTK Prestige Limited has introduced a Voluntary Retirement Scheme (VRS) for workmen at its Hosur factory. Approximately 43 workmen have opted to retire under the scheme, with additional acceptances expected by the closing date of November 1, 2025. The scheme is available to all eligible workmen at the Hosur facility. The company estimates the financial impact of the VRS to be approximately 9.5 crores. TTK Prestige believes the implementation will be mutually beneficial to both the workmen and the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761895690501,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Plans 49 New Products Launch and Strategic Investments Amid Export Concerns",
            "Summary": "TTK Prestige announced plans to introduce approximately 49 new products in the third quarter of FY 26. The company warned that its exports could be impacted by ongoing tariff wars. TTK Prestige also outlined strategic investments aimed at improving business operations and achieving cost savings, though these investments are expected to negatively affect operating EBITDA in the short term over the next 6-7 quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1761642677715,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Reports Strong Q2 Performance with Revenue Growth and Improved Profitability",
            "Summary": "TTK Prestige Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 786.64 crores for Q2 2025 compared to Rs. 708.52 crores in the previous year quarter. Net profit after tax reached Rs. 77.06 crores for Q2 2025, up from Rs. 63.20 crores in Q2 2024. For the half year period, revenue stood at Rs. 1,530.32 crores versus Rs. 1,259.77 crores in the previous year. The company operates in the kitchen and home appliances segment. Basic earnings per share for Q2 was Rs. 7.68 compared to Rs. 7.54 in the previous year quarter. The company incurred Rs. 35.60 crores in expenses for the first half related to business excellence initiatives and sustainable cost savings efforts. CSR expenditure was Rs. 3.20 crores for the half year. The Board meeting was held on October 28, 2025, where these results were approved.",
            "Sentiment": "positive",
            "PublishDate": 1761636657391,
            "Source": "earnings"
        },
        {
            "Title": "TT Jagannathan, TTK Group Chairman Emeritus and Prestige Founder, Passes Away",
            "Summary": "TT Jagannathan, Chairman Emeritus of TTK Group, passed away in Bengaluru. He revolutionized the pressure cooker industry by introducing the 'gasket release system', establishing Prestige as a household brand. Jagannathan held a PhD in operations research from Cornell University and served on TTK Prestige's board for fifty years. He authored 'Disrupt and Conquer-How TTK Prestige became a Billion Dollar Company', detailing the company's transformation from near-bankruptcy to success. He played a key role in turning around the TTK group and making it debt-free.",
            "Sentiment": "neutral",
            "PublishDate": 1760066667220,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Adds 12 Lakh Units Annual Capacity for Triply Cookware at Karjan Plant",
            "Summary": "TTK Prestige has commissioned additional manufacturing capacity of 12 lakh units annually for Triply Cookware at its Karjan plant. Commercial production at the expanded facility is scheduled to begin on October 3, 2025. This capacity expansion will increase the company's production capabilities for its cookware segment.",
            "Sentiment": "positive",
            "PublishDate": 1759405594251,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Announces Death of Promoter Group Member T T Venkatesh",
            "Summary": "TTK Prestige Limited announced the death of T T Venkatesh, a member of the Promoter and Promoter Group, on September 17, 2025. Venkatesh held 31,70,432 shares (2.32% stake) in his personal capacity and was a 14% partner in M/s T T Krishnamachari & Co., which holds 8,27,67,238 equity shares (60.44%) in the company. Following his death, Venkatesh will cease to be part of the Promoter Group. The company will process the transmission of his shareholding to his nominees, with shares remaining in his name until the transmission is completed.",
            "Sentiment": "negative",
            "PublishDate": 1758199096355,
            "Source": "corporate_governance"
        },
        {
            "Title": "TTK Prestige Appoints Tamilselvan Sankaralingam as Chief Technology Officer and Senior Management Personnel",
            "Summary": "TTK Prestige Limited announced the appointment of Mr. Tamilselvan Sankaralingam as Chief Technology Officer, who joined the company on September 15, 2025, and was designated as Senior Management Personnel from September 16, 2025. Sankaralingam holds an Executive MBA from Rotterdam School of Management, Netherlands, and joint Master's degrees from National University of Singapore and Eindhoven University of Technology. He previously worked with Philips Global Business Services LLP as Director for Sustaining Engineering for Image-guided therapy business in Pune, where he spent over two decades in various leadership roles across Singapore, Netherlands, and India in R&D, consumer marketing, and project management. At Philips, he led successful product initiatives in personal health including steam irons, coffee machines, shavers, and toothbrushes, and established a women's health start-up initiative. He also set up Global Capability Centers in India, leading an engineering team of over 150 people.",
            "Sentiment": "positive",
            "PublishDate": 1758009405673,
            "Source": "corporate_governance"
        },
        {
            "Title": "TTK Prestige Reaches Long-Term Settlement with Workers at Gujarat Factory",
            "Summary": "TTK Prestige Limited has concluded a long-term settlement with permanent workmen at its Karjan, Gujarat unit. The settlement provides for improved productivity in exchange for increased benefits extended to the workers.",
            "Sentiment": "positive",
            "PublishDate": 1756980830816,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Restarts Production at Roorkee Plant Following Flood Disruption",
            "Summary": "TTK Prestige has announced the resumption of production operations at its Roorkee manufacturing plant after flood-related disruptions. The company's plant had been affected by flooding, which temporarily halted production activities.",
            "Sentiment": "positive",
            "PublishDate": 1756105915915,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Roorkee Plant Operations Disrupted by Flooding, Full Resumption Expected August 25",
            "Summary": "TTK Prestige Limited's manufacturing plant in Roorkee, Uttarakhand experienced operational disruption due to heavy rains and flooding. Partial production has resumed at the facility, with normal operations expected to resume on August 25. The company is assessing potential asset damage but confirmed all assets are adequately insured. TTK Prestige stated it does not anticipate material impact on overall operations due to sufficient manufacturing capacity at other locations. The company will continue monitoring the situation and provide updates on full-scale production resumption.",
            "Sentiment": "neutral",
            "PublishDate": 1755938148280,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Expects EBITDA Margins Above 13% After Strategic Investments, Plans ₹200 Crore Investment",
            "Summary": "TTK Prestige stated it will not provide specific gross margin predictions as they depend on commodity prices, though the company expects margins to remain stable. The company anticipates EBITDA margins will return to over 13% after completing strategic investments in the coming quarters. TTK Prestige plans to invest ₹200 crore in strategic projects over the next three years. The company indicated it may adjust prices if necessary to protect margins while predicting gross margins will stay steady.",
            "Sentiment": "neutral",
            "PublishDate": 1753759395872,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Warns of Potential Export Impact from Tariff Conflicts",
            "Summary": "TTK Prestige has indicated that its export operations could face adverse effects due to ongoing tariff conflicts. The company has expressed concerns about how trade tensions and tariff disputes may impact its international business activities.",
            "Sentiment": "negative",
            "PublishDate": 1753693850829,
            "Source": "stock"
        },
        {
            "Title": "TTK Prestige Q1 Revenue Rises to 6.1B Rupees Despite Profit Decline",
            "Summary": "TTK Prestige reported Q1 revenue of 6.1 billion rupees, up from 5.9 billion rupees in the same period last year. However, the company's consolidated net profit declined to 266 million rupees from 417 million rupees year-over-year. EBITDA also decreased to 404 million rupees from 544 million rupees, with EBITDA margin contracting to 6.62% from 9.26% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753689269283,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige Reschedules Q1 FY 2025-26 Earnings Call to 4:00 PM on July 28, 2025",
            "Summary": "TTK Prestige Ltd has rescheduled its earnings call for the first quarter ended June 30, 2025, moving the time from 3:30 PM to 4:00 PM on July 28, 2025. The call will discuss unaudited financial results and will be moderated by Ambit Capital. Key company representatives participating include Managing Director & CEO Venkatesh Vijayaraghavan, Board Advisor K. Shankaran, and Whole-Time Director & CFO R. Saranyan. The company has provided updated conference call details with multiple access numbers for domestic and international participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753350793767,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige: Q4 Revenue Growth Muted, Dolat Capital Downgrades",
            "Summary": "TTK Prestige reported Q4 revenue of Rs 6.5 billion, up 4.3% YoY. Growth was muted compared to peers. Raw material costs declined, offset by increased staff and other expenses. Dolat Capital downgraded the stock to 'Add' and reduced the target price.",
            "Sentiment": "neutral",
            "PublishDate": 1748426930000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige: Q4 Net Loss and Margin Decline Trigger Stock Fall",
            "Summary": "TTK Prestige reported a net loss of ₹40.64 crore in Q4 FY23, compared to a profit of ₹58.7 crore in Q4 FY22. The loss includes an exceptional charge of ₹71.42 crore due to impairment. Revenue increased by 4.3% YoY to ₹650 crore, while EBITDA declined 33% YoY to ₹51.53 crore. EBITDA margin contracted by 500 basis points to 7.93%. The stock fell up to 8% following the results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1748338160000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige Reports Q4 Loss and Declares Dividend",
            "Summary": "TTK Prestige has announced a dividend of 6 rupees per share. The company's Q4 results show a revenue of 6.5 billion rupees, up from 6.2 billion in the same quarter last year. However, EBITDA decreased to 543 million rupees from 772 million, with EBITDA margin falling to 8.37% from 12.4%. The company reported a consolidated net loss of 420 million rupees for Q4, compared to a profit of 574 million in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748333440000,
            "Source": "result"
        },
        {
            "Title": "TTK Prestige to Consider Q4 Results on May 27",
            "Summary": "TTK Prestige, a leading kitchenware and home appliances company, has announced that it will consider its fourth quarter (Q4) financial results on May 27. This meeting will likely involve the company's board reviewing and approving the financial statements for the quarter ending March 31, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1742993497000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige: Leadership Transition Announced for 2025",
            "Summary": "TTK Prestige announces leadership changes effective March 25, 2025. TT Raghunathan to become non-executive chairman, Dr Mukund TT to be non-executive vice chairman. T T Jagannathan steps down after 50 years, becomes chairman emeritus and continues as non-executive director.",
            "Sentiment": "neutral",
            "PublishDate": 1742826572000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TTK Prestige Announces 5 Billion Rupee Investment Plan",
            "Summary": "TTK Prestige has announced a significant investment plan of 5 billion rupees over the next three years. The company will allocate 2 billion rupees for operational improvements and 3 billion rupees for capital expenditure. This investment is aimed at strengthening TTK Prestige's core business in pressure cookers and cookware.",
            "Sentiment": "positive",
            "PublishDate": 1739886733000,
            "Source": "corporate_action"
        },
        {
            "Title": "TTK Prestige: Q3 Profit Dips 6.45% Amid Revenue Decline",
            "Summary": "TTK Prestige reported Q3 FY25 results with profit falling 6.45% YoY to ₹58.45 crore and revenue declining 1.51% YoY to ₹727.23 crore. EPS decreased to ₹4.27. Operating income fell 8.85% YoY but rose 12.22% QoQ. Analysts maintain a 'Hold' recommendation.",
            "Sentiment": "negative",
            "PublishDate": 1738130698000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige Reports Decline in Q3 EBITDA and Margin",
            "Summary": "TTK Prestige, a consumer durables company, has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased from 850 million rupees to 790 million rupees year-over-year. Additionally, the EBITDA margin declined from 11.52% to 10.87% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738050762000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige Reports Q3 Revenue Decline",
            "Summary": "TTK Prestige, a consumer goods company, has reported its third-quarter revenue figures. The company's revenue for Q3 stood at 7.27 billion rupees, compared to 7.4 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738050441000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige Reports Q3 Consolidated Net Profit of 584 Million Rupees",
            "Summary": "TTK Prestige, a leading consumer goods company, has announced its financial results for the third quarter. The company reported a consolidated net profit of 584 million rupees, compared to 625 million rupees in the same period last year, indicating a slight decrease in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1738050406000,
            "Source": "earnings"
        },
        {
            "Title": "TTK Prestige Schedules Board Meeting for Q3 Results",
            "Summary": "TTK Prestige has announced a board meeting scheduled for January 28 to consider and approve the company's financial results for the third quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1734951985000,
            "Source": "corporate_action"
        },
        {
            "Title": "TTK Prestige: Export Slump May Persist, Q2 Margins Under Pressure",
            "Summary": "TTK Prestige's Q2 exports dropped 26% YoY to Rs 13.5 crore. MD Venkatesh Vijayaraghavan cites macroeconomic conditions and logistics issues as reasons, expecting a slow recovery. Q2 standalone revenue grew 3.6% YoY to Rs 708.5 crore, while PAT decreased to Rs 57.6 crore. EBITDA margins contracted to 13.5% due to rising raw material costs. The company is focusing on cost re-engineering and automation to mitigate expenses.",
            "Sentiment": "negative",
            "PublishDate": 1730776990000,
            "Source": "result"
        },
        {
            "Title": "TTK Prestige: Q2 Results Show Margin Pressure",
            "Summary": "TTK Prestige's Q2 results indicate that elevated commodity prices are likely to impact the company's margins. Yes Securities maintains a neutral stance on the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1730360422000,
            "Source": "result"
        },
        {
            "Title": "TTK Prestige Expresses Confidence in Growth Prospects",
            "Summary": "TTK Prestige has expressed confidence in their growth prospects during a recent conference call. The company cited robust export orders and a positive outlook from their distribution channels as key factors contributing to their optimistic view. The overall outlook for the company was described as 'quite positive'.",
            "Sentiment": "positive",
            "PublishDate": 1730344325000,
            "Source": "normal_news"
        },
        {
            "Title": "TTK Prestige Reports Decline in Q2 EBITDA and Margin",
            "Summary": "TTK Prestige, a consumer goods company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 720 million rupees, down from 810 million rupees in the same quarter last year. The EBITDA margin also decreased to 9.60% from 11.13% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730277707000,
            "Source": "result"
        },
        {
            "Title": "TTK Prestige Reports Slight Revenue Increase in Q2",
            "Summary": "TTK Prestige, an Indian kitchenware and appliances company, has reported a revenue of 7.5 billion rupees for the second quarter, compared to 7.3 billion rupees in the same period last year. This represents a modest year-over-year increase in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1730277626000,
            "Source": "result"
        },
        {
            "Title": "TTK Prestige Reports Q2 Consolidated Net Profit of 530 Million Rupees",
            "Summary": "TTK Prestige, a consumer goods company, has reported its second quarter consolidated net profit of 530 million rupees, compared to 593 million rupees in the same period last year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730277606000,
            "Source": "result"
        },
        {
            "Title": "TTK Prestige Concludes Long-Term Settlement with Khardi Workmen",
            "Summary": "TTK Prestige has announced the successful conclusion of a long-term settlement agreement with its permanent workmen at the Khardi facility. This agreement likely covers various aspects of employment terms and conditions for the workers.",
            "Sentiment": "positive",
            "PublishDate": 1730214187000,
            "Source": "corporate_action"
        }
    ]
}