{
    "Symbol": "TTL",
    "ISIN": "INE592B01024",
    "News": [
        {
            "Title": "T.T. Limited Promoter Group Buys 1.25 Lakh Shares",
            "Summary": "T T Brands Limited, a promoter group entity of T.T. Limited, purchased 1,25,125 equity shares worth ₹11.61 lakh over two days in February 2026, increasing their stake to 33.84%.",
            "Sentiment": "positive",
            "PublishDate": 1770724085199,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTL Promoter Group Acquires 1.57 Lakh Shares",
            "Summary": "T T Brands Limited, part of TTL's promoter group, purchased 1,56,879 equity shares through open market transactions, increasing their shareholding from 33.66% to 33.72% in the company.",
            "Sentiment": "positive",
            "PublishDate": 1770034784676,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTL Promoter Group Acquires Additional 52,109 Shares",
            "Summary": "Ms. Muskaan Jain from TTL's promoter group purchased 52,109 equity shares from December 29-31, 2025, following her earlier acquisition of 15,159 shares in December.",
            "Sentiment": "positive",
            "PublishDate": 1766838223105,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanjay Kumar Jain Increases Stake in T. Limited Through Open Market Purchase",
            "Summary": "Sanjay Kumar Jain, part of the promoter group, acquired 11,734 shares of T. Limited through open market transactions between December 1-5, 2025. His shareholding increased from 2.3062% to 2.3107% of the company's total share capital of 5,83,10,944 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1765016735706,
            "Source": "corporate_action"
        },
        {
            "Title": "TTL Director Sanjay Kumar Jain Purchases 15,188 Equity Shares",
            "Summary": "Mr. Sanjay Kumar Jain, Director from the Promoter Group of TTL, purchased 15,188 equity shares of the company on 27 November 2025. The transaction was disclosed to stock exchanges NSE and BSE under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764309673278,
            "Source": "corporate_action"
        },
        {
            "Title": "TTL Director Sanjay Kumar Jain Purchases 30,700 Equity Shares",
            "Summary": "Mr. Sanjay Kumar Jain, Director from the Promoter Group of TTL, purchased 30,700 equity shares of the company on 25 November 2025. The transaction was disclosed to stock exchanges NSE and BSE under SEBI insider trading regulations, indicating promoter confidence in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764068113596,
            "Source": "corporate_action"
        },
        {
            "Title": "T.T. Brands Limited Increases Shareholding to 33.66% Through Open Market Acquisition",
            "Summary": "T.T. Brands Limited, part of the promoter group, acquired 353,504 shares (0.136%) through open market transactions between November 18-21, 2025. The acquisition increased their total shareholding from 33.53% to 33.66% in the target company, strengthening promoter control.",
            "Sentiment": "neutral",
            "PublishDate": 1763793724402,
            "Source": "corporate_action"
        },
        {
            "Title": "TTL Director Sanjay Kumar Jain Increases Stake with 43,101 Share Purchase",
            "Summary": "Sanjay Kumar Jain, Director from the Promoter Group of T.T. Limited, purchased 43,101 equity shares on 20 November 2025 through open market transactions. The acquisition increased his shareholding from 2.272% to 2.2886% of the company's total voting capital of 5,83,10,944 shares.",
            "Sentiment": "positive",
            "PublishDate": 1763642757459,
            "Source": "corporate_action"
        },
        {
            "Title": "TTL Director Sanjay Kumar Jain Purchases 95,695 Equity Shares",
            "Summary": "Mr. Sanjay Kumar Jain, Director from the Promoter Group of TTL Limited, purchased 95,695 equity shares on 18 November 2025. The transaction was disclosed under SEBI insider trading regulations and communicated to NSE and BSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1763465614361,
            "Source": "corporate_action"
        },
        {
            "Title": "T.T. Limited Announces Diversification Into Corrugated Box Manufacturing and Vietnam Office Setup",
            "Summary": "T.T. Limited announced three new growth initiatives following a Board Meeting held on November 5, 2025. The vertically integrated textile company will enter corrugated box manufacturing at its Avinashi plant, targeting both in-house packaging needs and external clients in textile and FMCG sectors. The company plans to establish a sourcing and marketing office in Ho Chi Minh City, Vietnam, to strengthen export competitiveness and access European and US markets. Additionally, T.T. Limited will expand its Hiflyer brand into premium outerwear and high-end innerwear segments. Managing Director Sanjay Kumar Jain stated these initiatives represent steps toward becoming a more diversified and future-ready organization. The company operates across the textile value chain from yarn to retail, exports to over 65 countries, and holds a Well-Known Mark recognition from the Government of India.",
            "Sentiment": "positive",
            "PublishDate": 1762491736424,
            "Source": "stock"
        },
        {
            "Title": "TT Limited Fined Rs 2.14 Lakh by Stock Exchanges for Non-Compliance with Director Age Regulations",
            "Summary": "TT Limited received fines totaling Rs 2,14,760 (including GST) from NSE and BSE for non-compliance with SEBI regulations regarding the continuation of non-executive directors who have attained the age of seventy-five years. The non-compliance occurred due to the change in designation of Shri Rikhab Chand Jain from Executive Chairman Director to Non-Executive Chairman Director, who has attained the age of seventy-five years. The Board noted that the non-compliance was unintentional and arose due to the timing of the Board's decision and the subsequent requirement of shareholder approval. Shareholder approval for continuation of Shri Rikhab Chand Jain as Non-Executive Chairman was obtained at the Annual General Meeting held on 24th September, 2025. The company has applied for waiver of the fine and instructed the compliance team to strengthen internal monitoring to avoid recurrence.",
            "Sentiment": "negative",
            "PublishDate": 1762414086567,
            "Source": "corporate_governance"
        },
        {
            "Title": "TT Limited Reports Quarterly Results and Completes ₹240 Crore Rights Issue",
            "Summary": "TT Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The textile company reported total revenue of ₹4,720.67 lakhs for the quarter compared to ₹5,431.28 lakhs in the same period last year. Net profit for the quarter was ₹17.56 lakhs versus ₹48.75 lakhs in the previous year. For the half year, total revenue reached ₹9,547.26 lakhs with net profit of ₹60.29 lakhs. The company successfully completed a Rights Issue of Equity Shares, raising ₹240 crore, with allotment completed on August 5, 2025, and trading commencing on August 14, 2025. The company operates in a single segment - textiles. Basic earnings per share for the quarter was ₹0.01.",
            "Sentiment": "neutral",
            "PublishDate": 1762382918141,
            "Source": "earnings"
        },
        {
            "Title": "Hardik Jain Increases Stake in T.T. Limited Through Open Market Purchases",
            "Summary": "Hardik Jain, a member of the promoter group of T.T. Limited, acquired 13,400 shares through open market transactions on September 1 and 2, 2025. The acquisition increased his shareholding from 8,671,490 shares (3.357%) to 8,684,890 shares (3.3621%), representing an increase of 0.0051%. The transactions were completed across multiple dates, with the final acquisition occurring on September 2, 2025. T.T. Limited's shares are listed on BSE and NSE, with the company's total equity share capital remaining at 25,83,10,944 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757392509107,
            "Source": "corporate_action"
        },
        {
            "Title": "TTL Director Hardik Jain Purchases 13,400 Equity Shares",
            "Summary": "Hardik Jain, a Director from the promoter group of TTL, purchased 13,400 equity shares of the company on September 1st and 2nd, 2025. The transaction was disclosed under SEBI's Prohibition of Insider Trading regulations. The disclosure was submitted to both NSE and BSE by Company Secretary Rahul Maurya.",
            "Sentiment": "positive",
            "PublishDate": 1757140692430,
            "Source": "corporate_action"
        },
        {
            "Title": "T.T. Limited Reports 17.35% Sales Growth in Q1 FY26, Launches New West Bengal Factory",
            "Summary": "T.T. Limited, a leading knitwear company with 60 years of legacy, announced its Q1 FY26 financial results showing total income of ₹4,826.59 lakhs compared to ₹4,113.82 lakhs in Q1 FY25, representing 17.35% year-over-year growth. EBITDA improved significantly to ₹291.77 lakhs from a loss of ₹387.81 lakhs in the previous year. However, net profit declined to ₹42.72 lakhs from ₹671.08 lakhs, with the previous year including exceptional income of ₹1,704.25 lakhs. The company commenced commercial production at its new 1.25 lakh square feet factory in Howrah, West Bengal in July 2025. T.T. Limited's trademark has been officially recognized as a Well Known Mark by the Government of India, joining only 345 brands out of over 30 lakh registered trademarks with this distinction. The vertically integrated textiles company operates across yarn, knitted fabrics and garments, with facilities in multiple states and exports to over 65 countries through a network of 500 dealers and major e-commerce platforms.",
            "Sentiment": "positive",
            "PublishDate": 1754891395856,
            "Source": "earnings"
        },
        {
            "Title": "TT Limited Reports Quarterly Profit of ₹42.72 Lakhs, Revenue Rises to ₹4,816.92 Lakhs",
            "Summary": "TT Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The textile company reported revenue from operations of ₹4,816.92 lakhs, up from ₹4,104.68 lakhs in the same quarter last year. The company posted a profit of ₹42.72 lakhs compared to a profit of ₹671.08 lakhs in the previous year quarter. Total comprehensive income for the period was ₹34.83 lakhs. Basic and diluted earnings per share stood at ₹0.02. The company's Rights Issue to raise up to ₹4,000 lakhs closed on July 31, 2025 and was oversubscribed. TT Limited operates in a single segment - textiles.",
            "Sentiment": "positive",
            "PublishDate": 1754567522888,
            "Source": "earnings"
        },
        {
            "Title": "T.T. Limited's Rs. 40 Crore Rights Issue Oversubscribed by 1.13 Times",
            "Summary": "T.T. Limited completed its rights issue of 3,33,30,444 fully paid-up equity shares worth Rs. 40 crores, which closed on July 31, 2025. The issue was oversubscribed by 1.13 times, priced at Rs. 12 per equity share including a share premium of Rs. 11. The raised capital will fund the Avinashi project Capex, brand building activities, incremental working capital needs, and general corporate purposes. Managing Director Sanjay Kumar Jain acknowledged shareholder trust and highlighted the company's over three decades of market presence. The allotment and listing on BSE and NSE is expected around August 14, 2025. T.T. Limited is a vertically integrated textiles company operating across the yarn, knitted fabrics and garments chain, with the T.T. Brand recognized as a Well Known brand and Bollywood celebrity Rajkumar Rao as brand ambassador.",
            "Sentiment": "positive",
            "PublishDate": 1754043143051,
            "Source": "corporate_action"
        },
        {
            "Title": "TTL Ltd Closes Rights Issue of ₹4,000 Lakhs at ₹12 Per Share",
            "Summary": "TTL Ltd has closed its rights issue offering up to 3,33,30,444 fully paid-up equity shares at ₹12 per share, aggregating up to ₹4,000 lakhs. The rights issue was offered to existing eligible equity shareholders in the ratio of 4 rights equity shares for every 27 fully paid-up equity shares held on the record date of July 4, 2025. Each equity share has a face value of ₹1 with a share premium of ₹11 per equity share. The company published closure advertisements in Financial Express (English) and Jansatta (Hindi) national dailies on July 31, 2025, and submitted the same to NSE and BSE for regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1753950005012,
            "Source": "corporate_action"
        },
        {
            "Title": "TT Ltd Starts Commercial Production at New Manufacturing Facility in West Bengal",
            "Summary": "TT Ltd has commenced commercial production at its new 1.25 lakh square feet factory located in West Bengal Hosiery Park. The facility represents the company's expansion in manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1753073097422,
            "Source": "stock"
        }
    ]
}