{
    "Symbol": "TTML",
    "ISIN": "INE517B01013",
    "News": [
        {
            "Title": "TTML Faces Rs 2 Lakh TRAI Penalty for QoS Lapses",
            "Summary": "Tata Teleservices (Maharashtra) Limited receives financial disincentive from TRAI for failing to meet quality-of-service benchmarks in Mumbai service area for quarter ending June 2025.",
            "Sentiment": "negative",
            "PublishDate": 1770128638431,
            "Source": "stocks"
        },
        {
            "Title": "Tata Teleservices Q3 FY26: Revenue Falls 12% YoY",
            "Summary": "Tata Teleservices (Maharashtra) shares dropped 4% despite reduced losses as Q3 FY26 revenue declined 12% YoY to ₹294 crore, raising concerns over growth sustainability amid mixed quarterly performance.",
            "Sentiment": "negative",
            "PublishDate": 1768916047977,
            "Source": "co_actions_results"
        },
        {
            "Title": "TTML Board Meet on Jan 20 for Q3FY26 Results",
            "Summary": "Tata Teleservices (Maharashtra) Limited has scheduled a board meeting on January 20, 2026, to consider and approve Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768306694471,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Teleservices Maharashtra Receives Rs. 4.68 Crore Penalty Demands from DoT",
            "Summary": "Tata Teleservices (Maharashtra) Limited received two penalty demands totaling Rs. 4.68 crore from the Department of Telecommunications for alleged violations of subscriber verification norms during April 2007 to April 2012. The company is reviewing the demands and evaluating next steps, with the maximum financial impact being the extent of the penalty levied.",
            "Sentiment": "negative",
            "PublishDate": 1765019821864,
            "Source": "stock"
        },
        {
            "Title": "Tata Teleservices Maharashtra Shareholders Approve Nalin Rana's Director Appointment",
            "Summary": "Tata Teleservices (Maharashtra) Limited shareholders approved the appointment of Mr Nalin Rana (DIN:11211374) as a Non-Executive Non-Independent Director through postal ballot voting. The remote e-voting process ran from September 27 to October 26, 2025, with 77.19% of total shares participating in the voting. The ordinary resolution passed with 98.35% votes in favor and 1.65% against. Promoter and Promoter Group, holding 1,45,36,72,327 shares, voted 100% in favor. Public institutions cast 52.04% votes in favor while public non-institutions supported with 95.34% favorable votes. The company has 10,36,651 shareholders on record as of the cut-off date of September 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761558967351,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Teleservices Maharashtra Reports Rs 645.80 Crore Loss for Half Year Ended September 2025",
            "Summary": "Tata Teleservices (Maharashtra) Limited reported a net loss of Rs 645.80 crores for the half year ended September 30, 2025, compared to Rs 653.79 crores loss in the same period last year. Revenue from operations declined to Rs 570.38 crores from Rs 667.00 crores year-on-year. The company's EBITDA improved to Rs 286.58 crores from Rs 277.27 crores. Finance costs remained high at Rs 857.88 crores. The company's accumulated losses have exceeded its paid-up capital and reserves, with current liabilities exceeding current assets. However, the company received a support letter from its ultimate holding company indicating financial backing for the next 12 months. The company operates under a Unified License providing telecommunication services and has Commercial Papers worth Rs 990 crores outstanding as of September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761200826459,
            "Source": "earnings"
        },
        {
            "Title": "Tata Teleservices Maharashtra Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "Tata Teleservices (Maharashtra) Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Nalin Rana as a Non-Executive Non-Independent Director. The Board appointed Mr. Rana as an Additional Director on August 7, 2025, subject to member approval. The e-voting period runs from September 27 to October 26, 2025. Mr. Rana, aged 39, is currently a senior leader in the Group Strategy Office of Tata Sons Private Limited and previously worked as an Executive Director at Standard Chartered Bank for over 12 years. He holds a B.Tech in Electrical Engineering and a post-graduate management degree from IIM Indore. The resolution will be passed as an Ordinary Resolution through remote e-voting only, with NSDL providing the e-voting facility.",
            "Sentiment": "neutral",
            "PublishDate": 1758871221419,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Teleservices (Maharashtra) Company Secretary Vrushali Dhamnaskar Resigns",
            "Summary": "Tata Teleservices (Maharashtra) Limited announced that Ms Vrushali Dhamnaskar has resigned from her position as Company Secretary & Compliance Officer, effective December 13, 2025. She submitted her resignation to pursue an alternate career opportunity outside the organization. Following her resignation, she will cease to be a Key Managerial Personnel under Regulation 30(5) of the Listing Regulations. The company stated there are no material reasons for her resignation other than the career opportunity mentioned. Ms Dhamnaskar holds no shareholding in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758100793403,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Teleservices Partners With McAfee To Enhance Cybersecurity Solutions For Indian MSMEs",
            "Summary": "Tata Teleservices has formed a partnership with McAfee to strengthen cybersecurity offerings for micro, small, and medium enterprises (MSMEs) in India. The collaboration aims to provide enhanced cybersecurity solutions to the MSME sector.",
            "Sentiment": "positive",
            "PublishDate": 1754978309423,
            "Source": "stock"
        },
        {
            "Title": "Tata Teleservices Reports Flat Net Loss at 3.2B Rupees, Revenue Declines in Q1",
            "Summary": "Tata Teleservices reported a net loss of 3.2 billion rupees in Q1, unchanged from the same period last year. The company's revenue decreased to 2.8 billion rupees compared to 3.2 billion rupees in the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1753252100076,
            "Source": "earnings"
        },
        {
            "Title": "Tata Teleservices (Maharashtra) Ltd: Q4 Loss Narrows, Annual Revenue Rises",
            "Summary": "Tata Teleservices (Maharashtra) Ltd reported a narrowed Q4 FY25 loss of Rs 306.4 crore, down from Rs 309.3 crore in the previous year. Q4 revenue declined 5% to Rs 308.3 crore. For FY25, the company's loss widened to Rs 1,276.8 crore, while annual revenue increased 9.7% to Rs 1,308 crore. Q4 Ebitda improved to Rs 151.8 crore from Rs 142.5 crore last year. The company's curative petition in the AGR matter was rejected by the Supreme Court.",
            "Sentiment": "neutral",
            "PublishDate": 1745424342000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Teleservices Reports Q4 FY23 Financial Results",
            "Summary": "Tata Teleservices announced its Q4 financial results. The company reported a net loss of 3.06 billion rupees, slightly improved from a loss of 3.09 billion rupees in the same quarter last year. However, the loss widened compared to the previous quarter's loss of 3.15 billion rupees. Revenue for Q4 stood at 3.1 billion rupees, down from 3.23 billion rupees in the year-ago period.",
            "Sentiment": "negative",
            "PublishDate": 1745412723000,
            "Source": "result"
        },
        {
            "Title": "Tata Teleservices Reports Q3 Revenue Growth",
            "Summary": "Tata Teleservices has reported a revenue of 3.3 billion rupees for the third quarter, compared to 2.96 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737611862000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Teleservices Reports Q3 EBITDA Growth",
            "Summary": "Tata Teleservices has reported an EBITDA of 1.5 billion rupees for the third quarter, showing an increase from 1.4 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737611717000,
            "Source": "earnings"
        },
        {
            "Title": "Tata Teleservices Reports Q3 Net Loss of 3.1 Billion Rupees",
            "Summary": "Tata Teleservices has reported a net loss of 3.1 billion rupees for the third quarter, compared to a loss of 3.07 billion rupees in the same period last year. This represents a slight increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737611556000,
            "Source": "earnings"
        }
    ]
}