{
    "Symbol": "TVSELECT",
    "ISIN": "INE236G01019",
    "News": [
        {
            "Title": "TVS Electronics Board Meet Set for Feb 12, 2026",
            "Summary": "TVS Electronics Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770141889225,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Electronics GST Show Cause Notice Vacated",
            "Summary": "TVS Electronics successfully resolved a ₹25.65 crore GST demand notice from UP tax authorities. The show cause notice has been vacated with no actual demand raised after document examination.",
            "Sentiment": "positive",
            "PublishDate": 1765611280012,
            "Source": "stocks"
        },
        {
            "Title": "NCLT Chennai Approves TVS Electronics Merger with TVS Investments Private Limited",
            "Summary": "The National Company Law Tribunal (NCLT) Chennai has approved the merger plan between TVS Electronics and TVS Investments Private Limited. The approval enables the consolidation of these entities within the TVS group structure.",
            "Sentiment": "positive",
            "PublishDate": 1764694412009,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Electronics Resolves GST Dispute with Karnataka Department, Demand Reduced from Rs. 2.31 Cr to Rs. 48,190",
            "Summary": "TVS Electronics disclosed a material pending litigation with Karnataka GST Department regarding vendor payments made after 180 days from invoice date for financial year 2021-22. The company successfully reduced the GST demand from Rs. 2.31 crore to Rs. 48,190 through submission of supporting documents and will remit the final amount to conclude proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1764590300850,
            "Source": "stock"
        },
        {
            "Title": "TVS Electronics Reports Strong Q2 FY26 Performance with 22% Revenue Growth",
            "Summary": "TVS Electronics achieved consolidated revenue of Rs. 128 crores in Q2 FY26, marking 22% year-on-year growth, with EBITDA rising 81% to Rs. 5 crores and net profit of Rs. 1.5 crores. The Products and Solutions vertical drove performance with 27% growth to Rs. 93 crores, while Customer Support Services grew 10% to Rs. 35 crores, supported by new customer additions and higher volumes across manufacturing and logistics segments.",
            "Sentiment": "positive",
            "PublishDate": 1763457190037,
            "Source": "earnings"
        },
        {
            "Title": "TVS Electronics Focuses on Margin Improvement Through Business Expansion and Automation",
            "Summary": "TVS Electronics is implementing a strategic focus on margin improvement through multiple initiatives. The company is expanding its after-sales and mobility solutions while scaling contract manufacturing and IoT hardware integration. TVS Electronics is investing in automation and IT infrastructure to enhance operational efficiency. The company targets diversified revenue streams across digital services and hardware segments.",
            "Sentiment": "positive",
            "PublishDate": 1762963576589,
            "Source": "stock"
        },
        {
            "Title": "TVS Electronics Reports Mixed Performance with Revenue Growth but Net Loss in Q2 FY2026",
            "Summary": "TVS Electronics Limited announced its quarterly results for the period ended September 30, 2025. The company reported total revenue from operations of ₹12,750 lakhs, showing 32% quarter-on-quarter growth and 22% year-on-year growth. However, the company posted a net loss of ₹153 lakhs for the quarter, compared to a net profit of ₹155 lakhs in the previous quarter. For the half-year period, the company recorded a net loss of ₹402 lakhs. The company operates through two business segments: Products & Solutions (₹9,299 lakhs revenue) and Customer Support Services (₹3,452 lakhs revenue). Basic earnings per share stood at ₹0.83 for the quarter. The Board of Directors approved these unaudited financial results at their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762912685998,
            "Source": "earnings"
        },
        {
            "Title": "TVS Electronics Reports Strong Q2 Turnaround with 16M Rupees Net Profit",
            "Summary": "TVS Electronics delivered improved quarterly performance with EBITDA rising to 48 million rupees from 26 million rupees year-over-year, while EBITDA margin expanded to 3.74% from 2.51%. The company achieved a net profit of 16 million rupees compared to a loss of 13 million rupees in the same period last year. Revenue grew to 1.27 billion rupees from 1.04 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762875847218,
            "Source": "earnings"
        },
        {
            "Title": "TVS Electronics Chief Business Officer Sathya Doraisamy Resigns",
            "Summary": "TVS Electronics Limited announced the resignation of Mr. Sathya Doraisamy, Chief Business Officer, effective September 30, 2025. Mr. Doraisamy resigned to pursue career opportunities outside the organization. The company accepted his resignation and he will be relieved from his duties at the close of business hours on September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759236685543,
            "Source": "corporate_governance"
        },
        {
            "Title": "TVS Electronics Reports Wider Q1 Loss and Revenue Decline",
            "Summary": "TVS Electronics reported a net loss of 35.5 million rupees in Q1 compared to a loss of 12.6 million rupees in the same period last year. Revenue declined to 966.6 million rupees from 1.1 billion rupees year-over-year. EBITDA fell to 12.6 million rupees from 32 million rupees, while EBITDA margin compressed to 1.30% from 2.84% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755093132118,
            "Source": "earnings"
        },
        {
            "Title": "TVS Electronics Limited Approves Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "TVS Electronics Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, during their meeting held on August 13, 2025. The board meeting commenced at 12:00 PM and concluded at 5:00 PM. The company submitted the quarterly results along with a Limited Review Report from statutory auditors Guru & Jana LLP. The auditors concluded that nothing came to their attention suggesting the financial statements contain material misstatements or fail to comply with disclosure requirements under Indian Accounting Standards.",
            "Sentiment": "neutral",
            "PublishDate": 1755092321760,
            "Source": "earnings"
        },
        {
            "Title": "TVS Electronics Reports Q4 Financial Results",
            "Summary": "TVS Electronics has released its Q4 financial results. The company's EBITDA remained stable at 26 million rupees compared to the same period last year. However, the EBITDA margin decreased from 2.68% to 2.3%. TVS Electronics reported a net loss of 5.7 million rupees in Q4, compared to a profit of 5.7 million rupees in the same quarter last year. On a positive note, the company's revenue increased to 1.15 billion rupees from 970.8 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747495043000,
            "Source": "result"
        },
        {
            "Title": "TVS Electronics Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "TVS Electronics has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 30 million rupees, up from 5 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 3.04% from 0.59% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739452006000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Electronics Reports Reduced Q3 Loss and Increased Revenue",
            "Summary": "TVS Electronics has reported financial results for the third quarter. The company's net loss decreased to 6 million rupees, compared to a loss of 17 million rupees in the same period last year. Revenue for Q3 increased to 999 million rupees, up from 869 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739452001000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Electronics Reports Q2 Net Loss of 13M Rupees",
            "Summary": "TVS Electronics Ltd. has reported a net loss of 13 million rupees for the second quarter, compared to a profit of 11 million rupees in the same period last year. The company's revenue for Q2 increased to 1 billion rupees from 921 million rupees year-over-year. Sequentially, the loss widened from 12 million rupees in the previous quarter, while revenue decreased from 1.1 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731284255000,
            "Source": "result"
        }
    ]
}