{
    "Symbol": "TVSHLTD",
    "ISIN": "INE105A01035",
    "News": [
        {
            "Title": "TVS Holdings Gets CARE AA+ Rating on ₹950 Cr Debentures",
            "Summary": "CARE Ratings reaffirmed and assigned CARE AA+ stable ratings to TVS Holdings' non-convertible debentures worth ₹950 crore, citing strong group investments and financial flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1770722479625,
            "Source": "stocks"
        },
        {
            "Title": "TVS Holdings Q3 Net Profit Rises 25% to ₹5B",
            "Summary": "TVS Holdings reported consolidated net profit of ₹5 billion in Q3, marking a 25% year-on-year increase from ₹4 billion in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769591914043,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Holdings Board to Consider NCD Fundraising",
            "Summary": "TVS Holdings Limited has scheduled a board meeting on January 28, 2026, to consider raising funds through Non-Convertible Debentures on a private placement basis in multiple tranches over time.",
            "Sentiment": "neutral",
            "PublishDate": 1769067083806,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Holdings Limited Gets Credit Rating Reaffirmed by CARE Ratings",
            "Summary": "CARE Ratings Limited reaffirmed TVS Holdings Limited's credit rating at CARE AA-/Stable for its ₹750 crore non-convertible debentures through a press release dated November 25, 2025. The rating reflects the company's strong group presence as a core investment company holding a 50.26% stake in TVS Motor Company valued at ₹82,441 crore, providing substantial debt coverage of 87x against gross debt of ₹944 crore.",
            "Sentiment": "positive",
            "PublishDate": 1764138313145,
            "Source": "corporate_action"
        },
        {
            "Title": "VS Trust Pledges 1.8 Lakh TVS Holdings Shares for Rs 135 Crore Facility with HSBC",
            "Summary": "VS Trust has pledged 1,80,000 equity shares of TVS Holdings Limited to HSBC Invest Direct Financial Services (India) Limited as security for a facility worth Rs 135 crore. The pledge agreement was executed on November 7, 2025, for general purposes. The pledged shares represent 0.89% of TVS Holdings' total share capital and 24.25% of VS Trust's promoter shareholding. VS Trust, with Mr. Venu Srinivasan as trustee, holds 1,50,63,398 shares or 74.45% of TVS Holdings' total share capital. The security cover value of the pledged shares is Rs 270.22 crore against the borrowed amount of Rs 135 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1762923158791,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holding Reports 59% Jump in Quarterly Net Profit to 4.43 Billion Rupees",
            "Summary": "TVS Holding announced quarterly consolidated net profit of 4.43 billion rupees compared to 2.78 billion rupees in the same period last year, representing a year-on-year increase. The company's quarterly revenue rose to 145.49 billion rupees from 114.49 billion rupees year-on-year, showing growth across both profit and revenue metrics.",
            "Sentiment": "positive",
            "PublishDate": 1761696484424,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Reports Rs 32.20 Crore Profit for Half Year, Invests Rs 89.15 Crore in Home Credit India",
            "Summary": "TVS Holdings Limited announced quarterly results for the quarter ended September 30, 2025. The company reported a net profit of Rs 19.30 crore for the quarter and Rs 32.20 crore for the half year on a standalone basis. Basic earnings per share stood at Rs 174.06 for the half year. The company made a significant investment of Rs 89.15 crore in Home Credit India Finance Private Limited during the quarter. On a consolidated basis, the group reported total comprehensive income attributable to owners of Rs 479.87 crore for the quarter. The Board of Directors meeting was held on October 28, 2025, where these results were approved. The company operates through two main segments: Automotive Vehicles & Parts and Financial Services, with consolidated revenue of Rs 27,315.67 crore for the half year.",
            "Sentiment": "positive",
            "PublishDate": 1761650327313,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Approves Bonus Issue of Preference Shares Worth INR 986.52 Crore",
            "Summary": "TVS Holdings Limited's Board of Directors approved a Scheme of Arrangement to issue Cumulative Non-Convertible Redeemable Preference Shares (NCRPS) as bonus to shareholders. The scheme offers 46 NCRPS of INR 10 each for every 1 equity share held, with a total issue size of approximately INR 986.52 crore. The preference shares carry a 6% annual coupon rate and will be redeemed after 12 months from allotment. The bonus issue will utilize the company's general reserves and retained earnings, which stood at INR 1,456.26 crore as of March 31, 2025. The NCRPS are proposed to be listed on NSE and BSE. The scheme requires approvals from stock exchanges, National Company Law Tribunal, shareholders and creditors before implementation.",
            "Sentiment": "positive",
            "PublishDate": 1758531845521,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Schedules Board Meeting to Consider Bonus Preference Shares Issue",
            "Summary": "TVS Holdings Limited has scheduled a Board of Directors meeting for September 22, 2025, to consider issuing Cumulative Non-Convertible Redeemable Preference Shares as a bonus to shareholders. The company notified stock exchanges NSE and BSE about the meeting through Company Secretary R Raja Prakash.",
            "Sentiment": "neutral",
            "PublishDate": 1758021145993,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Reports Strong Q1 Results, Approves Rs 250 Crore Debenture Fundraising",
            "Summary": "TVS Holdings Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported total income of Rs 55.26 crores compared to Rs 136.37 crores in the same quarter last year, with profit for the period at Rs 12.82 crores versus Rs 12.90 crores previously. Consolidated results showed stronger performance with total income of Rs 12,753.64 crores compared to Rs 10,390.73 crores in the prior year quarter, and profit for the period reaching Rs 675.36 crores against Rs 481.03 crores. The Board also approved raising funds up to Rs 250 crores through issuance of Non-Convertible Debentures on a private placement basis. During the quarter, the company invested Rs 121.57 crores in Home Credit India Finance Private Limited. Earnings per share on a consolidated basis increased to Rs 165.85 from Rs 107.20 in the corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753953794599,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Reports Strong Q1 Growth with Revenue Up 21% and Net Profit Rising 52%",
            "Summary": "TVS Holdings delivered strong quarterly results with revenue increasing to 127 billion rupees from 104.75 billion rupees in the same period last year. The company's consolidated net profit grew significantly to 3.3 billion rupees compared to 2.17 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753952869345,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Limited Schedules Board Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "TVS Holdings Limited has scheduled a board meeting for July 31, 2025, to consider and approve raising funds through the issuance of Non-Convertible Debentures via private placement. The debentures will be issued in one or more tranches or series over a period of time. The company trades on BSE with scrip code 520056 and on NSE with scrip code TVSHLTD.",
            "Sentiment": "neutral",
            "PublishDate": 1753707430387,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Invests ₹121.57 Crore in Home Credit India",
            "Summary": "TVS Holdings has invested ₹121.57 crore in Home Credit India, maintaining its ownership at 81.04%. The investment suggests a strategic move by TVS Holdings to strengthen its position in the financial services sector through Home Credit India.",
            "Sentiment": "positive",
            "PublishDate": 1751033272000,
            "Source": "default"
        },
        {
            "Title": "TVS Holdings: Sudarshan Venu Becomes 'Significant Beneficial Owner'",
            "Summary": "Sudarshan Venu, Managing Director of TVS Holdings, has become a 'significant beneficial owner' through an inter-se transfer of promoter shares. This move is part of the company's succession plan, aligning ownership and management between the children of Venu Srinivasan and Mallika Srinivasan. TVS Holdings owns 50.26% of TVS Motor Company.",
            "Sentiment": "neutral",
            "PublishDate": 1745739817000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TVS Holdings Declares Interim Dividend of 93 Rupees per Share",
            "Summary": "TVS Holdings has announced an interim dividend of 93 rupees per share for its shareholders. This corporate action represents a significant return of value to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1742794490000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Ltd: Declares ₹4.75 Per Share Interim Dividend for FY25",
            "Summary": "TVS Holdings Ltd (formerly Sundaram-Clayton Ltd) has declared an interim dividend of ₹4.75 per share for FY25. The total payout is ₹10.42 crore. The record date is set for March 27, 2025, with disbursement within 30 days.",
            "Sentiment": "positive",
            "PublishDate": 1742556620000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Acquires Majority Stake in Home Credit India",
            "Summary": "TVS Holdings has acquired an 80.74% equity stake in Home Credit India. The remaining 19.26% stake will be held by Premji Invest and other associates. This acquisition represents a significant corporate action for TVS Holdings, expanding its presence in the financial services sector.",
            "Sentiment": "positive",
            "PublishDate": 1738574328000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Acquires Majority Stake in Home Credit India",
            "Summary": "TVS Holdings has acquired an 80.74% stake in Home Credit India for 554 crore rupees. The acquisition was made from Dutch and Czech entities, signifying a significant corporate action that expands TVS Holdings' portfolio in the financial services sector.",
            "Sentiment": "positive",
            "PublishDate": 1738380240000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Reports Strong Q3 Financial Results",
            "Summary": "TVS Holdings has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 3.86 billion rupees, up from 2.24 billion rupees in the same quarter last year. This also represents a quarter-over-quarter increase from 2.78 billion rupees. Revenue for Q3 rose to 114.6 billion rupees, compared to 100.14 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738109916000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Reports Improved Q3 EBITDA and Margin",
            "Summary": "TVS Holdings announced its Q3 financial results, showing an increase in EBITDA to 18.26 billion rupees from 15.4 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 15.93% from 15.38% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738062605000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Reports Q3 Revenue Growth",
            "Summary": "TVS Holdings has announced its third-quarter revenue results. The company reported revenue of 114.6 billion rupees, compared to 100.14 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738062593000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "TVS Holdings has announced its Q3 consolidated net profit, which stands at 3.86 billion rupees. This represents a substantial year-over-year increase from 2.24 billion rupees in the same quarter last year. Additionally, it shows a quarter-over-quarter growth from 2.78 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738062584000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Holdings Subsidiary Completes Acquisition of Radial Phase II and III",
            "Summary": "A subsidiary of TVS Holdings has successfully completed the acquisition of Radial Phase II and Phase III. This acquisition marks a significant corporate action for the company, potentially expanding its operations or assets.",
            "Sentiment": "positive",
            "PublishDate": 1734964562000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Announces Acquisition Cost of ₹5.76 Billion",
            "Summary": "TVS Holdings has set the acquisition cost at ₹5.76 billion (approximately $76 million USD). This significant financial commitment suggests a strategic move by the company, potentially to expand its operations or market presence. The specifics of what is being acquired are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1734512384000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings Subsidiary to Acquire Radial IT Park",
            "Summary": "A subsidiary of TVS Holdings is set to acquire 100% of the securities of Radial IT Park (Phase II and III). This acquisition represents a significant corporate action for TVS Holdings, potentially expanding its real estate or technology infrastructure portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1734512321000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings: Share Price Dips 0.58% Amid Market Gains",
            "Summary": "TVS Holdings shares are trading at ₹11,800, down 0.58% from the previous close. The stock has ranged between ₹11,753.45 and ₹11,801 today. Sensex and Nifty are up 0.86% and 0.88% respectively. Technical analysis suggests initial signs of a trend reversal after recent downtrend.",
            "Sentiment": "neutral",
            "PublishDate": 1732858616000,
            "Source": "normal_news"
        },
        {
            "Title": "TVS Holdings: Share Price Dips Slightly Amid Market Decline",
            "Summary": "TVS Holdings shares are trading at ₹12,019, down 0.11% on November 28, 2024. The stock has fluctuated between ₹12,192.6 and ₹12,019 during the day. Sensex is down 0.95% at ₹79,475.33, while Nifty is down 0.59%. Technical analysis suggests initial signs of a trend reversal after a recent downtrend.",
            "Sentiment": "neutral",
            "PublishDate": 1732772880000,
            "Source": "normal_news"
        },
        {
            "Title": "TVS Holdings: Share Price Stable Amid Mixed Market",
            "Summary": "TVS Holdings shares are trading at ₹11,857, unchanged from the previous close. The stock has fluctuated between ₹11,944 and ₹11,493.4 today. Technical analysis suggests initial signs of a trend reversal after a recent downtrend. The company's fundamentals show a ROE of 26.32% and ROA of 4.24%. Institutional holdings have seen minor changes, with a slight decrease in MF holding and increase in FII holding compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732685544000,
            "Source": "normal_news"
        },
        {
            "Title": "TVS Holdings: Share Price Rises 0.21% Amid Mixed Market",
            "Summary": "TVS Holdings shares are trading at ₹11844.05, up 0.21% from the previous close. The stock hit a high of ₹11908.9 and a low of ₹11747.65. Technical analysis suggests initial signs of a trend reversal after a recent downtrend. The company has a ROE of 26.32% and ROA of 4.24%. Mutual fund holding decreased slightly while FII holding increased in the September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732599144000,
            "Source": "normal_news"
        },
        {
            "Title": "TVS Holdings: Share Price Rises 1.77% Amid Market Upturn",
            "Summary": "TVS Holdings shares are trading at ₹11,742, up 1.77% from the previous close. The stock has hit a high of ₹11,848 and a low of ₹11,708.25. Sensex is up 1.56% at ₹80,350.98, while Nifty is up 1.78%. Technical analysis suggests initial signs of a trend reversal following a recent downtrend.",
            "Sentiment": "positive",
            "PublishDate": 1732514337000,
            "Source": "normal_news"
        },
        {
            "Title": "TVS Holding Reports Improved Q2 Financial Performance",
            "Summary": "TVS Holding has announced its Q2 financial results, showing an increase in EBITDA to 16.7 billion rupees from 14.8 billion rupees year-over-year. The company's EBITDA margin also improved to 14.51% from 13.98% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729697893000,
            "Source": "result"
        },
        {
            "Title": "TVS Holding Reports Q2 Revenue Growth",
            "Summary": "TVS Holding has announced its Q2 revenue, which stands at 115.54 billion rupees, compared to 106.1 billion rupees in the same quarter last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729697868000,
            "Source": "result"
        },
        {
            "Title": "TVS Holding Reports Q2 Profit Increase",
            "Summary": "TVS Holding announced its Q2 consolidated net profit of 2.78 billion rupees, showing an increase from 2.28 billion rupees year-over-year and 2.17 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729697852000,
            "Source": "result"
        },
        {
            "Title": "TVS Holdings: Board to Consider NCD Issuance for Fundraising",
            "Summary": "TVS Holdings' board will meet on October 23, 2024, to consider raising funds through non-convertible debentures (NCDs) via private placement. The board will also review Q2 FY2025 financial results. This follows CCI's recent approval of TVS Holdings' acquisition of an 80.74% stake in Home Credit India Finance.",
            "Sentiment": "positive",
            "PublishDate": 1729072670000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Holdings: CRISIL Upgrades Outlook to 'Positive', Reaffirms 'AA' Rating",
            "Summary": "<p>CRISIL Ratings revised TVS Holdings' outlook to <span class='positive'>'positive'</span> from <span class='neutral'>'stable'</span> while maintaining <b>'AA'</b> rating. The change reflects <span class='positive'>improved credit profile</span> of TVS Motor Company, driven by <span class='positive'>market share gains</span> and <span class='positive'>product expansion</span>. TVS Holdings' 50.26% stake in TVS Motor is valued at <b>Rs 68,718 crore</b>, providing <span class='positive'>strong debt cover</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728643500000,
            "Source": "normal_news"
        },
        {
            "Title": "TVS Holdings Winds Up Automotive Spare Parts Trading Business",
            "Summary": "<p>TVS Holdings has announced the <span class='negative'>closure</span> of its business division that was involved in <span class='neutral'>trading automotive spare parts</span>. This decision marks a <b>significant change</b> in the company's <span class='neutral'>operational structure</span> and <span class='neutral'>business focus</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728570228000,
            "Source": "corporate_action"
        }
    ]
}