{
    "Symbol": "TVSMOTOR",
    "ISIN": "INE494B01023",
    "News": [
        {
            "Title": "TVS Motor Delivers Two iQube Electric Scooters to Vatican",
            "Summary": "TVS Motor Company delivered two iQube electric scooters to Vatican City State on February 5th, 2026, through partnership with TVS Motor Italia and Exelentia, supporting Vatican's zero-emission mobility goals.",
            "Sentiment": "positive",
            "PublishDate": 1770822356437,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motor Launches Ronin Top & Ntorq RE in Egypt",
            "Summary": "TVS Motor Company strengthens its Egyptian presence with the launch of TVS Ronin Top and TVS Ntorq Race Edition, marking a significant expansion in the premium two-wheeler segment through its partnership with Ezz LCV.",
            "Sentiment": "positive",
            "PublishDate": 1770486935209,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motor Appoints Madhu Srivastava as HR President",
            "Summary": "TVS Motor Company announces appointment of Madhu Manral Srivastava as President & Group Head – Human Resources, effective February 6, 2026. Former Vedanta Global CHRO brings cross-industry expertise.",
            "Sentiment": "positive",
            "PublishDate": 1770372928799,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motor January Sales Jump 28.7% to 511,766 Units",
            "Summary": "TVS Motor Company reported strong January sales of 511,766 units, marking a significant 28.7% increase from 397,623 units in the same month last year, though slightly below analyst estimates of 513,000 units.",
            "Sentiment": "positive",
            "PublishDate": 1769931729172,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motors Optimistic About Q4 Auto Industry Performance",
            "Summary": "TVS Motors expresses positive outlook for the automotive industry's fourth quarter performance, indicating strong expectations for the sector's growth during this period.",
            "Sentiment": "positive",
            "PublishDate": 1769593928125,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motor Posts Record Q3 Sales Growth of 27%",
            "Summary": "TVS Motor Company achieved its highest ever quarterly sales of 15.44 lakh units in Q3 FY26, marking a strong 27% growth compared to 12.12 lakh units in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1769586675389,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Motor Q3 Net Profit Jumps 52% to ₹9.4 Billion",
            "Summary": "TVS Motor Company reported a strong 52% year-on-year growth in Q3 net profit to ₹9.4 billion, slightly missing analyst estimates of ₹9.8 billion but demonstrating robust operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769586342176,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Motor Q3FY26 Results Call on Jan 28",
            "Summary": "TVS Motor Company has rescheduled its Q3FY26 results conference call to 2:45 PM IST on January 28, 2026, with CEO K N Radhakrishnan and CFO K Gopala Desikan participating.",
            "Sentiment": "neutral",
            "PublishDate": 1769502823486,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Motors' US Associate Altizon Ceases Operations",
            "Summary": "TVS Digital's stake in Altizon Inc., USA reduced from 20.064% to 10.489% due to additional share issuance to promoters, causing Altizon to cease being an associate company effective January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769178158380,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Motor Appoints Kalpana Unadkat as Independent Director",
            "Summary": "TVS Motor Company shareholders approve appointment of Ms Kalpana Unadkat as Non-Executive Independent Director for five years through postal ballot with 86.49% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1769097323533,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Maintains 'Add' Rating on TVS Motor at ₹3,950",
            "Summary": "Kotak Institutional Equities retains 'Add' rating on TVS Motor with revised fair value of ₹3,950, citing strong domestic recovery, EV leadership, and robust export growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768358921852,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motor Q3FY26 earnings call set for Jan 28",
            "Summary": "TVS Motor Company announces conference call on January 28, 2026 at 3:30 PM IST to discuss Q3FY26 financial performance with CEO K N Radhakrishnan and CFO K Gopala Desikan participating.",
            "Sentiment": "neutral",
            "PublishDate": 1768300316507,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Motor December Sales Beat Estimates at 4.81 Lakh Units",
            "Summary": "TVS Motor Company reported December sales of 4,81,389 units, beating estimates of 3,98,000 units with 50% YoY growth driven by strong domestic and electric vehicle performance.",
            "Sentiment": "positive",
            "PublishDate": 1767273416409,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motor shares in focus as Q3FY26 sales hit record high",
            "Summary": "TVS Motor shares likely in focus after reporting highest-ever quarterly sales of 15.44 lakh units in Q3FY26 with 27% growth. December volumes surged 50% with strong performance across segments.",
            "Sentiment": "positive",
            "PublishDate": 1767273156265,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Motor Signs MoU With Manba Finance For 3-Wheeler Loans",
            "Summary": "TVS Motor Company signed MoU with Manba Finance Limited on December 30, 2025, to provide retail financing solutions for commercial mobility vehicles including passenger and cargo three-wheelers across ICE and EV models.",
            "Sentiment": "positive",
            "PublishDate": 1767078486063,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Motor Appoints Kalpana Unadkat as Director",
            "Summary": "TVS Motor Company has appointed Ms. Kalpana Unadkat as an Independent Director. She currently serves on the boards of DMart, TVS Credit Services, and Eris Lifesciences.",
            "Sentiment": "positive",
            "PublishDate": 1765777258244,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Cuts TVS Motor to Hold, Sets ₹4,000 Target",
            "Summary": "HSBC downgrades TVS Motor Company from previous rating to Hold with a target price of ₹4,000 per share, reflecting revised outlook on the automotive manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1765375643554,
            "Source": "stocks"
        },
        {
            "Title": "TVS Motor Unveils AR-Enabled Helmet and Racing Academy at MotoSoul 5.0",
            "Summary": "TVS Motor Company showcased the Aegis Rider Vision AR HUD Helmet with advanced safety features, announced a partnership with MT Helmets for ECE-certified products, and launched the TVS Racing Offroad Training Academy on Day 2 of MotoSoul 5.0. The initiatives focus on next-generation rider safety technology, premium helmet manufacturing collaboration, and specialized off-road training programs to enhance the motorcycling experience and safety standards.",
            "Sentiment": "positive",
            "PublishDate": 1765021612569,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor November Sales Rise 29% to 519,508 Units But Miss Analyst Estimates",
            "Summary": "TVS Motor reported November sales of 519,508 units, marking a 29% increase from 401,250 units in the same month last year. The sales figures fell short of analyst estimates of 507,070 units, indicating performance below market expectations despite the year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1764571919959,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor-BMW Motorrad Partnership Achieves 200,000 Units Production Milestone",
            "Summary": "TVS Motor Company and BMW Motorrad announced reaching 200,000 units produced under their strategic partnership that began in 2013, with products now available in over 100 markets globally. The companies are commencing manufacturing of the new BMW F450GS at TVS Motor's Hosur plant, marking the next phase of their collaboration in the sub-500cc motorcycle segment.",
            "Sentiment": "positive",
            "PublishDate": 1764234860794,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Launches New Three-Wheeler Range in Ghana Market",
            "Summary": "TVS Motor has unveiled its new TVS King three-wheeler range in Ghana, expanding its commercial vehicle offerings in the African market. The launch represents the company's strategic move to strengthen its presence in Ghana's three-wheeler segment.",
            "Sentiment": "positive",
            "PublishDate": 1763734455245,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Launches Apache RTR 180 Motorcycle in Kenya",
            "Summary": "TVS Motor has launched its Apache RTR 180 motorcycle model in the Kenyan market. The launch represents the company's expansion efforts in the East African motorcycle segment.",
            "Sentiment": "positive",
            "PublishDate": 1763381321463,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Company Sees Rs. 105.69 Crore Block Trade on NSE",
            "Summary": "TVS Motor Company witnessed a significant block trade worth Rs. 105.69 crores involving approximately 309,699 shares at Rs. 3,412.80 per share on the NSE. The large-volume transaction indicates substantial institutional or bulk investor activity in the two-wheeler manufacturer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763356675436,
            "Source": "order&deals"
        },
        {
            "Title": "Norton Establishes Norton USA LLC In Delaware",
            "Summary": "Norton has established Norton USA LLC in Delaware. The news is associated with TVS Motor.",
            "Sentiment": "neutral",
            "PublishDate": 1762516518206,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Divests Stake in Rapido for INR 287.94 Crore",
            "Summary": "TVS Motor Company Limited has entered into share purchase agreements to sell its shareholding in Roppen Transportation Services Private Limited (Rapido) to two buyers. Accel India VIII (Mauritius) Limited will purchase 11,997 Series D Compulsory Convertible Preference Shares for INR 143.96 crore, while MIH Investments One B.V. will acquire 10 equity shares and 11,988 Series D CCPS for INR 143.98 crore. The total consideration amounts to INR 287.94 crore. The transaction is subject to regulatory approvals and represents a monetization of TVS Motor's investment in the transportation services company. Both purchasers are not related to TVS Motor's promoter group.",
            "Sentiment": "positive",
            "PublishDate": 1762463456220,
            "Source": "order&deals"
        },
        {
            "Title": "TVS Motor Company Independent Director Dr. Deepali Pant Rajeev Joshi Resigns",
            "Summary": "Dr. Deepali Pant Rajeev Joshi resigned as Independent Director of TVS Motor Company Limited effective November 6, 2025, to pursue other interests. She also ceased to be a member of the Audit Committee and Nomination and Remuneration Committee, and stepped down as Chairperson of the Stakeholders Relationship Committee. Dr. Joshi confirmed there are no material reasons for her resignation other than pursuing other interests. She holds directorships in other listed entities including LMW Limited, Aurobindo Pharma Ltd, and Coromandel International Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762444053200,
            "Source": "corporate_governance"
        },
        {
            "Title": "TVS Motor's Norton Plans £200 Million Investment with Four New Motorcycle Models",
            "Summary": "TVS Motor Company's Norton brand has announced a new strategic plan featuring four new motorcycle models and a £200 million investment. The plan targets 25% workforce growth and aims to establish over 200 global showrooms as part of the brand's expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762252475436,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Company Sees Rs. 688.36 Crore Block Trade on NSE",
            "Summary": "TVS Motor Company executed a block trade worth Rs. 688.36 crores on the National Stock Exchange. The transaction involved approximately 1,983,869 shares at a price of Rs. 3,469.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762249910897,
            "Source": "order&deals"
        },
        {
            "Title": "TVS Motor Launches Six New Products at EICMA 2025, Expands European Market Focus",
            "Summary": "TVS Motor unveiled six new products at EICMA 2025, including the TVS Tangent RR Concept and TVS eFX Three O. The company introduced AR-based heads-up display helmets and connected technology solutions. TVS Motor announced expanded global plans with particular emphasis on the European market.",
            "Sentiment": "positive",
            "PublishDate": 1762249378324,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Acquires 2.9 Million Shares in TVS Credit Services for ₹1.72 Billion",
            "Summary": "TVS Motor has received an allocation of 2.9 million shares in TVS Credit Services at a total cost of ₹1.72 billion. This represents a significant investment by the automotive manufacturer in the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1762175690956,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Reports October Sales of 543,557 Units, Beating Estimates",
            "Summary": "TVS Motor recorded total sales of 543,557 units in October, representing an increase from 489,015 units in the same period last year. The sales figure exceeded the estimated 521,400 units.",
            "Sentiment": "positive",
            "PublishDate": 1762128874484,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Reports 11% Growth in October Sales, Exceeds Estimates",
            "Summary": "TVS Motor recorded total sales of 543,557 units in October, representing an 11% increase compared to 489,015 units in the same period last year. The sales figure also surpassed analyst estimates of 521,400 units for the month.",
            "Sentiment": "positive",
            "PublishDate": 1761981774628,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Reports Record Quarterly Performance with 29% Revenue Growth and 40% EBITDA Jump",
            "Summary": "TVS Motor Company achieved its highest ever quarterly sales in both ICE and EV segments. Revenue grew 29% to INR 11,905 crores compared to INR 9,228 crores in the same quarter last year. Operating EBITDA surged 40% to INR 1,509 crores with margins improving 100 basis points to 12.7%. Sales volume increased 23% with domestic ICE two-wheeler sales growing 21% against industry growth of 8%. International sales rose 31% versus industry growth of 26%. EV two-wheeler sales grew 7% to 80,000 units despite magnet availability challenges. Three-wheeler sales jumped 41% to 53,000 units. Profit after tax increased 37% to INR 906 crores. For the first half, revenue grew 25% to INR 21,986 crores with PAT rising 36% to INR 1,685 crores. The company launched several new products including TVS Orbiter EV scooter, TVS King Kargo HD EV, TVS Ntorq 150, and Apache RTX. TVS Credit achieved significant growth with loans disbursed to over 25 lakh new customers, bringing total customer base to over 2.13 crores. International business posted highest ever quarterly sales crossing 400,000 units driven by strong growth in Africa and Latin America.",
            "Sentiment": "positive",
            "PublishDate": 1761918710559,
            "Source": "earnings"
        },
        {
            "Title": "TVS Motor Reports 32% YoY Festive Sales Growth, EV Revenue Reaches ₹1,269 Cr",
            "Summary": "TVS Motor reported a 32% year-on-year increase in festive sales. The company expects 8% growth in the ICE (Internal Combustion Engine) segment and anticipates rural demand to strengthen. The company's scooters are outpacing industry performance. TVS Motor is receiving benefits from the PLI (Production Linked Incentive) scheme, and its EV revenue reached ₹1,269 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761660501700,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Plans to Launch Norton Products in India by April 2026",
            "Summary": "TVS Motor has announced plans to introduce Norton products in the Indian market by April 2026. The company aims to bring the Norton motorcycle brand to Indian consumers within the specified timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1761652640485,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Reports Strong Q2 Results Despite Magnet Supply Challenges",
            "Summary": "TVS Motor Company delivered robust quarterly performance with revenue of 119 billion rupees, up from 92.3 billion rupees year-over-year, slightly exceeding estimates of 117.58 billion rupees. EBITDA reached 15.08 billion rupees compared to 10.8 billion rupees in the previous year, nearly matching estimates of 15.09 billion rupees. The EBITDA margin improved to 12.67% from 11.7% year-over-year, though falling short of the estimated 12.8%. Net profit stood at 9.1 billion rupees versus 6.6 billion rupees year-over-year, coming in below estimates of 9.53 billion rupees. The company indicated that magnet availability will continue to present operational challenges in the short to medium term.",
            "Sentiment": "positive",
            "PublishDate": 1761644505624,
            "Source": "stock"
        },
        {
            "Title": "Norton Motorcycles Releases First Design Sketch for New Flagship Superbike Under Resurgence Campaign",
            "Summary": "Norton Motorcycles unveiled the first official design sketch of its new flagship superbike to be manufactured at its Solihull headquarters. The sketch, created by Head of Design Simon Skinner, represents a new modern design philosophy under the advisory of Professor Gerry McGovern OBE, who has been named Chief Creative Advisor. An all-new range of motorcycles will be revealed at EICMA in Milan later this year, featuring the new superbike and introducing a reimagined brand identity. The development is part of Norton's Resurgence programme, which establishes the future direction of the brand. Norton Motorcycles was acquired by TVS Motor Company in April 2020.",
            "Sentiment": "positive",
            "PublishDate": 1761145750812,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Launches Apache RTX Adventure Motorcycle at Rs 1.99 Lakh",
            "Summary": "TVS Motor Company launched the TVS Apache RTX, marking its entry into the adventure rally tourer segment. The motorcycle is priced at Rs 1,99,000 as an introductory offer and is powered by a new 299.1cc single-cylinder engine producing 36 PS at 9,000 rpm and 28.5 Nm torque at 7,000 rpm. Built on the Next-Gen TVS RT-XD4 engine platform, the Apache RTX features four ride modes, bi-directional quickshifter, 5-inch TFT display with Bluetooth connectivity, cruise control, and traction control. The motorcycle comes with steel trellis frame, WP suspension, and is available in five color options across three variants. TVS positions this as a super-premium offering targeting adventure seekers and rally touring enthusiasts, leveraging the Apache brand's legacy with over 6 million riders globally.",
            "Sentiment": "positive",
            "PublishDate": 1760529530771,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Launches New Raider Motorcycle with Two Variants",
            "Summary": "TVS Motor has unveiled the new TVS Raider motorcycle featuring advanced capabilities. The motorcycle is available in two variants: the TFT DD model priced at ₹95,600 and the SXC DD model priced at ₹93,800. The launch represents the company's expansion of its motorcycle product portfolio with enhanced features.",
            "Sentiment": "positive",
            "PublishDate": 1759743156494,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor's Singapore Subsidiary Completes 100% Acquisition of Engines Engineering S.p.A",
            "Summary": "TVS Motor (Singapore) Pte Ltd has completed the acquisition of 100% share capital of Engines Engineering S.p.A on October 3, 2025. The acquisition involved purchasing 1,000,000 equity shares from ACT S.r.l., making Engines Engineering S.p.A a wholly owned subsidiary of TVS Motor (Singapore) Pte Ltd and TVS Motor Company Limited. The transaction was previously announced on September 25, 2025, subject to completion of agreed conditions precedent.",
            "Sentiment": "positive",
            "PublishDate": 1759553425052,
            "Source": "order&deals"
        },
        {
            "Title": "TVS Motor Reports September Sales of 541,064 Units, Up 12% Year-on-Year",
            "Summary": "TVS Motor achieved total sales of 541,064 units in September, representing a year-on-year increase from 482,495 units in the same period last year. The sales figure came in slightly below the estimated 549,700 units.",
            "Sentiment": "positive",
            "PublishDate": 1759456912258,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor September Sales Rise 12% Year-on-Year to 541,064 Units, Miss Market Estimates",
            "Summary": "TVS Motor reported September sales of 541,064 units, representing an increase from 482,495 units in the same month last year. However, the sales figure fell short of market estimates of 549,700 units for the month.",
            "Sentiment": "neutral",
            "PublishDate": 1759318874644,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Revamps Norton Motorbikes for U.S. Market Expansion",
            "Summary": "TVS Motor is revamping Norton Motorbikes as part of its strategy to expand into the U.S. market. The company is working on enhancing the Norton motorcycle brand to establish a presence in the American market.",
            "Sentiment": "positive",
            "PublishDate": 1759116512751,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Singapore Acquires Engines Engineering S.p.A for EUR 5.05 Million",
            "Summary": "TVS Motor (Singapore) Pte Ltd has agreed to acquire 1,000,000 equity shares in Engines Engineering S.p.A from ACT S.r.l for EUR 5.05 per share, totaling EUR 5,050,000. The acquisition will make Engines Engineering S.p.A a wholly owned subsidiary of TVS Motor Singapore and TVS Motor Company Limited. Engines Engineering is an Italy-based company specializing in styling, design, engineering and testing services for two-wheeled and three-wheeled vehicles, with expertise in high-performance and high-displacement vehicles. The company was incorporated on July 1, 2008, and generated revenues of EUR 11.47 million in 2022, EUR 5.53 million in 2023, and EUR 11.28 million in 2024. The acquisition is expected to complete by October 1, 2025, subject to agreed conditions. TVS Motor states this acquisition aligns with its vision of becoming a leading global mobility player and will provide automobile design and engineering services for the company and its subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1758804479800,
            "Source": "order&deals"
        },
        {
            "Title": "TVS Motor Company Launches Two New Motorcycle Models in Nepal Market",
            "Summary": "TVS Motor Company unveiled the TVS Apache RTR 160 2V Fi and TVS Raider iGo motorcycles in Nepal. The Apache RTR 160 2V Fi targets performance enthusiasts with features including dual disc brakes, single-channel ABS, connected digital cluster, AHO LED headlamp, and three ride modes. The Raider iGo is designed for young, tech-savvy riders and includes TFT digital cluster, iGo start-stop technology, and sporty split seat. The Apache will be available in three colors while the Raider comes in two colors. TVS Motor operates over 60 sales touchpoints and 26 service centers throughout Nepal. The company sells products in more than 80 countries and has four manufacturing facilities in India and Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1758462128603,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Launches CNG 3-Wheeler in Tanzania Market",
            "Summary": "TVS Motor has launched the TVS King Deluxe Plus CNG 3-Wheeler in Tanzania. The launch represents the company's expansion of its commercial vehicle offerings in the African market with a compressed natural gas-powered three-wheeler variant.",
            "Sentiment": "positive",
            "PublishDate": 1758107115246,
            "Source": "stock"
        },
        {
            "Title": "TVS Chairman Highlights GST 2.0 Impact on Middle-Income Groups and EV Sales Growth",
            "Summary": "TVS Motor Chairman Sudarshan Venu reported that electric two-wheeler sales have reached approximately one lakh units per month, driven by GST policies, PLI schemes, and PM e-drive initiatives. He stated that GST 2.0 reforms support middle-income and middle-class consumption by focusing on sectors affecting common consumption patterns. TVS is experiencing strong bookings and registrations, with expected sales growth after September 22 when auspicious periods begin and GST rate transitions take effect. The company is expanding its sustainable fuel portfolio, with CNG variants for two-wheelers and three-wheelers, an upcoming Jupiter CNG model, and an Ethanol Apache in development. Venu noted strong export performance in newer markets including Turkey and the Middle East. He emphasized India's transformation from a 'fragile five' economy to a top global performer over the past decade, citing GST implementation and UPI as key reforms that established India as a leader in digital payments.",
            "Sentiment": "positive",
            "PublishDate": 1758099376736,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Integrates India's First EV Smartwatch Technology",
            "Summary": "TVS Motor has integrated what it claims to be India's first EV smartwatch technology. The integration represents a technological advancement in the electric vehicle sector, combining wearable technology with electric vehicle functionality.",
            "Sentiment": "positive",
            "PublishDate": 1758090803630,
            "Source": "stock"
        },
        {
            "Title": "TVS Motor Partners with Alt Mobility to Deploy 3,000 Electric Three-Wheelers by FY 2025-26",
            "Summary": "TVS Motor has partnered with Alt Mobility to introduce 3,000 electric three-wheelers by FY 2025-26. The vehicles will be leased under Alt's Drive-to-Own Program, aimed at promoting eco-friendly urban transport and supporting driver income.",
            "Sentiment": "positive",
            "PublishDate": 1757918180505,
            "Source": "order&deals"
        },
        {
            "Title": "TVS Motor to Pass GST Rate Cuts to Customers",
            "Summary": "TVS Motor announced it will fully pass on GST rate cuts to its customers. The company plans to transfer the complete benefit of reduced GST rates directly to consumers.",
            "Sentiment": "positive",
            "PublishDate": 1757329771182,
            "Source": "stock"
        }
    ]
}