{
    "Symbol": "TVSSCS",
    "ISIN": "INE395N01027",
    "News": [
        {
            "Title": "TVS Supply Chain Solutions Q3FY26 Earnings Call Feb 11",
            "Summary": "TVS Supply Chain Solutions announces earnings conference call on February 11, 2026 to discuss Q3 and nine months FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770279456786,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS SCS Acquires Swamy & Sons 3PL for ₹88 Crore",
            "Summary": "TVS Supply Chain Solutions announces strategic acquisition of Hyderabad-based Swamy & Sons 3PL through subsidiary FIT 3PL for ₹88 crore to strengthen FMCG supply chain capabilities in Andhra Pradesh and Telangana.",
            "Sentiment": "positive",
            "PublishDate": 1769597900305,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Supply Chain Solutions Appoints Vikas Chadha as CEO",
            "Summary": "TVS Supply Chain Solutions announces appointment of Vikas Chadha as Global CEO effective January 22, 2026, as part of structured leadership transition plan following MD Ravi Viswanathan's retirement decision.",
            "Sentiment": "positive",
            "PublishDate": 1768399043572,
            "Source": "stocks"
        },
        {
            "Title": "TVS Supply Chain Solutions Names Vikas Chadha as CEO",
            "Summary": "TVS Supply Chain Solutions appoints Vikas Chadha as Global CEO effective January 22, 2026, as part of structured leadership transition following MD Ravi Viswanathan's retirement plan.",
            "Sentiment": "positive",
            "PublishDate": 1768398360347,
            "Source": "stocks"
        },
        {
            "Title": "TVS Supply Chain jumps 7% on Daimler contract win",
            "Summary": "TVS Supply Chain Solutions secured a 3-year warehouse management contract from Daimler India Commercial Vehicles for Chennai facility operations, driving shares up 7% to ₹114.",
            "Sentiment": "positive",
            "PublishDate": 1768305766320,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Supply wins 3-year Daimler contract",
            "Summary": "TVS Supply Chain Solutions secures three-year warehouse management contract from Daimler India Commercial Vehicles for Chennai facility operations with 700 employees deployment.",
            "Sentiment": "positive",
            "PublishDate": 1768221949880,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS SCS Wins 3-Year Daimler Warehouse Contract",
            "Summary": "TVS Supply Chain Solutions secures three-year contract from Daimler India Commercial Vehicles to manage end-to-end in-plant warehouse operations at Chennai facility with 700-member team deployment.",
            "Sentiment": "positive",
            "PublishDate": 1768218273232,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Supply Chain Wins Daimler Warehouse Contract",
            "Summary": "TVS Supply Chain Solutions has secured a significant contract with Daimler for comprehensive in-plant warehouse management services, marking a notable business development for the logistics company.",
            "Sentiment": "positive",
            "PublishDate": 1768218071135,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Supply Chain Gets ₹1.61 Cr Tax Order from CGST",
            "Summary": "TVS Supply Chain Solutions receives tax order totaling ₹1.61 crores from Assistant Commissioner of Central Tax for FY 2018-19 violations including reverse charge liability shortfall and ineligible credit availment.",
            "Sentiment": "negative",
            "PublishDate": 1767188408149,
            "Source": "stocks"
        },
        {
            "Title": "TVS Supply Chain Gets Tax Order Worth ₹3.63 Cr",
            "Summary": "Gujarat State Tax Authority passes order against TVS Supply Chain Solutions for FY2021-22 involving reverse charge liability and ineligible credit totaling ₹3.63 crores. Company to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766562524753,
            "Source": "stocks"
        },
        {
            "Title": "TVS Supply Chain Gets Tax Order Worth ₹1.38 Cr",
            "Summary": "TVS Supply Chain Solutions receives tax demand order from Maharashtra State Tax Authority for FY2021-22 regarding reverse charge liability and ineligible credit issues.",
            "Sentiment": "negative",
            "PublishDate": 1765883485734,
            "Source": "stocks"
        },
        {
            "Title": "TVS Supply Chain Gets Tax Order Worth ₹1.92 Cr",
            "Summary": "TVS Supply Chain Solutions receives tax demand order of ₹1.92 crores from Madhya Pradesh State Tax Authority for FY2018-19, covering tax, interest and penalty components.",
            "Sentiment": "negative",
            "PublishDate": 1765608944119,
            "Source": "stocks"
        },
        {
            "Title": "T.S. Rajam Rubbers Creates Encumbrance on TVS Supply Shares",
            "Summary": "T.S. Rajam Rubbers Private Limited disclosed creation of encumbrance over equity shares held in TVS Supply Chain Solutions Limited under SEBI Takeover Regulations on December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765543377438,
            "Source": "stocks"
        },
        {
            "Title": "TVS Supply Chain: Shares Worth ₹120 Cr Pledged",
            "Summary": "TVS Supply Chain Solutions sees additional 5 crore shares pledged to Catalyst Trusteeship, increasing total encumbrance to 6.05 crore shares worth 13.71% of equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765423377333,
            "Source": "co_actions_results"
        },
        {
            "Title": "TVS Supply Chain Gets ₹4.29 Cr Tax Demand Notice",
            "Summary": "Bihar State Tax Authority issues order against TVS Supply Chain Solutions for alleged excess input tax credit and short payment of tax liability for FY2021-22. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1765379301548,
            "Source": "stocks"
        },
        {
            "Title": "TVS Supply Chain Solutions Approves Rs 1 Billion Investment in Unit",
            "Summary": "TVS Supply Chain Solutions has approved an investment of up to Rs 1 billion in its unit. The investment decision represents a significant capital allocation by the company to expand or strengthen its operations.",
            "Sentiment": "positive",
            "PublishDate": 1765294011693,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Supply Chain Solutions Files Appeal Against NCLT Order in ZTE Telecom Dispute",
            "Summary": "TVS Supply Chain Solutions has filed an appeal with the National Company Law Appellate Tribunal challenging an NCLT order dated October 09, 2025, regarding operational dues from ZTE Telecom. The company has filed an operational claim of approximately ₹5.03 crore for work carried out under business arrangements where certain amounts remained outstanding despite part-payments being received.",
            "Sentiment": "negative",
            "PublishDate": 1763911672456,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Strong Q2 Performance with 30.8% PBT Growth",
            "Summary": "TVS Supply Chain Solutions delivered consolidated revenue of INR 2,662.6 crores in Q2 FY26, up 6% year-on-year, with PBT improving 30.8% to INR 23.32 crores and PAT growing 54% to INR 16.31 crores. The ISCS segment drove performance with EBITDA margins expanding to 8.7%, while GFS segment faced headwinds with margins declining to 2.2% due to pricing pressures, though the company secured new business wins worth INR 204 crores and maintains a healthy order pipeline of INR 6,200 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763705600389,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Targets Mid-Teens Revenue Growth, Sets 4% PBT Margin Goal by Q4 FY27",
            "Summary": "TVS Supply Chain outlined its growth strategy targeting mid-teens revenue growth across all segments while aiming for sequential margin improvements in Q3 and Q4 from current 8.5% levels due to Project One benefits. The company set medium-term targets including 3.5-4% EBITDA margins for its GFS segment and 4% PBT margins by Q4 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763202023356,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Strong Q2 Performance with 6% Revenue Growth and Margin Expansion",
            "Summary": "TVS Supply Chain Solutions delivered quarterly results for September 30, 2025, with consolidated revenue growing 6% year-on-year to ₹2,663 crores and adjusted EBITDA of ₹178 crores, driven by strong performance in its Integrated Supply Chain Solutions segment. The company reported positive profit after tax of ₹16.3 crores for the second consecutive quarter, with ISCS margins expanding to 8.7% from 8.2% in Q2FY25, while maintaining a robust business development pipeline of ₹6,200 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763054177465,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Solutions Receives NCLT Order to Dispense Shareholder Meeting in Amalgamation Scheme",
            "Summary": "TVS Supply Chain Solutions Limited received an order from the National Company Law Tribunal, Bengaluru Bench, directing the Fourth Transferor Company to dispense with the meeting of equity shareholders as part of an ongoing amalgamation scheme. The order was dated October 13, 2025, and received on October 17, 2025. The amalgamation involves five transferor companies - Mahogany Logistics Services Private Limited, TVS SCS Global Freight Solutions Limited, White Date Systems Private Limited, SPC International (India) Private Limited, and FLEXOL Packaging (India) Limited - merging with and into TVS Supply Chain Solutions Limited along with their respective shareholders, subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1760720438038,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS SCS North America Targets $500M Revenue with New Automated Facility in Iowa",
            "Summary": "TVS Supply Chain Solution's North American division has set a revenue target of $500 million with a projected compound annual growth rate of 20%. The company has inaugurated a new 225,000 square foot automated facility in Iowa as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1759232497143,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Solutions Closes Dormant UK Subsidiary Through Voluntary Liquidation",
            "Summary": "TVS Supply Chain Solutions Limited has completed the voluntary liquidation and striking off of its step-down foreign subsidiary, Peter Thomas & Co (Refurbishing) Limited, UK. The closure was part of a rationalization of dormant entities. The subsidiary was dormant and not considered a material subsidiary of TVS SCS. The closure was completed on August 26, 2025, with the company receiving notification on September 4, 2025. The subsidiary contributed nil turnover, revenue, income, and net worth to the parent company during the last financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1756994648323,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Supply Chain Solutions Converts Inter-Company Loan to Equity in U.S. Unit for $14.8 Million",
            "Summary": "TVS Supply Chain Solutions has converted an inter-company loan into equity in its U.S. subsidiary. The transaction involves acquiring 89,845 shares at $165 per share, with a total acquisition cost of $14.8 million. This restructuring changes the financial relationship between the parent company and its American operations from debt to equity ownership.",
            "Sentiment": "neutral",
            "PublishDate": 1756459272609,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Solutions Receives GST Order for ₹4.9 Cr ITC Claim, Plans to Challenge",
            "Summary": "TVS Supply Chain Solutions received an order from the GST Department regarding ₹4.9 crore Input Tax Credit (ITC) availment. The company plans to challenge this claim and states that it expects no material impact from this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1756126412132,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Q1 FY26 Results with Project One Restructuring Initiative",
            "Summary": "TVS Supply Chain Solutions reported consolidated revenue of INR 2,592 crores for Q1 FY26, reflecting 3.7% sequential growth and 2.1% year-on-year growth. The company launched Project One, a restructuring program combining ISCS and IFM businesses in UK and Europe under single leadership, expected to deliver INR 110-120 crores in annualized cost savings. The company recognized one-time exceptional costs of INR 91 crores related to this restructuring. Adjusted EBITDA stood at INR 173 crores with 6.7% margin. The company recorded INR 177 crores as share of profit from TVS ILP's asset transfer to InVIT platform. New business wins totaled INR 124 crores representing 5% of Q1 FY25 revenue. Order pipeline remains at INR 5,300 crores. Management maintains target of achieving 4% PBT by Q4 FY27 and mid-teens revenue growth guidance.",
            "Sentiment": "positive",
            "PublishDate": 1755519877592,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Solutions Faces Increased RBI Penalty of ₹13.18 Lakh for FEMA Violations",
            "Summary": "TVS Supply Chain Solutions Limited received a corrigendum from the Reserve Bank of India's Foreign Exchange Department, revising a compounding fee upward from ₹11.75 lakh to ₹13.18 lakh. The penalty relates to violations of Foreign Exchange Management Act provisions, specifically undertaking divestment and acquiring equity shares in a foreign entity without following proper valuation procedures, and making further financial commitments without regularizing reporting delays. The original compounding order was passed on August 4, 2025, with the corrigendum issued on August 14, 2025. The company states there is no material impact on its financial or operational activities from this order.",
            "Sentiment": "negative",
            "PublishDate": 1755184260802,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Targets 4% PBT Margin by FY27 Amid Strategic Transformation",
            "Summary": "TVS Supply Chain Solutions aims to achieve a 4% Profit Before Tax margin by FY27 through cost optimization, strategic transformation initiatives, and a turnaround in its UK business. Managing Director Ravi Viswanathan expressed confidence in reaching mid-teens growth driven by a robust order pipeline of Rs 5,300 crore and advanced-stage large deals. The company is implementing 'Project One' to transform UK and European operations and focusing on cost control measures. In quarterly results, revenue rose 2.12% year-on-year to Rs 2,592 crore, while EBITDA declined 2.1% to Rs 177.2 crore with margins dropping to 6.8% from 7.1%. However, profit after tax surged nearly tenfold to Rs 71.2 crore from Rs 7.5 crore in the previous year. Company shares closed 7.86% higher at Rs 133.98.",
            "Sentiment": "positive",
            "PublishDate": 1754962672320,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Sharp Decline in Q1 FY26 Financial Performance",
            "Summary": "TVS Supply Chain Solutions Limited reported consolidated revenue of Rs. 85,628.52 lakhs for Q1 FY26, down from Rs. 1,09,808.39 lakhs in Q1 FY25, representing a 22% decline. The company's consolidated profit before tax dropped to Rs. 150.48 lakhs from Rs. 593.44 lakhs in the previous year, while profit after tax fell to Rs. 112.48 lakhs compared to Rs. 435.44 lakhs in Q1 FY25. Consolidated total comprehensive income decreased to Rs. 215.81 lakhs from Rs. 463.90 lakhs year-over-year. The company operates in the Foreign Exchange segment. The Board of Directors approved these unaudited standalone and consolidated financial results on August 8, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754741209216,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports ₹3.30 Crore Quarterly Profit, Appoints Deloitte as Internal Auditor",
            "Summary": "TVS Supply Chain Solutions Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone profit of ₹3.30 crores for the quarter, compared to ₹20.64 crores in the previous quarter and ₹8.69 crores in the same quarter last year. Revenue from operations stood at ₹467.96 crores. On a consolidated basis, the company posted a profit of ₹71.16 crores, significantly higher than the loss of ₹3.92 crores in the previous quarter. The Board also appointed Deloitte Touche Tohmatsu India LLP as Internal Auditor for FY 2025-26. The company recognized exceptional restructuring costs of ₹91.29 crores related to 'Project One', a strategic transformation initiative to streamline operations in UK and Europe. Earnings per share on standalone basis was ₹0.07 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754664839837,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Mixed Q1 Results with Exceptional Item Boost",
            "Summary": "TVS Supply Chain Solutions reported quarterly results showing revenue growth to 25.9 billion rupees from 25.4 billion rupees year-over-year. Net profit surged to 712 million rupees compared to 75 million rupees in the previous year. The company recorded an exceptional item of 913 million rupees during the quarter. Profit before tax increased to 175 million rupees from 128 million rupees year-over-year. However, EBITDA declined slightly to 1.78 billion rupees from 1.8 billion rupees, with EBITDA margin compressing to 6.87% from 7.17% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754662820749,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Solutions Holds NCLT-Directed Unsecured Creditors Meeting for Amalgamation Scheme",
            "Summary": "TVS Supply Chain Solutions Limited conducted a meeting of unsecured creditors on July 30, 2025, as directed by the National Company Law Tribunal, Chennai Bench. The meeting was held via video conference from 3:00 PM to 3:48 PM and was chaired by Mr. L N Gupta, former NCLT Member. The primary agenda was to approve a Scheme of Amalgamation between five companies - Mahogany Logistics Services Private Limited, TVS SCS Global Freight Solutions Limited, White Data Systems India Private Limited, SPC International (India) Private Limited, and FLEXOL Packaging (India) Limited - with TVS Supply Chain Solutions Limited. The company facilitated remote e-voting through NSDL from July 27-29, 2025, and conducted e-voting during the meeting from 3:18 PM to 3:48 PM. Key management personnel including Executive Chairman R Dinesh, Managing Director Ravi Viswanathan, Global CFO Vaidhyanathan R, and Company Secretary P D Krishna Prasad were present. Scrutinizer Mr. F Raymond Albyness will submit a consolidated report of the voting results, which will be announced separately to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753884690540,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Supply Chain Solutions Shareholders Approve Amalgamation Scheme with 99.99% Majority",
            "Summary": "TVS Supply Chain Solutions Limited held a shareholder meeting on July 30, 2025, via video conference as directed by the National Company Law Tribunal, Chennai Bench. Shareholders approved the scheme of amalgamation between five companies - Mahogany Logistics Services Private Limited, TVS SCS Global Freight Solutions Limited, White Data Systems India Private Limited, SPC International (India) Private Limited, and FLEXOL Packaging (India) Limited - with TVS Supply Chain Solutions Limited. The resolution received overwhelming support with 331,432,488 votes in favor (99.999%) and only 2,289 votes against (0.001%). The meeting was chaired by L N Gupta, former NCLT Member, and attended by 44 shareholders through video conferencing. Remote e-voting was conducted from July 27-29, 2025, with additional e-voting during the meeting. The statutory auditor certified that certain SEBI circular provisions do not apply to this amalgamation scheme.",
            "Sentiment": "positive",
            "PublishDate": 1753882788887,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Supply Chain Solutions Receives Stay Order from Madras High Court on Employee Provident Fund Proceedings",
            "Summary": "TVS Supply Chain Solutions Limited obtained a stay order from the Madras High Court regarding Writ Petition WP 21278 of 2025 related to Employee Provident Fund proceedings. The court directed that proceedings by the Regional Provident Fund Commissioner should not proceed until the Employee Provident Fund Tribunal hears the matter. As part of the order, TVS Supply Chain Solutions is required to remit 25% of the claim amount before the tribunal hearing takes place.",
            "Sentiment": "neutral",
            "PublishDate": 1753336081404,
            "Source": "stock"
        },
        {
            "Title": "TVS Supply Chain Solutions Acquires Additional 30% Stake in TVS Autoserv for €500,000",
            "Summary": "TVS Supply Chain Solutions has acquired an additional 30% stake in TVS Autoserv for 500,000 euros. This transaction increases the company's ownership position in TVS Autoserv.",
            "Sentiment": "positive",
            "PublishDate": 1752846024730,
            "Source": "order&deals"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Q4 Financial Results",
            "Summary": "TVS Supply Chain Solutions has released its Q4 financial results. The company reported an EBITDA of 1.7 billion rupees, down from 1.73 billion rupees year-over-year. The EBITDA margin decreased to 6.76% from 7.13% in the same period last year. The company posted a consolidated net loss of 48 million rupees, compared to a loss of 43.2 million rupees year-over-year and 247 million rupees quarter-over-quarter. Revenue for Q4 increased to 24.98 billion rupees from 24.26 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748444148000,
            "Source": "result"
        },
        {
            "Title": "TVS Supply Chain Solutions: R Vaidhyanathan Appointed as Global CFO",
            "Summary": "TVS Supply Chain Solutions has appointed R Vaidhyanathan as the new Global Chief Financial Officer, effective April 1. The current Global CFO, Raviprakash Bhagavathula, will transition to Head of Strategic Initiatives in Singapore. Vaidhyanathan, previously Deputy Global CFO, joined the company in 2019 and has held various key positions.",
            "Sentiment": "positive",
            "PublishDate": 1743070987000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TVS Supply Chain Solutions Approves Additional Funding for Overseas Subsidiaries",
            "Summary": "TVS Supply Chain Solutions has approved additional funding of up to 250 crore rupees for its subsidiaries located in the United Kingdom, Singapore, and the United States of America. This investment decision aims to strengthen the company's international operations and support its overseas subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1743034311000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Supply Chain Solutions Approves Additional Funding for Overseas Subsidiaries",
            "Summary": "TVS Supply Chain Solutions has approved additional funding of up to 250 crore rupees for its subsidiaries located in the United Kingdom, Singapore, and the United States of America. This investment decision aims to strengthen the company's international operations and support its overseas subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1743005565000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Supply Chain Solutions: TVS Motor Company Acquires 0.45% Stake in Block Deal",
            "Summary": "TVS Motor Company bought 20 lakh shares (0.45% stake) of TVS Supply Chain Solutions for ₹25 crore in a block deal. This follows a previous 1.52% stake purchase, increasing TVS Motor's total stake to 4.36%. TVS Supply Chain's stock rose nearly 8% intraday, reaching ₹137.20.",
            "Sentiment": "positive",
            "PublishDate": 1739854183000,
            "Source": "block_deals"
        },
        {
            "Title": "TVS Supply Chain Solutions: Shareholder Sells 0.45% Stake for Rs 25 Crore",
            "Summary": "Allanzers Fin sold 20 lakh shares (0.45% stake) of TVS Supply Chain Solutions at Rs 128.86 per share. TVS Motor Co. acquired these shares. The company's Q3 revenue increased by 10% to Rs 2,444.62 crore, but it incurred a loss of Rs 24.65 crore. EBITDA decreased by 18% to Rs 132.63 crore with margins narrowing to 5.4%.",
            "Sentiment": "neutral",
            "PublishDate": 1739808805000,
            "Source": "block_deals"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Increased Q3 Net Loss",
            "Summary": "TVS Supply Chain Solutions reported a consolidated net loss of 247 million rupees in Q3, compared to 95.6 million rupees in the same quarter last year and 93 million rupees in the previous quarter. However, the company's revenue increased to 24.4 billion rupees from 22.2 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739233250000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Decline in Q3 EBITDA",
            "Summary": "TVS Supply Chain Solutions has reported a decrease in its third-quarter EBITDA, which fell to 1.3 billion rupees from 1.62 billion rupees in the same period last year. The company's EBITDA margin also declined, dropping to 5.44% from 7.29% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739198020000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain Solutions Reports Increased Q3 Loss",
            "Summary": "TVS Supply Chain Solutions reported a consolidated net loss of 247 million rupees in Q3, compared to a loss of 95.6 million rupees year-over-year and 93 million rupees quarter-over-quarter. However, the company's revenue increased to 24.4 billion rupees from 22.2 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739197966000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Supply Chain: Q2 Profit Turnaround, Revenue Up 11%",
            "Summary": "TVS Supply Chain Solutions reported Q2 FY2024 net profit of ₹10.6 crore, reversing last year's ₹40.6 crore loss. Revenue grew 11% to ₹2,513 crore. EBITDA declined 8.8% to ₹169 crore, with margin contracting to 6.7%.",
            "Sentiment": "positive",
            "PublishDate": 1731334428000,
            "Source": "result"
        },
        {
            "Title": "TVS Supply Chain Solutions Provides Inter-Corporate Loan to Subsidiary",
            "Summary": "<p>TVS Supply Chain Solutions has entered into an <span class='neutral'>inter-corporate loan agreement</span> with its <span class='neutral'>subsidiary</span>, <b>FIT 3PL Warehousing</b>, for <span class='positive'>60 million rupees</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728055630000,
            "Source": "corporate_action"
        }
    ]
}