{
    "Symbol": "TVSSRICHAK",
    "ISIN": "INE421C01016",
    "News": [
        {
            "Title": "TVS Srichakra Opens 11th Exclusive Store in Delhi",
            "Summary": "TVS Srichakra expands retail presence with new exclusive store in New Delhi, offering comprehensive two-wheeler tire solutions and services to strengthen market position.",
            "Sentiment": "positive",
            "PublishDate": 1770106224051,
            "Source": "stocks"
        },
        {
            "Title": "TVS Srichakra faces ₹55.11 cr GST demand order",
            "Summary": "TVS Srichakra Limited receives CGST order confirming tax demand of ₹55.11 crores for alleged GST liability related to mismatch between returns and e-way bills for FY 2018-21. Company plans to file appeal within 90 days.",
            "Sentiment": "negative",
            "PublishDate": 1767010410302,
            "Source": "stocks"
        },
        {
            "Title": "Eurogrip Tyres Showcases Premium Portfolio at Automechanika Dubai 2025",
            "Summary": "TVS Srichakra's Eurogrip brand displayed its premium range of two and three-wheeler tyres at Automechanika Dubai 2025, marking its third participation in the global automotive aftermarket trade show. The company showcased new product lines including trail range tyres and prototypes, aiming to strengthen Eurogrip's global presence across West Asia, Africa and Gulf countries.",
            "Sentiment": "positive",
            "PublishDate": 1765258501349,
            "Source": "stock"
        },
        {
            "Title": "TVS Srichakra Acquires 5.92% Stake in Navia Two Power for Renewable Energy Access",
            "Summary": "TVS Srichakra Limited acquired 5,915 equity shares representing 5.92% stake in Navia Two Power Private Limited for Rs. 59,150 to purchase renewable energy under Group Captive mode. The acquisition enables compliance with regulatory requirements for captive power consumption under electricity laws, with Navia being a special-purpose vehicle for owning and operating captive power plants.",
            "Sentiment": "neutral",
            "PublishDate": 1764231737926,
            "Source": "order&deals"
        },
        {
            "Title": "Eurogrip Expands Global Presence with Premium Tyre Showcase at Mexico and Sri Lanka Motor Shows",
            "Summary": "TVS Srichakra's Eurogrip brand showcased its premium 2-wheeler and 3-wheeler tyre portfolio at Expo Moto International Trade Show in Mexico City and Colombo Motor Show in Sri Lanka. The participation signals Eurogrip's expanding presence in Latin American and South Asian markets, strengthening engagement with customers and global partners.",
            "Sentiment": "positive",
            "PublishDate": 1763971912192,
            "Source": "stock"
        },
        {
            "Title": "TVS Srichakra Limited Publishes Quarterly Financial Results",
            "Summary": "TVS Srichakra Limited announced the publication of its unaudited financial results for the quarter and half year ended September 30, 2025. The company published these results in Business Line (English) and Dinamalar (Tamil) newspapers on November 12, 2025. The announcement was made through a regulatory communication to BSE Limited and National Stock Exchange of India Ltd., with the company trading under scrip codes 509243 (BSE) and TVSSRICHAK (NSE).",
            "Sentiment": "neutral",
            "PublishDate": 1762986020909,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Srichakra Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "TVS Srichakra Limited announced its quarterly results for the quarter ended September 30, 2025. On a standalone basis, revenue from operations increased to Rs 865.04 crores compared to Rs 761.74 crores in the previous quarter. However, net profit after tax declined to Rs 15.81 crores from Rs 18.19 crores in the previous quarter. For the half-year period, standalone revenue reached Rs 1,626.78 crores versus Rs 1,523.85 crores in the corresponding period last year, while net profit for the half-year was Rs 33.93 crores compared to Rs 36.96 crores previously. On a consolidated basis, quarterly revenue was Rs 1,253.83 crores and net profit was Rs 10.96 crores. The company received a government grant of Rs 18.81 crores under exceptional items related to an Investment Promotion Capital Subsidy from Tamil Nadu government. The company also incurred Rs 2.56 crores in the quarter for its Voluntary Retirement Scheme. Earnings per share on standalone basis was Rs 20.65 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762846236496,
            "Source": "earnings"
        },
        {
            "Title": "TVS Srichakra Reports Strong Q2 Performance with Revenue Growth to 9.3B Rupees",
            "Summary": "TVS Srichakra delivered improved quarterly results with revenue rising to 9.3 billion rupees from 8.4 billion rupees year-over-year. The company's EBITDA increased to 658 million rupees compared to 590 million rupees in the same period last year, while EBITDA margin expanded to 7.11% from 7.01%. Consolidated net profit grew to 110 million rupees versus 103 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762843364224,
            "Source": "earnings"
        },
        {
            "Title": "TVS Srichakra's Eurogrip Tyres Unveils Adventure Tyre Collection at EICMA 2025 Milan",
            "Summary": "TVS Srichakra's Eurogrip Tyres launched a new adventure tyre collection at EICMA 2025 in Milan. The collection features Trailhound Wild and Bee Wild tyres designed for enduro motorcycles and scooters. The launch showcases the company's global product lines and commitment to innovation in the tyre segment.",
            "Sentiment": "positive",
            "PublishDate": 1762406937314,
            "Source": "stock"
        },
        {
            "Title": "TVS Srichakra Signs 99-Year Trademark License Deal with US Subsidiary for Global 'Super Grip' Brand Rights",
            "Summary": "TVS Srichakra Limited has executed a trademark license agreement with Super Grip Corporation, USA, its wholly owned subsidiary, to acquire global usage rights for the 'Super Grip' trademark. Under the 99-year agreement, TVS Srichakra will pay a 2% royalty on all sales made under the Super Grip brand to parties other than Super Grip Corporation itself. The deal allows TVS Srichakra to use the Super Grip brand globally while Super Grip Corporation retains its own usage rights. The transaction is classified as a related party transaction conducted on an arm's length basis.",
            "Sentiment": "positive",
            "PublishDate": 1755009226523,
            "Source": "stock"
        },
        {
            "Title": "TVS Srichakra Reports Strong Profit Growth in Q1 FY2026 Despite Modest Revenue Increase",
            "Summary": "TVS Srichakra Limited, an Indian automotive tyre manufacturer, reported consolidated revenue growth of 3.6% to Rs 819.41 crores in Q1 FY2026. The company achieved significant profit improvements with consolidated profit before tax rising 69.4% to Rs 19.92 crores and net profit after tax surging 93.2% to Rs 12.83 crores. On a standalone basis, revenue increased 3.1% to Rs 761.74 crores while net profit grew 60.9% to Rs 18.12 crores. The company benefited from stable raw material costs which decreased marginally by 0.1%, while other expenses fell 10.4%. Employee benefit expenses increased 7.3% and finance costs remained stable. TVS Srichakra recognized Rs 18.81 crores in grant income under exceptional items and continued its voluntary retirement scheme with Rs 1.25 crores allocated. The company received an interim eligibility certificate for an Investment Promotion Capital Subsidy from the Tamil Nadu government to be received over 12 years.",
            "Sentiment": "positive",
            "PublishDate": 1754980593970,
            "Source": "earnings"
        },
        {
            "Title": "TVS Srichakra Shareholders Approve Re-appointment of Managing Director for Five Years",
            "Summary": "TVS Srichakra Limited shareholders approved the re-appointment of Ms. Shobhana Ramachandhran as Managing Director for a five-year term effective from August 25, 2025. The special resolution was passed through postal ballot with 98.48% votes in favor, with 34,07,339 votes supporting and 52,688 votes against the proposal. The Board had initially approved her re-appointment at a meeting held on May 27, 2025. Her remuneration will be determined by the Board based on the Nomination Remuneration Committee's recommendation, subject to a maximum of 5% of the company's net profits. The e-voting period ran from June 17 to July 16, 2025, with results declared on July 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754140006343,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Srichakra's Eurogrip Tyres Opens Fourth Exclusive Store in Chennai",
            "Summary": "TVS Srichakra's Eurogrip Tyres has opened its fourth exclusive branded store in Chennai as part of its expansion strategy. This store opening represents the company's continued efforts to increase its retail presence and reach more customers through dedicated branded outlets.",
            "Sentiment": "positive",
            "PublishDate": 1753701075961,
            "Source": "stock"
        },
        {
            "Title": "TVS Srichakra Receives ₹65.38 Crore GST Demand Notice",
            "Summary": "TVS Srichakra, a company in the automotive sector, has been issued a Goods and Services Tax (GST) demand notice for ₹65.38 Crore. This represents a significant financial obligation for the company.",
            "Sentiment": "negative",
            "PublishDate": 1751369407000,
            "Source": "default"
        },
        {
            "Title": "Eurogrip Tyres Partners with Honda Taiwan for After-sales Service",
            "Summary": "TVS Srichakra's Eurogrip Tyres has officially partnered with Honda Taiwan, becoming integrated into Honda Taiwan's after-sales service network. This partnership allows Eurogrip Tyres to be part of Honda Taiwan's official service offerings for their customers.",
            "Sentiment": "positive",
            "PublishDate": 1749774492000,
            "Source": "default"
        },
        {
            "Title": "TVS Srichakra: Eurogrip Tyres Now Available in Honda Taiwan Service Centers",
            "Summary": "TVS Srichakra's Eurogrip brand has partnered with Honda Taiwan, integrating its premium motorcycle tyres into Honda's after-sales service network across Taiwan. This expansion marks a strategic move into the Asian mobility market.",
            "Sentiment": "positive",
            "PublishDate": 1749731490000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Srichakra's Eurogrip Tyres Joins Honda Taiwan's After-Sales Network",
            "Summary": "TVS Srichakra's Eurogrip Tyres has partnered with Honda Taiwan to become part of their official after-sales service network. This collaboration allows Eurogrip Tyres to provide services to Honda customers in Taiwan.",
            "Sentiment": "positive",
            "PublishDate": 1749728809000,
            "Source": "default"
        },
        {
            "Title": "TVS SRICHAKRA Reports Q4 Financial Results",
            "Summary": "TVS SRICHAKRA has released its Q4 financial results. The company reported revenue of 8.1 billion rupees, up from 7.65 billion rupees in the same quarter last year. EBITDA for Q4 was 665 million rupees, down from 770 million rupees year-over-year. The EBITDA margin decreased to 8.13% from 10.06% in the previous year's quarter. Consolidated net profit for Q4 was 96 million rupees, a decrease from 237 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748333355000,
            "Source": "result"
        },
        {
            "Title": "TVS Srichakra Invests in Evincea Renewables",
            "Summary": "TVS Srichakra has made an investment of 10.3 million rupees in Evincea Renewables. This investment suggests that the company is expanding its interests in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1740574648000,
            "Source": "corporate_action"
        },
        {
            "Title": "TVS Srichakra Reports 11% Revenue Growth in Q3",
            "Summary": "TVS Srichakra, an Indian tire manufacturer, has reported a revenue of 8 billion rupees for the third quarter, compared to 7.2 billion rupees in the same period last year. This represents an 11% year-over-year increase in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1739344994000,
            "Source": "earnings"
        },
        {
            "Title": "TVS Srichakra Reports Q3 Consolidated Net Loss",
            "Summary": "TVS Srichakra, an Indian tire manufacturer, has reported a consolidated net loss of 59 million rupees for the third quarter. This represents a significant decline from the profit of 241 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739344935000,
            "Source": "earnings"
        }
    ]
}