{
    "Symbol": "TVTODAY",
    "ISIN": "INE038F01029",
    "News": [
        {
            "Title": "TV Today Network Gets ₹11.16 Cr Tax Demand Notice",
            "Summary": "TV Today Network received income tax demand notice of ₹11,16,14,958 for FY 2019-20 from ACIT Circle 25(1) Delhi related to incorrect set off of carried forward losses.",
            "Sentiment": "negative",
            "PublishDate": 1770733656097,
            "Source": "stocks"
        },
        {
            "Title": "Living Media Acquires 4.5L TV Today Shares",
            "Summary": "Living Media India Limited acquired 4,50,000 equity shares of TV Today Network Limited through bulk deal on December 23, 2025, increasing its stake from 60.90% to 61.66%.",
            "Sentiment": "neutral",
            "PublishDate": 1766579981950,
            "Source": "co_actions_results"
        },
        {
            "Title": "TV Today Network Signs MOU to Sell FM Radio Operations for Rs. 10 Crores",
            "Summary": "TV Today Network Limited entered into a Memorandum of Understanding with Abhijit Realtors and Infraventures Private Limited to sell its FM radio broadcasting operations comprising three stations in Mumbai, Delhi and Kolkata for Rs. 10 crores plus applicable taxes. The radio business generated Rs. 14.16 crores in turnover but reported a loss of Rs. 10.54 crores in FY 2024-25, with the company citing focus on core business areas as the rationale for the sale.",
            "Sentiment": "neutral",
            "PublishDate": 1764081131599,
            "Source": "stock"
        },
        {
            "Title": "HDFC Mutual Fund Reduces Stake in T.V. Today Network by 5.42%",
            "Summary": "HDFC Mutual Fund decreased its shareholding in T.V. Today Network from 9.25% to 3.83% through open market sales of 32,33,040 shares. The transaction was completed on November 19, 2025, and disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763726615452,
            "Source": "stock"
        },
        {
            "Title": "Living Media India Acquires Additional 4% Stake in TV Today Network Through Block Deal",
            "Summary": "Living Media India Limited acquired 23,86,745 equity shares (4% stake) in TV Today Network Limited through a block deal on stock exchange, increasing its total shareholding from 56.90% to 60.90%. The acquisition strengthens Living Media's controlling position in TV Today Network, with the transaction valued at the prevailing market price through the exchange mechanism.",
            "Sentiment": "positive",
            "PublishDate": 1763632172680,
            "Source": "order&deals"
        },
        {
            "Title": "TV Today Network Reports Q2 Net Loss of 19.8M Rupees, Revenue Declines to 1.88B Rupees",
            "Summary": "TV Today Network reported a net loss of 19.8 million rupees in Q2, compared to a profit of 82.7 million rupees in the same period last year. Revenue decreased to 1.88 billion rupees from 2.07 billion rupees year-over-year. EBITDA fell to 34.9 million rupees from 89.9 million rupees, while EBITDA margin compressed to 1.86% from 4.35% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762868868485,
            "Source": "earnings"
        },
        {
            "Title": "T.V. Today Network Completes Acquisition of Romesh Films as Wholly Owned Subsidiary",
            "Summary": "T.V. Today Network has completed the acquisition of Romesh Films, making it a wholly owned subsidiary of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758804021612,
            "Source": "order&deals"
        },
        {
            "Title": "TV Today Network Terminates Agreements with CCAMPL and Cancels FM Radio Operations Sale",
            "Summary": "TV Today Network has terminated its agreements with CCAMPL and cancelled the proposed sale of its FM radio operations. The company has decided not to proceed with the previously planned divestiture of its radio business segment.",
            "Sentiment": "neutral",
            "PublishDate": 1757513466784,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Receives Approval to Transfer 104.8 FM Radio Business to Subsidiary",
            "Summary": "TV Today has received approval to move its 104.8 FM radio business to its subsidiary Vibgyor Broadcasting. This represents a restructuring of the company's radio operations within its corporate structure.",
            "Sentiment": "positive",
            "PublishDate": 1755705487812,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Network Reports Sharp Decline in Q1 Financial Performance",
            "Summary": "TV Today Network reported significantly lower financial results for Q1. Net profit dropped to 74 million rupees from 514 million rupees in the same period last year. Revenue declined to 1.97 billion rupees compared to 3.1 billion rupees year-over-year. EBITDA fell substantially to 75 million rupees from 716 million rupees, while EBITDA margin compressed to 3.81% from 23.17% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753662235659,
            "Source": "earnings"
        },
        {
            "Title": "TV Today Network Receives Approval to Acquire Romesh Films for ₹2 Billion",
            "Summary": "TV Today Network has received approval to purchase Romesh Films in a deal valued at ₹2 billion. The acquisition represents a significant investment by the media company in expanding its content portfolio through the purchase of the film production entity.",
            "Sentiment": "positive",
            "PublishDate": 1753450974747,
            "Source": "order&deals"
        },
        {
            "Title": "T.V. Today Network Reports Rs 7.32 Crore Net Profit, Approves Rs 200 Crore Acquisition of Romesh Films",
            "Summary": "T.V. Today Network Limited reported a net profit of Rs 7.32 crore for the quarter ended June 30, 2025, compared to Rs 51.43 crore in the same period last year. Revenue from operations declined to Rs 197.19 crore from Rs 309.22 crore year-on-year. The Board approved the acquisition of 100% shares (4,65,010 equity shares) of Romesh Films Private Limited for Rs 200 crore, making it a wholly owned subsidiary. Romesh Films owns immovable property near the company's corporate office in Noida and has no active business operations. The company also entered into an MoU to sell its FM Radio Broadcasting operations comprising three stations in Mumbai, Delhi, and Kolkata for Rs 20 crore. Earnings per share from continuing operations stood at Rs 1.23 compared to Rs 9.11 in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753449740840,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Network Reports Sharp Decline in Q1 Financial Performance",
            "Summary": "TV Today Network reported significantly lower quarterly results with EBITDA falling to 75 million rupees from 716 million rupees in the same period last year. The company's EBITDA margin dropped to 3.81% from 23.17% year-over-year. Consolidated net profit declined to 74 million rupees compared to 514 million rupees previously. Revenue also decreased substantially to 1.97 billion rupees from 3.1 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753449257020,
            "Source": "earnings"
        },
        {
            "Title": "TV Today Network to Review Q1 Results on July 25",
            "Summary": "TV Today Network has announced that it will review its Q1 results on July 25. The company has scheduled a meeting to discuss and analyze its financial performance for the first quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751977274000,
            "Source": "default"
        },
        {
            "Title": "TV Today Network Reports Q4 Results and Dividend Recommendation",
            "Summary": "TV Today Network has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA decreased to 46 million rupees from 237 million rupees year-over-year, with EBITDA margin falling to 1.85% from 9.60%. Consolidated net profit for Q4 was 62 million rupees, down from 115 million rupees year-over-year but up from 87 million rupees quarter-over-quarter. Q4 revenue remained stable at 2.5 billion rupees compared to the same period last year. The company has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747917149000,
            "Source": "result"
        },
        {
            "Title": "TV Today Network Approves Purchase of Immovable Property in Noida",
            "Summary": "The board of TV Today Network has approved the purchase of immovable property in Noida. The agreement for this acquisition is valued at 2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744718653000,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Network Approves 94 Million Rupee Investment in Vibgyor Broadcasting",
            "Summary": "TV Today Network has approved an investment of 94 million rupees (approximately $1.13 million USD) in Vibgyor Broadcasting. This decision represents a significant corporate action, potentially aimed at expanding the company's broadcasting portfolio or strengthening its market position.",
            "Sentiment": "positive",
            "PublishDate": 1742996324000,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Network to Sell FM Radio Operations to Creative Channel",
            "Summary": "TV Today Network has announced the sale of its FM radio operations to Creative Channel for a consideration of 200 million rupees plus taxes. This move represents a significant corporate action for the company, potentially impacting its business structure and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1740483308000,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Network to Close FM Radio Operations and Sell Radio Business",
            "Summary": "TV Today Network has approved the closure of its FM radio broadcasting operations. The company has also given approval for the sale of its radio business to a potential buyer. This decision represents a significant shift in the company's operational strategy and asset portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1739282404000,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Network Reports Significant Drop in Q3 EBITDA",
            "Summary": "TV Today Network experienced a substantial decline in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 108 million rupees from 413 million rupees in the same period last year. Additionally, the EBITDA margin decreased sharply from 15.70% to 4.54% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739278442000,
            "Source": "earnings"
        },
        {
            "Title": "TV Today Network Reports Decline in Q3 Profit and Revenue",
            "Summary": "TV Today Network has announced its financial results for the third quarter. The company's consolidated net profit decreased to 87 million rupees from 291 million rupees in the same period last year. Revenue also declined to 2.4 billion rupees from 2.63 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739278437000,
            "Source": "earnings"
        },
        {
            "Title": "TV Today Network Reports Closure Impact and Financial Loss",
            "Summary": "TV Today Network has reported that a closure event accounted for 1.70% of the company's total turnover. Additionally, the company has incurred a loss of 19.53 crore rupees for the financial year 2023-24.",
            "Sentiment": "negative",
            "PublishDate": 1736398742000,
            "Source": "earnings"
        },
        {
            "Title": "TV Today Network to Close FM Radio Operations in Major Cities",
            "Summary": "TV Today Network has approved the closure of its FM radio broadcasting operations in Mumbai, Delhi, and Kolkata under the frequency 104.8 FM. This decision marks a significant change in the company's media portfolio and operations in these key metropolitan areas.",
            "Sentiment": "neutral",
            "PublishDate": 1736398624000,
            "Source": "corporate_action"
        },
        {
            "Title": "TV Today Network Reports Decline in Q2 EBITDA and Margin",
            "Summary": "TV Today Network has reported a decrease in its second quarter EBITDA, which fell to 70.77 million rupees from 118 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 3.75% from 5.53% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730103756000,
            "Source": "result"
        },
        {
            "Title": "TV Today Network Reports Stable Q2 Revenue",
            "Summary": "TV Today Network has reported a quarterly revenue of 2.1 billion rupees for Q2, which remains unchanged compared to the same period last year (year-over-year).",
            "Sentiment": "neutral",
            "PublishDate": 1730103607000,
            "Source": "result"
        },
        {
            "Title": "TV Today Network Reports Increased Q2 Profit",
            "Summary": "TV Today Network has announced its Q2 consolidated net profit of 83 million rupees, showing an increase from 70 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730103578000,
            "Source": "result"
        }
    ]
}