{
    "Symbol": "UBL",
    "ISIN": "INE686F01025",
    "News": [
        {
            "Title": "United Breweries Q3FY26 Results Show Strong Growth",
            "Summary": "United Breweries Limited reported Q3FY26 results with revenue of Rs. 3,93,563 lakhs and net profit of Rs. 8,083 lakhs, showing resilient performance despite category challenges.",
            "Sentiment": "positive",
            "PublishDate": 1770738115622,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI MF crosses 5% stake in United Breweries",
            "Summary": "SBI Mutual Fund acquired 60,683 shares of United Breweries on February 01, 2026, increasing its holding to 5.0097% and crossing the 5% regulatory threshold for disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1770117008025,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Breweries Launches Kingfisher Super Smooth",
            "Summary": "United Breweries set to launch new Kingfisher Super Smooth Strong Premium Beer in Karnataka on January 28, 2026, targeting local market with pricing between INR 100-200 based on size.",
            "Sentiment": "positive",
            "PublishDate": 1769593956065,
            "Source": "stocks"
        },
        {
            "Title": "United Breweries Block Trade Worth Rs. 54.72 Crores",
            "Summary": "United Breweries executed a significant NSE block trade involving 386,959 shares at Rs. 1414.20 per share, totaling Rs. 54.72 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769489798746,
            "Source": "co_actions_results"
        },
        {
            "Title": "UBL Launches Cost Efficiency Program for 3-6% Savings",
            "Summary": "United Breweries Limited announces comprehensive productivity and cost effectiveness program targeting 3% to 6% annualised savings through operational restructuring and network optimization.",
            "Sentiment": "positive",
            "PublishDate": 1769232408845,
            "Source": "stocks"
        },
        {
            "Title": "United Breweries Q3FY26 earnings call on Feb 11",
            "Summary": "United Breweries Limited announces Q3 FY2025-26 earnings call scheduled for February 11, 2026 at 3:00 PM IST to discuss unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769168932728,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Breweries Sells Hyderabad Land for ₹80.8 Cr",
            "Summary": "United Breweries completes sale of 8 acres industrial land in Hyderabad to Topsun Solar Private Limited for ₹80.8 crores under Regulation 30 disclosure. Transaction executed on January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768807744401,
            "Source": "stocks"
        },
        {
            "Title": "UBL Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "United Breweries Limited announces Board meeting scheduled for February 10, 2026 to consider Q3FY26 financial results. Trading window closed till February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767856123219,
            "Source": "co_actions_results"
        },
        {
            "Title": "UBL Launches Kingfisher Smooth Strong Premium Beer",
            "Summary": "United Breweries Limited expands its Kingfisher portfolio with the launch of Kingfisher Smooth Strong Premium Beer in Rajasthan, targeting younger consumers with a balanced strong beer experience.",
            "Sentiment": "positive",
            "PublishDate": 1767771491595,
            "Source": "stocks"
        },
        {
            "Title": "United Breweries Launches Kingfisher Smooth Beer",
            "Summary": "United Breweries introduces Kingfisher Smooth, a new strong and smooth mainstream beer offering, expanding its product portfolio in the alcoholic beverages segment.",
            "Sentiment": "positive",
            "PublishDate": 1767771160994,
            "Source": "stocks"
        },
        {
            "Title": "United Breweries Sees Rs. 33.66 Crore Block Trade on NSE",
            "Summary": "United Breweries Ltd. witnessed a block trade worth Rs. 33.66 crores involving approximately 199,229 shares executed at Rs. 1,689.50 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the brewing company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764821053650,
            "Source": "order&deals"
        },
        {
            "Title": "United Breweries Launches Heineken Silver in New Delhi",
            "Summary": "United Breweries launched 'Heineken Silver' in New Delhi effective November 25, 2025. The product launch expands the company's beer portfolio in the Delhi market.",
            "Sentiment": "positive",
            "PublishDate": 1764115792546,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Secures Lease for New Greenfield Brewery in Uttar Pradesh",
            "Summary": "United Breweries has registered a lease agreement to establish a new greenfield brewery facility in Uttar Pradesh. This expansion move represents the company's efforts to increase manufacturing capacity and strengthen its presence in the northern Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1763727905059,
            "Source": "stock"
        },
        {
            "Title": "United Breweries CEO Calls for Tax Rationalization as High Levies Impact Beer Pricing",
            "Summary": "United Breweries CEO Vivek Gupta highlighted that taxation accounts for 75% of beer pricing, with the company's net realization being only 25%. He explained that a Re 1 cost increase translates to a Rs 4-5 price increase for consumers due to high tax burden. Gupta advocated for separating beer from spirits in taxation regimes, citing beer's lower alcohol content and social nature. The company has expanded its cooler network from 15,000 to 35,000 units. Second quarter results were mixed, with one-third to 40% of business showing double-digit growth in states like Maharashtra, Goa, Assam, Andhra Pradesh and Jharkhand. However, northern states experienced volume declines of nearly 20%, with Punjab and Haryana seeing category drops of up to 40% in certain months due to heavy rainfall impact.",
            "Sentiment": "neutral",
            "PublishDate": 1762235563284,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Focuses on Premium Products and Local Production for Better Margins",
            "Summary": "United Breweries discussed its strategy to improve profit margins by focusing on premium products and local production during a conference call. The company is working to balance its presence across different market segments while pursuing these margin enhancement initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1761881296061,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Forecasts 5-6% Beer Category Growth, Plans Higher Capital Expenditure",
            "Summary": "United Breweries expects the beer category to grow 5-6%, based on the past 5% compound annual growth rate. The company plans to increase capital expenditure to high single-digit percentage of sales, up from previous mid single-digit levels.",
            "Sentiment": "positive",
            "PublishDate": 1761880925875,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Reports 3% Sales Decline Due to Monsoon Disruption",
            "Summary": "United Breweries reported a 3% year-on-year drop in sales volume and value in the September quarter, with CEO Vivek Gupta attributing the decline to unusual monsoon conditions that flooded three company breweries. Key markets including Karnataka, Odisha, West Bengal and Telangana experienced double-digit declines, with category sales dropping 40% in affected states. The company had to rely on contract brewers to serve markets. Despite overall challenges, UBL grew premium market volume by 17% driven by Kingfisher Ultra products and launched economic brands in affected regions. Financial results showed standalone gross profit of Rs 878 crore (down 5%), EBITDA of Rs 145 crore (down 39%), net sales of Rs 2,051 crore (down 3%), and revenue from operations of Rs 3,735.6 crore (down 21%). The company also faced licensing issues in Telangana and can shortages in Uttar Pradesh, while highlighting tax concerns in Karnataka affecting the beer category.",
            "Sentiment": "negative",
            "PublishDate": 1761836217198,
            "Source": "earnings"
        },
        {
            "Title": "United Breweries Reports 64% Drop in Quarterly Net Profit to ₹469.5 Million",
            "Summary": "United Breweries reported quarterly net profit of ₹469.5 million, down from ₹1.32 billion in the same period last year, missing analyst estimates of ₹1.10 billion. Revenue declined to ₹37.36 billion from ₹47.41 billion year-over-year, though it exceeded estimates of ₹21.56 billion. EBITDA fell to ₹1.3 billion from ₹2.3 billion, with EBITDA margin contracting to 3.48% from 4.78% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761748179044,
            "Source": "earnings"
        },
        {
            "Title": "United Breweries Reports Mid-Single-Digit Revenue Growth Despite Volume Decline in Q3 2025",
            "Summary": "United Breweries Limited disclosed information from Heineken N.V.'s Q3 2025 trading update showing mixed performance in India operations. The company achieved mid-single-digit organic net revenue growth while beer volume declined by mid-single-digit due to an unusually strong monsoon season. Despite the volume drop, United Breweries outperformed the market with high-single-digit price-mix expansion driven by pricing adjustments in key states and portfolio mix improvements. Premium volume segment showed strong performance with low-teens growth, led by Kingfisher Ultra Max and the launch of Amstel Grande.",
            "Sentiment": "neutral",
            "PublishDate": 1761113202138,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Relaunches Kalyani Black Label Strong Beer in West Bengal at INR 140 per Bottle",
            "Summary": "United Breweries Limited relaunched Kalyani Black Label Strong beer in West Bengal on September 23, 2025. The product is categorized as Strong Mainstream and targets the domestic market. The beer is priced at INR 140 per 650ml bottle and will be available across leading outlets in West Bengal. According to CMO Vikram Bahl, the brand is deeply rooted in Bengal's beer culture and the accessible pricing aims to drive wider adoption and growth for the category in the state. United Breweries is part of the HEINEKEN group and is India's largest beer manufacturer with a diverse portfolio including Kingfisher, Heineken, and Amstel brands.",
            "Sentiment": "positive",
            "PublishDate": 1758606992409,
            "Source": "stock"
        },
        {
            "Title": "UBL CEO Projects 6-7% Volume Growth Despite Rain Impact, Calls for Beer Tax Reforms",
            "Summary": "United Breweries Ltd. CEO Vivek Gupta expects 6-7% volume growth this fiscal year despite heavy rains impacting key states during the second quarter. The company reported 11% volume growth in the June quarter with premium portfolio growing 46%. Gupta anticipates 25% premiumisation growth and believes recent GST reforms could boost alcoholic beverage consumption if state governments don't increase excise taxes to compensate for revenue shortfalls. He advocates for separate taxation of beer from spirits, arguing that beer contains less than 6% alcohol compared to 40-45% in whisky and other spirits. The CEO highlighted challenges including commodity price volatility, aluminum can shortages, and state-wise taxation policies affecting expansion plans. Current quarter performance faces headwinds from significant rainfall across northern India, with the beer category down double digits in July and August.",
            "Sentiment": "neutral",
            "PublishDate": 1757847752604,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Directed to Pay ₹33.98 Lakh Environmental Compensation by Rajasthan Pollution Board",
            "Summary": "United Breweries Limited received a directive from the Rajasthan State Pollution Control Board to pay ₹33,98,438 as Environmental Compensation under the Polluter Pays Principle. The order relates to alleged violations of the Water Act and Air Act at the company's brewery in Chopanki, Rajasthan. The company received the direction on September 11, 2025, and must deposit the amount at RSPCB's regional office in Bhiwadi. United Breweries stated it does not expect any financial impact on its operations and is reviewing the notice while committing to work on the highest standards.",
            "Sentiment": "negative",
            "PublishDate": 1757593144804,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Launches London Pilsner Beer in Odisha at INR 160 per 650ml Bottle",
            "Summary": "United Breweries Limited launched its London Pilsner beer in Odisha on September 09, 2025. The Strong Mainstream category beer is crafted using European hops and aged for one week at low temperatures. Priced at INR 160 per 650ml bottle, the product targets the domestic market and represents UBL's effort to make international-quality beer accessible. Odisha becomes the fourth market for London Pilsner after Maharashtra, Karnataka, and Madhya Pradesh. The company's CMO Vikram Bahl stated the launch celebrates Odisha's growing preference for fine brews and aims to drive category growth through premium beer at an accessible price point.",
            "Sentiment": "positive",
            "PublishDate": 1757396886004,
            "Source": "stock"
        },
        {
            "Title": "UBL Commences Kingfisher Beer Production at Ilios Brewery in Andhra Pradesh",
            "Summary": "UBL has started producing Kingfisher beer at its Ilios Brewery facility in Andhra Pradesh. This expansion increases the company's total production capacity in the state to 16.5 lakh cases per month.",
            "Sentiment": "positive",
            "PublishDate": 1756726667343,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Invests ₹90 Crore to Expand Telangana Brewery Capacity",
            "Summary": "United Breweries has approved a ₹90 crore investment to add 0.4 million hectoliters of capacity through a new canning line at its Nizam Brewery in Telangana. This expansion will increase the company's production capabilities at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1756207392189,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Limited Initiates Postal Ballot for Statutory Auditor Appointment",
            "Summary": "United Breweries Limited has issued a postal ballot notice to shareholders for remote e-voting on the appointment of Messrs. B S R & Co. LLP as statutory auditors. The e-voting period runs from August 20, 2025, to September 18, 2025, for shareholders as of the cut-off date of August 14, 2025. The appointment is necessary to fill a casual vacancy created by the resignation of Messrs. Deloitte Haskins & Sells following the 26th AGM held on August 07, 2025. The company seeks to align with its ultimate holding company HEINEKEN, which appointed KPMG as their statutory auditors effective January 1, 2025. B S R & Co. LLP will serve from August 8, 2025, until the conclusion of the 27th AGM in 2026, with proposed fees of ₹26.60 million excluding additional costs. The resolution requires ordinary resolution approval from shareholders through electronic voting only.",
            "Sentiment": "neutral",
            "PublishDate": 1755603593271,
            "Source": "corporate_governance"
        },
        {
            "Title": "United Breweries Launches Amstel Grande Premium Beer in Goa",
            "Summary": "United Breweries has launched Amstel Grande in Goa, marking the introduction of a premium beer offering in the country. The launch represents the company's entry into the premium beer segment.",
            "Sentiment": "positive",
            "PublishDate": 1755013893792,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Changes Statutory Auditors from Deloitte to B S R & Co. LLP",
            "Summary": "United Breweries Limited announced a change in statutory auditors following their 26th Annual General Meeting on August 7, 2025. Deloitte Haskins & Sells resigned from their position, with their tenure concluding after the AGM. The Board approved the appointment of B S R & Co. LLP as the new statutory auditors, effective August 8, 2025, until the 27th AGM in 2026. The change aligns with the company's ultimate holding company Heineken, which changed its statutory auditor effective January 1, 2025. United Breweries stated this alignment will enhance coordination with group auditors and drive audit process efficiencies given the company's materiality within the Heineken Group. The appointment requires shareholder approval, which the company will seek within prescribed timelines. B S R & Co. LLP is a chartered accountancy firm with over 4,000 staff and 140+ partners, auditing various listed companies in India including those in the consumer markets sector.",
            "Sentiment": "neutral",
            "PublishDate": 1754574701993,
            "Source": "corporate_governance"
        },
        {
            "Title": "United Breweries Limited Releases Q1 FY2025-26 Earnings Call Transcript",
            "Summary": "United Breweries Limited has made available the transcript of their earnings call held on July 23, 2025, following the announcement of financial results for the quarter ended June 30, 2025. The company provided a weblink to access the transcript and notified stock exchanges BSE and NSE about its availability. The earnings call transcript was released as part of disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753797211417,
            "Source": "earnings"
        },
        {
            "Title": "Heineken Reports Stronger-Than-Expected H1 2025 Results, Confirms Full-Year Growth Forecast",
            "Summary": "Heineken delivered stronger-than-expected results with adjusted operating profit of €2.03 billion, surpassing expectations of €2.01 billion. The company reported organic net revenue growth of 2.1% and confirmed its full-year profit growth forecast of 4-8%. The results indicate solid operational performance across Heineken's business segments.",
            "Sentiment": "positive",
            "PublishDate": 1753679593774,
            "Source": "earnings"
        },
        {
            "Title": "United Breweries Sees Rs. 36.32 Crore Block Trade on NSE",
            "Summary": "United Breweries Ltd. witnessed a block trade worth Rs. 36.32 crores on the National Stock Exchange. The transaction involved approximately 179,047 shares at a price of Rs. 2,028.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753419158859,
            "Source": "order&deals"
        },
        {
            "Title": "United Breweries Reports 6% Profit Growth, CEO Emphasizes Affordability as Key Driver",
            "Summary": "United Breweries reported a 6% year-on-year increase in standalone net profit to Rs 183.7 crore for the first quarter of fiscal 2026, with revenue rising to Rs 2,862.4 crore from Rs 2,473 crore. CEO Vivek Gupta identified affordability as the primary driver for beer category growth and highlighted the company's market share increase of over 300 basis points. The company's premium portfolio grew 46% this quarter, with strong performance from brands like Ultra, Ultra Max, and Heineken. Growth was supported by increased cooler placements in stores and localization of production. While some states like Karnataka, West Bengal, and Rajasthan face challenges due to increased excise duties, others including Uttar Pradesh, Andhra Pradesh, Assam, and Madhya Pradesh are performing well. The Maharashtra Excise Policy changes did not impact quarterly results as they were implemented after the quarter ended.",
            "Sentiment": "positive",
            "PublishDate": 1753344018327,
            "Source": "earnings"
        },
        {
            "Title": "United Breweries Targets Double-Digit EBITDA Margins, Projects 5-8% Volume Growth",
            "Summary": "United Breweries has set a target to achieve double-digit EBITDA margins in the mid-term. The company expects volume growth of 5-8% this year, with the actual figure depending on various factors. Additionally, the brewery anticipates 4-5% growth in pricing and mix for the current year.",
            "Sentiment": "positive",
            "PublishDate": 1753328204907,
            "Source": "stock"
        },
        {
            "Title": "UBL Reports 11% Volume Growth Driven by Premium Portfolio Performance",
            "Summary": "UBL reported an 11% increase in volume growth, with strong performance in its premium portfolio. The growth was driven by brands including Kingfisher Ultra, Amstel Grande, and Heineken Silver. The company achieved market share gains across several states.",
            "Sentiment": "positive",
            "PublishDate": 1753200582653,
            "Source": "stock"
        },
        {
            "Title": "United Breweries Limited Releases Q1FY2026 Investor Presentation",
            "Summary": "United Breweries Limited has made available its investor presentation covering unaudited financial results for the quarter ended June 30, 2025. The presentation is accessible through a weblink and on the company's website. The company is hosting an earnings call on July 23, 2025, following the announcement of these quarterly results. Company Secretary Nikhil Malpani communicated this information to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753196937284,
            "Source": "earnings"
        },
        {
            "Title": "United Breweries Reports Q1 Net Profit of 1.8B Rupees, Revenue Rises to 28.6B Rupees",
            "Summary": "United Breweries reported Q1 net profit of 1.8 billion rupees, up from 1.7 billion rupees in the same period last year, though below analyst estimates of 2 billion rupees. Revenue increased to 28.6 billion rupees from 24.73 billion rupees year-over-year, exceeding estimates of 27.5 billion rupees. The company showed revenue growth while profit margins fell short of expectations.",
            "Sentiment": "neutral",
            "PublishDate": 1753192704283,
            "Source": "earnings"
        },
        {
            "Title": "United Breweries Launches Amstel Grande in Karnataka",
            "Summary": "United Breweries has introduced Amstel Grande, a premium beer brand, in Karnataka. This launch marks the introduction of the premium beer segment in India by United Breweries.",
            "Sentiment": "positive",
            "PublishDate": 1751290506000,
            "Source": "default"
        },
        {
            "Title": "UBL Faces Potential Revenue Challenges as Maharashtra Raises Liquor Excise Duty",
            "Summary": "The Maharashtra state cabinet has increased the excise duty on liquor, leading to higher prices for alcoholic beverages in the state. This price increase could potentially impact United Breweries Limited (UBL) by creating revenue challenges due to increased costs and possible shifts in consumer spending patterns.",
            "Sentiment": "negative",
            "PublishDate": 1749568514000,
            "Source": "default"
        },
        {
            "Title": "United Breweries: Mangalore Brewery to Close in Strategic Consolidation",
            "Summary": "United Breweries announced the closure of its Mangalore brewery unit effective June 30, 2025, as part of a strategic capacity consolidation plan. The company is focusing on expanding its Nanjangud Brewery in Mysuru to enhance supply chain efficiencies. United Breweries assures that this closure will not impact its business performance in Karnataka.",
            "Sentiment": "neutral",
            "PublishDate": 1748923088000,
            "Source": "corporate_action"
        },
        {
            "Title": "United Breweries: Mangalore Brewery Closure and Strategic Expansion",
            "Summary": "United Breweries Ltd. will close its Mangalore brewery by June end. The company is expanding its Nanjangud Brewery in Mysuru to enhance supply chain efficiencies. UBL assures the closure won't impact business performance in Karnataka and is supporting affected employees.",
            "Sentiment": "neutral",
            "PublishDate": 1748881086000,
            "Source": "corporate_action"
        },
        {
            "Title": "United Breweries Closes Mangalore Brewery",
            "Summary": "United Breweries has announced the closure of operations at its Mangalore brewery. The company stated that this closure will not impact its business performance in the state.",
            "Sentiment": "neutral",
            "PublishDate": 1748875989000,
            "Source": "default"
        },
        {
            "Title": "United Breweries: Leases Andhra Facility to Boost Kingfisher Production",
            "Summary": "United Breweries Ltd has leased a facility from Ilios Breweries Pvt. Ltd. in Andhra Pradesh to expand manufacturing capacity. The lease became effective on May 20, aiming to strengthen supply chain and meet growing demand for Kingfisher and other products in the region.",
            "Sentiment": "positive",
            "PublishDate": 1747798164000,
            "Source": "corporate_action"
        },
        {
            "Title": "United Breweries Expands Production Capacity in Andhra Pradesh",
            "Summary": "United Breweries Limited (UBL) has expanded its production capacity in Andhra Pradesh through a leasing arrangement with Ilios Breweries. This move allows UBL to increase its brewing capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1747786899000,
            "Source": "default"
        },
        {
            "Title": "United Breweries: Leases Facility to Boost Kingfisher Production",
            "Summary": "United Breweries Ltd. has leased a facility from Ilios Breweries Pvt. Ltd. in Andhra Pradesh to increase manufacturing capacity, effective May 20. This move aims to strengthen supply chain and meet rising demand for Kingfisher beer in the region.",
            "Sentiment": "positive",
            "PublishDate": 1747737341000,
            "Source": "corporate_action"
        },
        {
            "Title": "UBL Expands Manufacturing Capabilities in Andhra Pradesh",
            "Summary": "United Breweries Limited (UBL) is increasing its manufacturing capabilities by acquiring an additional facility from Ilios Breweries Private Limited ('ILIOS') in the state of Andhra Pradesh. This expansion aims to enhance UBL's production capacity in the region.",
            "Sentiment": "positive",
            "PublishDate": 1747735242000,
            "Source": "default"
        },
        {
            "Title": "United Breweries Reports Q4 FY23 Financial Results and Dividend",
            "Summary": "United Breweries announced its Q4 financial results. Net profit increased to 974 million rupees, up from 808.4 million rupees year-over-year and 383 million rupees quarter-over-quarter. However, revenue decreased to 44.2 billion rupees from 47.87 billion rupees year-over-year. The company has recommended a dividend of 10 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746663152000,
            "Source": "default"
        },
        {
            "Title": "United Breweries: Q4 Results Surpass Expectations with Profit and Revenue Growth",
            "Summary": "United Breweries reported Q4 FY25 standalone net profit of ₹97.4 crore, up 20.5% YoY. Revenue increased 8.9% to ₹2,321.3 crore. EBITDA rose 31.2% to ₹186.3 crore with margin expansion to 8%. The company declared a dividend of ₹10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746630845000,
            "Source": "earnings"
        },
        {
            "Title": "United Breweries Announces Q4 Results and Dividend",
            "Summary": "United Breweries has reported improved financial performance for Q4, with EBITDA increasing to 1.9 billion rupees from 1.42 billion rupees year-over-year. The EBITDA margin also improved to 4.21% from 2.97%. Additionally, the company has recommended a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746627467000,
            "Source": "result"
        },
        {
            "Title": "United Breweries Reports Q4 FY2023 Financial Results",
            "Summary": "United Breweries has announced its financial results for the fourth quarter of fiscal year 2023. The company reported a net profit of 974 million rupees, up from 808.4 million rupees year-over-year, but down from 383 million rupees quarter-over-quarter. Revenue for Q4 stood at 44.2 billion rupees, a decrease from 47.87 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746627372000,
            "Source": "result"
        },
        {
            "Title": "United Breweries: Q4 FY25 Results Date and Dividend Announcement Scheduled",
            "Summary": "United Breweries to announce Q4 and FY25 results on May 7, 2025. Board meeting to consider dividend recommendation. Earnings call scheduled for May 8. Trading window closed from April 1 to May 9 for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1746509374000,
            "Source": "corporate_action"
        }
    ]
}