{
    "Symbol": "UCAL",
    "ISIN": "INE139B01016",
    "News": [
        {
            "Title": "UCAL Limited Reports Q3 FY26 Financial Results",
            "Summary": "UCAL Limited announced Q3 FY26 results with standalone revenue of ₹16,080.89 lakhs and consolidated revenue of ₹19,852.23 lakhs for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770880707807,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ucal Limited Board Approves Major Restructuring Moves",
            "Summary": "Ucal Limited's board approved dilution of up to 90% shareholding in US subsidiary Ucal Holdings Inc and sale of 6.97-acre residential plot by subsidiary UPIL for ₹45 crores to promoter group company.",
            "Sentiment": "neutral",
            "PublishDate": 1768310709901,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ucal Limited Completes Filing of Compounding Applications with RBI for Rs. 15,191.85 Lakhs Write-offs",
            "Summary": "Ucal Limited has completed filing compounding applications with the Reserve Bank of India regarding write-offs of loans and advances worth Rs. 12,337.79 lakhs and receivables of Rs. 2,854.06 lakhs from its wholly owned subsidiary Ucal Holdings Inc., USA. The write-offs were made during the year ending March 31, 2018, and the company will update stock exchanges on the progress of these applications.",
            "Sentiment": "neutral",
            "PublishDate": 1763467374867,
            "Source": "corporate_governance"
        },
        {
            "Title": "UCAL Limited Reports Mixed Quarterly Performance with Standalone Profit and Consolidated Loss",
            "Summary": "UCAL Limited announced its unaudited financial results for the quarter ended September 30, 2025. On a standalone basis, the company reported a net loss of Rs 252.09 lakhs compared to a profit of Rs 547.08 lakhs in the same quarter last year. However, on a consolidated basis, the net loss widened to Rs 446.93 lakhs from a profit of Rs 48.74 lakhs in the corresponding period. Revenue from operations on standalone basis was Rs 6,493.30 lakhs versus Rs 5,443.84 lakhs in the previous year quarter. The consolidated revenue stood at Rs 21,130.39 lakhs compared to Rs 21,302.21 lakhs in the same quarter last year. The company operates in the automotive components segment and has subsidiaries including UCAL Holdings Inc. (USA) and UCAL Polymer Industries Limited.",
            "Sentiment": "negative",
            "PublishDate": 1762756572409,
            "Source": "earnings"
        },
        {
            "Title": "Ucal Limited Reports Mixed Q1 Results with Revenue Decline but Improved Profitability",
            "Summary": "Ucal Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. Standalone revenue decreased to Rs. 13,960.10 lakhs from Rs. 15,013.76 lakhs in the previous quarter, while consolidated revenue declined to Rs. 19,452.27 lakhs from Rs. 19,889.60 lakhs. However, both showed year-over-year growth. Standalone profit before tax fell to Rs. 146.29 lakhs from Rs. 194.24 lakhs, but consolidated loss before tax improved significantly to Rs. 475.87 lakhs from Rs. 1,724.20 lakhs. The automotive components company showed operational improvements with standalone EBITDA margin rising to 8.86% from 8.28% and consolidated EBITDA margin improving to 6.64% from -0.41%. Standalone EPS improved to Rs. 0.15 from Rs. -0.63, while consolidated EPS improved to Rs. -2.72 from Rs. -9.31. The company is awaiting RBI approval for write-offs totaling Rs. 15,191.85 lakhs from its US subsidiary UCAL Holdings Inc.",
            "Sentiment": "neutral",
            "PublishDate": 1755067330768,
            "Source": "earnings"
        },
        {
            "Title": "UCAL Reports Profit in Q2 FY2024, Reversing Previous Year's Loss",
            "Summary": "UCAL has announced its Q2 financial results, showing a turnaround from loss to profit. The company reported a consolidated net profit of 5 million rupees, compared to a loss of 15 million rupees in the same quarter last year. Revenue also increased to 2 billion rupees from 1.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731404227000,
            "Source": "result"
        }
    ]
}