{
    "Symbol": "UCOBANK",
    "ISIN": "INE691A01018",
    "News": [
        {
            "Title": "UCO Bank alerts on Feb 12 strike by bank unions",
            "Summary": "UCO Bank informs exchanges about potential strike by AIBEA, BEFI and AIBOA on February 12, 2026, which may affect branch operations despite bank's contingency measures.",
            "Sentiment": "negative",
            "PublishDate": 1770789913624,
            "Source": "stocks"
        },
        {
            "Title": "UCO Bank GM Manish Kumar Superannuates from Service",
            "Summary": "UCO Bank announces superannuation of Mr. Manish Kumar, General Manager of Credit Monitoring Department, effective January 31, 2026, under SEBI regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769883157009,
            "Source": "stocks"
        },
        {
            "Title": "UCO Bank Q3FY26 Earnings Call Highlights Strong Growth",
            "Summary": "UCO Bank reported robust Q3FY26 performance with 16.74% credit growth, 15.65% net profit increase to ₹739 crores, and improved asset quality metrics during earnings call.",
            "Sentiment": "positive",
            "PublishDate": 1769593671897,
            "Source": "co_actions_results"
        },
        {
            "Title": "UCO Bank Issues Strike Notice for January 27, 2026",
            "Summary": "UCO Bank notifies exchanges about potential strike by United Forum of Bank Unions on January 27, 2026, which may affect branch operations despite contingency measures.",
            "Sentiment": "negative",
            "PublishDate": 1769336557006,
            "Source": "stocks"
        },
        {
            "Title": "UCO Bank Uploads Q3 FY26 Earnings Call Recording",
            "Summary": "UCO Bank has made available the audio/video recording of its post-earnings analyst meet held on January 20, 2026, on the bank's official website for stakeholder access.",
            "Sentiment": "neutral",
            "PublishDate": 1768927729542,
            "Source": "co_actions_results"
        },
        {
            "Title": "UCO Bank Reduces MCLR Rates by 5 Basis Points",
            "Summary": "UCO Bank's ALCO committee has revised benchmark rates effective January 11, 2026, reducing MCLR rates across all tenors by 5 basis points while keeping repo-linked rates and base rate unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1768055048508,
            "Source": "stocks"
        },
        {
            "Title": "UCO Bank Q3 business grows 13% YoY, shares up 3.69%",
            "Summary": "UCO Bank reports ₹5.54L cr total business with 13.29% YoY growth. Advances surge 16.27% while deposits grow 10.71%. CASA ratio improves to 38.41% in Q3FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767346468694,
            "Source": "co_actions_results"
        },
        {
            "Title": "UCO Bank Director Rachna Khare Resigns for New Role",
            "Summary": "UCO Bank announces resignation of Shareholder Director Ms. Rachna Khare effective December 25, 2025, following her appointment as Insurance Ombudsman in Pune.",
            "Sentiment": "neutral",
            "PublishDate": 1766745239956,
            "Source": "stocks"
        },
        {
            "Title": "UCO Bank Revises Key Benchmark Rates Effective Dec 11",
            "Summary": "UCO Bank's ALCO committee has revised several benchmark rates including MCLR, TBLR, G-Sec and Repo-linked rates effective December 11, 2025, with notable reductions in Treasury Bill Linked Rates and Repo-linked rates.",
            "Sentiment": "neutral",
            "PublishDate": 1765380274254,
            "Source": "stocks"
        },
        {
            "Title": "UCO Bank Reports 3% Net Profit Growth in Q2 FY26 with Strong Asset Quality Improvement",
            "Summary": "UCO Bank reported net profit of Rs. 620 crores for the quarter ended September 2025, marking a 3% year-on-year growth. Operating profit reached Rs. 1,613 crores with 12.64% growth. The bank achieved 16.56% credit growth and 10.85% deposit growth, with business growing 13.23% overall. Asset quality improved significantly with gross NPA declining 62 basis points to 2.56% and net NPA reducing 30 basis points to 0.43%. The bank maintained CASA ratio at 38.11% and achieved provision coverage ratio of 96.99%. Net interest margin stood at 2.90% globally and 3.08% domestically, excluding one-time interest income of Rs. 107 crores. RAM (Retail, Agriculture, MSME) portfolio grew 22.87% and now comprises 65.23% of total advances. The bank reported total recovery and upgradation of Rs. 792 crores for the quarter with slippage ratio at 0.26%. Cost of deposits decreased to 4.73% from 4.88% year-on-year. Capital adequacy ratio remained strong at 17.89%. Management highlighted ongoing digital transformation initiatives under Project Parivartan and plans for 150 new branches by March.",
            "Sentiment": "positive",
            "PublishDate": 1761308911754,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Plans 150 New Branches by March, Reports 3% Profit Growth",
            "Summary": "UCO Bank announced plans to add 150 branches over the next five months, expanding its network from 3,322 to 3,472 branches by March. The board has approved this expansion as part of efforts to grow business presence. The bank reported a 3% increase in net profit to Rs 620 crore for the second quarter, up from Rs 603 crore in the previous year. Total income rose to Rs 7,421 crore from Rs 7,071 crore, while interest income increased to Rs 6,537 crore from Rs 6,078 crore. Net interest income grew to Rs 2,533 crore from Rs 2,301 crore. Operating profit climbed to Rs 1,613 crore compared to Rs 1,432 crore. Asset quality improved significantly with gross non-performing assets declining to 2.56% from 3.18%, and net NPAs dropping to 0.43% from 0.73%. The bank plans to hire more skilled workers in IT, digital and cyber security areas while improving branch ambience. UCO Bank currently employs 21,266 staff members, with 70% below the average age of 70 years.",
            "Sentiment": "positive",
            "PublishDate": 1761142792060,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Reports Growth in Q2 Interest Income and Net Profit",
            "Summary": "UCO Bank reported Q2 interest earnings of 65.37 billion rupees, up from 60.78 billion rupees year-over-year. The bank's Q2 net profit increased to 6.2 billion rupees compared to 6.03 billion rupees in the same period last year. Asset quality showed improvement with gross non-performing assets (GNPA) declining to 2.56% from 2.63% quarter-over-quarter, while net non-performing assets (NNPA) decreased to 0.43% from 0.45% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760688789990,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Schedules Board Meeting on October 17, 2025 for Quarterly Results",
            "Summary": "UCO Bank has scheduled a Board of Directors meeting on October 17, 2025, to consider and approve unaudited standalone financial results for the quarter and half year ended September 30, 2025. The bank's trading window for directors, designated persons, and insiders has been closed since October 1, 2025, and will remain closed until 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1760361267654,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank Revises Benchmark Interest Rates with Mixed Changes to MCLR and TBLR",
            "Summary": "UCO Bank's Asset Liability Management Committee has revised several benchmark interest rates effective from October 10, 2025. The bank reduced MCLR rates across most tenors, with overnight MCLR decreasing from 8.05% to 8.00%, one-month from 8.30% to 8.25%, and one-year from 8.90% to 8.85%. Three-month and six-month MCLR rates remained unchanged at 8.45% and 8.70% respectively. TBLR rates increased across all tenors, with 3-month rising from 5.45% to 5.50%, 6-month from 5.50% to 5.60%, and 12-month from 5.55% to 5.60%. G-Sec linked rates saw marginal decreases, with UCO G-Sec Rate (1 year) falling from 5.67% to 5.64% and 10-year G-Sec Rate YTM declining from 6.78% to 6.72%. Repo Linked Rates, Base Rate, and BPLR remained unchanged at their existing levels.",
            "Sentiment": "neutral",
            "PublishDate": 1760265003948,
            "Source": "stock"
        },
        {
            "Title": "UCO Bank Reports 13% Growth in Total Business to ₹5.37 Lakh Crore",
            "Summary": "UCO Bank reported total business of ₹5.37 lakh crore for the quarter ended September 30, 2025, marking 13.29% year-on-year growth and 2.48% quarter-on-quarter increase. Total advances rose 16.67% YoY to ₹2.31 lakh crore, while domestic advances increased 17.24% YoY to ₹2.04 lakh crore. Total deposits reached ₹3.06 lakh crore, up 10.87% YoY. The domestic CASA ratio stood at 38.11% compared to 38.24% a year earlier. Credit-to-deposit ratio improved to 75.56% from 71.77% in September 2024. Net Interest Income for the quarter rose 7% to ₹2,403 crore. Asset quality improved with Gross NPA at 2.63% compared to 2.69% in March quarter, and Net NPA at 0.45% from 0.50% in March quarter. Provisions decreased to ₹616 crore from ₹663 crore in March. UCO Bank shares closed at ₹30.78, down 0.52% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1759579883623,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Executive Director Rajendra Kumar Saboo Gets Three-Year Tenure Extension",
            "Summary": "The Central Government has extended the tenure of Rajendra Kumar Saboo as Executive Director of UCO Bank for an additional three years beyond his term ending on November 20, 2025, or until further orders, whichever is earlier. The extension was granted through government notification dated September 15, 2025, under the Banking Companies Act, 1970 and related provisions for nationalized banks.",
            "Sentiment": "positive",
            "PublishDate": 1758008992114,
            "Source": "corporate_governance"
        },
        {
            "Title": "UCO Bank Receives Government Approval to Handle Trade Payments for Sanctioned Nayara Energy",
            "Summary": "UCO Bank has received government approval to facilitate trade payments for Nayara Energy, nearly two months after the refiner was sanctioned by the EU. Senior executives from the state-owned lender met with finance ministry officials and were asked to take the lead in executing payments for Nayara, which is part-owned by Russian oil major Rosneft. Operational details including currency choice are still being worked out. Nayara had approached government officials for help securing a domestic lender with limited offshore presence to support crude oil import payments and receive payments for refined fuel exports. Since being sanctioned in July, Nayara has faced significant operational challenges - large institutions including State Bank of India have stopped processing transactions, ships have diverted from its terminal, and the company has cut run rates while seeking advance payments. Rosneft owns just over 49% of Nayara, which accounts for nearly 8% of India's refining capacity and 7% of its retail-fuel network.",
            "Sentiment": "neutral",
            "PublishDate": 1757948561709,
            "Source": "stock"
        },
        {
            "Title": "UCO Bank Reduces MCLR Rates by 5-10 Basis Points, Adjusts Other Benchmark Rates",
            "Summary": "UCO Bank's Asset Liability Management Committee has revised benchmark interest rates effective September 10, 2025. The bank reduced MCLR rates across all tenors by 5-10 basis points, with overnight MCLR decreasing from 8.15% to 8.05% and one-year MCLR falling from 8.95% to 8.90%. The 3-month TBLR increased from 5.35% to 5.45%, while 6-month and 12-month TBLR rates remained unchanged at 5.50% and 5.55% respectively. UCO G-Sec Rate for 1 year rose from 5.64% to 5.67%, and the 10-year G-Sec Rate YTM increased from 6.51% to 6.78%. Repo Linked Rates, Base Rate at 9.60%, and BPLR at 14.25% remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1757425343167,
            "Source": "stock"
        },
        {
            "Title": "UCO Bank Revises MCLR and Other Benchmark Interest Rates Effective August 10, 2025",
            "Summary": "UCO Bank's Asset Liability Management Committee has revised its benchmark interest rates. The MCLR rates have been updated across all tenors: overnight at 8.15%, one month at 8.35%, three month at 8.50%, six month at 8.75%, and one year at 8.95%. Other benchmark rate changes include TBLR (3 month) decreasing from 5.40% to 5.35%, TBLR (12 month) increasing from 5.50% to 5.55%, UCO G-Sec Rate (1 year) rising from 5.60% to 5.64%, and 10-year G-Sec Rate YTM increasing from 6.44% to 6.51%. TBLR (6 month), Repo Linked Rates, Base Rate, and BPLR remain unchanged. The revised MCLR, TBLR and G-sec linked rates take effect from August 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754575122424,
            "Source": "stock"
        },
        {
            "Title": "UCO Bank Makes Post Earnings Conference Call Recording Available Online",
            "Summary": "UCO Bank has uploaded the audio/video recording of its Post Earnings Conference Call with Analysts and Investors held on July 21, 2025, to its website. The bank provided a direct link for accessing the recording and notified stock exchanges NSE and BSE about the availability of this content on their platform.",
            "Sentiment": "neutral",
            "PublishDate": 1753158207408,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Reports 10.7% Growth in Q1 Net Profit to 6.1 Billion Rupees",
            "Summary": "UCO Bank posted a net profit of 6.1 billion rupees in Q1, representing a 10.7% increase from 5.51 billion rupees in the same period last year. The bank's interest income grew to 64.36 billion rupees from 60.24 billion rupees year-over-year. Provisions for non-performing assets increased to 4.6 billion rupees from 3.6 billion rupees quarter-over-quarter. Asset quality showed improvement with gross non-performing assets ratio declining to 2.63% from 2.69% and net non-performing assets ratio decreasing to 0.45% from 0.50% on a quarterly basis.",
            "Sentiment": "positive",
            "PublishDate": 1753082581514,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Reports Growth in Q1 Advances and Deposits",
            "Summary": "UCO Bank has reported growth in its quarterly financial performance. The bank's total business increased to 5.24 lakh crore, representing a 13.67% year-over-year growth. Total advances grew by 16.58% year-over-year to 2.25 lakh crore, while total deposits increased by 11.57% year-over-year to 2.99 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1751542513000,
            "Source": "default"
        },
        {
            "Title": "UCO Bank: Total Business Surges 14% to ₹5.24 Lakh Crore in Q1",
            "Summary": "UCO Bank reported a 13.7% YoY growth in total business for Q1 FY2025-26, reaching ₹5.24 lakh crore. Total advances grew 16.6% YoY to ₹2.25 lakh crore, while total deposits increased 11.6% YoY to ₹2.99 lakh crore. Domestic advances showed strong growth at 19.8% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1751539874000,
            "Source": "result"
        },
        {
            "Title": "UCO Bank Block Trade: 26.14 Million Shares Traded at Rs. 29.39",
            "Summary": "A block trade of approximately 26,138,260 shares of UCO Bank occurred on the National Stock Exchange (NSE). The total value of the trade was Rs. 76.82 crores, with shares priced at Rs. 29.39 each.",
            "Sentiment": "neutral",
            "PublishDate": 1750663398000,
            "Source": "block_details"
        },
        {
            "Title": "UCO Bank: MCLR Reduced by 10 Basis Points Across Tenures",
            "Summary": "UCO Bank has lowered its marginal cost of fund-based lending rate (MCLR) by 10 basis points across all tenures, effective June 10. This follows the RBI's 50 basis point cut in the repo rate. The overnight MCLR is now 8.15%, one-month 8.35%, three-month 8.5%, six-month 8.8%, and one-year 9%. Treasury bill-linked rates have been reduced to 5.8%, UCO Float rate to 8.3%, and UCO Prime to 5.5%.",
            "Sentiment": "positive",
            "PublishDate": 1749226112000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank: Former CMD Arrested in ₹6,210 Crore Money Laundering Case",
            "Summary": "Subodh Kumar Goel, ex-CMD of UCO Bank, arrested by ED for alleged involvement in a ₹6,210.72 crore money laundering case. Goel accused of facilitating illegal loans to Concast Steel & Power Ltd and receiving kickbacks. ED custody granted until May 21, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1747638169000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Uco Bank Reports Strong Q4 FY23 Results",
            "Summary": "Uco Bank has reported a net profit of 6.52 billion rupees in Q4 FY23, up from 5.26 billion rupees year-over-year. Interest earned increased to 67.45 billion rupees from 58.6 billion rupees in the same period. The bank's asset quality improved with GNPA at 2.69% and NNPA at 0.50%, down from 2.91% and 0.63% respectively in the previous quarter. Provisions stood at 6.63 billion rupees. The bank exceeded its guidance for deposit and credit growth, reporting 11.56% and 17.72% growth respectively.",
            "Sentiment": "positive",
            "PublishDate": 1745885457000,
            "Source": "default"
        },
        {
            "Title": "UCO Bank: Plans to Issue 270 Crore Shares in FY26 to Reduce Government Stake",
            "Summary": "UCO Bank aims to issue up to 270 crore fresh equity shares in FY 2025-26 to reduce government stake to 75%, complying with SEBI's minimum public shareholding norms. This follows a recent QIP raising Rs 2,000 crore, which reduced government shareholding to 90.95%. The new issue could be valued at around Rs 8,000 crore based on current market price.",
            "Sentiment": "positive",
            "PublishDate": 1745850301000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank Exceeds Growth Guidance for Deposits and Credit",
            "Summary": "UCO Bank has reported deposit growth of 11.56%, surpassing its guidance of 8-10%. The bank's credit growth has also exceeded expectations, reaching 17.72% compared to the projected 12-14% growth.",
            "Sentiment": "positive",
            "PublishDate": 1745843035000,
            "Source": "result"
        },
        {
            "Title": "UCO Bank: Net Profit Jumps 24% in Q4, Asset Quality Improves",
            "Summary": "UCO Bank reported a 24% year-on-year increase in consolidated net profit to ₹665.72 crore for Q4 FY2025. Total income rose to ₹8,136 crore. The bank's asset quality improved with gross NPA ratio declining to 2.69% and net NPA ratio falling to 0.50%. Total business grew 14.12% to ₹5,13,527 crore, driven by growth in advances and deposits.",
            "Sentiment": "positive",
            "PublishDate": 1745840534000,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank: Q4 Profit Jumps 24%, Announces Dividend",
            "Summary": "UCO Bank reported a 24% YoY increase in Q4 FY2024-25 net profit to ₹652 crore. Total business grew 14.12% YoY to ₹5,13,527 crore. Gross NPA improved to 2.69%. The bank proposed a dividend of ₹0.39 per share for FY2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1745838458000,
            "Source": "result"
        },
        {
            "Title": "UCO Bank Revises One-Year MCLR to 9.10%",
            "Summary": "UCO Bank has announced a revision to its one-year Marginal Cost of Funds Based Lending Rate (MCLR). The new rate is set at 9.10% and will be effective from April 10. This change in the MCLR, which serves as a benchmark for various types of loans, could potentially impact the interest rates for borrowers.",
            "Sentiment": "neutral",
            "PublishDate": 1744199648000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank: Q4 Business Grows 14%, Domestic Loans Surge 20%",
            "Summary": "UCO Bank reported 14% YoY business growth in Q4 FY2025, with total business at Rs 5.13 lakh crore. Domestic advances rose 20.37% to Rs 1.95 lakh crore, while total deposits increased 11.41% to Rs 2.93 lakh crore. The CASA ratio stood at 37.9%, and the credit-deposit ratio was 75.01%.",
            "Sentiment": "positive",
            "PublishDate": 1743731897000,
            "Source": "result"
        },
        {
            "Title": "Uco Bank Closes QIP Issue and Sets Share Price",
            "Summary": "Uco Bank has announced the closure of its Qualified Institutional Placement (QIP) issue period. The bank has determined and approved the issue price of ₹34.27 per equity share for the QIP.",
            "Sentiment": "neutral",
            "PublishDate": 1743120673000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank Closes Qualified Institutional Placement (QIP) Issue",
            "Summary": "UCO Bank has approved the closure of its Qualified Institutional Placement (QIP) issue period. The bank has determined and approved the issue price at ₹34.27 per equity share for the QIP.",
            "Sentiment": "positive",
            "PublishDate": 1743083869000,
            "Source": "corporate_action"
        },
        {
            "Title": "Uco Bank Launches Qualified Institutional Placement (QIP)",
            "Summary": "Uco Bank has set the floor price for its Qualified Institutional Placement (QIP) at 36.07 rupees per equity share. The bank approved the opening of the QIP on March 24 and may offer a discount of up to 5% for the placement.",
            "Sentiment": "positive",
            "PublishDate": 1742861370000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank Launches Qualified Institutional Placement (QIP)",
            "Summary": "UCO Bank has initiated a Qualified Institutional Placement (QIP) with a total size of ₹2,000 crore. The QIP is priced at 34.27 rupees per share, which represents a 9.19% discount to the closing price on March 21 and a 5% discount to the floor price.",
            "Sentiment": "positive",
            "PublishDate": 1742775298000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank: QIP Launched to Raise ₹2,000 Crore at Discounted Price",
            "Summary": "UCO Bank has set the price for its ₹2,000 crore qualified institutional placement (QIP) at ₹34.27 per share, a 9.19% discount to its March 21 closing price. The issue price is 5% below the SEBI-prescribed floor price of ₹36.07 per share.",
            "Sentiment": "positive",
            "PublishDate": 1742570731000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank: ₹2,000 Crore QIP Likely Delayed to Next Fiscal Year",
            "Summary": "UCO Bank's planned ₹2,000 crore Qualified Institutional Placement (QIP) is unlikely to occur in the current fiscal year. The bank has postponed foreign roadshows originally scheduled for February to March or later. The QIP aims to reduce government stake by 3% to comply with SEBI's public shareholding norms.",
            "Sentiment": "neutral",
            "PublishDate": 1740632722000,
            "Source": "corporate_action"
        },
        {
            "Title": "Uco Bank Receives Tax Demand Order of 14.73 Billion Rupees",
            "Summary": "Uco Bank has been issued a tax demand order amounting to 14.73 billion rupees (approximately $177 million USD). This significant tax liability could have substantial financial implications for the bank, potentially affecting its profitability and financial stability. The news indicates a major financial challenge for Uco Bank, which may need to address this tax demand through legal means or by adjusting its financial strategies.",
            "Sentiment": "negative",
            "PublishDate": 1739146306000,
            "Source": "corporate_governance"
        },
        {
            "Title": "UCO Bank Revises One-Year MCLR to 9.10%",
            "Summary": "UCO Bank has announced a revision to its one-year Marginal Cost of Funds Based Lending Rate (MCLR). The new rate has been set at 9.10% and will be effective from February 10. This change in the MCLR, which serves as a benchmark for various types of loans, could potentially impact borrowing costs for the bank's customers.",
            "Sentiment": "neutral",
            "PublishDate": 1739146233000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank Revises One-Year MCLR to 9.10%",
            "Summary": "UCO Bank has announced a revision to its one-year Marginal Cost of Funds Based Lending Rate (MCLR). The new MCLR has been set at 9.10% and will take effect from February 10. This change in the benchmark lending rate could potentially impact the interest rates on various loans offered by the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1738939298000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank Receives Tax Demand Order of 14.73 Billion Rupees",
            "Summary": "UCO Bank has been issued a tax demand order amounting to 14.73 billion rupees (approximately $177 million USD). This significant tax liability could potentially impact the bank's financial position and may require attention from shareholders and management.",
            "Sentiment": "negative",
            "PublishDate": 1738930711000,
            "Source": "corporate_governance"
        },
        {
            "Title": "UCO Bank Plans Rs 20 Billion QIP in Q4 to Reduce Government Stake",
            "Summary": "UCO Bank's Managing Director has announced plans to launch a Qualified Institutional Placement (QIP) worth Rs 20 billion in the fourth quarter. This move is aimed at reducing the government's stake in the bank by 3%.",
            "Sentiment": "positive",
            "PublishDate": 1737453261000,
            "Source": "corporate_action"
        },
        {
            "Title": "UCO Bank: Q3 Profit Surges 27%, Asset Quality Improves",
            "Summary": "UCO Bank reported a 27% increase in net profit to ₹638.83 crore for Q3FY25. Net Interest Income rose 19.6% YoY to ₹2,377 crore. Asset quality improved with GNPA ratio decreasing to 2.91% and Net NPA ratio dropping to 0.63%.",
            "Sentiment": "positive",
            "PublishDate": 1737450075000,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Reports Reduced NPA Provisions in Q3",
            "Summary": "UCO Bank has reported a significant decrease in its provisions for Non-Performing Assets (NPAs) in the third quarter. The bank set aside 2.6 billion rupees for NPAs, compared to 6 billion rupees in the previous quarter, indicating a 56.7% reduction in provisions quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737448525000,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Reports Increased Interest Earnings in Q3",
            "Summary": "UCO Bank has reported a significant increase in its interest earnings for the third quarter. The bank's interest earned rose to 62.2 billion rupees, up from 55 billion rupees in the same period last year, marking a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737448513000,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank Reports Improvement in Asset Quality for Q3",
            "Summary": "UCO Bank has reported a significant improvement in its asset quality for the third quarter. The Gross Non-Performing Assets (GNPA) ratio decreased to 2.91% from 3.18% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) ratio improved to 0.63% from 0.73% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737448492000,
            "Source": "result"
        },
        {
            "Title": "UCO Bank Reports 28% Increase in Q3 Net Profit",
            "Summary": "UCO Bank has announced its financial results for the third quarter, reporting a net profit of 6.4 billion rupees. This represents a significant increase from the 5 billion rupees net profit recorded in the same quarter of the previous year, indicating a year-over-year growth of approximately 28%.",
            "Sentiment": "positive",
            "PublishDate": 1737448458000,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank to Consider Q3 Results on January 21",
            "Summary": "UCO Bank has announced that it will consider its third quarter (Q3) financial results on January 21. This indicates that the bank is preparing to release its earnings report for the quarter, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1737036369000,
            "Source": "earnings"
        }
    ]
}