{
    "Symbol": "UDS",
    "ISIN": "INE851I01011",
    "News": [
        {
            "Title": "Updater Services Q3FY26 Results: Profit Drops 79%",
            "Summary": "Updater Services reported Q3FY26 consolidated profit of ₹66.12 million, down 79% YoY. Revenue grew 10% to ₹7,671.01 million. Company faced ₹201 million impairment loss due to irregularities.",
            "Sentiment": "negative",
            "PublishDate": 1770306799799,
            "Source": "co_actions_results"
        },
        {
            "Title": "UDS Wins GST Appeal, Rs 4.69 Cr Demand Dropped",
            "Summary": "Updater Services Limited successfully contested GST demand as Joint Commissioner Appeals Chennai dropped Rs 4,69,14,392 demand in full on February 3, 2026, setting aside GST Department's order.",
            "Sentiment": "positive",
            "PublishDate": 1770223979898,
            "Source": "stocks"
        },
        {
            "Title": "Updater Services Q3 FY26 earnings call on Feb 6",
            "Summary": "Updater Services Limited announces earnings conference call scheduled for February 6, 2026 at 11:00 AM IST to discuss Q3 and 9M FY26 financial results with key management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769779030843,
            "Source": "co_actions_results"
        },
        {
            "Title": "Updater Services Announces Key Leadership Changes",
            "Summary": "Updater Services Limited reports resignation of Whole Time Director Snehashish Bhattacharjee and appointment of Sunil Munshi as Additional Executive Director at material subsidiary Denave India Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769759047007,
            "Source": "stocks"
        },
        {
            "Title": "Updater Services Receives ₹21.99 Lakh CGST Order",
            "Summary": "Updater Services Limited received a CGST order of ₹21.99 lakh from Commercial Tax Officer Chennai for alleged wrongful ITC on insurance expenses. Company plans legal appeal.",
            "Sentiment": "negative",
            "PublishDate": 1769256812746,
            "Source": "stocks"
        },
        {
            "Title": "Updater Services Subsidiary Gets ₹1.01 Cr Tax Order",
            "Summary": "Updater Services subsidiary Fusion Foods receives ₹1.01 crore tax order under Section 73 for SEZ supplies. Company deems order without merit, expects nil financial impact, exploring legal options.",
            "Sentiment": "negative",
            "PublishDate": 1767073065292,
            "Source": "stocks"
        },
        {
            "Title": "Updater Services receives ₹18.20 lakh CGST order",
            "Summary": "Updater Services Limited received a regulatory order from Pune authorities for ₹18,19,524 under CGST Act Section 74, related to housekeeping services tax payment dispute.",
            "Sentiment": "negative",
            "PublishDate": 1766490231692,
            "Source": "stocks"
        },
        {
            "Title": "Updater Services gets ₹11.07L tax order from Chennai",
            "Summary": "Updater Services Limited received a ₹11.07 lakh tax order from Deputy Commissioner, Chennai under CGST Act Section 73. Company plans legal challenge, expects nil financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1765950097354,
            "Source": "stocks"
        },
        {
            "Title": "Updater Services Promoter Raghunandana Tangirala Increases Stake Through Open Market Purchase",
            "Summary": "Promoter Raghunandana Tangirala acquired 8,000 equity shares of Updater Services Limited through open market transactions, increasing his shareholding from 24.1377% to 24.1496% of the paid-up share capital. The acquisition represents a 0.0119% increase in his stake in the Chennai-based business services company listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1765340450232,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Promoter Increases Stake Through Open Market Purchase",
            "Summary": "Raghunandana Tangirala, a promoter of Updater Services Limited, acquired 7,000 equity shares through open market purchase on December 05, 2025. His shareholding increased by 0.0105% from 24.1123% to 24.1228% of the company's paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1765005020380,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Appoints Surinder Kumar as Interim Group CFO",
            "Summary": "Updater Services Limited has appointed Mr. Surinder Kumar as interim Group Chief Financial Officer with immediate effect from December 01, 2025, following board approval based on committee recommendations. Kumar brings 18 years of diverse financial experience and previously headed the Finance of UDS-BSS Segment, having also served as CFO at Denave India Private Limited and held roles at Baxter, KPMG, and Deloitte.",
            "Sentiment": "positive",
            "PublishDate": 1764590277885,
            "Source": "corporate_governance"
        },
        {
            "Title": "Updater Services Promoter Raghunandana Tangirala Acquires Additional 3,000 Shares",
            "Summary": "Promoter Raghunandana Tangirala acquired 3,000 equity shares of Updater Services Limited through open market purchase on November 24, 2025. His shareholding increased by 0.0045% from 24.0959% to 24.1004% of the company's paid-up share capital, strengthening promoter ownership in the business services company.",
            "Sentiment": "positive",
            "PublishDate": 1764057156806,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Promoter Raghunandana Tangirala Acquires Additional 11,000 Equity Shares",
            "Summary": "Promoter Raghunandana Tangirala acquired 11,000 equity shares of Updater Services Limited through open market purchase on November 21, 2025. His shareholding increased by 0.0165% from 24.0794% to 24.0959% of the company's paid-up share capital, strengthening promoter ownership in the business services company.",
            "Sentiment": "neutral",
            "PublishDate": 1763726570824,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Promoter Raghunandana Tangirala Increases Stake Through Open Market Purchase",
            "Summary": "Raghunandana Tangirala, a promoter of Updater Services Limited, acquired 11,400 equity shares through open market purchase on November 14, 2025. His shareholding increased by 0.0170% from 24.0624% to 24.0794% of the company's paid-up share capital, strengthening promoter ownership in the business services company.",
            "Sentiment": "neutral",
            "PublishDate": 1763369747603,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Promoter Raghunandana Tangirala Increases Stake Through Open Market Purchase",
            "Summary": "Raghunandana Tangirala, a promoter of Updater Services Limited, acquired 16,000 equity shares through open market transactions on November 13, 2025. His shareholding increased by 0.0239% from 24.0385% to 24.0624% of the company's paid-up share capital, strengthening promoter control in the business services company.",
            "Sentiment": "neutral",
            "PublishDate": 1763098483471,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Reports Mixed Q2 Performance with IFM Growth Offset by BSS Challenges",
            "Summary": "Updater Services Limited reported quarterly results with contrasting performance across segments. The Integrated Facilities Management (IFM) business recorded 10% year-on-year revenue growth to INR 9,608 million in H1 FY26, adding 14 new clients during the quarter. However, EBITDA stood at INR 476 million with margins impacted by upfront costs from new strategic contracts still in ramp-up phase. The Business Support Services (BSS) segment faced headwinds, with overall BSS growth at just 1.5% year-on-year. Key challenges included sluggish demand from a large global customer in Denave's demand generation segment, continued IT hiring slowdown affecting the employee background verification business, and a 20% decline in Athena revenues. The company took conservative provisions of INR 30 million related to receivables under review at subsidiary Avon, primarily due to lapses in due diligence processes. Management expects consolidated revenue growth of 9-10% for the full year, targeting 12-13% growth in IFM and around 3-4% in BSS. The company maintains its focus on private sector clients and technology-led interventions to improve profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1762987846514,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services Promoter Raghunandana Tangirala Increases Stake Through Share Purchase",
            "Summary": "Raghunandana Tangirala, a promoter of Updater Services Limited, purchased 20,000 equity shares on November 11, 2025, through on-market transactions on NSE. His shareholding increased from 1,60,69,579 shares (24.00%) to 1,60,89,579 shares (24.03%). The company disclosed this transaction under SEBI insider trading regulations. Tangirala serves as Managing Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762933067568,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Promoter Raghunandana Tangirala Increases Stake Through Share Purchase",
            "Summary": "Raghunandana Tangirala, a promoter of Updater Services Limited, purchased 36,070 equity shares on November 10, 2025, through on-market transactions on NSE. Following this acquisition, his shareholding increased from 1,60,33,579 shares (3.94%) to 1,60,69,579 shares (24.00%). The company disclosed this transaction in compliance with SEBI insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762813295818,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Reports No Deviation in IPO Fund Utilization for Q2 FY2026",
            "Summary": "Updater Services Limited submitted its monitoring agency report for the quarter ended September 30, 2025, prepared by ICRA Limited. The report confirms no deviation from the stated objects of the company's IPO issue, with fund utilization aligned with disclosed purposes. The company's IPO raised Rs 640 crores, with net proceeds of Rs 377.87 crores allocated across four main objectives: repayment of borrowings (Rs 133 crores), working capital funding (Rs 115 crores), inorganic initiatives (Rs 80 crores), and general corporate purposes (Rs 49.87 crores). As of the quarter end, Rs 377.76 crores had been utilized with Rs 0.11 crores remaining unutilized. All implementation timelines remain on schedule with completion dates set for March 31, 2025. The monitoring agency found no major deviations, delays, or unfavorable events affecting the viability of the stated objects.",
            "Sentiment": "neutral",
            "PublishDate": 1762752418582,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Reports 7% Revenue Decline in Q2FY26 Despite Strategic Contract Wins",
            "Summary": "Updater Services Limited reported consolidated revenue of ₹7,349 million for Q2FY26, down 7% from ₹7,869 million in Q2FY25. EBITDA increased to ₹506 million from ₹371 million year-over-year, with margins improving to 7.4% from 5.0%. For H1FY26, revenue declined 7% to ₹14,402 million while EBITDA fell 17% to ₹815 million. The company secured several strategic contracts during the quarter that are in ramp-up phase with upfront costs impacting margins. BSS companies Denave and Athena experienced impact from global industry headwinds. UDS Group added 28 marquee clients across business segments and received Great Place to Work accreditation for the third consecutive year. The company anticipates full-year FY26 revenue growth in the 0-10% range. During internal review of Avon subsidiary, certain instances were identified where thorough due diligence processes for customers were not adequately completed.",
            "Sentiment": "negative",
            "PublishDate": 1762404283666,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Updater Services reported Q2 consolidated net profit of 199 million rupees, down from 281 million rupees in the same period last year. Revenue increased to 7.3 billion rupees compared to 6.8 billion rupees year-over-year. EBITDA declined to 316 million rupees from 438 million rupees, while EBITDA margin compressed to 4.33% from 6.44% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762395286509,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services Identifies Irregularities Worth INR 280 Million in Subsidiary Operations",
            "Summary": "Updater Services Limited has identified potential irregularities in its subsidiary Avon Solutions Logistics Private Limited involving trade receivables of INR 280 million and trade payables of INR 50 million as of September 30, 2025. The irregularities involve transactions related to sales to certain customers and services procured from certain vendors. The company has recorded a provision for doubtful recovery of INR 30 million against these trade receivables in its unaudited consolidated financial results. Management is initiating an investigation to evaluate the irregularities and determine necessary actions. The company stated it cannot evaluate the likely outcome or consequential impact on financial results pending completion of the investigation.",
            "Sentiment": "negative",
            "PublishDate": 1762298281841,
            "Source": "corporate_governance"
        },
        {
            "Title": "Updater Services Reports 7% Revenue Growth to INR 7,053 Million in Q1 FY26 Despite Global Headwinds",
            "Summary": "Updater Services Limited reported quarterly revenue of INR 7,053 million, representing 7% year-on-year growth. The company achieved EBITDA of INR 444 million with margins of 6.3% and PAT of INR 290 million, showing 13% growth. The IFM segment contributed 66% of revenue with INR 4,679 million (10% growth), while BSS segment accounted for 34% with INR 2,374 million. The company added 5 new logos in IFM and 9 in BSS, with total headcount reaching 73,000 employees (9% growth). Global uncertainties and geopolitical instability impacted discretionary spending, particularly affecting IT sector demand and background verification services. The company faced challenges including client in-sourcing at Athena, IT industry slowdowns affecting employee background verification, and cautious corporate spending in sales enablement services. Management expects 13-15% revenue growth in IFM segment and maintains confidence in 15% PAT growth for the full year despite sector-specific headwinds. The company holds INR 250 crores in cash with negative 0.2x net debt to equity ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1755005518765,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services Limited Makes Q1 FY'26 Earnings Call Audio Recording Available",
            "Summary": "Updater Services Limited has made the audio recording of their earnings call for the quarter ended June 30, 2025 available on their company website at www.uds.in. The earnings call was held on August 06, 2025, and the audio file can be accessed under the title 'Q1 & FY'26' section. The company has informed BSE Limited and National Stock Exchange of India Limited about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754493321239,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Limited Reports No Deviation in IPO Proceeds Utilization for Q1 FY2026",
            "Summary": "Updater Services Limited submitted a monitoring agency report through ICRA Limited for the quarter ended June 30, 2025, regarding the utilization of proceeds from their Initial Public Offer. The company raised INR 640 crores through its IPO in September 2023, with net proceeds of INR 377.87 crores allocated for specific purposes. The monitoring report shows no deviation from the stated objects of the issue. The company has fully utilized INR 377.76 crores across four key areas: INR 133 crores for repayment of borrowings, INR 115 crores for working capital requirements, INR 80 crores for inorganic initiatives, and INR 49.76 crores for general corporate purposes. Only INR 0.11 crores remains unutilized. ICRA Limited confirmed that the utilization is in line with the objects of the issue and all completion targets were met on schedule by March 31, 2025. The company operates in the manpower outsourcing and security services sector.",
            "Sentiment": "positive",
            "PublishDate": 1754411020672,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services CFO Radha Ramanujan Resigns; Company Reports Q1 Consolidated Profit of ₹289.88 Million",
            "Summary": "Updater Services Limited announced the resignation of Group Chief Financial Officer Mrs. Radha Ramanujan, effective September 4, 2025. The company also appointed M/s. R.G.N. Price & Co. as Internal Auditor for the period from April 1, 2025, to June 30, 2025. The Board approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹7,002.41 million and profit after tax of ₹289.88 million for the quarter. Standalone results showed revenue from operations of ₹4,160.87 million and profit after tax of ₹156.23 million. The company operates through two segments: Integrated Facility Management Services and Business Support Services. Basic earnings per share stood at ₹4.33 for consolidated results and ₹2.33 for standalone results.",
            "Sentiment": "neutral",
            "PublishDate": 1754409902511,
            "Source": "corporate_governance"
        },
        {
            "Title": "Updater Services Reports Mixed Q1 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Updater Services reported quarterly revenue of 7 billion rupees, up from 6.5 billion rupees year-over-year. The company's consolidated net profit increased to 286 million rupees from 254 million rupees in the same period last year. However, EBITDA declined to 393 million rupees from 410 million rupees year-over-year, while EBITDA margin compressed to 5.61% from 6.27% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754408381818,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services Reports Q4 Financial Results",
            "Summary": "Updater Services has announced its Q4 financial results. The company's EBITDA for Q4 was 357 million rupees, down from 402.6 million rupees in the same quarter last year. The EBITDA margin decreased to 5% from 6.37% year-over-year. However, consolidated net profit increased to 344 million rupees from 258.4 million rupees in the previous year. Revenue for Q4 grew to 7.09 billion rupees, up from 6.32 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748226238000,
            "Source": "result"
        },
        {
            "Title": "Updater Services Reports Strong Q3 Financial Results",
            "Summary": "Updater Services has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 309 million rupees, up from 208 million rupees in the same quarter last year and 281 million rupees in the previous quarter. Revenue also saw growth, reaching 6.95 billion rupees compared to 6.36 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738023411000,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services Reports Improved Q3 EBITDA and Margin",
            "Summary": "Updater Services has reported significant year-over-year improvements in its third-quarter financial performance. The company's EBITDA increased to 462 million rupees from 348 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 6.65% from 5.47% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737988653000,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services Reports Strong Q3 Financial Results",
            "Summary": "Updater Services has announced its Q3 consolidated financial results. The company's net profit increased to 309 million rupees, up from 208 million rupees year-over-year and 281 million rupees quarter-over-quarter. Revenue for Q3 rose to 6.95 billion rupees, compared to 6.36 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737988600000,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services to Consider Q3 Results",
            "Summary": "Updater Services has announced that it will be considering its third quarter (Q3) financial results on January 27. This indicates the company is preparing to review and potentially release its performance figures for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737385671000,
            "Source": "earnings"
        },
        {
            "Title": "Updater Services' Fast-Track Merger Application Rejected",
            "Summary": "Updater Services has announced that their application for a fast-track merger has been rejected by the Regional Director. This decision may impact the company's strategic plans and could potentially delay any proposed merger activities.",
            "Sentiment": "negative",
            "PublishDate": 1734912670000,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services' Fast-Track Merger Application Rejected",
            "Summary": "Updater Services has reported that their application for a fast-track merger has been rejected by the Regional Director. This decision could potentially impact the company's strategic plans and future operations.",
            "Sentiment": "negative",
            "PublishDate": 1734700846000,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Projects Strong Growth in Outsourced IFM Market",
            "Summary": "Updater Services has presented to investors that the outsourced Integrated Facility Management (IFM) market is expected to grow at a Compound Annual Growth Rate (CAGR) of approximately 17.0% during the fiscal years 2023 to 2028.",
            "Sentiment": "positive",
            "PublishDate": 1730259231000,
            "Source": "corporate_action"
        },
        {
            "Title": "Updater Services Reports Strong Q2 Financial Performance",
            "Summary": "Updater Services has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 264 million rupees to 438 million rupees. Additionally, the EBITDA margin expanded from 4.40% to 6.44%.",
            "Sentiment": "positive",
            "PublishDate": 1730207232000,
            "Source": "result"
        },
        {
            "Title": "Updater Services Reports Strong Q2 Financial Results",
            "Summary": "Updater Services has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 281 million rupees, up from 99 million rupees in the same quarter last year and 254 million rupees in the previous quarter. Revenue also saw growth, reaching 6.8 billion rupees compared to 6 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730207148000,
            "Source": "result"
        }
    ]
}