{
    "Symbol": "UEL",
    "ISIN": "INE899L01030",
    "News": [
        {
            "Title": "Ujaas Energy clarifies share price movement to exchanges",
            "Summary": "Ujaas Energy Limited responds to BSE and NSE queries on recent share price volatility, stating all disclosures made timely and movement is purely market-driven with no material information withheld.",
            "Sentiment": "neutral",
            "PublishDate": 1770466088254,
            "Source": "stocks"
        },
        {
            "Title": "Ujaas Energy Chairman & MD Shyamsunder Mundra Passes Away",
            "Summary": "Ujaas Energy Limited announces the sad demise of Chairman & Managing Director Shri Shyamsunder Mundra on February 1, 2026, who served the company since June 1999.",
            "Sentiment": "negative",
            "PublishDate": 1770034091055,
            "Source": "stocks"
        },
        {
            "Title": "Ujaas Energy Q3FY26 Results: Revenue Drops 57%",
            "Summary": "Ujaas Energy reported Q3FY26 revenue of ₹348.95 crores, down 57.28% YoY from ₹816.84 crores. Net profit declined 96.02% to ₹15.65 crores. Nine-month revenue fell 42.63% to ₹1,099.42 crores.",
            "Sentiment": "negative",
            "PublishDate": 1768913720788,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujaas Energy Board Meet on Jan 20 for Q3FY26 Results",
            "Summary": "Ujaas Energy Limited has scheduled its board meeting for January 20, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768304651291,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujaas Energy Clarifies ₹140.33 Cr Preferential Issue",
            "Summary": "Ujaas Energy provides detailed fund utilization breakdown for its ₹140.33 crore preferential allotment, allocating ₹79.25 cr for working capital, ₹25 cr for green energy facilities, and ₹35.08 cr for general purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1767161988281,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujaaas Energy Clarifies EGM Resolution on Share Allotment",
            "Summary": "Ujaaas Energy Limited announces modifications to Resolution No. 2 from its December 1, 2025 EGM, clarifying ultimate beneficial ownership details for Efficient Tie-Up Pvt. Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1765545524293,
            "Source": "stocks"
        },
        {
            "Title": "Ujaas Energy Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "Ujaas Energy Limited reported unaudited financial results for the quarter and half-year ended September 30, 2025. The company posted a net loss of Rs. 93.41 lakhs for the quarter compared to a profit of Rs. 79.25 lakhs in the corresponding previous quarter. Revenue increased to Rs. 340.91 lakhs from Rs. 330.29 lakhs year-over-year. For the half-year period, the company achieved a profit of Rs. 316.01 lakhs compared to Rs. 362.36 lakhs in the previous year. The auditors issued a qualified opinion due to accrued interest income of Rs. 6.79 lakhs on fixed deposits with Axis Bank that has not been credited by the bank. The company operates in two segments: solar power plant operations and manufacturing/sale of solar power systems. The board approved a preferential issue of 1,275.70 lakh equity shares at Rs. 11 per share and bonus share allotment of 222.65 lakh shares to public shareholders in a 2:1 ratio.",
            "Sentiment": "negative",
            "PublishDate": 1762948253508,
            "Source": "earnings"
        },
        {
            "Title": "Ujaas Energy Reports 87.5% Decline in Quarterly Net Profit Despite Revenue Growth",
            "Summary": "Ujaas Energy reported a net profit of 1 million rupees in Q2, representing an 87.5% decline from 8 million rupees in the same quarter of the previous year. However, the company's revenue increased to 48.5 million rupees from 47 million rupees year-over-year, showing a 3.2% growth in the top line.",
            "Sentiment": "negative",
            "PublishDate": 1762947220725,
            "Source": "earnings"
        },
        {
            "Title": "Swastika Fin-mart's Stake in Ujaas Energy Increases to 23.61% Through Bonus Issue",
            "Summary": "Swastika Fin-mart Private Limited's shareholding in Ujaas Energy Limited increased from 9.45% to 23.61% following a bonus share issue. The company received 2,10,00,000 additional equity shares on October 14, 2025, bringing their total holding to 3,15,00,000 shares. Director Sunil Nyati disclosed that this was a passive increase due to the bonus issue with no acquisition for consideration. Swastika Fin-mart is classified as a non-promoter shareholder of Ujaas Energy. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1762936787199,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujaas Energy Shares Hit Upper Circuit for Sixth Consecutive Day Ahead of Bonus Issue",
            "Summary": "Ujaas Energy shares hit a 5% upper circuit for the sixth consecutive trading session, reaching Rs 371 ahead of its bonus share record date. The stock has gained approximately 50% over six months, rising from Rs 247 to current levels. The company announced a 2-for-1 bonus issue with October 10 as the record date, meaning shareholders will receive two new shares for every share held. Bonus shares will be credited to demat accounts on October 13. Ujaas Energy, incorporated in 1999, operates in solar power generation and has entered the electric vehicle segment with the E-spa launch. The company has a market capitalization exceeding Rs 4,000 crore and trades at a price-to-earnings multiple of 550. The stock shows a relative strength index of 50, indicating neutral market sentiment. Year-to-date, the stock has declined over 7% but gained nearly 20% over the past 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1759985360913,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujaas Energy Shares Jump 16% in Four Sessions Ahead of 2:1 Bonus Issue",
            "Summary": "Ujaas Energy's share price surged nearly 16% over four trading sessions, hitting upper circuits consecutively on high volumes. The stock reached Rs 336.9 per share with a 5% upper circuit limit. The company announced a 2:1 bonus share issue with October 10 as the record date and bonus shares to be credited on October 13. Each bonus share will have a face value of Rs 1. Trading volume was 14 times the 30-day average. The stock declined 3.07% over 12 months but gained 5.33% year-to-date. Ujaas Energy's 52-week high stands at Rs 699 and low at Rs 217.50. The company reported a 35% decline in net profit to Rs 2.48 crore in the June quarter compared to Rs 3.81 crore in the same period last year. Total revenue also decreased to Rs 9.20 crore from Rs 10.71 crore year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1759814597086,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujaas Energy Approves Q1 Results, Dissolves Implementation Committee",
            "Summary": "Ujaas Energy Limited's Board approved unaudited standalone financial results for the quarter ended June 30, 2025. The company decided to dissolve the Implementation and Management Committee, which was established to oversee the Resolution Plan approved by NCLT in October 2023, subject to NCLT approval. The Board also extended the scope of the Management Committee. The auditor's review highlighted issues including Rs. 6.70 lakhs in accrued interest income on Fixed Deposits with Axis Bank not credited by the bank, and Rs. 735.93 lakhs in borrowings that remain outstanding in bank records despite being settled under the resolution plan.",
            "Sentiment": "neutral",
            "PublishDate": 1754997568590,
            "Source": "earnings"
        },
        {
            "Title": "Ujaas Energy Ltd: Board to Consider Bonus Share Issuance",
            "Summary": "Ujaas Energy Ltd's Board of Directors will meet on April 19, 2025, to consider issuing bonus shares to public shareholders. This move aims to comply with SEBI's Minimum Public Shareholding norms. The board will also appoint a Scrutinizer for an upcoming EGM and finalize related dates.",
            "Sentiment": "positive",
            "PublishDate": 1744958147000,
            "Source": "corporate_action"
        }
    ]
}