{
    "Symbol": "UFBL",
    "ISIN": "INE382M01027",
    "News": [
        {
            "Title": "United Foodbrands Q3FY26 Earnings Call on Jan 30",
            "Summary": "United Foodbrands Limited schedules earnings conference call for January 30, 2026 at 5:00 PM IST to discuss Q3FY26 results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769170318049,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Foodbrands Promoter Group Increases Stake by 0.83%",
            "Summary": "United Foodbrands Limited reports promoter group acquisition of 3.23 lakh shares worth 0.83% stake during November-December 2025, raising total promoter holding to 34.56%.",
            "Sentiment": "positive",
            "PublishDate": 1767012856677,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Foodbrands Acquires Thai Subsidiaries",
            "Summary": "United Foodbrands Limited announces acquisition of two Thai companies through its Dubai subsidiary, expanding operations in Southeast Asia for restaurant business growth.",
            "Sentiment": "positive",
            "PublishDate": 1765962331426,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Foodbrands Wins Tax Appeal on Goodwill Depreciation for Assessment Years 2013-19",
            "Summary": "The Income Tax Appellate Tribunal, Bengaluru Bench upheld United Foodbrands' eligibility for depreciation on goodwill for Assessment Years 2013-14 to 2018-19, overturning earlier disallowances. The company had faced disallowance of ₹11.05 crores in goodwill depreciation and is awaiting the final assessment order to determine the positive financial impact.",
            "Sentiment": "positive",
            "PublishDate": 1764756161537,
            "Source": "stock"
        },
        {
            "Title": "United Foodbrands Reports 2.6% Revenue Growth to INR 305 Crores in Q2 FY26 Despite Margin Pressures",
            "Summary": "United Foodbrands achieved 2.6% sequential revenue growth to INR 305 crores in Q2 FY26 with positive Same Store Sales Growth of 0.8% excluding Navratri impact, driven by transaction growth across dine-in and delivery segments. The company faced margin compression with gross margins declining 150 basis points to 66.2% due to value-based group offers and food festival costs, while maintaining expansion plans with 6 new restaurants added during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763387508993,
            "Source": "earnings"
        },
        {
            "Title": "United Foodbrands Grants 1.88 Lakh Employee Stock Options Under Two ESOP Plans",
            "Summary": "United Foodbrands Limited's Nomination and Remuneration Committee approved the grant of 1,88,500 Employee Stock Options to eligible employees of the company and its subsidiaries. The grant includes 1,38,500 options under ESOP Plan 2015 and 50,000 options under ESOP Plan 2022. All options are priced at Rs. 196.19 per option, based on the closing price on the National Stock Exchange on November 10, 2025. Each stock option is convertible into one equity share with a face value of Rs. 5. The options will vest 100% at the end of 3 years from the grant date, subject to fulfillment of pre-vesting conditions. Employees will have 5 years from the vesting date to exercise the options.",
            "Sentiment": "positive",
            "PublishDate": 1762849857340,
            "Source": "corporate_action"
        },
        {
            "Title": "United Foodbrands Reports Rs 225 Crore Loss in Q2, Revenue Rises to Rs 3,047 Crore",
            "Summary": "United Foodbrands Limited (formerly Barbeque-Nation Hospitality Limited) reported a net loss of Rs 225.02 crore for the quarter ended September 30, 2025, compared to a loss of Rs 72.32 crore in the same period last year. Total income increased to Rs 3,047.57 crore from Rs 3,099.72 crore year-over-year. For the six-month period, the company's loss widened to Rs 691.77 crore from Rs 414.76 crore in the previous year, while revenue declined to Rs 6,117.52 crore from Rs 6,183.35 crore. The company operates restaurants across India and overseas markets, with India contributing Rs 2,771.55 crore and overseas operations Rs 276.02 crore in quarterly revenue. United Foodbrands completed the acquisition of 51% stake in Willow Gourmet Private Limited in June 2025, making it a subsidiary. The company also received approval for a scheme of amalgamation between two of its subsidiaries, Red Apple Kitchen Consultancy and Blue Planet Foods, subject to regulatory approvals.",
            "Sentiment": "negative",
            "PublishDate": 1762849312396,
            "Source": "earnings"
        },
        {
            "Title": "United Foodbrands Reports Wider Q2 Net Loss and Lower EBITDA",
            "Summary": "United Foodbrands (Barbeque-Nation Hospitality) reported Q2 EBITDA of 458.16 million rupees, down from 498.6 million rupees in the same period last year. The company's EBITDA margin declined to 15% from 16.3% year-over-year. The consolidated net loss widened significantly to 222 million rupees compared to a loss of 72 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762848272934,
            "Source": "earnings"
        },
        {
            "Title": "United Foodbrands Gets Credit Rating Reaffirmed by ICRA with Outlook Revised to Negative",
            "Summary": "ICRA Limited has reaffirmed United Foodbrands Limited's credit ratings while revising the outlook to negative from stable. The company's long-term fund-based term loan facility was rated [ICRA] A (Negative) for an enhanced amount of Rs. 70.50 crore, up from the previous Rs. 45.50 crore. Short-term fund-based facilities of Rs. 15.00 crore and non-fund-based letter of credit facilities of Rs. 10.00 crore both received [ICRA] A2+ ratings, which were reaffirmed. The total rated amount increased to Rs. 95.50 crore from Rs. 70.50 crore. United Foodbrands was formerly known as Barbeque-Nation Hospitality Limited.",
            "Sentiment": "negative",
            "PublishDate": 1761652579384,
            "Source": "stock"
        },
        {
            "Title": "Barbeque-Nation Reports Mixed FY2025 Results with Revenue Decline but Improved Margins",
            "Summary": "Barbeque-Nation Hospitality Limited reported consolidated revenue of ₹12,330 million in FY2025, marking a 1.7% year-on-year decline due to negative same-store sales growth of -3.8% and slower store expansion. Despite the revenue drop, the company improved its gross margin to 68.2% (up 160 basis points) and restaurant operating margin to 13.9% (up 30 basis points). The company operates 230 restaurants across 86 cities in 5 countries, adding 13 new outlets during the year. While the core Barbeque Nation India segment saw -4.4% same-store sales growth, the Premium CDR segment (Toscano, Salt) achieved strong 30% revenue growth driven by network expansion. The international business grew 8% with positive same-store sales growth of 0.8%. The company targets reaching 300-325 restaurants by FY2027 and has been ranked 14th in India's Best Companies to Work For, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756990263332,
            "Source": "stock"
        },
        {
            "Title": "Barbeque-Nation Reports 2.8% Revenue Decline with Persistent Same-Store Sales Challenges",
            "Summary": "Barbeque-Nation Hospitality Limited reported consolidated revenues of Rs. 297 crores for Q1 FY2026, down 2.8% year-on-year, primarily due to negative same-store sales growth (SSSG) of 3.4%. The company opened seven new restaurants during the quarter and operates 236 restaurants across three segments. Barbeque Nation India, the core business, faced significant headwinds with revenues declining 7% to Rs. 229 crores and SSSG falling 5.2%. The India business is experiencing challenges from softer dine-out cycles, particularly in South India where 50 restaurants are affected by competitive pricing pressure and reduced corporate demand. International operations showed resilience with 10% revenue growth to Rs. 26.3 crores and strong SSSG of 8.5%, while Premium CDR segment grew 19% to Rs. 43.1 crores. Gross margins compressed to 67.7% from previous levels, and restaurant operating margins for the India business declined due to operational deleverage. The company maintains its expansion target of 300-325 restaurants by FY27 and has increased marketing spend by 1% of sales to drive volume recovery.",
            "Sentiment": "negative",
            "PublishDate": 1754576330173,
            "Source": "earnings"
        },
        {
            "Title": "Barbeque-Nation Hospitality Appoints Tarun Khanna as Independent Director for Five-Year Term",
            "Summary": "Barbeque-Nation Hospitality Limited has appointed Tarun Khanna as an Independent Director for a five-year term from May 22, 2025 to May 21, 2030. The appointment was approved by shareholders through postal ballot via remote e-voting on July 31, 2025, following recommendations from the Nomination and Remuneration Committee and Board of Directors. Khanna is a Partner in CX Advisors LLP, an advisory firm to CX Partners, a growth/buyout oriented India focused PE fund. He has extensive experience in investment banking, having previously worked at Yes Bank and Citigroup, and currently serves on boards of several portfolio companies including Sapphire Foods, Mrs. Bectors Foods, and Thyrocare Technologies. He holds an MBA from University of Baltimore and a B.S. in Engineering from University of Maryland.",
            "Sentiment": "positive",
            "PublishDate": 1754062635514,
            "Source": "corporate_governance"
        },
        {
            "Title": "Barbeque-Nation Re-appoints Rahul Agrawal as CEO for Five-Year Term",
            "Summary": "Barbeque-Nation Hospitality Limited's Board of Directors approved the re-appointment of Rahul Agrawal as Chief Executive Officer and Whole-Time Director for five years, from December 31, 2025 to December 30, 2030. The decision was made based on the Nomination and Remuneration Committee's recommendation and is subject to shareholder approval. Agrawal has been with the company since July 2017 and has led its expansion from approximately 80 restaurants in 2017 to over 230 restaurants currently. During his tenure, he oversaw international expansion, acquisitions including Italian restaurant chain Toscano and Salt restaurant chain, launch of delivery brands UBQ and Barbeque-in-a-Box, and biryani brand Dum Safar. He also led various funding rounds including private equity investments, strategic investment from Jubilant FoodWorks, and the company's IPO and listing in 2021. Agrawal brings over 20 years of experience across private equity and consumer industry, holding degrees from SRCC Delhi and IIM Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1753971593294,
            "Source": "corporate_governance"
        },
        {
            "Title": "Barbeque-Nation Targets 325 Restaurants by FY27 Amid Recovery Focus",
            "Summary": "Barbeque-Nation has set a target to operate 325 restaurants by FY27 as part of its recovery strategy. The company is focusing on increased dine-in operations, brand growth, and international expansion. However, the restaurant chain is experiencing short-term margin pressure and a decline in same-store sales in India.",
            "Sentiment": "neutral",
            "PublishDate": 1753971168963,
            "Source": "stock"
        },
        {
            "Title": "Barbeque-Nation Hospitality Appoints Vipul Goel as Chief Operating Officer",
            "Summary": "Barbeque-Nation Hospitality Limited appointed Vipul Goel as Chief Operating Officer and categorized him as Senior Management Personnel. The Board of Directors approved the appointment on July 31, 2025. Goel brings over 15 years of experience across E-commerce, Retail, FMCG, and Consumer Durables. He previously led private brands at Amazon India across Health & Personal Care, Grocery, and Toys categories, scaling brands like Presto! and Jam & Honey! to top positions. Prior to Amazon, he held leadership roles at Orkla (MTR Foods) focusing on innovation, market expansion, and brand growth. He holds an MBA in Marketing from Symbiosis Institute of Business Management, Pune and a Bachelor of Engineering from Thapar University. His expertise includes P&L management, brand strategy, trade marketing, cross-functional team leadership, and operational excellence. The appointment is not for a fixed term and he serves as a full-time employee.",
            "Sentiment": "positive",
            "PublishDate": 1753967712010,
            "Source": "corporate_governance"
        },
        {
            "Title": "Barbeque-Nation Reports Q1 FY26 Results, Announces Name Change to United Foodbrands Limited",
            "Summary": "Barbeque-Nation Hospitality Limited reported quarterly results for the period ended June 30, 2025, with revenue from operations declining 2.8% year-on-year to ₹2,970 million. The company posted a loss after tax of ₹167 million compared to ₹43 million loss in the previous year. The Board approved changing the company name to United Foodbrands Limited, subject to shareholder and regulatory approvals. The restaurant network expanded to 236 outlets with 7 new additions during the quarter. Same-store sales growth remained negative at -3.4%, though showing gradual stabilization from previous quarters. Operating EBITDA margin stood at 15.5% versus 16.6% in the prior year. The company reappointed Rahul Agrawal as CEO for five years and appointed new executives including Vipul Goel as COO. Barbeque Nation India segment saw revenue decline 7% year-on-year, while international operations grew 10% and Premium CDR segment achieved 19% growth.",
            "Sentiment": "negative",
            "PublishDate": 1753963574694,
            "Source": "corporate_action"
        },
        {
            "Title": "Barbeque-Nation Hospitality Reports Decline in Q1 Financial Performance",
            "Summary": "Barbeque-Nation Hospitality reported quarterly results showing a decline across key financial metrics. The company's EBITDA fell to 480 million rupees compared to 536 million rupees in the same period last year. EBITDA margin decreased to 16.16% from 17.53% year-over-year. Revenue dropped to 2.9 billion rupees from 3.06 billion rupees in the previous year. The company's consolidated net loss widened significantly to 164 million rupees compared to a loss of 49 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1753962979360,
            "Source": "earnings"
        },
        {
            "Title": "Sayaji Housekeeping Services Releases 5.41 Lakh Pledged Shares of Barbeque-Nation Hospitality",
            "Summary": "Sayaji Housekeeping Services Limited, a promoter of Barbeque-Nation Hospitality Limited, released 5,41,516 equity shares (1.39% of total equity) that were pledged to Axis Bank Limited. The shares were released on July 16, 2025, reducing the promoter's encumbered shareholding from previously pledged shares. The pledged shares were used as security for availing loan facility of the holding company, Sayaji Hotels Limited. Following this release, the promoter's total holding in Barbeque-Nation Hospitality remains at 1,16,02,828 shares (29.69% of total share capital).",
            "Sentiment": "positive",
            "PublishDate": 1753263496092,
            "Source": "corporate_action"
        },
        {
            "Title": "Barbeque-Nation Acquires 51% Stake in Willow Gourmet",
            "Summary": "Barbeque-Nation has completed the acquisition of a 51% stake in Willow Gourmet Private Limited. This represents a full acquisition of the targeted ownership percentage.",
            "Sentiment": "positive",
            "PublishDate": 1751301069000,
            "Source": "default"
        },
        {
            "Title": "Barbeque Nation Hospitality Ltd: Q4 Net Loss Widens, Stock Drops 6%",
            "Summary": "Barbeque Nation's Q4 net loss increased to ₹20 crore from ₹1 crore last year. Revenue declined 2% to ₹293 crore. EBITDA remained nearly unchanged at ₹54 crore with an 18.4% margin. The stock fell 6% following the results announcement, trading at ₹311.3, down 40% from its IPO price.",
            "Sentiment": "negative",
            "PublishDate": 1747905852000,
            "Source": "earnings"
        },
        {
            "Title": "Barbeque Nation Hospitality Reports Q4 EBITDA and Margin",
            "Summary": "Barbeque Nation Hospitality reported its Q4 EBITDA at 567 million rupees, compared to 624 million rupees in the same quarter last year. The company's Q4 EBITDA margin improved to 19.37% from 18.36% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747904955000,
            "Source": "result"
        },
        {
            "Title": "Barbeque-Nation Hospitality Reports Q4 Financial Results",
            "Summary": "Barbeque-Nation Hospitality has reported its Q4 financial results. The company's revenue decreased to 2.3 billion rupees from 2.98 billion rupees in the same quarter last year. The consolidated net loss for Q4 increased to 202 million rupees, compared to a loss of 10.74 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747904840000,
            "Source": "result"
        },
        {
            "Title": "Barbeque-Nation to Acquire Remaining Stake in Willow Gourmet",
            "Summary": "Barbeque-Nation Hospitality has announced plans to acquire the remaining 8.64% stake in Willow Gourmet by June 30. This move suggests the company is consolidating its ownership in the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1746023117000,
            "Source": "default"
        },
        {
            "Title": "Barbeque Nation: Acquires 42.4% Stake in Willow Gourmet",
            "Summary": "Barbeque-Nation Hospitality has acquired a 42.36% stake in Willow Gourmet Pvt Ltd, with plans to increase ownership to 51%. This acquisition aims to strengthen Barbeque-Nation's presence in the premium dining segment.",
            "Sentiment": "positive",
            "PublishDate": 1741771142000,
            "Source": "corporate_action"
        },
        {
            "Title": "Barbeque-Nation Hospitality Expands to Saudi Arabia",
            "Summary": "Barbeque-Nation Hospitality has announced that its subsidiary has subscribed to the constitution of Barbeque Nation Saudi Arabia. This move suggests the company is expanding its operations into the Saudi Arabian market, potentially opening new restaurant locations in the country.",
            "Sentiment": "positive",
            "PublishDate": 1738742512000,
            "Source": "corporate_action"
        },
        {
            "Title": "Barbeque-Nation to Acquire Up to 51% Stake in Willow Gourmet",
            "Summary": "Barbeque-Nation has announced plans to acquire up to 51% ownership in Willow Gourmet. The cost of this acquisition is reported to be 170 million rupees. This move suggests Barbeque-Nation is expanding its portfolio in the food and beverage industry.",
            "Sentiment": "positive",
            "PublishDate": 1738592946000,
            "Source": "corporate_action"
        },
        {
            "Title": "Barbeque-Nation Hospitality Reports Q3 Revenue",
            "Summary": "Barbeque-Nation Hospitality has reported its third-quarter revenue at 3.28 billion rupees, compared to 3.3 billion rupees in the same period last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1738569423000,
            "Source": "earnings"
        },
        {
            "Title": "Barbeque-Nation Hospitality Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Barbeque-Nation Hospitality experienced a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 615 million rupees from 679 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 18.70% from 20.52% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738569355000,
            "Source": "earnings"
        },
        {
            "Title": "Barbeque-Nation Hospitality Reports Slight Increase in Q3 Net Profit",
            "Summary": "Barbeque-Nation Hospitality has reported a consolidated net profit of 45 million rupees for the third quarter, showing a marginal increase from 43 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738569258000,
            "Source": "earnings"
        },
        {
            "Title": "Barbeque-Nation Hospitality to Consider Q3 Results",
            "Summary": "Barbeque-Nation Hospitality has announced that it will consider its third quarter (Q3) financial results on February 3. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737722498000,
            "Source": "earnings"
        },
        {
            "Title": "Barbeque-Nation Hospitality's Mauritius Subsidiary Removed from Register",
            "Summary": "Barbeque-Nation Hospitality has announced that the application of its Mauritius subsidiary, Barbeque-Mauritius, has been approved by the Registrar of Companies in Mauritius. As a result, Barbeque Nation Holdings Pvt has been removed from the register, according to a letter from the Registrar of Companies.",
            "Sentiment": "neutral",
            "PublishDate": 1733357033000,
            "Source": "corporate_action"
        },
        {
            "Title": "Barbeque Nation Holdings Removed from Mauritius Company Register",
            "Summary": "Barbeque-Mauritius' application has been approved by the Registrar of Companies in Mauritius. According to a letter from the Registrar, Barbeque Nation Holdings Pvt Ltd has been removed from the register of companies in Mauritius.",
            "Sentiment": "neutral",
            "PublishDate": 1733318796000,
            "Source": "corporate_action"
        },
        {
            "Title": "Barbeque-Nation Hospitality Invests in Sri Lankan Subsidiary",
            "Summary": "A subsidiary of Barbeque-Nation Hospitality has made an additional equity investment of 24,531,900 Sri Lankan Rupees in Barbeque Nation Lanka, its Sri Lankan unit.",
            "Sentiment": "neutral",
            "PublishDate": 1732104203000,
            "Source": "corporate_action"
        }
    ]
}