{
    "Symbol": "UFLEX",
    "ISIN": "INE516A01017",
    "News": [
        {
            "Title": "UFLEX Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "UFLEX Limited has scheduled its board meeting for February 12, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770102683114,
            "Source": "co_actions_results"
        },
        {
            "Title": "UFlex Achieves Silver Rating in EcoVadis Assessment",
            "Summary": "UFlex Limited receives Silver rating with 72/100 score in EcoVadis Sustainability Assessment for FY25, ranking in 87th percentile globally among assessed companies.",
            "Sentiment": "positive",
            "PublishDate": 1766489905155,
            "Source": "stocks"
        },
        {
            "Title": "UFLEX Limited Gets Credit Ratings Reaffirmed by CRISIL at AA-/Stable",
            "Summary": "CRISIL Ratings has reaffirmed UFLEX Limited's credit ratings at CRISIL AA-/Stable/CRISIL A1+ across various facilities totaling Rs. 4,000 crore including long-term loans and fund-based bank limits. The reaffirmation maintains the company's strong credit profile and indicates stable financial standing for the packaging solutions provider.",
            "Sentiment": "positive",
            "PublishDate": 1764316401455,
            "Source": "stock"
        },
        {
            "Title": "UFlex Reports Flat Q2 Performance, Revises FY26 Revenue Growth Guidance to 5%",
            "Summary": "UFlex Limited reported flat quarterly results with 3% H1 sales growth and 4% EBITDA increase, while revising full-year revenue growth guidance from 10% to 5% due to headwinds including tariffs, GST transition, and extended monsoons. The packaging company expects EBITDA of Rs. 1,800-1,850 crores for FY26 and commissioned extended aseptic packaging capacity to 12 billion packs annually, with three major projects including PET recycling and facilities in Egypt and Mexico expected to be operational by Q1 FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1763653395527,
            "Source": "earnings"
        },
        {
            "Title": "Uflex Plans ₹1,200 Cr Global Expansion with Focus on Sustainable Packaging Solutions",
            "Summary": "Uflex is launching recyclable and biodegradable film lines with ₹1,200 crore capital expenditure across Egypt, Poland, and India, focusing on specialty films for food and pharma segments. The company targets 10-12% revenue CAGR through margin expansion from high-value products and improved ESG profile.",
            "Sentiment": "positive",
            "PublishDate": 1763137037292,
            "Source": "stock"
        },
        {
            "Title": "Uflex Limited Reports Mixed Quarterly Results and Approves Rs 715 Crore Capacity Expansion",
            "Summary": "Uflex Limited's consolidated net profit declined to Rs 2,891 lacs in Q2 FY26 from Rs 6,482 lacs loss in Q2 FY25, while standalone profit dropped to Rs 2,231 lacs from Rs 3,774 lacs. The company's board approved setting up a new 54,000 MT packaging films manufacturing line at Dharwad, Karnataka requiring Rs 715.41 crores investment, expected to be completed during FY2027-28.",
            "Sentiment": "neutral",
            "PublishDate": 1763049657717,
            "Source": "earnings"
        },
        {
            "Title": "UFlex Limited Schedules Q2 and H1 FY26 Earnings Conference Call",
            "Summary": "UFlex Limited has announced an earnings conference call for its Q2 and H1 FY26 results scheduled for Friday, November 14, 2025, at 4:00 PM IST. The call will be represented by Mr. Rajesh Bhatia, Group President (Finance Accounts) and CFO, and Mr. Surajit Pal, Vice President-Head of Investor Relations. Multiple dial-in numbers have been provided for different regions including India, Hong Kong, Singapore, USA, and UK. The company has advised participants to dial-in 5-10 minutes prior to ensure timely connection. Arihant Capital Markets Ltd. is coordinating the conference call arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1762796584073,
            "Source": "earnings"
        },
        {
            "Title": "Uflex Expands Gujarat Aseptic Packaging Capacity by 71% to 12 Billion Packs Annually",
            "Summary": "Uflex has completed the expansion of its aseptic packaging facility in Gujarat, increasing production capacity from 7 billion packs per annum to 12 billion packs per annum. The capacity enhancement represents a significant operational expansion for the company's packaging operations.",
            "Sentiment": "positive",
            "PublishDate": 1759709579297,
            "Source": "stock"
        },
        {
            "Title": "UFLEX Expands Aseptic Packaging Capacity by 71% in Gujarat Facility",
            "Summary": "UFLEX has increased its aseptic packaging capacity from 7 billion to 12 billion packs annually at its Gujarat facility. This expansion represents a significant boost in the company's production capabilities for aseptic packaging solutions.",
            "Sentiment": "positive",
            "PublishDate": 1759498749654,
            "Source": "stock"
        },
        {
            "Title": "UFlex Limited Reports 6.5% Revenue Growth to Rs 3,922 Crores with Strong Volume Expansion",
            "Summary": "UFlex Limited, a flexible packaging company, reported revenue growth of 6.5% year-over-year to Rs 3,922 crores with volume growth of 7.9%. The company's EBITDA margin was 12% compared to 12.7% in the previous year quarter. The packaging segment showed strong performance with 11.7% volume growth, while packaging films grew 6.8%. Aseptic packaging volumes increased 18% and flexible packaging volumes rose 7.4%. The company benefited from industry dynamics following a competitor's plant accident in May, which reduced local availability of BOPET and BOPP films and led to better margins. UFlex is expanding capacity with Rs 2,000 crores in planned investments, including increasing aseptic packaging capacity from 7 to 12 billion packs and setting up a new plant in Egypt. The company provided revenue growth guidance of 10% and EBITDA guidance of Rs 2,100 crores. However, the company faces challenges from US tariffs on Indian products and increased imports from Southeast Asia and China affecting domestic prices.",
            "Sentiment": "positive",
            "PublishDate": 1755876121676,
            "Source": "earnings"
        },
        {
            "Title": "UFLEX Reports Strong Q1 Turnaround with 618.9M Rupees Net Profit After Previous Year Loss",
            "Summary": "UFLEX reported a consolidated net profit of 618.9 million rupees in Q1, marking a significant turnaround from a loss of 953.6 million rupees in the same period last year. The company's revenue grew to 39 billion rupees from 36.5 billion rupees year-over-year. EBITDA increased to 4.57 billion rupees compared to 4.11 billion rupees previously, with EBITDA margin improving to 11.73% from 11.26%. The company recorded an exceptional item of 1.8 billion rupees during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755101330004,
            "Source": "earnings"
        },
        {
            "Title": "Uflex Forms Joint Venture with AMPIN C&I Power for Solar Energy Project in Haryana",
            "Summary": "Uflex Limited has formed a joint venture with AMPIN C&I Power Private Limited, incorporating AMPIN C&I Power Twenty Private Limited on August 1, 2025. Uflex holds a 26% stake while AMPIN C&I Power holds 74% in the venture. The joint venture will establish a solar power plant in Haryana, with Uflex purchasing the generated solar power on a long-term basis under the captive power plant policy. The newly incorporated company has an authorized share capital of Rs. 15 lakh and subscribed share capital of Rs. 1 lakh. Uflex's contribution to the initial share capital will be made at face value of Rs. 10 per share through cash subscription. The 26% shareholding requirement allows Uflex to qualify as a captive user under the policy.",
            "Sentiment": "positive",
            "PublishDate": 1754108197001,
            "Source": "order&deals"
        },
        {
            "Title": "UFLEX Subsidiary Launches New CPP Films Production Line in Mexico",
            "Summary": "UFLEX, a packaging company, has announced that its subsidiary has started operations of a new Cast Polypropylene (CPP) films production line in Mexico. This expansion indicates growth in the company's manufacturing capabilities and potential market reach in North America.",
            "Sentiment": "positive",
            "PublishDate": 1743074736000,
            "Source": "corporate_action"
        },
        {
            "Title": "UFlex Ltd: Rs 317 Crore Investment in New Noida Recycling Plants",
            "Summary": "UFlex Ltd. is investing Rs 317 crore to establish two new recycling plants in Noida with a combined annual capacity to process 39,600 metric tons of plastic waste. The facilities will boost production of rPET and rPE materials for food packaging. UFlex recently received USFDA approval for using recycled polyethylene in food packaging and is seeking certification for polypropylene recycling.",
            "Sentiment": "positive",
            "PublishDate": 1741764191000,
            "Source": "corporate_action"
        },
        {
            "Title": "UFlex Ltd: Rs 750 Crore Investment in Mexico and Noida Recycling Units",
            "Summary": "UFlex Ltd is investing over Rs 750 crore to establish a woven polypropylene bags plant in Mexico and a recycling facility in Noida, both set to be operational in 2025-26. The Mexico plant, costing $50 million, will produce 80 million bags annually for the North and South American pet food market. The Noida recycling plant, with a Rs 317 crore investment, will process 39,600 MTPA of plastic waste, supporting India's extended producer responsibility legislation.",
            "Sentiment": "positive",
            "PublishDate": 1739794415000,
            "Source": "corporate_action"
        },
        {
            "Title": "UFLEX Reports Strong Q3 Financial Performance",
            "Summary": "UFLEX, a packaging company, has reported significant year-over-year improvements in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 4.5 billion rupees from 3.25 billion rupees in the same quarter last year. Additionally, UFLEX's EBITDA margin expanded to 12.07% from 9.85% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739545497000,
            "Source": "earnings"
        },
        {
            "Title": "UFLEX Reports Q3 Profit After Previous Losses",
            "Summary": "UFLEX has reported a consolidated net profit of 1.37 billion rupees in Q3, marking a significant turnaround from a loss of 672.7 million rupees in the same quarter last year. However, this follows a loss of 646 million rupees in the previous quarter. The company's revenue for Q3 increased to 36.8 billion rupees, up from 33.09 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739545432000,
            "Source": "earnings"
        },
        {
            "Title": "UFLEX to Consider Q3 Results on February 14",
            "Summary": "UFLEX, a company in the packaging industry, has announced that it will consider its third quarter (Q3) financial results on February 14. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738673113000,
            "Source": "earnings"
        },
        {
            "Title": "UFLEX Announces Expansion Plans for Asepto Packaging Division",
            "Summary": "UFLEX has announced expansion plans for its Asepto packaging division. The company expects its Sanand facility to reach a production capacity of 12 billion packs by FY25. Additionally, a new greenfield plant in Egypt will add another 12 billion packs, bringing Asepto's total capacity to 24 billion packs by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1734430315000,
            "Source": "corporate_action"
        },
        {
            "Title": "UFLEX Reports Q2 FY25 Financial Results",
            "Summary": "UFLEX, a company in the packaging industry, has reported its financial results for the second quarter of fiscal year 2025. The company recorded an exceptional item of 926 million rupees in this quarter. The profit before tax (PBT) for Q2 FY25 stands at 616 million rupees, which is lower compared to 1.09 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1731510172000,
            "Source": "result"
        },
        {
            "Title": "UFLEX Reports Q2 FY2024 Financial Results",
            "Summary": "UFLEX, a packaging company, has released its Q2 financial results. The company reported an EBITDA of 3.9 billion rupees, slightly up from 3.82 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 10.07% from 11.34% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731510108000,
            "Source": "result"
        },
        {
            "Title": "UFLEX Reports Q2 Financial Results",
            "Summary": "UFLEX, a company in the packaging industry, has reported its Q2 financial results. The company experienced a consolidated net loss of 646 million rupees, slightly higher than the 633 million rupees loss in the same quarter last year. Compared to the previous quarter, the loss has decreased from 984 million rupees. However, the company's revenue has shown growth, increasing to 38.3 billion rupees from 33.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731510036000,
            "Source": "result"
        },
        {
            "Title": "UFlex's Egyptian Subsidiary to Invest $126M in New Packaging Unit",
            "Summary": "<p><span class=\"positive\">UFlex Limited's</span> Egyptian subsidiary, <span class=\"neutral\">Flex Asepto</span>, is planning to establish a <b>new packaging unit</b> with an investment of <span class=\"positive\">$126 million</span>. This <span class=\"positive\">expansion</span> indicates <span class=\"positive\">growth</span> and <span class=\"positive\">increased production capacity</span> for the company's operations in Egypt.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727991851000,
            "Source": "corporate_action"
        }
    ]
}