{
    "Symbol": "UFO",
    "ISIN": "INE527H01019",
    "News": [
        {
            "Title": "UFO Moviez Q3FY26 Results: Revenue Declines to ₹1,319 mn",
            "Summary": "UFO Moviez reported Q3FY26 consolidated revenues of ₹1,319 mn versus ₹1,387 mn in Q3FY25. Advertisement revenue dropped to ₹323 mn from ₹460 mn, while PAT fell to ₹64 mn from ₹153 mn year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1769694147511,
            "Source": "co_actions_results"
        },
        {
            "Title": "UFO Moviez Board Approves Promoter Reclassification",
            "Summary": "UFO Moviez India Limited board approves reclassification request from Apollo Green Energy Limited and Mr. Raaja Kanwar from promoter category to public category, subject to regulatory and shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769688493283,
            "Source": "stocks"
        },
        {
            "Title": "UFO Moviez schedules Q3FY26 results call on Jan 30",
            "Summary": "UFO Moviez India Limited has scheduled a conference call for January 30, 2026, at 12:00 PM IST to discuss its Q3FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769152789557,
            "Source": "co_actions_results"
        },
        {
            "Title": "UFO Moviez Subsidiary Partners with Chinese LED Technology Company for Middle East and India Expansion",
            "Summary": "Scrabble Entertainment DMCC, a wholly owned subsidiary of UFO Moviez India Limited, has entered into a strategic tie-up with Shenzhen Timewaying Technology Co. Ltd. to exclusively promote and distribute HeyLED DCI-certified direct view LED cinema screens. The partnership targets accelerating premium LED cinema screen adoption across the Middle East, India and other SAARC countries, combining Timewaying's advanced HDR-capable LED technology with Scrabble's industry relationships and operational capabilities in the exhibition sector.",
            "Sentiment": "positive",
            "PublishDate": 1765247800558,
            "Source": "order&deals"
        },
        {
            "Title": "UFO Moviez Partners with Miraj Cinemas for Exclusive Advertising Rights",
            "Summary": "UFO Moviez has entered into a strategic alliance with Miraj Cinemas to secure exclusive advertising rights across 239 screens spanning 49 cities and 72 locations. This partnership expands UFO Moviez's advertising network reach and strengthens its position in the cinema advertising market.",
            "Sentiment": "positive",
            "PublishDate": 1763597058399,
            "Source": "stock"
        },
        {
            "Title": "UFO Moviez Reports Strong Q2 FY26 Performance with Revenue Growth and Return to Profitability",
            "Summary": "UFO Moviez India Limited reported consolidated revenue of ₹1,113 million for Q2 FY26, compared to ₹968 million in Q2 FY25. EBITDA increased to ₹218 million from ₹102 million year-over-year. The company achieved net profit of ₹75 million versus a net loss of ₹9 million in the same quarter last year. For H1 FY26, consolidated revenue reached ₹2,203 million with EBITDA of ₹411 million and net profit of ₹141 million. The company's advertising network spans 3,795 screens including 2,279 multiplex screens and 1,516 single screens across 1,300 cities. Management highlighted robust growth in advertisement and theatrical revenues, supported by solid product sales. The quarter saw release of 462 movies across various languages and genres. Cash position stood at ₹1,348 million with net cash of ₹606 million after considering outstanding debt. Management expressed confidence about continuing momentum with upcoming high-profile releases in Q3.",
            "Sentiment": "positive",
            "PublishDate": 1762940551856,
            "Source": "earnings"
        },
        {
            "Title": "UFO Moviez Reports Strong Q2 Performance with 113% EBITDA Growth",
            "Summary": "UFO Moviez, India's largest in-cinema advertising platform, reported consolidated revenue growth of 15% to ₹1,113 million in Q2 FY26 compared to ₹968 million in Q2 FY25. Advertisement revenue increased by 37% to ₹335 million from ₹245 million. EBITDA grew significantly by 113% from ₹102 million to ₹218 million. The company turned profitable with Profit Before Tax of ₹106 million versus a loss of ₹6 million in the previous year, marking 1,784% growth. Profit After Tax reached ₹75 million against a loss of ₹9 million, showing 963% improvement. For the half-year period, consolidated revenues grew 15% to ₹2,203 million, with EBITDA increasing 145% to ₹411 million. Executive Director and Group CEO Rajesh Mishra attributed the performance to strong content mix including major Hindi releases and regional performers, which maintained healthy footfalls and improved advertising sentiment. The company operates 3,795 cinema screens across 1,346 cities with potential to impact 1.8 billion viewers annually.",
            "Sentiment": "positive",
            "PublishDate": 1762266313540,
            "Source": "earnings"
        },
        {
            "Title": "UFO Moviez Reports Strong Q1FY26 Results with 15% Revenue Growth and Return to Profitability",
            "Summary": "UFO Moviez India Limited reported consolidated revenue growth of 15% to ₹1,090 million in Q1FY26, compared to ₹945 million in the previous year. The company achieved significant profitability improvement with EBITDA growing 194% to ₹193 million and returned to net profit of ₹65 million versus a net loss of ₹42 million in Q1FY25. The advertising network now spans 3,762 screens including 2,251 multiplex screens and 1,511 single screens. Advertisement revenue drove growth with a 28% increase, while distributor service fees grew 6%. Average advertisement minutes sold increased to 4.31 from 2.35 in the previous year, with corporate clients contributing 3.3 minutes. The company maintains consolidated cash of ₹1,239 million and net cash of ₹537 million. Management expressed optimism for Q2 with several high-profile film releases planned and noted improved consumer sentiment toward cinema viewing.",
            "Sentiment": "positive",
            "PublishDate": 1754560748180,
            "Source": "earnings"
        },
        {
            "Title": "UFO Moviez Targets Profitable Growth Through 3,762-Screen Ad Platform and Rural Expansion",
            "Summary": "UFO Moviez is focusing on profitable growth through its 3,762-screen advertising platform. The company's strategy includes advanced audience targeting and rural market expansion. UFO Moviez expects to benefit from advertising recovery, digital content offerings, and local theatre integration to enhance earnings for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753971668215,
            "Source": "stock"
        },
        {
            "Title": "UFO Moviez India Reports Quarterly Results with Standalone Profit of Rs 365 Lacs",
            "Summary": "UFO Moviez India Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs 365 lacs compared to a loss of Rs 267 lacs in the same quarter last year. Consolidated net profit reached Rs 652 lacs versus a loss of Rs 414 lacs in the previous year quarter. Total standalone income from operations was Rs 8,383 lacs, up from Rs 7,889 lacs year-over-year. EBITDA improved significantly to Rs 1,518 lacs from Rs 634 lacs in the corresponding quarter. The company's earnings per share stood at Rs 0.95 for standalone and Rs 1.68 for consolidated results. The results were reviewed by statutory auditors B S R & Co. LLP who issued unmodified review reports.",
            "Sentiment": "positive",
            "PublishDate": 1753961172605,
            "Source": "earnings"
        },
        {
            "Title": "UFO Moviez India to Acquire UMW Business Undertaking",
            "Summary": "UFO Moviez India has announced plans to purchase the business undertaking of UMW for a total of 130 million rupees. This includes a lump sum payment of 120 million rupees for the business itself and an additional 10 million rupees as a non-compete fee.",
            "Sentiment": "neutral",
            "PublishDate": 1732103263000,
            "Source": "corporate_action"
        },
        {
            "Title": "UFO Moviez India Approves Business Transfer Agreement with United Mediaworks",
            "Summary": "UFO Moviez India has approved a business transfer agreement with United Mediaworks for the acquisition of their digital cinema deployment business. This move suggests a strategic expansion or consolidation in the digital cinema sector for UFO Moviez India.",
            "Sentiment": "positive",
            "PublishDate": 1732103255000,
            "Source": "corporate_action"
        }
    ]
}