{
    "Symbol": "UGARSUGAR",
    "ISIN": "INE071E01023",
    "News": [
        {
            "Title": "Ugar Sugar Works Board Meet Set for Feb 13, 2026",
            "Summary": "The Ugar Sugar Works Limited has scheduled its board meeting for February 13, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770301134936,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ugar Sugar Works Gets Promoter Reclassification Nod",
            "Summary": "The Ugar Sugar Works Limited received approval from NSE and BSE for reclassification of promoters under Regulation 31A, reducing promoter holding from 46.75% to 43.99%.",
            "Sentiment": "neutral",
            "PublishDate": 1770183933640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ugar Sugar Works Seeks Promoter Reclassification",
            "Summary": "Ugar Sugar Works Limited has applied for promoter reclassification under Listing Regulation 31A for two promoters holding a combined 2.76% stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1768807101320,
            "Source": "stocks"
        },
        {
            "Title": "Ugar Sugar Works Gets NSE Fine Waiver for Q2FY25",
            "Summary": "The Ugar Sugar Works Limited received approval from NSE for waiver of fines levied for delayed compliance with SEBI LODR Regulations 17, 18, 19, 20, and 21 for the quarter ended September 30, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1767426930088,
            "Source": "stocks"
        },
        {
            "Title": "The Ugar Sugar Works Reports Loss of Rs 45.9 Crores for Half-Year Ended September 2025",
            "Summary": "The Ugar Sugar Works Limited reported a net loss after tax of Rs 45.9 crores for the half-year ended September 30, 2025, compared to a loss of Rs 71.9 crores in the corresponding period of the previous year. The company's total income from operations increased to Rs 789.1 crores from Rs 608.2 crores year-on-year. For the quarter ended September 30, 2025, the company posted a net loss of Rs 32.2 crores versus Rs 60.0 crores loss in the same quarter last year. The company operates across multiple segments including sugar, co-generation, industrial alcohol, and potable alcohol. Earnings per share stood at negative Rs 4.08 for the half-year period. The Board of Directors approved these unaudited financial results in their meeting held on November 12, 2025. The company noted that crushing for the Sugar Season 2025-26 at the Ugar Unit commenced on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762946522867,
            "Source": "earnings"
        },
        {
            "Title": "Ugar Sugar Works Commences Crushing Operations for Season 2025-26",
            "Summary": "Ugar Sugar Works Limited has started its sugar crushing operations for the season 2025-26 at its Ugar Unit. The crushing began on November 10, 2025, and the company expects operations to reach full capacity in due course. The company has informed both the Bombay Stock Exchange and National Stock Exchange of India about this operational development.",
            "Sentiment": "positive",
            "PublishDate": 1762904930647,
            "Source": "stock"
        },
        {
            "Title": "The Ugar Sugar Works Reports Loss of Rs 1,373 Lakhs in Latest Quarter",
            "Summary": "The Ugar Sugar Works Ltd reported a net loss of Rs 1,373.29 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 1,182.81 lakhs in the same quarter of the previous year. Total income from operations stood at Rs 36,388.11 lakhs versus Rs 34,494.69 lakhs in the corresponding quarter. The company's earnings per share was negative Rs 1.22 compared to negative Rs 1.05 in the same quarter last year. The company operates in multiple segments including sugar, co-generation, industrial alcohol, and potable alcohol. The Board of Directors approved these unaudited financial results at their meeting held on August 5, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754393815631,
            "Source": "earnings"
        },
        {
            "Title": "Ugar Sugar Works Reports Significant Profit Growth in Q4",
            "Summary": "Ugar Sugar Works has reported a substantial increase in net profit for the fourth quarter. The company's net profit rose to 510 million rupees, up from 173.6 million rupees in the same quarter last year and 45 million rupees in the previous quarter. Revenue also saw growth, reaching 5.2 billion rupees compared to 4.04 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1747095809000,
            "Source": "default"
        },
        {
            "Title": "Ugar Sugar Works Reports Strong Q4 Financial Results",
            "Summary": "Ugar Sugar Works has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 576 million rupees from 236 million rupees in the previous year, with the EBITDA margin expanding to 10.98% from 5.84%. Net profit rose to 510 million rupees from 173.6 million rupees year-over-year. Revenue also grew to 5.2 billion rupees from 4.04 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747048205000,
            "Source": "result"
        },
        {
            "Title": "Ugar Sugar Works Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "Ugar Sugar Works has reported a substantial decrease in both net profit and revenue for the third quarter. The company's net profit fell to 45 million rupees from 461 million rupees in the same quarter last year. Revenue also declined, dropping to 2.75 billion rupees from 3.9 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738801320000,
            "Source": "earnings"
        },
        {
            "Title": "Ugar Sugar Works Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Ugar Sugar Works has reported a significant decrease in its Q3 EBITDA, which fell to 203 million rupees from 607 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 7.39% from 15.59% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738756231000,
            "Source": "earnings"
        },
        {
            "Title": "UGAR Sugar Works Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "UGAR Sugar Works has reported a substantial decrease in both net profit and revenue for the third quarter. The company's net profit fell to 45 million rupees from 461 million rupees in the same period last year. Revenue also declined, dropping to 2.75 billion rupees from 3.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738756225000,
            "Source": "earnings"
        },
        {
            "Title": "Ugar Sugar Works Reports Increased Q2 Net Loss",
            "Summary": "Ugar Sugar Works reported a net loss of 600 million rupees in Q2, compared to a loss of 332 million rupees in the same quarter last year. This represents an increase in losses year-over-year. The company's revenue slightly decreased to 2.63 billion rupees from 2.7 billion rupees in the previous year's Q2. Compared to the previous quarter, the loss has widened from 118 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731499957000,
            "Source": "result"
        }
    ]
}