{
    "Symbol": "UGROCAP",
    "ISIN": "INE583D01011",
    "News": [
        {
            "Title": "UGRO Capital announces strategic business realignment",
            "Summary": "UGRO Capital Limited announces strategic realignment focusing on Emerging Market secured lending and embedded merchant financing, with identified cost savings of ₹220 crore annually to improve earnings quality and capital efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770460326776,
            "Source": "stocks"
        },
        {
            "Title": "UGRO Capital Gets CareEdge B+/Stable Rating for USD 50M ECB",
            "Summary": "CareEdge Global assigns 'CareEdge B+/Stable' rating to UGRO Capital's USD 50 million External Commercial Borrowing, citing strong business profile with Rs 12,226 crore AUM and 70% secured portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1769753097317,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Submits Q3FY26 ALM Statement to RBI",
            "Summary": "UGRO Capital Limited has submitted its Asset Liability Management (ALM) statement for Q3FY26 to stock exchanges as per SEBI operational circular requirements, including detailed liquidity and interest rate sensitivity analysis.",
            "Sentiment": "neutral",
            "PublishDate": 1769176367113,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Allots 1 Lakh Shares Under ESOP Scheme",
            "Summary": "UGRO Capital Limited allotted 1,00,500 equity shares to employees under its Employee Stock Option Scheme 2017, increasing paid-up share capital to ₹155.20 crores with shares priced at ₹130 each.",
            "Sentiment": "positive",
            "PublishDate": 1768573294545,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Board Approves Subsidiary Merger Scheme",
            "Summary": "UGRO Capital's board approved amalgamation of wholly-owned subsidiary Profectus Capital, subject to regulatory approvals. The merger aims to create stronger entity with higher secured assets proportion.",
            "Sentiment": "positive",
            "PublishDate": 1767935970598,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Board Approves Subsidiary Merger Scheme",
            "Summary": "UGRO Capital's board approved amalgamation of wholly-owned subsidiary Profectus Capital Private Limited and increased commercial paper borrowing limit from ₹500 crore to ₹800 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767883223672,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Board Approves Merger with Subsidiary PCPL",
            "Summary": "UGRO Capital Limited's board approved amalgamation scheme with wholly owned subsidiary Profectus Capital Private Limited on January 8, 2026, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1767882113859,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Approves Merger With Profectus Capital",
            "Summary": "UGRO Capital has received approval for its merger with Profectus Capital, marking a significant corporate restructuring move for the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1767881528732,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Board to Review Key Corporate Actions",
            "Summary": "UGRO Capital scheduled board meeting on January 8 to discuss amalgamation of Profectus Capital subsidiary and raising commercial paper issuance limits for strategic growth initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1767622912678,
            "Source": "stocks"
        },
        {
            "Title": "UGRO Capital Gets Credit Rating Affirmation from Agencies",
            "Summary": "India Ratings affirmed UGRO Capital's ratings at IND A-/Positive outlook, removing Rating Watch status. CRISIL also reaffirmed ratings at CRISIL A/Stable following completion of Profectus Capital acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1766057095537,
            "Source": "stocks"
        },
        {
            "Title": "UGRO Capital Committee Approves ₹200 Cr NCD Issue",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved issuance of ₹200 crores NCDs with oversubscription option up to ₹500 crores through private placement in multiple series.",
            "Sentiment": "positive",
            "PublishDate": 1765976252467,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Allots EUR 10 Million Bonds",
            "Summary": "UGRO Capital Limited has allotted up to 1,000 EUR-denominated non-convertible bonds worth EUR 10 million through private placement, with 6% annual coupon rate and 60-month tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1765905512912,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Allots 15.89 Lakh Equity Shares",
            "Summary": "UGRO Capital Limited allotted 15,89,170 equity shares on December 12, 2025, following conversion of Compulsory Convertible Debentures at ₹185 per share, increasing paid-up capital to ₹154.17 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765537505249,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Raises ₹50 Crores via Commercial Papers",
            "Summary": "UGRO Capital Limited allotted unlisted commercial papers worth ₹50 crores with 33-day tenure, priced at ₹4,95,964.50 per security through Yes Bank Limited as issuing and paying agent.",
            "Sentiment": "neutral",
            "PublishDate": 1765379156501,
            "Source": "co_actions_results"
        },
        {
            "Title": "UGRO Capital Allots Commercial Papers Following Board Committee Approval",
            "Summary": "UGRO Capital Limited's Investment and Borrowing Committee approved the allotment of Commercial Papers on December 09, 2025. The company has informed stock exchanges BSE and NSE about this debt instrument issuance as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765288936699,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Completes Acquisition of Profectus Capital",
            "Summary": "UGRO Capital has completed its acquisition of Profectus Capital. This transaction represents a strategic expansion move for UGRO Capital through the acquisition of another financial services entity.",
            "Sentiment": "positive",
            "PublishDate": 1765199395757,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots 7.34 Million Equity Shares Following Mandatory CCD Conversion",
            "Summary": "UGRO Capital allotted 7,342,732 equity shares at Rs. 264 per share following the mandatory conversion of Compulsorily Convertible Debentures that expired after their 18-month tenure. The company's paid-up share capital increased from Rs. 145.24 crore to Rs. 152.58 crore, while 1.76 crore warrants issued in June 2024 have lapsed due to non-conversion.",
            "Sentiment": "neutral",
            "PublishDate": 1764947110305,
            "Source": "corporate_action"
        },
        {
            "Title": "India Ratings Maintains UGRO Capital's Debt Instruments on Rating Watch with Positive Implications",
            "Summary": "India Ratings maintained UGRO Capital's bank loans (INR 68,000 million), non-convertible debentures (INR 30,014.2 million), and subordinated debt (INR 6,500 million) on Rating Watch with Positive Implications while affirming commercial paper ratings at IND A1+. The rating watch is due to UGRO's ongoing acquisition of 100% stake in Profectus Capital Private Limited, with RBI approval already granted for the proposed change in control and shareholding.",
            "Sentiment": "positive",
            "PublishDate": 1764769733849,
            "Source": "stock"
        },
        {
            "Title": "UGRO Capital Approves INR 150 Crore Non-Convertible Debenture Issuance",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved the issuance of up to 75,000 Non-Convertible Debentures worth INR 75 crores with a green shoe option for an additional INR 75 crores, totaling INR 150 crores. The debentures are secured by loan receivables with 110% security cover and scheduled for allotment on December 10, 2025, offering monthly interest payments to investors.",
            "Sentiment": "positive",
            "PublishDate": 1764576895013,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots 2.25 Million Equity Shares Through CCD Conversion",
            "Summary": "UGRO Capital's Securities Allotment Transfer Committee approved the allotment of 2,251,325 equity shares at Rs. 185 per share following conversion notices from holders of Compulsory Convertible Debentures. The company's paid-up equity share capital increased from Rs. 142.99 crore to Rs. 145.24 crore, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764340679564,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots ₹150 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved the allotment of 1,50,000 non-convertible debentures worth ₹150 crore with a face value of ₹10,000 each on November 27, 2025. The secured debentures carry a 9.50% annual interest rate with monthly coupon payments and will mature on February 27, 2027, to be listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764234054027,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Schedules Board Meeting to Consider NCD Issuance",
            "Summary": "UGRO Capital has planned a board meeting on December 1st to discuss the issuance of non-convertible debentures. The proposed debt instrument issuance will be evaluated by the company's board for potential fundraising through the debt market.",
            "Sentiment": "neutral",
            "PublishDate": 1764161948329,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots 17.8 Lakh Equity Shares Through CCD Conversion",
            "Summary": "UGRO Capital allotted 17,80,302 equity shares at Rs. 264 per share following conversion of Compulsory Convertible Debentures by holders. The company's paid-up share capital increased from Rs. 141.21 crore to Rs. 142.99 crore, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764076058024,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots Rs. 110 Crore Commercial Papers with 18-Day Tenure",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved the allotment of unlisted commercial papers worth Rs. 110 crores on November 20, 2025. The short-term securities carry an 18-day tenure with redemption scheduled for December 8, 2025, and Yes Bank Limited serves as the issuing and paying agent.",
            "Sentiment": "neutral",
            "PublishDate": 1763645277878,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Approves INR 200 Crore Non-Convertible Debenture Issue",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved issuance of up to 1,00,000 Non-Convertible Debentures worth INR 100 crore with green shoe option of additional INR 100 crore on private placement basis. The debentures are secured by first ranking charge on loan receivables with allotment scheduled for November 27, 2025, and monthly interest payments.",
            "Sentiment": "positive",
            "PublishDate": 1763531333172,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots INR 50 Crore Non-Convertible Debentures to Boost Tier II Capital",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved allotment of 5,000 unsecured, rated, subordinated non-convertible debentures worth INR 50 crores with 11.65% annual coupon rate and maturity date of May 17, 2031. The Non-Banking Financial Company raised this subordinated debt as Tier II capital to enhance its capital adequacy under RBI's Scale Based Regulation Directions, 2023.",
            "Sentiment": "positive",
            "PublishDate": 1763367572267,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Reports 35% Revenue Growth in Q2FY26, Moderates Disbursals Amid MSME Sector Stress",
            "Summary": "UGRO Capital achieved 35% year-on-year total income growth to INR 461 crores and 22% PAT increase to INR 43 crores in Q2FY26, while consciously reducing disbursals to INR 1,789 crores due to overleveraging in small MSME segments. The company tightened underwriting standards, reduced throughput rates from 30% to 20%, and maintained stable asset quality with GNPA at 2.4% and NNPA at 1.5%, positioning for the upcoming Profectus Capital acquisition worth INR 3,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763175298040,
            "Source": "earnings"
        },
        {
            "Title": "UGRO Capital Schedules Committee Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "UGRO Capital has scheduled its Investment and Borrowing Committee meeting for November 19, 2025, to consider and approve raising funds through issuance of Non-Convertible Debentures via private placement. The decision affects the company's funding strategy and provides an alternative financing avenue for business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763133762122,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Submits Monitoring Reports for Preferential Issue and Rights Issue Fund Utilization",
            "Summary": "UGRO Capital filed monitoring agency reports from India Ratings for the quarter ended September 30, 2025, covering utilization of proceeds from its preferential issue (INR 513.37 crores raised) and rights issue (INR 380.72 crores raised). The reports confirmed no deviation from stated objectives, with funds allocated toward loan portfolio growth, debt repayment, and general corporate purposes as per the original offer documents.",
            "Sentiment": "neutral",
            "PublishDate": 1763121231872,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots Rs. 100 Crore Commercial Papers with One-Year Tenure",
            "Summary": "UGRO Capital Limited's Investment and Borrowing Committee approved the allotment of unlisted Commercial Papers worth Rs. 100 crores on November 13, 2025. The securities have a face value of Rs. 5 lakh per unit and were issued at Rs. 4,61,894 per security, generating total issue proceeds of Rs. 92.38 crores. The Commercial Papers carry a one-year tenure with redemption scheduled for November 13, 2026, and a total redemption value of Rs. 100 crores. Yes Bank Limited, Mumbai serves as the Issuing and Paying Agent for these securities.",
            "Sentiment": "neutral",
            "PublishDate": 1763038418947,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Submits Security Cover Certificate for Quarter Ended September 30, 2025",
            "Summary": "UGRO Capital Limited filed a Security Cover Certificate with BSE and NSE for the quarter and half year ended September 30, 2025. The certificate was signed by Sharp & Tannan Associates, Chartered Accountants, who serve as the company's statutory auditors. The filing relates to the company's listed secured redeemable non-convertible debentures and ensures compliance with SEBI listing regulations. The auditors certified that the security cover available for debenture holders is 100 percent or more than the required cover as per the offer documents, and that the company has complied with financial and other covenants related to its listed debt securities.",
            "Sentiment": "neutral",
            "PublishDate": 1762542796586,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Targets ₹15,000Cr AUM by FY27 with Branch Expansion and MSME Focus",
            "Summary": "UGRO Capital has set a target to achieve ₹15,000 crore in Assets Under Management by FY27, focusing on MSME lending and embedded finance. The company expanded its branch network by 90 locations in H1FY26, bringing the total to 303 branches. Financial performance showed stable Gross Non-Performing Assets at 2.4% and 22% growth in Profit After Tax. The company completed an equity infusion of ₹535 crore to fund the Profectus acquisition. UGRO Capital aims to maintain margin stability and scale digitally through AI-driven credit models.",
            "Sentiment": "positive",
            "PublishDate": 1762528845276,
            "Source": "stock"
        },
        {
            "Title": "UGRO Capital Approves Rs 500 Crore Debenture Issue to Boost Capital Adequacy",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved the issuance of up to 5,000 non-convertible debentures worth Rs 500 crore, with a green shoe option for an additional Rs 1,000 crore. Each debenture has a face value of Rs 1 lakh and will be issued on a private placement basis. The debentures are unsecured, rated, subordinated, listed, taxable, and redeemable. As a Non-Banking Finance Company, UGRO Capital plans to use this subordinated debt as Tier II capital to enhance its capital adequacy under RBI regulations. The allotment date is tentatively scheduled for November 17, 2025. Interest will be paid monthly, with redemption at par on the maturity date. In case of payment delays, a default interest of up to 2% per annum may apply.",
            "Sentiment": "positive",
            "PublishDate": 1762520511838,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Reports 22% Growth in Net Profit to 433M Rupees",
            "Summary": "UGRO Capital reported net profit of 433 million rupees compared to 355 million rupees in the same period last year, representing a year-over-year increase. The company's revenue grew to 4.55 billion rupees from 3.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762517948723,
            "Source": "earnings"
        },
        {
            "Title": "Ugro Capital Plans Fund Raising Through Non-Convertible Debentures on November 7",
            "Summary": "Ugro Capital has announced plans to raise funds through the issuance of non-convertible debentures scheduled for November 7. The company will use this debt instrument as a financing mechanism to raise capital.",
            "Sentiment": "neutral",
            "PublishDate": 1762176958657,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots Commercial Papers Worth Rs 16.43 Crore",
            "Summary": "UGRO Capital Limited's Investment and Borrowing Committee approved the allotment of Commercial Papers on October 28, 2025. The securities have a face value of Rs 5 lakh each and were issued at Rs 4,83,092 per security, raising Rs 16.43 crore. The Commercial Papers have a tenure of 146 days and will mature on March 23, 2026, with a redemption value of Rs 17 crore. Yes Bank Limited serves as the Issue and Paying Agent for these securities.",
            "Sentiment": "neutral",
            "PublishDate": 1761658430232,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Corrects Default Interest Rate in Debenture Issuance Details",
            "Summary": "UGRO Capital Limited issued a revised communication to stock exchanges correcting a typographical error in their Investment and Borrowing Committee meeting outcome. The company corrected the default interest rate from \"2.00% (One Percent) per annum\" to \"2.00% (Two Percent) per annum\" for their upcoming Non-Convertible Debentures issuance. The debenture issue involves unsecured, rated, subordinated, listed, taxable, redeemable Non-Convertible Debentures through private placement. The base issue size is up to INR 50 crores with a green shoe option of up to INR 150 crores, featuring an indicative coupon rate of 11.65% per annum with monthly interest payments. The debentures have a tentative tenure of 66 months with allotment scheduled for October 31, 2025, and maturity on April 30, 2031. The instruments will be listed on BSE Limited and redeemed at par upon maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1761390085669,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Plans Non-Convertible Debentures Issue of Up To 500 Million Rupees",
            "Summary": "UGRO Capital announced plans to issue non-convertible debentures worth up to 500 million rupees. The company has included an option to retain oversubscription up to 1.5 billion rupees, indicating potential for raising additional funds beyond the base issue size depending on investor demand.",
            "Sentiment": "positive",
            "PublishDate": 1761220209788,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots INR 150 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "UGRO Capital Limited allotted 150,000 non-convertible debentures with a face value of INR 10,000 each, totaling INR 150 crores through private placement on October 17, 2025. The debentures carry a coupon rate of 9.75% per annum with monthly interest payments and have a tenure of 24 months, maturing on October 16, 2027. The securities are listed, rated, senior, secured, transferable, and redeemable, proposed to be listed on BSE Limited. The debentures will be redeemed at par value upon maturity, with the company maintaining a minimum security cover of 1.10x over loan receivables during the tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1760688688804,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots ₹14.45 Crore Commercial Papers with 158-Day Tenure",
            "Summary": "UGRO Capital Limited has allotted commercial papers worth ₹14.45 crore on October 10, 2025. The commercial papers have a face value of ₹5 lakh per security and an issue price of ₹4.81 lakh per security. The securities carry a 158-day tenure with redemption scheduled for March 17, 2026, at a redemption value of ₹15 crore. Yes Bank Limited, Mumbai serves as the Issue and Paying Agent. The commercial papers are proposed to be listed and have been assigned ISIN INE583D14709.",
            "Sentiment": "neutral",
            "PublishDate": 1760104339967,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Approves Issuance of Non-Convertible Debentures Worth Up to ₹3 Billion",
            "Summary": "UGRO Capital has approved the issuance of non-convertible debentures with a value of up to ₹3 billion. This debt instrument will allow the company to raise funds from investors without providing conversion rights to equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1759935390082,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Allots Rs. 90 Crore Unlisted Commercial Papers",
            "Summary": "UGRO Capital Limited's Investment and Borrowing Committee approved the allotment of unlisted Commercial Papers worth Rs. 90 crore, comprising two tranches of Rs. 50 crore and Rs. 40 crore. The first tranche has a 184-day tenure with redemption scheduled for April 2, 2026, while the second tranche has a 227-day tenure with redemption on May 15, 2026. Both securities have a face value of Rs. 5 lakh per unit, with issue prices of Rs. 4,78,069 and Rs. 4,73,079 respectively. Yes Bank Limited, Mumbai serves as the Issuing and Paying Agent for both tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1759248422753,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Raises INR 50 Crores Through Non-Convertible Debentures to Boost Capital Adequacy",
            "Summary": "UGRO Capital Limited has allotted 5,000 unsecured, rated, subordinated, listed, taxable, redeemable, non-convertible debentures with a face value of INR 1,00,000 each, raising INR 50 crores through private placement. The debentures carry an interest rate of 11.65% per annum with monthly coupon payments and have a tenure of 66 months, maturing on March 25, 2031. The debentures are proposed to be listed on BSE Limited. As a Non-Banking Finance Company, UGRO Capital aims to raise subordinated debt in the form of Tier II capital to enhance its capital adequacy in compliance with RBI regulations. The company's Investment and Borrowing Committee approved the allotment on September 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758783627071,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Receives RBI Approval for Profectus Capital Acquisition, Expected to Close by October 31, 2025",
            "Summary": "UGRO Capital Limited has received RBI approval for its proposed acquisition of 100% shareholding in Profectus Capital Private Limited. The RBI granted approval through a letter dated September 17, 2025, following an application filed by Profectus seeking prior approval for the acquisition transaction. Subject to customary conditions in the share purchase agreement, the acquisition is expected to close by October 31, 2025. Additionally, UGRO Capital's Securities Allotment and Transfer Committee approved a variation in the terms of Compulsorily Convertible Debentures to be issued on preferential basis to fund the acquisition. The committee modified the coupon payment structure so that it will be paid entirely immediately post allotment of the CCDs, removing any linkage to subsequent events. All other terms and conditions of the CCDs remain unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1758185725154,
            "Source": "order&deals"
        },
        {
            "Title": "UGRO Capital Allots Commercial Papers Worth Rs 9.78 Crore with 91-Day Tenure",
            "Summary": "UGRO Capital Limited has allotted Commercial Papers worth Rs 9.78 crore on September 17, 2025. The securities have a face value of Rs 5 lakh each and were issued at Rs 4,89,146.50 per security. The Commercial Papers carry a 91-day tenure with redemption scheduled for December 17, 2025, at a redemption value of Rs 10 crore. Yes Bank Limited, Mumbai serves as the Issue and Paying Agent. The securities are proposed to be listed and have been assigned ISIN INE583D14675.",
            "Sentiment": "neutral",
            "PublishDate": 1758112367458,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Approves INR 50 Crore Non-Convertible Debenture Issuance to Boost Tier II Capital",
            "Summary": "UGRO Capital's Investment and Borrowing Committee approved the issuance of up to 5,000 unsecured, rated, subordinated, listed, taxable, redeemable Non-Convertible Debentures with a face value of INR 1,00,000 each, totaling up to INR 50 crores through private placement. The debentures will carry an indicative coupon rate of 11.65% per annum with monthly interest payments, have a tentative tenure of 66 months, and are scheduled for allotment on September 25, 2025, with maturity on March 25, 2031. The debentures will be listed on BSE Limited and are intended to raise Tier II capital to enhance the company's capital adequacy as a Non-Banking Finance Company under RBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1758097227043,
            "Source": "corporate_action"
        },
        {
            "Title": "UGRO Capital Announces Major Leadership Reshuffle with New CEO and Senior Management Appointments",
            "Summary": "UGRO Capital implemented significant senior management changes effective July 16, 2025. Anuj Pandey, previously Chief Risk Officer, was elevated to CEO on July 1, 2025, and designated as Key Managerial Personnel. The Board approved three additional appointments: Irem Sayeed was elevated from Chief Credit Officer to Chief Risk Officer for a 5-year term, Sameer Nanda was promoted from Chief Collection and Litigation Officer to Chief Revenue Officer, and Shilpa Bhatter was appointed as Chief Financial Officer. These appointments resulted in the departure of two executives - Kishore Lodha resigned as CFO effective July 16, 2025, while Amit Mande will continue as Chief Revenue Officer until August 8, 2025, to ensure smooth transition. The new appointees bring substantial experience: Sayeed has over 20 years in financial services with experience at Mswipe Technologies, Magma Fincorp, Kotak Mahindra Bank, and GE Capital; Nanda has 25+ years in lending business and has worked with ABN AMRO Bank, ICICI Bank, and Religare; Bhatter is a Chartered Accountant with 18+ years in BFSI sector and previously served as CFO at Dvara Kshetriya Gramin Financial Services, where she mobilized over ₹4,000 crores in debt.",
            "Sentiment": "positive",
            "PublishDate": 1757132279118,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ugro Capital Approves ₹100 Crore NCD Issuance",
            "Summary": "Ugro Capital has approved the issuance of Non-Convertible Debentures (NCDs) worth up to ₹100 crores. NCDs are debt instruments that allow companies to raise funds from investors while offering fixed returns over a specified period.",
            "Sentiment": "neutral",
            "PublishDate": 1757057285065,
            "Source": "corporate_action"
        },
        {
            "Title": "Ugro Capital Raises ₹250 Crore Through Commercial Paper Issuance",
            "Summary": "Ugro Capital has issued commercial papers worth ₹250 crore through a private placement. The fundraising was completed via commercial paper instruments, which are short-term debt securities typically used by companies for working capital requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1756483452682,
            "Source": "stock"
        },
        {
            "Title": "UGRO Capital Reports 31% YoY AUM Growth, Announces Rs 1,400 Crore Profectus Capital Acquisition",
            "Summary": "UGRO Capital Limited reported Assets Under Management of Rs 12,081 crores, representing 31% year-over-year growth for the quarter ended June 30, 2025. The NBFC focused on MSME financing posted total income of Rs 421.8 crores (up 40% YoY) and profit after tax of Rs 34.1 crores (up 12% YoY). The company announced an all-cash acquisition of Profectus Capital for Rs 1,400 crores, which will add Rs 3,468 crores to AUM and expand presence to 7 new states with 28 branches. UGRO expanded its Emerging Markets business to 286 operational branches and achieved a milestone of crossing Rs 1,000 crores AUM in Embedded Finance. The company maintained asset quality with Gross NPA at 2.5% and Net NPA at 1.7%, while capital adequacy ratio stood at 22.4%. UGRO completed a Rs 381 crores rights issue and is processing a Rs 911 crores preferential issue for total capital raising of approximately Rs 1,300 crores. Management targets medium-term AUM of Rs 20,000 crores and expects to achieve 4% steady-state ROA in 6-8 quarters.",
            "Sentiment": "positive",
            "PublishDate": 1755609156551,
            "Source": "earnings"
        }
    ]
}