{
    "Symbol": "UJJIVANSFB",
    "ISIN": "INE551W01018",
    "News": [
        {
            "Title": "Ujjivan Small Finance Bank Allots 19.37 Lakh Shares",
            "Summary": "Ujjivan Small Finance Bank allotted 19,36,509 equity shares under ESOP 2019 scheme, increasing paid-up capital from Rs. 19,38,95,94,830 to Rs. 19,40,89,59,920 following board committee approval on February 05, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770274621810,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank Plans Mid-Corporate Entry",
            "Summary": "Ujjivan Small Finance Bank announces strategic expansion into mid-corporate segment with new offerings planned for Q4 FY26, marking significant business diversification move.",
            "Sentiment": "positive",
            "PublishDate": 1769138251556,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Targets OpEx Improvement",
            "Summary": "Ujjivan Small Finance Bank expects OpEx to asset ratio to remain at 6.7% in Q4, with improvements planned for the next financial year as per management guidance.",
            "Sentiment": "neutral",
            "PublishDate": 1769138227895,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank Sets Loan Mix Target",
            "Summary": "Ujjivan Small Finance Bank projects loan portfolio to reach 30-35% unsecured and 65-70% secured loans by FY2030, with annual 5% progression towards target mix.",
            "Sentiment": "neutral",
            "PublishDate": 1769138203808,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Maintains FY26 Guidance",
            "Summary": "Ujjivan Small Finance Bank reaffirms its FY26 ROA guidance of 1.2-1.4% and ROE guidance of 10-12%, while targeting ROA of 1.8-2% by FY2030 as part of its long-term strategic vision.",
            "Sentiment": "positive",
            "PublishDate": 1769138174141,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank Expects Credit Cost Reduction",
            "Summary": "Ujjivan Small Finance Bank management provides guidance on credit cost trajectory, expecting further reduction in Q4 with normalization by end of Q1 or Q2 FY27 during recent concall.",
            "Sentiment": "positive",
            "PublishDate": 1769138147701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank Targets 7% Cost of Funds",
            "Summary": "Ujjivan Small Finance Bank expects cost of funds to improve with target exit rate of around 7% by year-end, according to management guidance shared during conference call.",
            "Sentiment": "positive",
            "PublishDate": 1769138102773,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank Completes Branch Expansion",
            "Summary": "Ujjivan Small Finance Bank successfully completed its planned addition of 24 branches for FY26, bringing its total branch network to 777 locations across the country.",
            "Sentiment": "positive",
            "PublishDate": 1769138078734,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Expects 7.3% GDP Growth",
            "Summary": "Ujjivan Small Finance Bank management projects real GDP growth of 7.3% for FY26, indicating optimistic economic outlook during recent conference call discussions.",
            "Sentiment": "positive",
            "PublishDate": 1769138050219,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Plans UAE Investor Roadshow",
            "Summary": "Ujjivan Small Finance Bank has scheduled investor meetings in UAE from January 28-30, 2026, including sessions with Abu Dhabi Investment Authority and seven other institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1769076152415,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Q3 Net Profit Surges 70.6%",
            "Summary": "Ujjivan Small Finance Bank reported a strong 70.6% year-on-year growth in Q3 net profit, rising to ₹186.00 crores from ₹109.00 crores in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769070926955,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank Appoints New Independent Director",
            "Summary": "Ujjivan Small Finance Bank has appointed Aniruddha Paul as an Independent Director for a three-year term beginning January 22, 2026, strengthening its board governance structure.",
            "Sentiment": "positive",
            "PublishDate": 1769061333036,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Grants 2.84 Lakh ESOPs",
            "Summary": "Ujjivan Small Finance Bank's board committee approved grant of 2,83,559 stock options under ESOP Scheme 2019 at exercise price of ₹54.15 per share with 4-year vesting schedule starting 20% in first year.",
            "Sentiment": "positive",
            "PublishDate": 1769003560190,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank MSME Head Resigns",
            "Summary": "Ujjivan Small Finance Bank announces resignation of Business Head - MSME Ashim Sarkar effective January 14, 2026, citing better career prospects as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768388868435,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan SFB gets CRISIL A1+ rating reaffirmation",
            "Summary": "CRISIL Ratings reaffirmed its 'A1+' rating on Ujjivan Small Finance Bank's ₹375 crore Certificate of Deposits programme, down from ₹2,500 crore, while withdrawing rating on ₹2,125 crore CDs.",
            "Sentiment": "neutral",
            "PublishDate": 1767962261561,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Q3FY26 Earnings Call Jan 22",
            "Summary": "Ujjivan Small Finance Bank scheduled Q3FY26 earnings conference call on January 22, 2026 at 5:30 PM IST with senior management participation including MD & CEO Sanjeev Nautiyal.",
            "Sentiment": "neutral",
            "PublishDate": 1767766770567,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan SFB Q3FY26: Deposits Rise 22.2% YoY to ₹42,219 Cr",
            "Summary": "Ujjivan Small Finance Bank reports strong Q3FY26 performance with total deposits growing 22.2% YoY to ₹42,219 crores and gross loan book expanding 21.6% to ₹37,055 crores, while asset quality improves.",
            "Sentiment": "positive",
            "PublishDate": 1767441243803,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ujjivan Small Finance Bank Launches Forex Services",
            "Summary": "Ujjivan Small Finance Bank introduces foreign exchange services and EEFC accounts to facilitate cross-border transactions for individuals, businesses, exporters, and NRIs through digital and branch channels.",
            "Sentiment": "positive",
            "PublishDate": 1767153611680,
            "Source": "stocks"
        },
        {
            "Title": "Ujjivan Small Finance Bank Allots 6.71 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Ujjivan Small Finance Bank's Stakeholders Relationship Committee approved allotment of 6,71,386 equity shares of Rs. 10 face value each under ESOP 2019 scheme. The bank's paid-up capital increased from Rs. 19,37,79,17,310 to Rs. 19,38,46,31,170, with listing approvals being sought from NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764747045011,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujjivan Small Finance Bank Allots 3.27 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Ujjivan Small Finance Bank's Stakeholders Relationship Committee approved the allotment of 3,27,767 equity shares with a face value of Rs. 10 each under the ESOP Scheme 2019. The shares were allotted pursuant to the exercise of stock options by employees. The bank has received in-principle approval from NSE and BSE for listing and is applying for final listing approval. Following this allotment, the bank's paid-up capital increased from Rs. 19,37,46,39,640 to Rs. 19,37,79,17,310.",
            "Sentiment": "neutral",
            "PublishDate": 1762885701275,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports Strong Q2 FY26 Performance with Improved Asset Quality and Growth",
            "Summary": "Ujjivan Small Finance Bank delivered robust quarterly results with total deposits rising 15.1% year-on-year to INR 39,211 crores and CASA deposits crossing INR 10,000 crores for the first time, growing 22.1% annually. The bank achieved its highest-ever disbursements of INR 7,932 crores, up 48% year-on-year, with gross loan book growing 14% to INR 34,588 crores. Asset quality showed improvement as slippages reduced to INR 278 crores from approximately INR 350 crores in previous quarters, while SMA book dropped below 2%. Net interest margin improved to 7.9% from 7.7% in the previous quarter, supported by cost of funds reduction of 23 basis points. The secured loan portfolio reached 47% of total book, with strong growth in affordable housing (42% year-on-year), micro mortgages (180% year-on-year), and MSME segments (69% year-on-year). Net interest income stood at INR 922 crores with PAT at INR 122 crores, reflecting ROA of 1% and ROE of 7.7%. The bank maintained strong capital position with CRAR at 21.4% and expects meaningful decline in credit costs in the second half.",
            "Sentiment": "positive",
            "PublishDate": 1761034237980,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports 18.2% QoQ Profit Growth to ₹122 Crore",
            "Summary": "Ujjivan Small Finance Bank reported quarterly profit of ₹122 crore, marking an 18.2% increase quarter-on-quarter. The bank achieved record disbursements of ₹7,932 crore, up 47.6% year-on-year and 21.3% quarter-on-quarter. Gross loan book reached ₹34,588 crore, growing 14.0% year-on-year and 3.9% quarter-on-quarter. Deposits stood at ₹39,211 crore, up 15.1% year-on-year, while CASA deposits grew 22.1% year-on-year to ₹10,783 crore. The secured book expanded 52.9% year-on-year to ₹16,173 crore, representing 46.8% of total loans. Asset quality metrics showed Portfolio at Risk at 4.45%, GNPA at 2.45%, and NNPA at 0.67%. Net Interest Income increased 7.7% quarter-on-quarter to ₹922 crore. Return on Assets stood at 1.0% and Return on Equity at 7.7%. Capital adequacy ratio was 21.4% with Tier I at 19.9%. Cost of funds improved to 7.3% from 7.6% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760689268653,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports Mixed Q2 Results with Higher Interest Income and Improved Asset Quality",
            "Summary": "Ujjivan Small Finance Bank reported quarterly results showing interest earned of 16.8 billion rupees compared to 16.13 billion rupees year-over-year. Provisions and contingencies increased to 2.35 billion rupees from 2.25 billion rupees quarter-over-quarter. The bank's asset quality improved with gross non-performing assets (GNPA) declining to 2.45% from 2.52% quarter-over-quarter, while net non-performing assets (NNPA) decreased to 0.67% from 0.70% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760687918356,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports 48% Decline in Quarterly Net Profit",
            "Summary": "Ujjivan Small Finance Bank reported a net profit of 1.2 billion rupees in Q2, representing a significant decrease from 2.3 billion rupees in the same quarter of the previous year. This marks a year-over-year decline of approximately 48% in the bank's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1760687484149,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan SFB Reports Growth in Deposits, Loan Book, and Disbursements",
            "Summary": "Ujjivan Small Finance Bank reported yearly growth across key metrics. Deposits increased to 391 billion from 341 billion, while the loan book expanded to 346 billion from 303 billion. Total disbursements rose to 79.6 billion from 53.8 billion.",
            "Sentiment": "positive",
            "PublishDate": 1759498762130,
            "Source": "stock"
        },
        {
            "Title": "Ujjivan Small Finance Bank Schedules London Investor Roadshow with 12 Global Investment Firms",
            "Summary": "Ujjivan Small Finance Bank will conduct a non-deal roadshow in London from September 17-19, 2025. The bank's management will hold one-on-one meetings with 12 investors including Carmignac Gestion, Marshall Wace, Sun Global Investments, Jupiter Asset Management, Aberdeen Investments, GIB Asset Management, North Rock, Mobius Capital, Millennium Partners, Capital Group, Pictet Asset Management, and Columbia Threadneedle. The bank confirmed that no unpublished price sensitive information will be shared during these meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1757679826255,
            "Source": "stock"
        },
        {
            "Title": "Ujjivan Small Finance Bank Confirms Rs 2,000 Crore Capital Requirement Over 18-24 Months",
            "Summary": "Ujjivan Small Finance Bank responded to exchange queries regarding media reports about its capital raising plans. The bank confirmed that during an analyst day event held on September 8, 2025, MD & CEO Sanjeev Nautiyal provided guidance that the bank will need additional capital of around Rs 2,000 crores in the next 18-24 months to support its growth trajectory outlined in its five-year outlook until FY29-30. The bank clarified that this guidance was given in response to media queries about future capital raising plans and universal bank application status. The bank stated it has made all necessary disclosures in accordance with applicable regulations and has no additional material price sensitive information requiring disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1757408117629,
            "Source": "stock"
        },
        {
            "Title": "Ujjivan SFB Sets ₹1 Lakh Crore Loan Book Target by 2030",
            "Summary": "Ujjivan Small Finance Bank has announced its target to achieve a loan book of ₹1 lakh crore by 2030. The bank is also exploring expansion into universal banking and housing finance sectors as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1757333915521,
            "Source": "stock"
        },
        {
            "Title": "Ujjivan Small Finance Bank Awaits RBI Decision on Commercial Banking License by December",
            "Summary": "Ujjivan Small Finance Bank expects the Reserve Bank of India to decide on its commercial banking license application by December, with the application reportedly in an advanced stage. The bank has outlined expansion plans to open 400 new branches over the next five years and is considering raising INR 20 billion through a Qualified Institutional Placement within the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1757312995413,
            "Source": "stock"
        },
        {
            "Title": "Ujjivan Small Finance Bank Appoints Deepak Agarwal as Head of Strategy",
            "Summary": "Ujjivan Small Finance Bank appointed Mr. Deepak Agarwal as Head of Strategy effective August 18, 2025. Agarwal brings experience in strategy and transformation across multiple markets including India, USA, South East Asia, and Middle East. He previously served as Head of Retail Business Strategy at Axis Bank and has worked with Mastercard, Deloitte and KPMG. Agarwal holds an MBA from S.P. Jain Institute of Management & Research, Mumbai and a Bachelor's Degree in Engineering from Delhi Technical University. He has no relationship with the bank's directors.",
            "Sentiment": "positive",
            "PublishDate": 1755599924327,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports 24% QoQ Profit Growth to ₹103 Crore in Q1 FY26",
            "Summary": "Ujjivan Small Finance Bank reported a profit of ₹103 crore for Q1 FY26, marking a 24% increase quarter-on-quarter. The bank's gross loan book grew 11% year-on-year to ₹33,287 crore, with secured book share rising to 45.5% from 31.3% in the previous year. Deposits increased 18.8% year-on-year to ₹38,619 crore. The secured book segment showed strong growth of 63% year-on-year to ₹15,162 crore. CASA deposits grew 12.6% year-on-year to ₹9,381 crore with a CASA ratio of 24.3%. The bank's RoA improved to 0.8% and RoE to 6.7%. Credit cost for the quarter was ₹225 crore, including accelerated provisions of ₹23 crore. The bank maintained a capital adequacy ratio of 22.8% and average daily LCR of 156%. Management expects to grow advances around 20% for FY26 with credit cost in the range of 2.3% to 2.4% of average gross advances.",
            "Sentiment": "positive",
            "PublishDate": 1753347161247,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports Mixed Q1 Results with Higher Interest Income but Rising NPAs",
            "Summary": "Ujjivan Small Finance Bank reported Q1 interest income of Rs 16.2 billion, up from Rs 15.8 billion year-over-year. However, the bank's asset quality deteriorated with gross non-performing assets (GNPA) ratio increasing to 2.52% from 2.18% quarter-over-quarter, and net NPA (NNPA) ratio rising to 0.70% from 0.49%. In absolute terms, gross NPAs increased to Rs 8.34 billion from Rs 6.95 billion, while net NPAs rose to Rs 2.26 billion from Rs 1.52 billion on a quarterly basis.",
            "Sentiment": "negative",
            "PublishDate": 1753345361980,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan Small Finance Bank: Q1 Deposits Up 18.8%, Strong Growth in MSME and Housing Loans",
            "Summary": "Ujjivan Small Finance Bank reported an 18.8% YoY increase in total deposits to ₹38,612 crore for Q1 FY26. Gross loan book grew 10.7% YoY to ₹33,287 crore. Affordable housing loans rose 53.1%, while MSME loans increased 59.3%. Overall disbursements grew 23.8% YoY to ₹6,543 crore. GNPA stood at 2.5%, up from previous quarter. CASA ratio declined to 24.3%.",
            "Sentiment": "positive",
            "PublishDate": 1751625214000,
            "Source": "result"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports Decline in CASA Ratio",
            "Summary": "Ujjivan Small Finance Bank has reported a decrease in its CASA (Current Account Savings Account) ratio. The ratio has fallen to 24.3% from 25.6% compared to the same period last year. This indicates a reduction in the proportion of low-cost deposits in the bank's total deposits.",
            "Sentiment": "negative",
            "PublishDate": 1751610314000,
            "Source": "default"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports Growth in Loan Book and Deposits",
            "Summary": "Ujjivan Small Finance Bank has reported a 10.7% year-on-year increase in its gross loan book, reaching ₹33,287 crore. The bank's total deposits have also grown to ₹38,612 crore, up from ₹32,514 crore in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1751610230000,
            "Source": "default"
        },
        {
            "Title": "Ujjivan Small Finance Bank: Q4 Profit Meets Estimates, Asset Quality Improves",
            "Summary": "Ujjivan Small Finance Bank reported Q4 FY25 net profit of ₹83.4 crore, meeting estimates but down 74.7% YoY. NII at ₹864.4 crore, down 7.4% YoY. Asset quality improved with GNPA at 2.18% and NNPA at 0.49%. Total deposits grew 20% YoY to ₹37,630 crore. Gross loan book reached ₹32,122 crore, up 8% annually. Secured loan portfolio increased to 44% of total loans. Bank applied for universal banking license.",
            "Sentiment": "neutral",
            "PublishDate": 1746002088000,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports Q4 Financial Results",
            "Summary": "Ujjivan Small Finance Bank has released its Q4 financial results. The bank's provision and contingencies are expected to be 2.6 billion rupees, compared to 790 million rupees year-over-year and 2.22 billion rupees quarter-over-quarter. Interest earned for Q4 is reported at 15.7 billion rupees, slightly up from 15.29 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745999762000,
            "Source": "result"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports Q4 Financial Results",
            "Summary": "Ujjivan Small Finance Bank has released its Q4 financial results. The bank's Gross Non-Performing Assets (GNPA) decreased to 2.18% from 2.68% quarter-over-quarter. Net Non-Performing Assets (NNPA) increased to 0.49% from 0.25% quarter-over-quarter. The bank reported a net profit of 834 million rupees, down from 3.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745999652000,
            "Source": "result"
        },
        {
            "Title": "Ujjivan Small Finance Bank: Q4 Deposits Rise 20%, Disbursements Surge 39%",
            "Summary": "Ujjivan Small Finance Bank reported Q4 total deposits of ₹37,617 crore, up 19.7% YoY and 9.1% QoQ. Disbursements reached ₹7,455 crore, increasing 39% QoQ and 11.6% YoY. The bank is preparing for a potential transition to a universal bank.",
            "Sentiment": "positive",
            "PublishDate": 1743758568000,
            "Source": "result"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports 11.6% Growth in Overall Disbursement",
            "Summary": "Ujjivan Small Finance Bank has announced that its overall disbursement grew by 11.6% year-over-year as of March 31, 2025. This growth indicates positive lending activity and potential expansion of the bank's loan portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1743757399000,
            "Source": "result"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports 7.9% Growth in Gross Loan Book",
            "Summary": "Ujjivan Small Finance Bank has announced that its gross loan book grew by 7.9% year-over-year as of March 31, 2025. This growth indicates an expansion in the bank's lending activities and potentially suggests improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1743757361000,
            "Source": "result"
        },
        {
            "Title": "Ujjivan Small Finance Bank Reports 19.6% Growth in Total Deposits",
            "Summary": "Ujjivan Small Finance Bank has announced that its total deposits grew by 19.6% year-over-year as of March 31, 2025. This growth indicates a positive trend in the bank's ability to attract and retain customer deposits.",
            "Sentiment": "positive",
            "PublishDate": 1743757314000,
            "Source": "result"
        },
        {
            "Title": "Ujjivan Small Finance Bank Sells Stressed Loan Portfolio for 342.6 Million Rupees",
            "Summary": "Ujjivan Small Finance Bank has successfully completed the sale of its stressed loan portfolio for 342.6 million rupees. This move is likely part of the bank's strategy to improve its asset quality and financial position by offloading non-performing assets.",
            "Sentiment": "positive",
            "PublishDate": 1740961195000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujjivan Small Finance Bank Sells Stressed Loan Portfolio",
            "Summary": "Ujjivan Small Finance Bank has completed the sale of its stressed loan portfolio for 342.6 million Indian rupees. This action is likely part of the bank's efforts to manage its non-performing assets and improve its overall financial health.",
            "Sentiment": "positive",
            "PublishDate": 1740755807000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujjivan Small Finance Bank Approves Sale of NPA and Written-off Loans",
            "Summary": "Ujjivan Small Finance Bank has approved the sale of non-performing assets (NPA) and written-off loans to an Asset Reconstruction Company (ARC). The sale involves a micro banking pool with a size of 3.65 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740355823000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujjivan Small Finance Bank Approves Sale of NPA and Written-off Loans",
            "Summary": "Ujjivan Small Finance Bank has approved the sale of non-performing assets (NPA) and written-off loans to an Asset Reconstruction Company (ARC). The sale involves a micro banking pool with a size of 3.65 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740134857000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujjivan Small Finance Bank: Potential Rebound and Universal Banking License Application",
            "Summary": "Ujjivan Small Finance Bank plans to apply for a universal banking license, which could improve its services range. Despite a weak Q3, the bank's stock has rebounded 16% from its 52-week low. The bank's gross loan book grew 9.8% YoY, but disbursements fell 5.5%. Gross NPA ratio increased to 2.7% due to stress in the microfinance portfolio. The bank is focusing on increasing secured assets, which now form 39.3% of the loan book.",
            "Sentiment": "positive",
            "PublishDate": 1738763465000,
            "Source": "normal_news"
        },
        {
            "Title": "Ujjivan Small Finance Bank Applies for Universal Banking License",
            "Summary": "Ujjivan Small Finance Bank has submitted an application to the Reserve Bank of India (RBI) for a universal banking license. This move indicates the bank's intention to expand its operations and offer a wider range of banking services beyond its current small finance bank model.",
            "Sentiment": "positive",
            "PublishDate": 1738653671000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ujjivan Small Finance Bank: Stock Continues Downward Trend in 2025",
            "Summary": "Ujjivan Small Finance Bank shares have fallen 3% in 2025, following a 45% decline in 2024. The bank's Q3 profit dropped 64%, and its plan for a universal banking license failed to boost investor confidence. The stock is trading below its December 2023 peak of Rs 63 per share.",
            "Sentiment": "negative",
            "PublishDate": 1737697939000,
            "Source": "earnings"
        },
        {
            "Title": "Ujjivan Small Finance Bank: Positive Outlook for FY26, Says Yes Securities",
            "Summary": "Yes Securities maintains an 'Add' rating on Ujjivan Small Finance Bank, anticipating improved growth and normalized credit costs starting Q1 FY26. The bank is expected to perform better in FY26 compared to FY25.",
            "Sentiment": "positive",
            "PublishDate": 1737696264000,
            "Source": "result"
        }
    ]
}