{
    "Symbol": "ULTRACEMCO",
    "ISIN": "INE481G01011",
    "News": [
        {
            "Title": "UltraTech Cement Gets 'BBB-' Rating Affirmation",
            "Summary": "Fitch Ratings affirms UltraTech Cement's Long-Term Foreign and Local Currency Issuer Default Ratings at 'BBB-' with stable outlook following update of Corporate Rating Criteria.",
            "Sentiment": "positive",
            "PublishDate": 1770475686259,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Completes 2.7 MTPA Capacity Expansion",
            "Summary": "UltraTech Cement has successfully completed a 2.7 MTPA capacity expansion at its Aligarh facility, strengthening its production capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1770295126041,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Grants 1,521 Stock Options to Employees",
            "Summary": "UltraTech Cement granted 1,521 stock options comprising 1,381 options and 140 PSUs to eligible employees under its Employee Stock Option Scheme 2022 on February 3, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770190184738,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement Receives GST Orders Worth ₹15.26 Cr",
            "Summary": "UltraTech Cement received two GST orders from Tamil Nadu authorities totaling ₹15.26 crore in tax demands for alleged excess ITC claims in FY2020-21 and FY2022-23. Company plans to contest.",
            "Sentiment": "negative",
            "PublishDate": 1769766551775,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Q3 Net Profit Surges 40% YoY",
            "Summary": "UltraTech Cement reports strong Q3 performance with consolidated net profit rising to ₹17.25 billion from ₹12.31 billion YoY, while EBITDA grows to ₹39 billion with improved margins at 17.94%.",
            "Sentiment": "positive",
            "PublishDate": 1769473074196,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement's Rise to Market Leadership",
            "Summary": "UltraTech Cement transformed from L&T's divested cement business in 2004 to India's largest cement producer with 192.26 MTPA capacity through strategic acquisitions and aggressive expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769446063137,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Q3FY26 Earnings Call Recording Live",
            "Summary": "UltraTech Cement makes Q3FY26 earnings call audio recording available online following January 24, 2026 investor meeting under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769274196683,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement Q3FY26 Preview: Volume Growth Expected",
            "Summary": "UltraTech Cement expected to report 18.9% YoY revenue growth to ₹21,142 crore in Q3FY26, driven by 15-21% volume growth from acquisitions and new capacities despite pricing pressures.",
            "Sentiment": "positive",
            "PublishDate": 1768980986000,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement Block Trade Worth ₹22.18 Crores",
            "Summary": "UltraTech Cement witnessed a significant block trade on NSE involving 17,930 shares at ₹12,373.00 per share, totaling ₹22.18 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768803729088,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement Sells Singapore Subsidiary for $107",
            "Summary": "UltraTech Cement announced the sale of its entire stake in non-material subsidiary Bumi Resources (Singapore) Pte. Ltd. to Celestial Energy Pte. Ltd. for USD 107, with completion expected by March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768565155990,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement Block Trade Worth ₹18.61 Crores",
            "Summary": "UltraTech Cement witnessed a significant block trade on NSE involving 15,316 shares at ₹12,152.00 per share, totaling ₹18.61 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767773088544,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement Q3FY26 Earnings Call on Jan 24",
            "Summary": "UltraTech Cement announces earnings call scheduled for January 24, 2026 at 4:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767354921279,
            "Source": "co_actions_results"
        },
        {
            "Title": "UltraTech Cement Faces GST Orders Worth ₹52.46 Lakh",
            "Summary": "UltraTech Cement receives two GST orders from Haryana authorities totaling ₹52.46 lakh in penalties and tax demands. Company plans to contest both orders, expects no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1767187324540,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Receives Mixed GST Orders from Tamil Nadu",
            "Summary": "UltraTech Cement received GST orders from Tamil Nadu authorities, with major tax demands of ₹133.48 crores and ₹24.85 crores dropped, though some penalties remain upheld.",
            "Sentiment": "positive",
            "PublishDate": 1766909539514,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Commissions 1.8 MTPA Capacity",
            "Summary": "UltraTech Cement successfully commissions additional cement capacity of 1.8 MTPA across Dhule and Nathdwara facilities, bringing total domestic capacity to 188.66 MTPA and global capacity to 194.06 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1766582877704,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Receives GST Order Worth ₹71.37 Lakh",
            "Summary": "UltraTech Cement disclosed receiving a GST demand order from Gujarat State Tax Officer totaling ₹71.37 lakh including interest and penalty for alleged ITC claims from cancelled vendor registrations.",
            "Sentiment": "negative",
            "PublishDate": 1765981057293,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Gets Positive Rating Outlook from Fitch",
            "Summary": "Fitch Ratings believes UltraTech Cement is unlikely to face rating pressure from rupee decline, indicating the cement major's financial resilience against currency fluctuations.",
            "Sentiment": "positive",
            "PublishDate": 1765437337855,
            "Source": "stocks"
        },
        {
            "Title": "UltraTech Cement Receives ESG Rating of 61 from NSE Sustainability for FY2025",
            "Summary": "NSE Sustainability Analytics Limited issued an ESG rating of 61 to UltraTech Cement Limited for FY2025, based on publicly available information. The rating reflects the company's performance on Environmental, Social and Governance parameters as assessed by NSE Sustainability.",
            "Sentiment": "neutral",
            "PublishDate": 1765346502427,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement Authorizes Key Personnel for Material Event Disclosures",
            "Summary": "UltraTech Cement has authorized three Key Managerial Personnel - Managing Director K.C. Jhanwar, CFO Atul Daga, and newly appointed Company Secretary Dhiraj Kapoor - to determine materiality of events and make regulatory disclosures to stock exchanges. The authorization follows Dhiraj Kapoor's appointment as Company Secretary and Compliance Officer effective December 1, 2025, ensuring compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764769449137,
            "Source": "corporate_governance"
        },
        {
            "Title": "UltraTech Cement Reports Material Price Movement Without Specific Trigger",
            "Summary": "UltraTech Cement experienced a material price movement in its share price on December 1, 2025, which the company attributed to market-driven factors rather than any specific event or mainstream media coverage. The company informed stock exchanges that no pending announcements or identifiable triggers caused the price movement.",
            "Sentiment": "neutral",
            "PublishDate": 1764666903069,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Schedules Board Meeting for Quarterly Results on January 24, 2026",
            "Summary": "UltraTech Cement will hold a board meeting on January 24, 2026, to consider and approve standalone and consolidated unaudited financial results for the quarter and nine months ending December 31, 2025. The company has announced a trading window closure for connected and designated persons from January 1, 2026, until 48 hours after the financial results announcement, extending through January 26, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764582160990,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement Appoints New Company Secretary as Sanjeeb Kumar Chatterjee Steps Down",
            "Summary": "UltraTech Cement's Board approved the appointment of Dhiraj Kapoor as Company Secretary and Compliance Officer effective December 1, 2025, while Sanjeeb Kumar Chatterjee will cease from his role on November 30, 2025. Kapoor brings over 24 years of post-qualification experience in corporate secretarial affairs and governance matters, with Chatterjee set to superannuate on June 30, 2026 following a transitional period.",
            "Sentiment": "neutral",
            "PublishDate": 1764231162845,
            "Source": "corporate_governance"
        },
        {
            "Title": "UltraTech Cement Appoints Ashok Kumar Pas as Chief Legal Officer",
            "Summary": "UltraTech Cement's Board of Directors approved the appointment of Mr. Ashok Kumar Pas as Chief Legal Officer effective from November 20, 2025, based on the recommendation of the Nomination, Remuneration and Compensation Committee. The appointee brings over 21 years of post-qualification experience in dispute management, litigation, strategic legal advisory, risk management, compliance, governance, and contract management from both Indian and international legal perspectives.",
            "Sentiment": "positive",
            "PublishDate": 1763528639034,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fitch Affirms UltraTech Cement's BBB- Rating with Stable Outlook",
            "Summary": "Fitch Ratings affirmed UltraTech Cement Limited's Long-Term Foreign and Local Currency Issuer Default Ratings at BBB- with stable outlook, and also affirmed the rating of the company's USD 400 million 2.80% senior unsecured notes due 2031 at BBB-. The ratings reflect expectations of modest leverage profile with EBITDA net leverage sustained around 1.5x, leading market position in India, and cost-efficient operations driven by the company's significant market share and expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1763466668277,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Receives GST Order Worth Rs 13 Crore from Ujjain Authority",
            "Summary": "UltraTech Cement Limited received an order from the Additional Commissioner, CGST Central Excise, Ujjain confirming a GST demand of Rs 6.49 crore along with interest and penalty of Rs 6.49 crore each, totaling approximately Rs 13 crore. The demand relates to GST under RCM on stamp duty and registration fees paid by the company for executing a lease deed. The company is reviewing the order and will decide on further course of action. UltraTech stated there is no material financial impact on the company from this order.",
            "Sentiment": "neutral",
            "PublishDate": 1762268630214,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Receives Tax Notice Worth 65 Million Rupees",
            "Summary": "UltraTech Cement has received a tax notice amounting to 65 million rupees. No additional details about the nature of the tax notice, the issuing authority, or the company's response were provided.",
            "Sentiment": "negative",
            "PublishDate": 1762263473502,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Grants 549 Stock Options to Employees Under ESOP Scheme 2022",
            "Summary": "UltraTech Cement's Nomination, Remuneration and Compensation Committee granted 549 stock options to eligible employees, comprising 498 options and 51 Performance Stock Units (PSUs). The options have an exercise price of Rs. 11,999 per option based on market price, with 33% vesting annually over 3 years starting one year from grant date. PSUs are priced at Rs. 10 per unit with 100% vesting after 3 years. Stock options can be exercised within 5 years from vesting date. The grant was made under the UltraTech Cement Limited Employee Stock Option and Performance Stock Unit Scheme, 2022.",
            "Sentiment": "positive",
            "PublishDate": 1761900240330,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement Reports Mixed Q2FY25 Results with Lower Profits Despite Volume Growth",
            "Summary": "UltraTech Cement announced its quarterly results with consolidated net sales of Rs. 15,308 crores compared to Rs. 15,735 crores in the previous year. Profit after tax declined to Rs. 820 crores from Rs. 1,281 crores year-over-year. The company achieved 68% capacity utilization and domestic sales volume grew 3% despite heavy rains. Energy costs decreased 14% while raw material costs increased 1%. UltraTech raised US$500 million through a sustainability-linked loan and completed acquisition of 25% stake in RAKW, increasing total shareholding to 54.79%. The company received multiple GST orders from various authorities with demands totaling several crores, which it plans to contest. CRISIL reaffirmed UltraTech's AAA/Stable/A1+ ratings while withdrawing rating on Rs. 250 crore redeemed debentures. The company granted stock options to employees under its ESOP schemes and continues expansion plans targeting over 200 MTPA cement capacity.",
            "Sentiment": "neutral",
            "PublishDate": 1761623076828,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement Reports 31 Million Tons Sales in Q2 FY26, Announces 22.8 Million Tons Expansion Plan",
            "Summary": "UltraTech Cement sold over 31 million tons of cement in Q2 FY26 despite heavy rains. The company reported varied growth rates: 22.3% excluding ICL and Kesoram from base, 9.6% excluding India Cements, and 6.8% with both acquisitions included. UltraTech brand specifically grew 13.2% year-on-year, with rural markets delivering 13% growth. The company's existing 166.76 million ton capacity assets achieved EBITDA of INR966 per metric ton, while India Cements delivered INR386 per ton and Kesoram assets INR755 per ton. Higher costs impacted performance, including 617 kiln shutdown days versus 207 last quarter, INR50 crores additional advertising spend, and INR94 crores increased staff costs, totaling approximately INR200 per ton impact. UltraTech announced a 22.8 million ton capacity expansion (18 million tons for North, 4.8 million tons for West) to be completed by fiscal 2029, funded largely through internal accruals. The company expects to reach 200 million tons capacity by fiscal year-end and targets 65% green power mix. Brand conversion progress shows India Cements at 31% and Kesoram at 55% transition to UltraTech branding, expected to complete by June 2026.",
            "Sentiment": "positive",
            "PublishDate": 1761556251521,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Forecasts 6-7% Industry Growth This Year",
            "Summary": "UltraTech Cement expects the cement industry to grow 6-7% this year. The company estimates growth of 4.5-5% for the second quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760930280105,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Reports Strong Q2 Performance with 75.7% Jump in Net Profit",
            "Summary": "UltraTech Cement delivered robust quarterly results with consolidated net profit rising to 12.3 billion rupees from 7 billion rupees year-on-year. Revenue increased to 196 billion rupees compared to 162.9 billion rupees in the same period last year. EBITDA grew significantly to 30.95 billion rupees from 20.18 billion rupees year-on-year. The company's EBITDA margin expanded to 15.79% from 12.91% in the previous year period, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1760918865846,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Makes Earnings Call Audio Recording Available on Website",
            "Summary": "UltraTech Cement has made the audio recording of its earnings call for the quarter ended September 30, 2025, available on its website at https://www.ultratechcement.com/investors/financials. The earnings call was held on October 18, 2025, and covered the financial results of the company and its subsidiaries for the quarter. The company notified BSE Limited, National Stock Exchange of India Limited, Luxembourg Stock Exchange, and Singapore Exchange about the availability of the recording.",
            "Sentiment": "neutral",
            "PublishDate": 1760789870251,
            "Source": "corporate_action"
        },
        {
            "Title": "Ultratech Cement Announces ₹10,255 Crore Capacity Expansion Plan",
            "Summary": "Ultratech Cement announced a ₹10,255 crore investment plan to increase its manufacturing capacity to 240.7 million tonnes, expected to be operational by March 2028. The company's production capacity was 183.4 million tonnes at the end of March 2025. Chairman Kumar Mangalam Birla noted this expansion follows over ₹50,000 crore invested in the past five years. The investment will add 22.8 million tonnes to the production capacity of cement manufacturers in the group, including India Cements, which Ultratech acquired in December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1760778183333,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Reports 21% Revenue Growth in Q2FY26 with Strong Operational Performance",
            "Summary": "UltraTech Cement's Board approved quarterly results for the quarter and half year ended September 30, 2025. Consolidated net sales reached Rs. 19,371 crores versus Rs. 15,967 crores in the corresponding previous period, marking 21.3% growth. Profit after tax increased to Rs. 1,232 crores from Rs. 703 crores. The company achieved 22.3% growth in domestic grey cement volumes, significantly exceeding expected industry growth of around 5%. Operating EBITDA per ton for existing UltraTech assets stood at Rs. 966 per ton. Energy costs decreased 7% year-on-year while raw material costs rose 5% due to increased flyash and slag costs. UltraTech's domestic grey cement capacity is 186.86 mtpa on consolidated basis, with global capacity at 192.26 mtpa including overseas operations. The company transitioned to GST 2.0 from September 22, 2025, passing full benefit of reduced GST rates to customers. During the quarter, UltraTech operationalized a 7.5 MW round-the-clock hybrid renewable energy project and commenced 9 MW of WHRS capacity, bringing total WHRS capacity to 369 MW.",
            "Sentiment": "positive",
            "PublishDate": 1760776721747,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Sees Rs. 78.52 Crore Block Trade on NSE",
            "Summary": "UltraTech Cement executed a block trade worth Rs. 78.52 crores on the National Stock Exchange. The transaction involved approximately 64,581 shares at a price of Rs. 12,158.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759813871873,
            "Source": "order&deals"
        },
        {
            "Title": "UltraTech Cement Wins Tax Appeal Without Major Financial Impact",
            "Summary": "UltraTech Cement has successfully won an appeal against a tax demand. The company indicated that this legal victory will not have a major financial effect on its operations.",
            "Sentiment": "positive",
            "PublishDate": 1756388533763,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Approves Sale of 6.49% Stake in The India Cements Through Stock Exchange",
            "Summary": "UltraTech Cement has approved the sale of its 6.49% stake in The India Cements through a stock exchange offer. The company describes this move as part of a strategic portfolio realignment.",
            "Sentiment": "neutral",
            "PublishDate": 1755685094288,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement to Reach 200 MTPA Capacity by End of Fiscal Year, One Year Ahead of Schedule",
            "Summary": "UltraTech Cement will cross the 200 million tonnes per annum capacity milestone by the end of this fiscal year, achieving its target one year ahead of the earlier FY27 timeline. Chairman Kumar Mangalam Birla announced this at the company's Annual General Meeting, positioning UltraTech as the largest cement-selling company globally outside China. The company added 42.6 MTPA of capacity in FY25 through 16.3 MTPA organic expansion and 26.3 MTPA via acquisitions, including stakes in India Cements and Kesoram Industries' cement business. As of March 2025, consolidated capacity stood at 188.8 MTPA. Birla noted India's projected GDP growth of 6.5% in FY25 and highlighted the March quarter's 7.4% growth driven by construction and manufacturing. UltraTech shares closed 0.7% higher at Rs 12,855.70 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1755662616610,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Allocates Rs 10,000 Crore Capex for FY26 Amid Capacity Expansion Drive",
            "Summary": "UltraTech Cement has allocated up to Rs 10,000 crore as capex for fiscal 2026 to enhance capacity and energy efficiency initiatives, expecting around 7% growth. The company crossed Rs 75,000 crore revenue in fiscal 2025 and is approaching 200 MTPA capacity. UltraTech recently acquired India Cements and Kesoram Industries' cement business, adding 26.3 MTPA grey cement capacity, and plans organic capacity addition of 28.8 MTPA by fiscal 2027. The net debt to Ebitda ratio rose to 1.33x in March 2025, but management anticipates reduction through higher volume growth and improving margins. Cement demand moderated to 4-5% in fiscal 2024-25 due to temporary slowdown in government infrastructure spending and prolonged monsoon, but is expected to rebound to 6-7% in fiscal 2025-26. The company added 42.6 MTPA consolidated grey cement capacity in fiscal 2025, reaching total capacity of 188.8 MTPA. India Cements achieved Ebitda break-even in March 2025 quarter after efficiency improvements. UltraTech faces competition from Ambuja Cements, which crossed 100 MTPA capacity and aims to reach 118 MTPA by FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1753699335263,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Reports 9.7% Volume Growth in Q1 FY26, India Cements Integration Progresses",
            "Summary": "UltraTech Cement achieved consolidated volume growth of 9.7% year-on-year in Q1 FY26, including Kesoram in both periods. The company sold 34.64 million tons during the quarter, with India Cements contributing 2.18 million tons. UltraTech brand specifically grew 6.5% year-on-year. Cement prices increased 2.2% sequentially, with South and East regions showing maximum gains. The company is progressing with India Cements integration, which recorded EBITDA of INR400 per ton after accounting for limestone royalty of INR160 per ton in Tamil Nadu. Management expects to achieve over INR1,000 per ton EBITDA for India Cements by FY28 through capex programs including WHRS, speed modifications, and renewable energy installations. The company targets double-digit volume growth for the full year and plans capex of approximately INR10,000 crores in FY26. Finance costs decreased with average borrowing cost at 7%. Building products revenue grew to INR275 crores from INR185 crores in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753360067207,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Expects Strong Volume Growth in FY26, Plans India Cements Integration by FY28",
            "Summary": "UltraTech Cement expects significant volume growth in FY26 that will outpace industry trends. The company plans to complete the brand transition from India Cements to UltraTech by the end of FY27. UltraTech aims to align India Cements' costs with its own operations by FY28 following planned investments. India Cements targets achieving EBITDA per tonne of over Rs. 1,000 by FY28. The company also plans to enhance recycling operations at India Cements and increase green power usage from 3% to 86% by FY28 to reduce carbon emissions.",
            "Sentiment": "positive",
            "PublishDate": 1753154605732,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Reports Strong Q1 FY26 Results with 9.7% Volume Growth and 49% PAT Jump",
            "Summary": "UltraTech Cement Limited announced its Q1 FY26 financial results with consolidated sales volumes reaching 36.83 million tonnes, growing 9.7% year-on-year. Consolidated net sales stood at Rs. 21,040 crores versus Rs. 18,626 crores in the previous year. Profit before interest, depreciation and tax increased 44% to Rs. 4,591 crores, while profit after tax jumped 49% to Rs. 2,226 crores. The company successfully turned around India Cements performance, generating EBITDA of Rs. 92 crores compared to a loss of Rs. 9 crores last year. Energy costs decreased 12% year-on-year due to reduced fuel prices, while raw material costs rose marginally by 2%. UltraTech increased its grey cement capacity by 3.5 mtpa during the quarter, bringing total capacity to 192.26 mtpa. The Board also approved the appointment of Deloitte Haskins and Sells LLP as Joint Statutory Auditor and appointed Mr. V. Chandrasekaran as an independent director.",
            "Sentiment": "positive",
            "PublishDate": 1753101768199,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Executive Expects Accelerated Growth in Coming Quarters",
            "Summary": "A company executive from UltraTech Cement has expressed expectations for faster growth in the upcoming quarters. No specific details about the growth drivers, financial metrics, or timeline were provided in the available information.",
            "Sentiment": "positive",
            "PublishDate": 1753098076420,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Reports Price Increases in July, Southern Markets Lead Growth",
            "Summary": "UltraTech Cement experienced price increases in July compared to June, with southern markets showing particularly strong price growth during this period.",
            "Sentiment": "positive",
            "PublishDate": 1753095779073,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Reports 9.7% Volume Growth with Profit Rising 31% in Latest Quarter",
            "Summary": "UltraTech Cement reported consolidated volume growth of 9.7% year-on-year, falling short of analyst expectations of low to mid-teen growth. Net profit reached ₹2,226 crore, up 31.33% from ₹1,695 crore in the previous year, though slightly below the estimated ₹2,290 crore. Revenue grew 17.7% to ₹21,275 crore from ₹18,070 crore, marginally missing the projected ₹21,680 crore. EBITDA surged 45% to ₹4,410 crore with margins expanding 388 basis points to 20.7%. Following the earnings announcement, shares traded 0.30% lower at ₹12,461, though the stock has gained 9% over the past month.",
            "Sentiment": "neutral",
            "PublishDate": 1753087518778,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Reports Strong Q1 Performance with Revenue Up 18% and Capacity Expansion",
            "Summary": "UltraTech Cement delivered robust quarterly results with revenue rising to 213 billion rupees from 180.7 billion rupees year-over-year, slightly below estimates of 215.7 billion rupees. Consolidated net profit increased significantly to 22.3 billion rupees from 17 billion rupees, surpassing estimates of 20.5 billion rupees. EBITDA jumped to 44 billion rupees from 30.39 billion rupees, exceeding estimates of 42.25 billion rupees. EBITDA margin improved to 20.73% from 16.82% year-over-year, beating estimates of 19.6%. The company expanded its grey cement capacity by 3.5 MTPA during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753086322203,
            "Source": "stock"
        },
        {
            "Title": "UltraTech Cement Q1 Results Preview: Analysts Expect Strong Volume Growth and Double-Digit Revenue Jump",
            "Summary": "UltraTech Cement, India's largest cement producer with 192.26 MTPA capacity, is set to announce quarterly results. Bloomberg estimates project 19% revenue growth to Rs 21,506 crore and 20.5% EBITDA growth to Rs 4,408.65 crore. Multiple analysts remain bullish, with Citi expecting 9-14% volume growth for FY26 and capacity addition of 12.4mt. Elara Capital and Jefferies have named UltraTech as a top pick. Morgan Stanley expects 7% volume growth while Jefferies forecasts 33-45% YoY EBITDA growth. Nuvama expects 18% YoY grey cement volume growth aided by acquisitions, including India Cements. The Indian cement industry anticipates robust growth driven by government infrastructure spending and housing demand, though early monsoon and input cost volatility may impact pricing.",
            "Sentiment": "positive",
            "PublishDate": 1753001921920,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Schedules Q1 Results Announcement for July 21",
            "Summary": "UltraTech Cement, India's largest cement producer with 192.26 million tonnes per annum production capacity, will announce its first quarter results on July 21. The Aditya Birla Group company will hold a board meeting to approve standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, followed by an earnings call at 4 p.m. The trading window for designated persons remains closed from July 1 to July 23. In the previous quarter, the company reported a 9.57% year-on-year increase in consolidated net profit to Rs 2,474.79 crore, with total income rising 12.7% to Rs 23,165.45 crore. UltraTech shares have gained 9.44% in the past month and 17.63% over six months, closing at Rs 12,498 on Friday.",
            "Sentiment": "neutral",
            "PublishDate": 1752929029411,
            "Source": "earnings"
        },
        {
            "Title": "UltraTech Cement Ltd.: Rs. 57.32 Crores Block Trade on NSE",
            "Summary": "A block trade of UltraTech Cement Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 46,092 shares at a price of Rs. 12,437.00 per share, totaling Rs. 57.32 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1752033284000,
            "Source": "block_details"
        },
        {
            "Title": "Ultratech Cement Denies Reports of Cement Cartel Investigation",
            "Summary": "Ultratech Cement has denied reports of an investigation into a cement cartel case. The company stated that it has not received any order from the Competition Commission of India (CCI) regarding this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1751857745000,
            "Source": "default"
        }
    ]
}