{
    "Symbol": "UMAEXPORTS",
    "ISIN": "INE0GIU01018",
    "News": [
        {
            "Title": "Uma Exports Acquires Swastik Oil Refinery for ₹14.67 Cr",
            "Summary": "Uma Exports Limited completes acquisition of Swastik Oil Refinery Private Limited for ₹14.67 crore through NCLT-approved resolution plan, marking entry into FMCG edible oil manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1770387736206,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uma Exports Forms Real Estate Partnership with Multicon",
            "Summary": "Uma Exports Limited announces board decision to enter into Limited Liability Partnership with Multicon Residences LLP for real estate and construction activities with 50% capital contribution of ₹50,000.",
            "Sentiment": "positive",
            "PublishDate": 1767696228020,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uma Exports Reports Mixed Quarterly Performance with Standalone Loss and Consolidated Profit",
            "Summary": "Uma Exports Limited reported a standalone net loss of Rs 123.03 lakhs for the quarter ended September 30, 2025, while achieving a consolidated net profit of Rs 43.24 lakhs for the same period. The company's revenue from operations reached Rs 40,559.57 lakhs on standalone basis and Rs 40,521.51 lakhs on consolidated basis, with results approved by the Board of Directors on November 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763147099349,
            "Source": "earnings"
        },
        {
            "Title": "Uma Exports Reports Standalone Net Profit of Rs 25.08 Lakhs for Q1 FY2026",
            "Summary": "Uma Exports Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 29,996.05 lakhs compared to Rs 36,986.47 lakhs in the same quarter last year. Net profit after tax stood at Rs 25.08 lakhs versus Rs 461.41 lakhs in the corresponding quarter. Basic earnings per share was Rs 0.07 compared to Rs 1.36 in the previous year quarter. On a consolidated basis, net profit after tax was Rs 43.23 lakhs against Rs 647.85 lakhs in the same quarter last year, with basic EPS of Rs 0.13 versus Rs 1.92. The company operates in the agri products segment and has subsidiaries including UEL International FZE, Graincomm Australia Pty Ltd, Pakhi Commercial Private Limited, and Swastik Oil Refinery Private Limited.",
            "Sentiment": "negative",
            "PublishDate": 1755091531422,
            "Source": "earnings"
        }
    ]
}