{
    "Symbol": "UMIYA-MRO",
    "ISIN": "INE398B01018",
    "News": [
        {
            "Title": "Umiya Buildcon: Promoter Acquires Additional Shares",
            "Summary": "Umiya Holding Private Limited, a promoter entity, acquired 1,000 additional shares in Umiya Buildcon Limited through open market purchase on February 10, 2026, maintaining its 38.01% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1770784820789,
            "Source": "co_actions_results"
        },
        {
            "Title": "Umiya Buildcon: Promoter Acquires Additional Shares",
            "Summary": "Umiya Holding Private Limited, promoter of Umiya Buildcon Limited, acquired 6,000 additional shares through open market purchase, increasing its stake from 37.84% to 37.87% as per SEBI disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1770108424992,
            "Source": "co_actions_results"
        },
        {
            "Title": "Umiya Holding Increases Stake in Umiya Buildcon",
            "Summary": "Umiya Holding Private Limited acquired additional 20,000 shares in Umiya Buildcon Limited through open market purchase, increasing its shareholding from 37.67% to 37.78%.",
            "Sentiment": "neutral",
            "PublishDate": 1769241795565,
            "Source": "co_actions_results"
        },
        {
            "Title": "Umiya Buildcon Board Meet on Jan 20 for Q3 Results",
            "Summary": "Umiya Buildcon Limited has scheduled its 6th board meeting for FY26 on January 20, 2026, to consider and approve unaudited financial results for Q3 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768390593771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 1,200 additional shares of Umiya Buildcon Limited through open market purchase, increasing its shareholding from 37.66% to 37.67%. The acquisition represents a marginal 0.006% increase in the promoter group's voting rights in the real estate company listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1765199371361,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 4,100 shares of Umiya Buildcon Limited through open market purchase, increasing its shareholding from 37.65% to 37.66%. The acquisition represents a minimal increase of 0.005% in the promoter group's voting rights in the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1764912004744,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Acquires Additional 4,100 Shares in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited acquired 4,100 shares of Umiya Buildcon Limited through open market purchase, maintaining its shareholding at 37.64% of the company's total voting capital. The acquisition was disclosed under SEBI takeover regulations, with the promoter group's total holding reaching 70,33,316 shares out of 1,86,84,602 total equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764599580214,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Buildcon Appoints Prabhugouda Biradar as Chief Technology Officer",
            "Summary": "Umiya Buildcon Limited appointed Mr. Prabhugouda Biradar as Chief Technology Officer effective December 1, 2025, bringing over 30 years of experience from senior roles at Philips, Cisco Systems, and Huawei. The strategic appointment aims to strengthen the company's Research & Development capabilities, accelerate indigenous telecom product development, and enhance its Make in India technology initiatives in the networking and telecom sector.",
            "Sentiment": "positive",
            "PublishDate": 1764579989215,
            "Source": "corporate_governance"
        },
        {
            "Title": "Umiya Holding Private Limited Acquires Additional Shares in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 4,500 additional shares of Umiya Buildcon Limited through open market purchase on November 27, 2025. The acquisition increased their shareholding from 37.62% to 37.63% in the company listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1764312689495,
            "Source": "stock"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited acquired 3,300 additional shares in Umiya Buildcon Limited, increasing its shareholding from 37.60% to 37.61% of the total voting capital. The acquisition represents a minimal increase of 0.01% in the promoter group's holding in the BSE and NSE-listed company.",
            "Sentiment": "neutral",
            "PublishDate": 1763990697287,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Acquires Additional 1,000 Shares in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 1,000 additional shares in Umiya Buildcon Limited on November 20, 2025, maintaining its shareholding at 37.60% of the company's total voting capital. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares, with the target company's equity share capital remaining at 1,86,84,602 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763704196375,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 1,000 additional shares in Umiya Buildcon Limited (formerly MRO-TEK Realty Limited) on November 17, 2025. The acquisition increased their shareholding from 37.57% to 37.58%, representing a minimal 0.01% increase in their voting rights in the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1763388054767,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 2,100 shares of Umiya Buildcon Limited on November 13, 2025, increasing its shareholding from 37.55% to 37.56%. The acquisition represents a minimal 0.01% increase in voting rights in the real estate company listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763099957931,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited acquired 1,500 shares of Umiya Buildcon Limited (formerly MRO-TEK Realty Limited) on November 11, 2025. The acquisition increased Umiya Holding's shareholding from 70,07,716 shares (37.52%) to 70,09,216 shares (37.53%) of the total share capital. Umiya Holding Private Limited belongs to the promoter group of the target company. The shares are listed on BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The total equity share capital of Umiya Buildcon Limited remains unchanged at 1,86,84,602 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762920674580,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 1,500 additional shares of Umiya Buildcon Limited (formerly MRO-TEK Realty Limited) through open market transactions on November 7, 2025. The acquisition increased the promoter group's shareholding from 70,06,216 shares (37.51%) to 70,07,716 shares (37.52%) in the target company. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The company's total equity share capital remains unchanged at 1,86,84,602 shares before and after the acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1762579849596,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Acquires Additional Shares in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited acquired 1,500 additional shares in Umiya Buildcon Limited (formerly MRO-TEK Realty Limited) on November 6, 2025. The acquisition increased Umiya Holding's stake from 37.50% to 37.51% of the total share capital. Before the acquisition, Umiya Holding held 70,04,716 shares, and after the purchase, their holding increased to 70,06,216 shares. Umiya Holding belongs to the promoter group of the target company. The total equity share capital of Umiya Buildcon remains at 1,86,84,602 shares. The company is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO).",
            "Sentiment": "neutral",
            "PublishDate": 1762491719391,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 3,200 additional shares of Umiya Buildcon Limited through open market transactions on November 4, 2025. The acquisition increased their shareholding from 70,01,516 shares (37.48%) to 70,04,716 shares (37.50%) in the target company. Umiya Buildcon Limited trades on BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO) with a total equity share capital of 1,86,84,602 shares. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1762402672053,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 5,000 additional shares of Umiya Buildcon Limited through open market transactions on October 31, 2025. The acquisition increased their shareholding from 69,96,516 shares (37.45%) to 70,01,516 shares (37.48%) in the target company. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The company's total equity share capital remains at 1,86,84,602 shares. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1761972229141,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 4,401 additional shares of Umiya Buildcon Limited through open market purchase on October 24, 2025. The acquisition increased Umiya Holding's shareholding from 69,92,115 shares (37.43%) to 69,96,516 shares (37.45%) in the target company. Umiya Buildcon, formerly known as MRO-TEK Realty Limited, is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The company's total equity share capital remains at 1,86,84,602 shares. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1761367623143,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 1,000 additional shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 69,91,115 shares (37.42%) to 69,92,115 shares (37.43%) of the company's total equity share capital of 1,86,84,602 shares. The transaction was completed on October 21, 2025. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO).",
            "Sentiment": "neutral",
            "PublishDate": 1761193898387,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Buildcon Reports Positive Quarterly Performance, Secures Land Allotment for New Manufacturing Plant",
            "Summary": "Umiya Buildcon Limited's Chairman and Managing Director presented a performance update to the Board of Directors on October 15, 2025, expressing satisfaction with the company's quarterly and half-yearly results. The company received final land allotment from the Government of Karnataka to establish a new state-of-the-art electronics manufacturing facility with a dedicated R&D center. Additionally, Umiya Buildcon launched MRO-TEK CORNUS Family 1G Switches, indigenous Layer-2 Gigabit switches with over 65% local content, designed for telecom operators, railways, industrial networks, and surveillance systems. The switches feature the company's proprietary MRO-OS and comply with RDSO and TEC standards. The Chairman emphasized the company's focus on operational excellence, innovative construction techniques, and expanding market presence while supporting India's Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1760515351551,
            "Source": "stock"
        },
        {
            "Title": "Umiya Buildcon Reports Strong Q2 Performance with 333% Jump in Net Profit",
            "Summary": "Umiya Buildcon Limited reported net profit of Rs 585.86 lakhs for the quarter ended September 30, 2025, compared to Rs 135.33 lakhs in the same period last year. Total income reached Rs 1,686.54 lakhs versus Rs 1,352.55 lakhs in the previous year quarter. For the six-month period, net profit surged to Rs 3,725.08 lakhs from Rs 300 lakhs in the corresponding period. The company's other income included a significant profit of Rs 4,041.95 lakhs from the sale of property at Electronic City, Bangalore during the June 2025 quarter. Basic earnings per share for continuing operations stood at Rs 3.14 for the quarter. The company operates in three business segments: Products, Real Estate Development, and Solutions. The board had previously decided to discontinue Electronic Contract Manufacturing Services operations in January 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760508464932,
            "Source": "earnings"
        },
        {
            "Title": "Umiya Buildcon Promoter Shareholding Increases to 64.18% in Q2 FY2026",
            "Summary": "Umiya Buildcon Limited reported an increase in promoter shareholding during the second quarter of FY 2025-26. Promoter stake rose from 60.95% (11,387,864 shares) as of June 30, 2025, to 64.18% (11,992,654 shares) as of September 30, 2025, through the acquisition of 604,790 shares from the open market. The company has scheduled its 4th board meeting for October 15, 2025, to consider and approve unaudited financial results for the quarter ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759497670123,
            "Source": "stock"
        },
        {
            "Title": "Umiya Buildcon Secures 1-Acre Land Allotment for INR 26 Crore Manufacturing Facility in Karnataka",
            "Summary": "Umiya Buildcon Limited has received approval from the Government of Karnataka for a 1-acre land allotment in Adinarayana Hosahalli 2nd Phase Industrial Area, Bangalore Rural District. The company plans to establish an advanced manufacturing facility for data communication and networking products with an estimated investment of over INR 26 Crores. The facility will manufacture network and telecom gear with next-generation technologies to support India's Make in India initiative. The project is expected to create direct and indirect employment opportunities for over 150 individuals. The location offers established infrastructure including assured water and power supply, and is situated near Foxconn's iPhone manufacturing facility. The company's focus areas include deploying automated manufacturing lines, establishing an in-house R&D center, adopting environmentally responsible operations, developing proprietary products, and creating a Center of Excellence for precision manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1758808092063,
            "Source": "stock"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 1,100 additional shares of Umiya Buildcon Limited through open market purchase. The acquisition increased their shareholding from 69,90,015 shares (37.41%) to 69,91,115 shares (37.42%). The transaction was completed on September 24, 2025. Umiya Buildcon Limited trades on BSE under scrip code 532376 and on NSE under symbol UMIYA-MRO. The company's total equity share capital remains at 1,86,84,602 shares after the acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1758781051955,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 1,600 additional shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 69,87,415 shares (37.39%) to 69,89,015 shares (37.40%) of the company's total equity share capital of 1,86,84,602 shares. The shares were acquired on September 22, 2025. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1758607459710,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 3,589 additional shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 69,75,951 shares (37.33%) to 69,79,540 shares (37.35%) of the company's total equity share capital of 1,86,84,602 shares. The transaction was completed on September 17, 2025, and was disclosed under SEBI regulations for substantial acquisition of shares. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO).",
            "Sentiment": "neutral",
            "PublishDate": 1758163856693,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 2,100 additional shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 69,73,851 shares (37.32%) to 69,75,951 shares (37.33%) of the company's total equity share capital of 1,86,84,602 shares. The transaction was completed on September 16, 2025, and disclosed under SEBI regulations for substantial acquisition of shares. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO).",
            "Sentiment": "neutral",
            "PublishDate": 1758083420282,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 5,050 additional shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 69,68,801 shares (37.29%) to 69,73,851 shares (37.32%). The shares were acquired on September 15, 2025. Umiya Buildcon Limited, formerly known as MRO-TEK Realty Limited, has an equity share capital of 1,86,84,602 shares and is listed on BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1757944342999,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 5,495 shares of Umiya Buildcon Limited through open market transactions. The acquisition increased Umiya Holding's shareholding from 69,63,306 shares (37.26%) to 69,68,801 shares (37.29%) of the total voting capital. Umiya Holding Private Limited is part of the promoter group of Umiya Buildcon Limited. The company has an equity share capital of 1,86,84,602 shares and is listed on BSE and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757932176628,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 5,738 shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 69,40,123 shares (37.13%) to 69,45,861 shares (37.16%). The transaction was completed on September 8, 2025. Umiya Buildcon Limited, formerly known as MRO-TEK Realty Limited, has shares listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The company's total equity share capital remains at 1,86,84,602 shares after the acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1757410545980,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 3,650 shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 68,55,792 shares (36.69%) to 68,59,442 shares (36.71%) of the total voting capital. Umiya Holding Private Limited is part of the promoter group of Umiya Buildcon Limited. The company has equity share capital of 1,86,84,602 shares and is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The acquisition was completed and disclosed under SEBI substantial acquisition regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1756130742242,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Acquires Additional Shares in Umiya Buildcon Limited",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 1,750 additional shares in Umiya Buildcon Limited (formerly MRO-TEK Realty Limited) through open market purchase. The acquisition increased their shareholding from 68,54,042 shares (36.68%) to 68,55,792 shares (36.69%) of the total equity share capital of 1,86,84,602 shares. The transaction was completed on August 22, 2025. Umiya Buildcon Limited is listed on BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO).",
            "Sentiment": "neutral",
            "PublishDate": 1756108035157,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Buildcon Signs MoU with A2000 Solutions for Drone Training Labs Under Tamil Nadu Technology Initiative",
            "Summary": "Umiya Buildcon Limited has signed a Memorandum of Understanding with A2000 Solutions Private Limited to develop structured drone training labs and expand into UAV technology. The partnership operates under the Tamil Nadu Future Technology Hubs (TNFTH) initiative, which aims to position Tamil Nadu as a global hub for next-generation technology and skilled talent. TNFTH is described as potentially Asia's first integrated hub uniting seven emerging technologies: Artificial Intelligence, Cyber security, Drone technology, Electric Vehicles, Internet of Things & sensors, 5G, and Enterprise Resource Planning. The initiative plans to establish hubs across 10 key locations in Tamil Nadu, starting with Tirunelveli. The training programs are designed to meet workforce needs across industries where drones are becoming essential. The partnership represents Umiya Buildcon's strategic expansion into next-generation technologies beyond its current dual-sector operations.",
            "Sentiment": "positive",
            "PublishDate": 1755869689090,
            "Source": "stock"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 2,000 additional shares of Umiya Buildcon Limited through open market transactions on August 18, 2025. The acquisition increased their shareholding from 68,43,171 shares (36.63%) to 68,45,171 shares (36.64%) of the total equity share capital of 1,86,84,602 shares. The company is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1755596525985,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 1,468 shares of Umiya Buildcon Limited through open market purchase. The acquisition increased Umiya Holding's shareholding from 68,41,703 shares (36.62%) to 68,43,171 shares (36.63%) of the total voting capital. Umiya Holding belongs to the promoter group of Umiya Buildcon Limited. The shares were acquired on August 14, 2025. Umiya Buildcon Limited is listed on BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO) with a total equity share capital of 1,86,84,602 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1755495263795,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 3,721 additional shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 68,32,382 shares (36.57%) to 68,36,103 shares (36.59%) of the company's total equity capital of 1,86,84,602 shares. The transaction was completed on August 12, 2025. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The disclosure was signed by Aniruddha Bhanuprasad Mehta, Director of Umiya Holding Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755059616750,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited acquired 8,221 shares of Umiya Buildcon Limited (formerly MRO-TEK Realty Limited) through open market transactions. The acquisition increased Umiya Holding's shareholding from 68,24,161 shares (36.53%) to 68,32,382 shares (36.57%) of the total equity share capital. Umiya Holding Private Limited is part of the promoter group of Umiya Buildcon Limited. The company's shares are listed on BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The total equity share capital of Umiya Buildcon Limited remains at 1,86,84,602 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754972382353,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited to 36.53%",
            "Summary": "Umiya Holding Private Limited acquired 3,710 additional shares of Umiya Buildcon Limited (formerly MRO-TEK Realty Limited) through open market purchases. The acquisition increased Umiya Holding's shareholding from 68,20,451 shares (36.51%) to 68,24,161 shares (36.53%) of the total voting capital. The transaction represents a 0.02% increase in ownership. Umiya Holding Private Limited is part of the promoter group of Umiya Buildcon Limited. The company's shares are listed on BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The total equity share capital of Umiya Buildcon Limited remains at 1,86,84,602 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754887173634,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 14,255 shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 68,06,196 shares (36.43%) to 68,20,451 shares (36.51%) of the total equity share capital. The shares were acquired on August 7, 2025. Umiya Buildcon Limited, formerly known as MRO-TEK Realty Limited, has a total equity share capital of 1,86,84,602 shares and is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1754641951570,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited Through Open Market Purchase",
            "Summary": "Umiya Holding Private Limited, a promoter entity, acquired 16,500 additional shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 67,89,696 shares (36.34%) to 68,06,196 shares (36.43%) of the company's total voting capital. The shares were acquired on August 6, 2025. Umiya Buildcon Limited, formerly known as MRO-TEK Realty Limited, is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The company's total equity share capital remains at 1,86,84,602 shares after the acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1754484722035,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon to 36.34%",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 13,800 additional shares of Umiya Buildcon Limited through open market purchases. The acquisition increased their shareholding from 67,75,896 shares (36.27%) to 67,89,696 shares (36.34%) of the total voting capital. The shares were acquired on August 5, 2025. Umiya Buildcon Limited was formerly known as MRO-TEK Realty Limited and is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The company's total equity share capital remains at 1,86,84,602 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754456712216,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon to 36.27%",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 22,080 additional shares of Umiya Buildcon Limited through open market purchases. The acquisition increased their shareholding from 67,53,816 shares (36.15%) to 67,75,896 shares (36.27%) of the total voting capital. The shares were acquired on August 4, 2025. Umiya Buildcon's total equity share capital remains at 1,86,84,602 shares. The company trades on BSE under scrip code 532376 and on NSE as UMIYA-MRO.",
            "Sentiment": "neutral",
            "PublishDate": 1754367752498,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon to 36.08%",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 30,320 additional shares in Umiya Buildcon Limited through open market purchases. The acquisition increased their shareholding from 35.92% to 36.08% of the company's total voting capital. The transaction was completed on July 31, 2025, representing 0.16% of Umiya Buildcon's total equity share capital of 1,86,84,602 shares. Umiya Buildcon is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO).",
            "Sentiment": "neutral",
            "PublishDate": 1754022820521,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon to 35.92%",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 20,861 additional shares of Umiya Buildcon Limited through open market purchases. The acquisition increased their shareholding from 35.81% to 35.92% of the company's total voting capital. The shares were acquired on July 30, 2025, with Umiya Buildcon's total equity share capital remaining at 1,86,84,602 shares. The company trades on BSE under scrip code 532376 and on NSE as UMIYA-MRO.",
            "Sentiment": "neutral",
            "PublishDate": 1753930911944,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited to 35.81%",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 24,650 additional shares in Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 66,65,109 shares (35.68%) to 66,89,759 shares (35.81%) of the company's total equity share capital of 1,86,84,602 shares. The shares were acquired on July 29, 2025. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO).",
            "Sentiment": "neutral",
            "PublishDate": 1753850113958,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon to 35.68%",
            "Summary": "Umiya Holding Private Limited, a promoter group entity, acquired 25,740 shares of Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 66,39,369 shares (35.54%) to 66,65,109 shares (35.68%) of the company's total equity share capital of 1,86,84,602 shares. The transaction was completed on July 28, 2025, and disclosed under SEBI regulations for substantial acquisition of shares. Umiya Buildcon Limited trades on BSE under scrip code 532376 and on NSE under symbol UMIYA-MRO.",
            "Sentiment": "neutral",
            "PublishDate": 1753781893697,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited to 35.43%",
            "Summary": "Umiya Holding Private Limited, a promoter entity of Umiya Buildcon Limited (formerly MRO-TEK Realty Limited), acquired 14,700 additional shares through open market transactions. The acquisition increased their shareholding from 66,04,669 shares (35.35%) to 66,19,369 shares (35.43%) of the company's total equity capital of 1,86,84,602 shares. The shares were acquired on July 24, 2025. Umiya Buildcon Limited is listed on both BSE (scrip code: 532376) and NSE (scrip code: UMIYA-MRO). The disclosure was made by Director Aniruddha Bhanuprasad Mehta under substantial acquisition regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753420816750,
            "Source": "corporate_action"
        },
        {
            "Title": "Umiya Holding Private Limited Increases Stake in Umiya Buildcon Limited to 35.17%",
            "Summary": "Umiya Holding Private Limited acquired 20,250 additional shares in Umiya Buildcon Limited through open market transactions. The acquisition increased their shareholding from 65,49,875 shares (35.06%) to 65,70,125 shares (35.17%) of the company's total equity share capital of 1,86,84,602 shares. The transaction was completed on July 21, 2025. Umiya Holding Private Limited is a promoter entity of Umiya Buildcon Limited, which was formerly known as MRO-TEK Realty Limited and is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753163566181,
            "Source": "corporate_action"
        },
        {
            "Title": "MRO-TEK Realty: Rebrands as Umiya Buildcon Limited",
            "Summary": "MRO-TEK Realty Limited has officially changed its name to Umiya Buildcon Limited effective February 18, 2025. The rebranding is part of a strategic shift to expand focus in the real estate sector while maintaining its networking product business. The MRO-TEK brand will continue for networking and electronic products, with operations through its wholly-owned subsidiary, MRO-TEK Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1740115652000,
            "Source": "corporate_action"
        }
    ]
}