{
    "Symbol": "UNICHEMLAB",
    "ISIN": "INE351A01035",
    "News": [
        {
            "Title": "Unichem Labs Q3 Profit Drops 71% to ₹180M",
            "Summary": "Unichem Laboratories reports consolidated profit before exceptional items of ₹180 million in Q3, down from ₹620 million year-over-year, with exceptional item of ₹2.75 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770284804616,
            "Source": "co_actions_results"
        },
        {
            "Title": "Unichem Lab USFDA Inspection Concludes",
            "Summary": "USFDA inspection of Unichem Laboratories' Kolhapur facility concludes with five observations but no data integrity issues identified, indicating regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1770031035996,
            "Source": "stocks"
        },
        {
            "Title": "Unichem US Unit Recalls Two Drug Products Voluntarily",
            "Summary": "Unichem Laboratories' US subsidiary voluntarily recalls Doxazosin tablets due to debossing defects and Bisoprolol combination tablets for impurity specification issues. No adverse events reported.",
            "Sentiment": "negative",
            "PublishDate": 1769510957594,
            "Source": "stocks"
        },
        {
            "Title": "Unichem Laboratories Reports Loss in Q2 2025 Due to European Commission Fine Interest",
            "Summary": "Unichem Laboratories reported a consolidated net loss of Rs 22.36 crores for the half year ended September 30, 2025, compared to a profit of Rs 26.70 crores in the same period last year. The company's consolidated revenue from operations increased to Rs 1,105.56 crores for the half year from Rs 990.70 crores previously. The loss was primarily attributed to exceptional expenses of Rs 58.26 crores related to interest on European Commission fine. The company and its subsidiary Niche Generics received a demand order from the European Commission for payment of fine and interest totaling Euro 19.55 million, which was fully settled on October 28, 2025. On a standalone basis, the company reported a net loss of Rs 41.78 crores for the half year. During the period, Unichem Ireland ceased to be a subsidiary effective April 30, 2025, resulting in a net gain of Rs 1.99 crores. The Board of Directors approved these unaudited financial statements at their meeting held on November 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762864085735,
            "Source": "earnings"
        },
        {
            "Title": "Unichem Lab Reports Mixed Q2 Results with Revenue Growth but Swings to Net Loss",
            "Summary": "Unichem Lab reported Q2 revenue of 5.79 billion rupees, up from 5.07 billion rupees year-over-year. EBITDA increased to 661 million rupees from 554 million rupees, with EBITDA margin improving to 11.43% from 10.94%. However, the company posted a consolidated net loss of 119 million rupees compared to a profit of 246 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1762846802391,
            "Source": "earnings"
        },
        {
            "Title": "Unichem Laboratories Pays €16.75 Million Fine to European Commission in Perindopril Drug Matter",
            "Summary": "Unichem Laboratories Limited has paid a fine of Euro 16,753,873.41 (including interest) to the European Commission in Brussels, Belgium related to the Perindopril drug matter. The payment was made following earlier communications from the company dated June 27, 2024 and September 18, 2025. The company notified stock exchanges NSE and BSE about this payment completion.",
            "Sentiment": "negative",
            "PublishDate": 1761700146176,
            "Source": "stock"
        },
        {
            "Title": "Unichem Lab Receives €19.49M Demand Notice from European Commission in Perindopril Case",
            "Summary": "Unichem Lab has received a €19.49 million demand notice from the European Commission related to a Perindopril case. The company has made a partial payment, leaving a balance of €16.70 million still payable.",
            "Sentiment": "negative",
            "PublishDate": 1758192474207,
            "Source": "stock"
        },
        {
            "Title": "Unichem Laboratories' US Subsidiary Recalls Mislabeled Tablets Due to Safety Concerns",
            "Summary": "Unichem Laboratories announced that its wholly-owned subsidiary Unichem Pharmaceuticals (USA) Inc. issued a voluntary nationwide recall of one lot of Cyclobenzaprine Hydrochloride Tablets USP 10 mg due to mislabeling. The bottles contained Meloxicam 7.5 mg tablets but were labeled as Cyclobenzaprine 10mg tablets. The company warned that patients unknowingly taking Meloxicam face reasonable probability of serious adverse events including cardiovascular, gastrointestinal, renal, anaphylaxis and skin reactions, particularly for those taking blood thinners or with allergies. The recalled products have lot number GMML24026A with September 2027 expiry and were distributed nationwide to distributors, retailers and consumers. The subsidiary is notifying downstream partners and consumers through third party recall provider Inmar. Unichem Laboratories shares traded 0.9% lower at ₹501.8 and have declined 32% this year.",
            "Sentiment": "negative",
            "PublishDate": 1756887054019,
            "Source": "stock"
        },
        {
            "Title": "Unichem Laboratories Receives USFDA Establishment Inspection Report Following Voluntary Inspection",
            "Summary": "Unichem Laboratories underwent an inspection by the US Food and Drug Administration (USFDA), which the company characterized as a voluntary action. The pharmaceutical company has received the Establishment Inspection Report from the regulatory authority following the completion of this inspection process.",
            "Sentiment": "neutral",
            "PublishDate": 1756200406623,
            "Source": "stock"
        },
        {
            "Title": "Unichem Lab Reports Q1 Net Loss of 105M Rupees, Revenue Rises to 5.3B Rupees",
            "Summary": "Unichem Lab reported a net loss of 105 million rupees in Q1 compared to a profit of 27 million rupees in the same period last year. Revenue increased to 5.3 billion rupees from 4.83 billion rupees year-over-year. EBITDA declined to 225 million rupees from 401 million rupees, while EBITDA margin compressed to 4.3% from 8.3% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754296206311,
            "Source": "earnings"
        },
        {
            "Title": "USFDA Inspection Results in Three Form 483 Observations for Unichem Labs' Roha API Facility",
            "Summary": "The United States Food and Drug Administration (USFDA) conducted an inspection of Unichem Labs' Active Pharmaceutical Ingredient (API) facility located in Roha. The inspection resulted in three Form 483 observations. Form 483 is issued by the USFDA when inspectors observe conditions that may constitute violations of the Food Drug and Cosmetic Act and related Acts.",
            "Sentiment": "neutral",
            "PublishDate": 1750645528000,
            "Source": "default"
        },
        {
            "Title": "Unichem Lab Reports Significant Q4 Financial Improvement",
            "Summary": "Unichem Lab has reported substantial year-over-year improvements in its Q4 financial results. The company's EBITDA increased to 837 million rupees from 216 million rupees in the previous year. The EBITDA margin rose to 14.25% from 4.71%. Revenue grew to 5.9 billion rupees from 4.6 billion rupees. Notably, the company turned a profit of 530 million rupees, compared to a loss of 1.2 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747903520000,
            "Source": "result"
        },
        {
            "Title": "Unichem Laboratories to Close UK Manufacturing Facility",
            "Summary": "Unichem Laboratories has announced the closure of its manufacturing facility in the United Kingdom. The company has described the facility as 'niche', suggesting it may not be a core part of their operations. This decision likely stems from strategic considerations to optimize their manufacturing footprint or reduce costs.",
            "Sentiment": "negative",
            "PublishDate": 1743145777000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unichem Laboratories to Transfer 100% Stake in Unichem Ireland to IPCA Laboratories",
            "Summary": "Unichem Laboratories has announced its decision to transfer its entire 100% stake in its subsidiary, Unichem Ireland, to IPCA Laboratories. This move represents a significant corporate action involving the divestment of a foreign subsidiary to another pharmaceutical company.",
            "Sentiment": "neutral",
            "PublishDate": 1743145676000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unichem Laboratories Expands API Plant Capacity",
            "Summary": "Unichem Laboratories has completed Phase I expansion of its Active Pharmaceutical Ingredients (API) plant in Pithampur. The expansion has added 210 KL capacity to the facility with an investment of Rs 200 crore.",
            "Sentiment": "positive",
            "PublishDate": 1742516542000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unichem Laboratories Completes Phase I Expansion of API Plant",
            "Summary": "Unichem Laboratories has successfully completed the first phase of expansion at its Active Pharmaceutical Ingredient (API) plant in Pithampur. This expansion has added 210 KL of capacity to the facility, with an investment of Rs 200 crore.",
            "Sentiment": "positive",
            "PublishDate": 1742469205000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unichem Laboratories' Pithampur API Facility Inspection Concludes with Four Observations",
            "Summary": "Unichem Laboratories reported that the inspection of its Active Pharmaceutical Ingredient (API) facility in Pithampur has been completed. The inspection resulted in four observations, which suggests that regulatory authorities identified some areas for improvement or compliance concerns during their review of the facility.",
            "Sentiment": "neutral",
            "PublishDate": 1740893497000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Unichem Laboratories Sells Land and Old Construction in Jogeshwari for Rs 279 Crore",
            "Summary": "Unichem Laboratories has approved the sale of approximately 3.40 acres of land and an old construction area of about 82,220 sq. ft. located in Jogeshwari. The company will receive a lump sum cash consideration of Rs 279 crore for this sale.",
            "Sentiment": "positive",
            "PublishDate": 1740815498000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unichem Laboratories Reports Significant Q3 EBITDA Growth",
            "Summary": "Unichem Laboratories has reported a substantial increase in its Q3 EBITDA, which rose to 860 million rupees from 320 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 16.14% compared to 6.87% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738828640000,
            "Source": "earnings"
        },
        {
            "Title": "Unichem Laboratories Reports Q3 Consolidated Net Profit of 580 Million Rupees",
            "Summary": "Unichem Laboratories has announced its financial results for the third quarter. The company reported a consolidated net profit of 580 million rupees, which represents a decrease from the 732 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738828466000,
            "Source": "earnings"
        },
        {
            "Title": "Unichem Laboratories: Faces ₹93.66 Crore GST Demand, Plans Appeal",
            "Summary": "Unichem Laboratories received an assessment order from CGST & CX, Thane Commissionerate, demanding ₹93.66 crore, including ₹6.59 crore interest and ₹87.07 crore penalty. The company claims the demand is not legally maintainable as taxes were paid on time and plans to appeal.",
            "Sentiment": "neutral",
            "PublishDate": 1737731983000,
            "Source": "corporate_governance"
        },
        {
            "Title": "UNICHEM LAB Reports Significant Q2 EBITDA Growth",
            "Summary": "UNICHEM LAB has reported a substantial year-over-year increase in its Q2 EBITDA, rising from 87 million rupees to 580 million rupees. The company's EBITDA margin also improved significantly, increasing from 2.11% to 12.55% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731487250000,
            "Source": "result"
        },
        {
            "Title": "Unichem Laboratories Reports Q2 Revenue Growth",
            "Summary": "Unichem Laboratories has reported a revenue of 4.6 billion rupees for the second quarter, compared to 4.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731487192000,
            "Source": "result"
        },
        {
            "Title": "Unichem Laboratories Reports Profit in Q2 FY2024",
            "Summary": "Unichem Laboratories has reported a consolidated net profit of 300 million rupees in the second quarter, compared to a loss of 245 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731487156000,
            "Source": "result"
        }
    ]
}