{
    "Symbol": "UNIDT",
    "ISIN": "INE961D01019",
    "News": [
        {
            "Title": "United Drilling Tools Board Meet on Feb 14 for Q3 Results",
            "Summary": "United Drilling Tools Limited has scheduled a board meeting on February 14, 2026, to consider Q3FY26 unaudited financial results and declare second interim dividend for FY 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1770704751492,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Drilling Tools Secures ₹1.97 Cr Export Order",
            "Summary": "United Drilling Tools receives export order worth ₹1.97 crores from Singapore-based AH&M Energy Services for supply of Leopard Dual Seal Connectors with 4-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768808243800,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Drilling Tools Wins ₹4.06 Cr ONGC Order",
            "Summary": "United Drilling Tools Limited secured a domestic order worth ₹4.06 crores from ONGC for supply of gas lift valves and side pocket mandrels, to be executed within 3-4 months.",
            "Sentiment": "positive",
            "PublishDate": 1765973260652,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Drilling Tools Secures ₹3.27 Cr Export Order",
            "Summary": "United Drilling Tools Limited receives export order worth ₹3.27 crores from Nigerian company Weafri Well Services for supply of Wireline Winch equipment to be executed within 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1765619665282,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Drilling Tools Reports 75.6% Quarter-on-Quarter Revenue Growth in Q2 FY26",
            "Summary": "United Drilling Tools Ltd announced Q2 FY26 results with revenue from operations rising 75.6% quarter-on-quarter to Rs. 5,560.18 lakhs and profit after tax increasing 96.3% to Rs. 572.38 lakhs. The company attributed the strong performance to operational efficiencies, improved capacity utilization, and disciplined cost management, while securing significant orders from Brazil and Venezuela.",
            "Sentiment": "positive",
            "PublishDate": 1763444672294,
            "Source": "earnings"
        },
        {
            "Title": "United Drilling Tools Reports Quarterly Financial Results for September 2025",
            "Summary": "United Drilling Tools Limited published its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, showing net profit of Rs. 571.53 lacs for the quarter with earnings per share of Rs. 2.81. The oil drilling equipment manufacturer's results were reviewed by the Audit Committee and approved by the Board of Directors on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763061894676,
            "Source": "earnings"
        },
        {
            "Title": "United Drilling Tools Secures ₹1.27 Crore Export Order for Gas Lift Equipment",
            "Summary": "United Drilling Tools has received an export order worth ₹1.27 crore from Union Venezuela Servicios, C.A. for gas lift equipment. The order is scheduled to be completed within 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1761898397854,
            "Source": "order&deals"
        },
        {
            "Title": "United Drilling Tools Secures First Export Order Worth ₹9.35 Lakh from Venezuelan Company",
            "Summary": "United Drilling Tools received its first export order from Union Venezuela Servicios, C.A. for gas lift valve supply valued at ₹9,34,500. The order is scheduled to be completed within two months.",
            "Sentiment": "positive",
            "PublishDate": 1760605263516,
            "Source": "order&deals"
        },
        {
            "Title": "UDT Ltd Secures First Export Order Worth Rs. 1.15 Crore from Brazil",
            "Summary": "UDT Ltd has received its first export order from Argentera Oil and Gas, Brazil, for supplying Casing Pipe with multi start Connector to Petrobras, Brazil. The order is valued at Rs. 1,14,63,572 (approximately Rs. 1.15 crore) and must be executed within 3 months. This represents an international supply contract in the oil drilling equipment sector. The company confirmed that promoters have no interest in the awarding entity and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760349393383,
            "Source": "order&deals"
        },
        {
            "Title": "United Drilling Tools Reports Q1 FY2026 Results, Declares 6% Interim Dividend and Announces Leadership Changes",
            "Summary": "United Drilling Tools Ltd. reported Q1 FY2025-26 standalone net profit of ₹291.49 lacs compared to ₹431.15 lacs in the same quarter last year. Revenue from operations stood at ₹3,166.74 lacs versus ₹5,438.25 lacs in Q1 FY2025. The company declared a 6% interim dividend of ₹0.60 per equity share with record date set for August 22, 2025. The board approved significant leadership changes including Pramod Kumar Gupta's transition from Managing Director to Non-Executive Director while continuing as Chairman, and Kanal Gupta's promotion from Whole-time Director to Managing Director. The company appointed Khitish Kumar Nayak as Additional Independent Director and scheduled its 43rd AGM for September 23, 2025. The company expects revenue growth in upcoming quarters driven by orders in hand and expected orders.",
            "Sentiment": "neutral",
            "PublishDate": 1755012491045,
            "Source": "corporate_action"
        },
        {
            "Title": "United Drilling Tools Limited Schedules Board Meeting for Q1 FY2025-26 Results and Interim Dividend Consideration",
            "Summary": "United Drilling Tools Limited has scheduled a Board of Directors meeting for August 12, 2025, at 3:30 PM at their corporate office in Noida. The board will consider and approve unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025, for FY 2025-26. The meeting will also address the declaration of a first interim dividend for FY 2025-26 on equity shares and approve the notice for the 43rd Annual General Meeting along with the Director's Report. The trading window for designated persons remains closed from July 1, 2025, and will reopen 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1754482886946,
            "Source": "corporate_action"
        },
        {
            "Title": "United Drilling Tools Limited's Statutory Auditors Resign Due to Expired Peer Review Certificate",
            "Summary": "M/s Sarupria Somani & Associates, Chartered Accountants, resigned as statutory auditors of United Drilling Tools Limited effective July 23, 2025. The auditing firm cited the expiration of their peer review certificate as the reason for resignation, stating they cannot continue as statutory auditors without a valid peer review certificate as required by SEBI regulations. The firm was appointed at the 41st Annual General Meeting held on September 26, 2023, for a term of 2 consecutive years ending at the 43rd Annual General Meeting in 2025. United Drilling Tools Limited confirmed that no concerns were raised by the auditors regarding management and no material reason was provided for the resignation beyond the expired certificate. The auditors submitted their latest audit report for FY 2024-25 on May 29, 2025, and provided a no objection certificate for the appointment of new statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1753341623342,
            "Source": "corporate_governance"
        },
        {
            "Title": "United Drilling Tools Secures New Order Worth 17.7 Crores",
            "Summary": "United Drilling Tools has received a new order valued at 17.7 crores. The news briefly mentions the company name and the order value without providing additional details about the nature of the order or its timeline.",
            "Sentiment": "positive",
            "PublishDate": 1751869626000,
            "Source": "default"
        },
        {
            "Title": "United Drilling Tools Secures ₹108 Crore Order",
            "Summary": "United Drilling Tools has received a new order valued at ₹108 crores. The news indicates a significant business development for the company, suggesting potential revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1750055608000,
            "Source": "default"
        },
        {
            "Title": "United Drilling Tools Secures 137.36 Million Rupee Order from Oil India",
            "Summary": "United Drilling Tools has been awarded a significant order worth 137.36 million rupees from Oil India. This contract represents a notable business development for the company in the oil and gas sector.",
            "Sentiment": "positive",
            "PublishDate": 1742287533000,
            "Source": "order&deals"
        },
        {
            "Title": "United Drilling Tools: Secures ₹80.84 Million Order from Oil India",
            "Summary": "United Drilling Tools Ltd (UDTL) has received an order worth ₹80.84 million from Oil India Limited for 2000 meters of Large OD Casing Pipe with connector. The equipment will be delivered over three months for Oil India's Andaman offshore exploration project.",
            "Sentiment": "positive",
            "PublishDate": 1740992411000,
            "Source": "order&deals"
        },
        {
            "Title": "United Drilling Tools Reports Significant Increase in Q3 EBITDA",
            "Summary": "United Drilling Tools has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 17 million rupees to 47 million rupees year-over-year. Additionally, the EBITDA margin expanded significantly from 5.02% to 13.6% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738932247000,
            "Source": "earnings"
        },
        {
            "Title": "United Drilling Tools Reports Slight Increase in Q3 Profit and Revenue",
            "Summary": "United Drilling Tools has announced its financial results for the third quarter. The company's net profit increased to 26 million rupees from 24 million rupees in the same period last year. Revenue also saw a modest rise, reaching 348 million rupees compared to 340 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738932236000,
            "Source": "earnings"
        },
        {
            "Title": "United Drilling Tools Secures $482,444 Order from Taiwan",
            "Summary": "United Drilling Tools has announced securing an order from the overseas market in Taiwan. The order is valued at 482,444 USD. The company currently has a market capitalization of 516 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736835739000,
            "Source": "order&deals"
        },
        {
            "Title": "United Drilling Tools Secures Order Worth ₹55 Crore",
            "Summary": "United Drilling Tools has won a new order valued at ₹55 crore. The company, which has a market capitalization of ₹536 crore, is likely to see a positive impact on its financial performance due to this significant order.",
            "Sentiment": "positive",
            "PublishDate": 1734688686000,
            "Source": "order&deals"
        },
        {
            "Title": "United Drilling Tools Secures 1.49 Billion Rupee Order from Vedanta",
            "Summary": "United Drilling Tools has received a significant order worth 1.49 billion rupees from Vedanta. This order represents a major business opportunity for United Drilling Tools and demonstrates Vedanta's confidence in the company's products or services.",
            "Sentiment": "positive",
            "PublishDate": 1733918596000,
            "Source": "order&deals"
        }
    ]
}