{
    "Symbol": "UNIENTER",
    "ISIN": "INE037A01022",
    "News": [
        {
            "Title": "Uniphos Enterprises Reports Q3 FY26 Financial Results",
            "Summary": "Uniphos Enterprises Limited announced unaudited financial results for Q3 FY26 and nine months ended December 31, 2025, showing significant other comprehensive income despite operational challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1770382789073,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uniphos Enterprises Reports Strong Q2 Performance with Rs 2,316 Crore Net Profit",
            "Summary": "Uniphos Enterprises Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a net profit of Rs 2,316 crore for the quarter, compared to a loss of Rs 73.61 crore in the previous quarter. Revenue from operations stood at Rs 585.80 crore for the quarter. Other income significantly increased to Rs 2,482.57 crore, primarily driven by dividend income of Rs 2,412.56 crore. Total comprehensive income for the period reached Rs 2,807.46 crore. The company's total assets stood at Rs 2,84,171.04 crore as of September 30, 2025. The Board of Directors approved a dividend of Rs 0.50 per equity share, which was paid on September 16, 2025. The company operates primarily in trading business in India and has no subsidiary, joint venture or associate companies.",
            "Sentiment": "positive",
            "PublishDate": 1762860452363,
            "Source": "earnings"
        },
        {
            "Title": "Uniphos Enterprises Reports Wider Net Loss Despite Revenue Growth in Q1",
            "Summary": "Uniphos Enterprises reported a net loss of 7.4 million rupees in Q1, compared to a loss of 1.42 million rupees in the same period last year. The company's revenue increased to 58 million rupees from 30.25 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755084424147,
            "Source": "earnings"
        }
    ]
}