{
    "Symbol": "UNIECOM",
    "ISIN": "INE00U401027",
    "News": [
        {
            "Title": "Unicommerce Launches Shipway Cargo SaaS Solution",
            "Summary": "Unicommerce introduces new SaaS solution 'Shipway Cargo' targeting B2B logistics market, expanding beyond parcel logistics to handle frequent B2B shipments and large deliveries.",
            "Sentiment": "positive",
            "PublishDate": 1769670269898,
            "Source": "stocks"
        },
        {
            "Title": "Unicommerce Partners Naqel Express for Saudi Logistics",
            "Summary": "Unicommerce Esolutions announces strategic partnership with Naqel Express to strengthen e-commerce logistics infrastructure in Saudi Arabia and facilitate cross-border trade operations with India.",
            "Sentiment": "positive",
            "PublishDate": 1768889037320,
            "Source": "stocks"
        },
        {
            "Title": "Unicommerce Launches Bilingual AI Voice Agent 'Catalyst'",
            "Summary": "Convertway by Unicommerce unveils 'Catalyst', a bilingual AI voice agent designed to recover abandoned checkouts and boost e-commerce conversions through real-time conversations in Hindi and English.",
            "Sentiment": "positive",
            "PublishDate": 1768464470562,
            "Source": "stocks"
        },
        {
            "Title": "Moxie Beauty Partners With Unicommerce eSolutions",
            "Summary": "Moxie Beauty has partnered with Unicommerce eSolutions to enhance its e-commerce operations through integration of Uniware for order management and UniCapture for video management solutions.",
            "Sentiment": "positive",
            "PublishDate": 1766386264980,
            "Source": "stocks"
        },
        {
            "Title": "Unicommerce Appoints Gaurav Juneja to Senior Role",
            "Summary": "Unicommerce eSolutions Ltd announces the appointment of Gaurav Juneja as Senior Management Personnel effective December 18, 2025. Juneja brings experience from his previous role as Chief Revenue Officer at Kapture.cx.",
            "Sentiment": "positive",
            "PublishDate": 1766036646552,
            "Source": "stocks"
        },
        {
            "Title": "Unicommerce Launches AI Assistant Unibot",
            "Summary": "Unicommerce eSolutions introduces GenAI-powered chat assistant Unibot with voice commands and bilingual support to enhance e-commerce operations and task management capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765521345231,
            "Source": "stocks"
        },
        {
            "Title": "Himalaya Wellness Partners with Unicommerce for Omnichannel E-commerce Expansion",
            "Summary": "Himalaya Wellness has partnered with Unicommerce to deploy the Uniware platform, integrating multi-channel order, warehouse, and omnichannel retail management systems across over 150 physical stores and online marketplaces. The partnership aims to enable faster deliveries, improved inventory management, and automated order processing as Himalaya transitions from a traditional-first to digital-first approach.",
            "Sentiment": "positive",
            "PublishDate": 1764310721777,
            "Source": "order&deals"
        },
        {
            "Title": "Unicommerce Reports 75% Revenue Growth in Q2 FY26, Crosses INR 200 Crore Annual Run Rate",
            "Summary": "Unicommerce eSolutions delivered strong Q2 FY26 performance with consolidated revenue growing 75.3% year-on-year to INR 51.4 crores, taking annual revenue run rate above INR 200 crores for the first time. The company's adjusted EBITDA increased 85.1% to INR 11.4 crores while Shipway maintained profitability and demonstrated 26% sequential growth, with the enterprise client base crossing 1,000 clients during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763385302852,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Partners With Unicommerce to Enhance Online Retail Operations",
            "Summary": "Raymond has partnered with Unicommerce Esolutions to integrate the Uniware platform for order and warehouse management to enhance its online retail operations. The partnership aims to deliver a seamless customer experience across multiple channels through improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763359635437,
            "Source": "order&deals"
        },
        {
            "Title": "Unicommerce eSolutions Reports Quarterly Results and Board Decisions",
            "Summary": "Unicommerce eSolutions Limited's Board approved the re-appointment of BDO India Services Private Limited as Internal Auditors and approved audited financial results for the quarter and half year ended September 30, 2025. The company completed acquisition of remaining 57.24% stake in Shipway Technology Private Limited through a non-cash share swap arrangement, resulting in allotment of 6,033,189 equity shares. The company commercially launched its payment reconciliation module UniReco and capitalized Rs 19.20 million under Intangible Assets. IPO expenses of Rs 303.60 million were incurred, with Rs 285.46 million recovered from selling shareholders and Rs 8.04 million yet to be billed. The audited results show both standalone and consolidated financial statements prepared in accordance with Indian Accounting Standards.",
            "Sentiment": "neutral",
            "PublishDate": 1762892944143,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce Projects 37% Revenue Growth to ₹245 Crores by FY26 with 24% EBITDA Margin",
            "Summary": "Unicommerce has provided guidance for rapid growth in its SaaS and omni-channel solutions business. The company projects revenue of ₹245 crores for FY26, representing a 37% year-on-year increase, with an EBITDA margin target of 24%. The company plans to scale its client base to over 25,000 retailers and direct-to-consumer brands. Unicommerce is expanding its global presence across Middle East, North Africa (MENA) and Southeast Asia (SEA) regions. The growth strategy focuses on AI-powered inventory optimization and API integrations to strengthen recurring revenue visibility.",
            "Sentiment": "positive",
            "PublishDate": 1762874903246,
            "Source": "stock"
        },
        {
            "Title": "Unicommerce eSolutions Reports Quarterly Results and Re-appoints Internal Auditors",
            "Summary": "Unicommerce eSolutions Limited's Board approved the re-appointment of BDO India Services Private Limited as Internal Auditors for 2025-2026 and subsequent years. The company also approved audited financial results (standalone and consolidated) for the quarter and half year ended September 30, 2025. The re-appointment was necessitated by BDO India LLP's internal restructuring, with operations transferring to BDO India Services Private Limited effective October 15, 2025. BDO India Services Private Limited is the Indian member firm of BDO, providing assurance, tax, advisory, and technology-led solutions with over 20 offices and serves both domestic and international clients.",
            "Sentiment": "neutral",
            "PublishDate": 1762867541229,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce eSolutions Reports 75% Revenue Growth, Crosses 1,000 Enterprise Clients in Q2 FY26",
            "Summary": "Unicommerce eSolutions reported consolidated revenue of ₹513.8 million for the quarter ended September 30, 2025, marking 75.3% year-on-year growth. The company's annualized revenue run-rate exceeded ₹2.1 billion for the first time. Adjusted EBITDA grew 85.1% year-on-year to ₹114.2 million, with an annualized run-rate surpassing ₹450 million. Profit after tax stood at ₹57.8 million, up 29.2% year-on-year. The Uniware platform crossed 1,000 enterprise clients during the quarter and maintained an annual transaction run-rate of over 1.1 billion order items. Shipway remained profitable with revenue run-rate increasing 26% quarter-on-quarter to ₹869 million. Cash and bank balance grew 79.5% to ₹633.8 million since March 2025. The company launched UniCapture Video Management System and enhanced its product offerings across all platforms. Operating cash flow increased 84.2% year-on-year to ₹296.7 million for the half-year period.",
            "Sentiment": "positive",
            "PublishDate": 1762860947978,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce Launches Video-Verification Solution UniCapture for E-commerce Order Management",
            "Summary": "Unicommerce eSolutions Limited announced the launch of UniCapture, a video-based verification solution designed for D2C brands and e-commerce sellers. The solution automatically records and links timestamped videos to each order during packing and return inspections, providing visual evidence for shipments and returns. UniCapture aims to address e-commerce disputes and return-related fraud by replacing manual proofing processes with automated video verification. The solution helps sellers handle claims with marketplace-acceptable evidence and reduces revenue leakage from disputes. Unicommerce serves 7,100 clients across India, Southeast Asia, and the Middle East, with its flagship platform Uniware processing over 1 billion order items annually. The company's clients include FabIndia, Lenskart, Timex, Mamaearth, and Urban Company among others.",
            "Sentiment": "positive",
            "PublishDate": 1762492644965,
            "Source": "stock"
        },
        {
            "Title": "Cure.fit Expands Partnership with Unicommerce, Adopts UniReco for Payment Reconciliation",
            "Summary": "Cure.fit has strengthened its partnership with Unicommerce by adopting UniReco, an automated payment reconciliation solution for enhanced financial accuracy across e-commerce operations. The fitness and wellness platform already uses Unicommerce's Uniware for order, warehouse, and inventory management for its cult store business. UniReco will automate complex financial reconciliations, provide end-to-end transaction visibility, and enable faster dispute resolution as Cure.fit scales across marketplaces, D2C platforms, and its own app. The solution offers order-wise revenue visibility, manages return payments, and automatically detects shortpayments, overcharges, and uncredited refunds. During a month-long pilot, Cure.fit realized strong performance enhancements and operational efficiency improvements. CFO Bishnu Hazari stated the solution will free teams to focus on business growth while ensuring financial accuracy and compliance. Unicommerce MD CEO Kapil Makhija noted that UniReco adds a vital financial control layer to their existing suite, providing complete order-to-payment visibility.",
            "Sentiment": "positive",
            "PublishDate": 1762254491726,
            "Source": "stock"
        },
        {
            "Title": "Unicommerce Partners with Gini & Jony Kidswear for Enhanced Online Operations",
            "Summary": "Unicommerce Esolutions has partnered with Gini & Jony Kidswear to enhance the children's clothing brand's online sales capabilities. The collaboration involves implementing multi-channel order and warehouse management systems designed to enable quicker deliveries and provide real-time inventory updates for improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1759820433835,
            "Source": "order&deals"
        },
        {
            "Title": "Unicommerce Launches GST Guidance Tool to Help E-commerce Sellers Navigate Tax Compliance",
            "Summary": "Unicommerce eSolutions Limited launched a GST Guidance Tool to help online sellers comply with GST revisions. The tool allows users to upload their central record database file containing HSN codes and receive detailed reports showing old tax rates, new tax rates, and flags where rates remain unchanged. This reduces manual cross-referencing and helps sellers manage tax compliance across thousands of SKUs. E-commerce brands can upload updated GST rates directly into the system, with automatic invoicing reflecting new GST rates from September 22 onwards. Chief Financial Officer Anurag Mittal stated the tool helps sellers navigate regulatory changes with confidence and maintain business continuity across marketplaces. Unicommerce serves over 7,100 clients across India, Southeast Asia, and the Middle East, with its flagship platform Uniware achieving an annualized transaction run rate of over 1 billion order items in Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1758530363027,
            "Source": "stock"
        },
        {
            "Title": "Dabur's NewU Partners With Unicommerce Esolutions for Omnichannel Shopping Enhancement",
            "Summary": "Dabur's NewU has partnered with Unicommerce Esolutions to enhance omnichannel shopping capabilities. The technology implementation will facilitate smooth shopping experiences across over 120 stores in more than 35 cities nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1757399927966,
            "Source": "order&deals"
        },
        {
            "Title": "Unicommerce Esolutions to Issue 200 Million Rupees Worth of Shares to Acevector",
            "Summary": "Unicommerce Esolutions will issue shares worth 200 million rupees to Acevector at a price of 138.87 rupees per share. This represents a share issuance transaction between the two entities.",
            "Sentiment": "neutral",
            "PublishDate": 1756733638639,
            "Source": "order&deals"
        },
        {
            "Title": "Unicommerce eSolutions Schedules Board Meeting to Consider Fund Raising Proposals",
            "Summary": "Unicommerce eSolutions Limited has announced a Board of Directors meeting scheduled for September 1, 2025, to consider proposals for raising funds through issuance of equity shares, share warrants, or other securities. The company is exploring various methods including preferential issue and qualified institutions placement, subject to regulatory and shareholder approvals. The Board will also determine the appropriate means to obtain shareholder approval for the proposed fund raising.",
            "Sentiment": "neutral",
            "PublishDate": 1756203741460,
            "Source": "corporate_action"
        },
        {
            "Title": "WoodenStreet Partners with Unicommerce to Enhance E-Commerce Operations",
            "Summary": "WoodenStreet has formed a partnership with Unicommerce to strengthen its e-commerce capabilities. The collaboration aims to boost WoodenStreet's online business operations through Unicommerce's platform and services.",
            "Sentiment": "positive",
            "PublishDate": 1756105920455,
            "Source": "stock"
        },
        {
            "Title": "Unicommerce Targets 25%+ Growth Through AI-Driven E-Commerce Solutions and Enterprise Client Focus",
            "Summary": "Unicommerce is pursuing continuous growth exceeding 25% profitability by leveraging artificial intelligence in e-commerce automation. The company is capitalizing on strong global demand and introducing new products including UniReco. The growth strategy focuses on acquiring enterprise clients and upgrading its platform to enhance revenue and margins.",
            "Sentiment": "positive",
            "PublishDate": 1755015962457,
            "Source": "stock"
        },
        {
            "Title": "Unicommerce eSolutions Appoints Price Waterhouse as Statutory Auditors and Reports Strong Q1 Results",
            "Summary": "Unicommerce eSolutions Limited's Board approved the appointment of Price Waterhouse Chartered Accountants LLP as statutory auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval at the Annual General Meeting. The company also approved its audited financial results for the quarter ended June 30, 2025. Consolidated revenue from contracts with customers reached Rs. 449.34 million, with profit before tax at Rs. 51.57 million and profit for the period at Rs. 35.12 million. On a standalone basis, revenue was Rs. 277.34 million with profit before tax of Rs. 84.62 million and profit for the period of Rs. 63.60 million. Basic earnings per share stood at Rs. 1.60 for consolidated results and Rs. 1.97 for standalone results. The company completed acquisition of remaining 57.24% stake in Shipway Technology Private Limited through share swap arrangement, with 6,033,189 equity shares allotted on August 7, 2025, pending listing approval from stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1755013505405,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce eSolutions Schedules Q1 FY26 Earnings Call for August 13, 2025",
            "Summary": "Unicommerce eSolutions Limited has scheduled an earnings call to discuss Q1 FY26 results on Wednesday, August 13, 2025, at 9:00 AM IST. The call will be led by Managing Director & CEO Kapil Makhija and Chief Financial Officer Anurag Mittal. The company has provided pre-registration details and local access numbers for participants, with international toll-free numbers available for Hong Kong, Singapore, UK, and USA. Strategic Growth Advisors will handle RSVP coordination for the earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1754397318964,
            "Source": "earnings"
        },
        {
            "Title": "BeastLife Partners with Unicommerce to Scale E-Commerce Operations Across India",
            "Summary": "Sports nutrition brand BeastLife has adopted Unicommerce's technology suite to expand its e-commerce operations across India. Co-founded in 2024 by Gaurav Taneja and Raj Vikram Gupta, BeastLife operates as an online platform for sports nutrition and bodybuilding supplements. The company has deployed Unicommerce's Uniware platform for multi-channel order management and warehouse management systems to automate order processing across multiple marketplaces and its brand website. The technology will provide inventory visibility across different channels, maintain stock levels, and identify underperforming inventory. The India dietary supplements market reached INR 178.6 billion in 2024 and is expected to reach INR 557.7 billion by 2033, with a projected growth rate of 12.82%. Unicommerce serves 10,000 brands across 7,000+ clients in India, Southeast Asia, and the Middle East, with its Uniware platform achieving an annualized transaction run rate of over 1 billion order items.",
            "Sentiment": "positive",
            "PublishDate": 1753167756854,
            "Source": "stock"
        },
        {
            "Title": "Unicommerce eSolutions: Q4 Revenue Surges 71%, Stock Jumps 13%",
            "Summary": "Unicommerce eSolutions reported Q4 FY25 revenue of ₹45.3 crore, up 71% YoY. EBITDA margin improved to 18.4%. FY25 revenue grew 30.1% to ₹134.7 crore. The company added over 125 new clients for Uniware in Q4. Stock price rose 13.4% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1746516489000,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce eSolutions Reports Strong Q4 Financial Performance",
            "Summary": "Unicommerce eSolutions has reported significant year-over-year growth in its Q4 financial results. The company's EBITDA increased to 83 million rupees from 37 million rupees in the previous year, with EBITDA margin improving to 18.21% from 13.85%. Consolidated net profit rose to 34 million rupees from 29 million rupees year-over-year, while revenue surged to 453 million rupees from 265 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746452440000,
            "Source": "result"
        },
        {
            "Title": "Unicommerce eSolutions Collaborates with FAE Beauty",
            "Summary": "Unicommerce eSolutions has announced a collaboration with FAE Beauty. This partnership likely aims to enhance e-commerce solutions or beauty product distribution, though specific details are not provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1745303607000,
            "Source": "default"
        },
        {
            "Title": "Zouk Partners with Unicommerce and Shipway for Multi-Channel Operations",
            "Summary": "Zouk, a fast-growing company, has partnered with Unicommerce Solutions and Shipway to enhance its multi-channel operations. Unicommerce's integrated solution will provide Zouk with order and warehouse management, automated shipping, and payment reconciliation capabilities. This partnership aims to help Zouk scale its operations efficiently across multiple channels.",
            "Sentiment": "positive",
            "PublishDate": 1744284028000,
            "Source": "order&deals"
        },
        {
            "Title": "Unicommerce eSolutions Completes Acquisition of Remaining Stake in Shipway",
            "Summary": "Unicommerce eSolutions has finalized the acquisition of the remaining 57.24% stake in Shipway. This move suggests a strategic expansion or consolidation of Unicommerce's operations in the e-commerce solutions sector.",
            "Sentiment": "positive",
            "PublishDate": 1742535286000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unicommerce Enhances Integration with Quick Commerce Players",
            "Summary": "Unicommerce has improved its integration with leading quick commerce platforms to simplify the process of quick commerce selling for retail brands. This enhancement aims to streamline operations for retailers looking to expand their presence in the fast-growing quick commerce sector.",
            "Sentiment": "positive",
            "PublishDate": 1740649519000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ethos Partners with Unicommerce to Enhance Luxury E-Commerce Experience",
            "Summary": "Ethos, a luxury watch retailer, has signed an agreement with Unicommerce eSolutions to improve its digital luxury retail experience. This partnership comes as the Indian luxury retail market is projected to reach USD 14 billion by 2032. Ethos aims to leverage Unicommerce's e-commerce solutions to elevate its online presence and cater to the growing demand for luxury goods in India.",
            "Sentiment": "positive",
            "PublishDate": 1740029374000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unicommerce: E-commerce Enabler Expands into Loyalty Programs and Ad-tech",
            "Summary": "Unicommerce, an e-commerce enablement platform, is exploring growth in customer loyalty programs and ad-tech solutions amid rising online orders. The company recently acquired a stake in Shipway and gained access to Convertway, a marketing automation platform. Unicommerce aims to become a one-stop shop for e-commerce enablement and is open to strategic acquisitions. The company reported a 26.1% year-on-year revenue growth to ₹32.74 crore in Q3FY24, with net profit increasing by 62.3% to ₹6.29 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739445115000,
            "Source": "normal_news"
        },
        {
            "Title": "Unicommerce eSolutions Reports Strong Q3 EBITDA Growth",
            "Summary": "Unicommerce eSolutions has reported significant year-over-year growth in its Q3 EBITDA. The company's EBITDA increased to 83.27 million rupees from 45.54 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 25.43% from 17.55% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738340758000,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce eSolutions Reports Q3 Revenue Growth",
            "Summary": "Unicommerce eSolutions has reported a revenue of 327.4 million rupees for the third quarter, compared to 259.6 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738340750000,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce eSolutions Reports Significant Profit Growth in Q3",
            "Summary": "Unicommerce eSolutions has reported a substantial increase in net profit for the third quarter. The company's net profit rose to 62.9 million rupees, up from 38.8 million rupees in the same quarter last year, representing a year-over-year growth. Additionally, the profit showed a quarter-over-quarter increase from 44.7 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738340738000,
            "Source": "earnings"
        },
        {
            "Title": "Unicommerce eSolutions Ltd: Shares Rise on Reid & Taylor Integration Deal",
            "Summary": "Unicommerce eSolutions Ltd shares increased 4.7% after announcing a deal to integrate Reid & Taylor Apparel's stores, online platforms, and warehouses using Unicommerce's multi-channel order management and omnichannel retail systems. The integration aims to automate order processing and enable ship-from-store services for Reid & Taylor.",
            "Sentiment": "positive",
            "PublishDate": 1738234218000,
            "Source": "order&deals"
        },
        {
            "Title": "Reid & Taylor Adopts Unicommerce eSolutions for Omnichannel Integration",
            "Summary": "Reid & Taylor, a well-known fashion brand, has partnered with Unicommerce eSolutions to integrate all its physical stores, online channels, and warehouses into a single technological network. This move aims to streamline operations and enhance the overall customer experience across all shopping platforms.",
            "Sentiment": "positive",
            "PublishDate": 1738219420000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hummel Partners with Unicommerce for E-commerce Operations",
            "Summary": "Danish sportswear brand Hummel has chosen Unicommerce Esolutions to manage its e-commerce operations. Unicommerce, an e-commerce technology platform, will provide its services to support Hummel's online retail activities. This partnership aims to enhance Hummel's digital presence and streamline its e-commerce processes.",
            "Sentiment": "positive",
            "PublishDate": 1733356998000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hummel Partners with Unicommerce for E-commerce Operations",
            "Summary": "Danish sportswear brand Hummel has chosen Unicommerce eSolutions to manage its e-commerce operations. This partnership aims to enhance Hummel's online presence and streamline its digital retail processes.",
            "Sentiment": "positive",
            "PublishDate": 1733325069000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unicommerce Expands Technology Support for Sugar Cosmetics",
            "Summary": "Unicommerce eSolutions has expanded its technology support for Sugar Cosmetics through its omnichannel solutions. This partnership aims to enhance Sugar Cosmetics' operational capabilities and customer experience across various sales channels.",
            "Sentiment": "positive",
            "PublishDate": 1731999494000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unicommerce eSolutions to Acquire Shipway",
            "Summary": "Unicommerce eSolutions is set to acquire a 42.76% stake in Shipway, an e-commerce technology platform, for 684 million rupees in the first tranche of the acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1731332302000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unicommerce eSolutions Reports Strong Q2 Financial Performance",
            "Summary": "Unicommerce eSolutions has reported significant year-over-year growth in its Q2 financial results. The company's EBITDA increased from 36 million rupees to 57 million rupees, representing a 58.3% growth. Additionally, the EBITDA margin improved from 13.90% to 19.45%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730127817000,
            "Source": "result"
        },
        {
            "Title": "Unicommerce eSolutions Reports Q2 Financial Results",
            "Summary": "Unicommerce eSolutions has announced its financial results for the second quarter. The company reported a net profit of 45 million rupees, showing an increase from 37 million rupees year-over-year and 35 million rupees quarter-over-quarter. Revenue for Q2 stood at 293 million rupees, up from 259 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730127753000,
            "Source": "result"
        },
        {
            "Title": "Unicommerce: IPO Success Challenges 'Growth at All Costs' Model",
            "Summary": "Unicommerce's recent IPO was oversubscribed 168 times, raising $5.5 billion in demand for a $35 million offering. Co-founders Kunal Bahl and Rohit Bansal attribute success to profitability and steady growth without external funding since 2015. They advise entrepreneurs to prioritize consistent growth and profitability over rapid expansion.",
            "Sentiment": "positive",
            "PublishDate": 1729780214000,
            "Source": "normal_news"
        },
        {
            "Title": "Hidesign: Partners with Unicommerce to Boost Omnichannel Operations",
            "Summary": "<p><span class='positive'>Hidesign</span> <span class='positive'>collaborates</span> with <span class='positive'>Unicommerce</span> to <span class='positive'>enhance</span> <b>omnichannel order processing</b> across <b>50+ stores and warehouses</b>. Unicommerce's stock <span class='positive'>rises 2.42%</span> to ₹212.73 on NSE.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728898304000,
            "Source": "normal_news"
        },
        {
            "Title": "Hidesign Partners with Unicommerce for Omnichannel Operations",
            "Summary": "<p><span class='neutral'>Hidesign</span>, a <span class='neutral'>fashion brand</span>, has signed an agreement with <span class='neutral'>Unicommerce eSolutions</span> to <span class='positive'>streamline</span> its <b>omnichannel operations</b>. Unicommerce will provide <span class='positive'>technology</span> to enable <span class='positive'>faster</span> and <span class='positive'>more efficient</span> management of omnichannel orders across Hidesign's various stores from a <span class='positive'>centralized location</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728888690000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unicommerce Esolutions: CEO Predicts E-Commerce Rebound Amid Festive Season",
            "Summary": "<p>Unicommerce Esolutions' MD and CEO Kapil Makhija expects the company to maintain a <span class='positive'>25%+ CAGR</span> over the next three years. He anticipates an <span class='positive'>e-commerce industry recovery</span> driven by <span class='positive'>festive season demand</span>, with <b>early signs of strong growth</b> already visible. Makhija believes the <b>long-term e-commerce market</b> will grow at <span class='positive'>20-25% CAGR</span>, with Unicommerce <span class='positive'>outperforming the market</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728441715000,
            "Source": "normal_news"
        },
        {
            "Title": "VIP Industries Partners with Unicommerce eSolutions for E-commerce Optimization",
            "Summary": "<p><span class=\"positive\">VIP Industries</span>, a <span class=\"neutral\">luggage and travel accessories company</span>, has entered into a <span class=\"positive\">partnership</span> with <span class=\"positive\">Unicommerce eSolutions</span> to <b>enhance and streamline</b> its <span class=\"neutral\">e-commerce operations</span>. This collaboration aims to <b>improve</b> VIP Industries' <span class=\"neutral\">online presence</span> and <span class=\"positive\">operational efficiency</span> in the <span class=\"neutral\">digital marketplace</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727978946000,
            "Source": "corporate_action"
        }
    ]
}