{
    "Symbol": "UNIMECH",
    "ISIN": "INE0U3I01011",
    "News": [
        {
            "Title": "Unimech Aerospace Schedules Q3FY26 Earnings Call",
            "Summary": "Unimech Aerospace and Manufacturing Limited announces earnings conference call on February 13, 2026 at 11:00 AM IST to discuss Q3FY26 financial results and business strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1770622987318,
            "Source": "co_actions_results"
        },
        {
            "Title": "Unimech's Auditor Converts to LLP Structure",
            "Summary": "Unimech Aerospace and Manufacturing Limited announces that its statutory auditor M S K A & Associates has converted to M S K A & Associates LLP effective January 13, 2026, with no change to audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1769516150749,
            "Source": "stocks"
        },
        {
            "Title": "Unimech Aerospace Forms JV with Saudi Arabia's YBAK",
            "Summary": "Unimech Aerospace and Manufacturing Limited's board approves joint venture agreement with Yusuf Bin Ahmed Kanoo Company Limited to establish operations in Saudi Arabia, expanding into Middle East markets.",
            "Sentiment": "positive",
            "PublishDate": 1768887531349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Unimech Subsidiary Wins ₹72.20 Cr NPCIL Order",
            "Summary": "Innomech Aerospace Toolings, wholly owned subsidiary of Unimech Aerospace, secures major order from Nuclear Power Corporation of India Limited for supply and delivery of support equipment.",
            "Sentiment": "positive",
            "PublishDate": 1767757066547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Unimech Aerospace Expands Bengaluru Facility to 95K Sq Ft",
            "Summary": "Unimech Aerospace and Manufacturing expands its precision engineering facility at KIADB Aerospace Park, Bengaluru, from 33,000 to 95,000 square feet with 62,000 sq ft addition, effective December 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766994979944,
            "Source": "stocks"
        },
        {
            "Title": "Unimech Aerospace Approves ₹5.53 Crore Investment for 29.99% Stake in Dheya Engineering Technologies",
            "Summary": "Unimech Aerospace has approved an investment of ₹5.53 crore to acquire a 29.99% stake in Dheya Engineering Technologies, a company operating in the aerospace and energy technology sector. This strategic acquisition will expand Unimech Aerospace's presence in the aerospace and energy technology markets through its investment in Dheya Engineering Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1764115804073,
            "Source": "order&deals"
        },
        {
            "Title": "Unimech Aerospace Seeks Shareholder Approval for IPO Fund Reallocation and Enhanced Financial Powers",
            "Summary": "Unimech Aerospace and Manufacturing Limited has issued a postal ballot notice seeking shareholder approval for three special resolutions, including reallocation of ₹612.87 million in unutilized IPO proceeds toward mergers, acquisitions, greenfield projects and joint ventures. The company also seeks approval to provide loans, guarantees and securities up to ₹1,000 crores each under Sections 185 and 186 of the Companies Act, with voting scheduled from November 18 to December 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763384807117,
            "Source": "corporate_action"
        },
        {
            "Title": "Unimech Aerospace Q2FY26 Results: Revenue Growth Slows to 1% Amid US Tariff Headwinds",
            "Summary": "Unimech Aerospace reported Q2FY26 revenue of Rs. 62 crores, up 1% year-on-year, with EBITDA margin at 30% as US export tariffs significantly impacted order pickups from American customers. The company secured a notable $4 million order for ground support equipment under the LEAP engine program and maintains an order book of Rs. 105 crores, though it withdrew FY26 growth guidance due to tariff uncertainties.",
            "Sentiment": "negative",
            "PublishDate": 1763361573124,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace and Manufacturing Approves Registered Office Relocation Within Karnataka",
            "Summary": "Unimech Aerospace and Manufacturing Limited's Board of Directors approved shifting the company's registered office from Peenya IV Phase Industrial Area to KIADB Layout of HiTech Defence and Aerospace Park Industrial Area, both located in Karnataka. The board meeting was held on November 12, 2025, from 2:30 P.M. to 5:00 P.M. The relocation is within the local limits of the same city/town/village where the current registered office is situated.",
            "Sentiment": "neutral",
            "PublishDate": 1762990449677,
            "Source": "corporate_action"
        },
        {
            "Title": "Unimech Aerospace Submits Monitoring Agency Report for IPO Fund Utilization",
            "Summary": "Unimech Aerospace and Manufacturing Limited submitted its monitoring agency report for the quarter ended September 30, 2025, prepared by Care Ratings Limited. The company raised Rs. 250 crore through a fresh issue of 31,84,713 equity shares in December 2024. Out of the total proceeds, Rs. 149.67 crore has been utilized across various objectives including capital expenditure for machinery purchase (Rs. 23.54 crore), working capital requirements (Rs. 13.46 crore), investment in material subsidiary (Rs. 35.43 crore), general corporate purposes (Rs. 37.16 crore), and issue expenses (Rs. 16.75 crore). The remaining Rs. 100.33 crore is deployed in fixed deposits with ICICI Bank earning 7.77% to 8.00% interest. The monitoring agency reported no deviations from the stated objectives of the IPO. The report indicates delays in repayment of certain borrowings, though the exact number of delay days was not ascertainable.",
            "Sentiment": "neutral",
            "PublishDate": 1762989786521,
            "Source": "corporate_action"
        },
        {
            "Title": "Unimech Aerospace Reports Strong Q2 Performance with 291% Rise in Standalone Profit",
            "Summary": "Unimech Aerospace and Manufacturing Limited reported standalone profit after tax of Rs 337.4 lakhs for the quarter ended September 30, 2025, compared to Rs 86.2 lakhs in the previous quarter. Revenue from operations reached Rs 1,504.37 lakhs versus Rs 1,170.55 lakhs in the prior quarter. For the six-month period, standalone profit increased to Rs 723.6 lakhs from Rs 605.54 lakhs in the corresponding period. On a consolidated basis, the company posted quarterly profit of Rs 1,567.09 lakhs with revenue from operations at Rs 6,198.19 lakhs. The company operates in aerospace manufacturing, producing tools and components for civil and defense aerospace sectors. Basic earnings per share stood at Rs 1.67 for the standalone quarter and Rs 3.08 for consolidated results. The company's equity shares are listed on NSE and BSE since December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1762979685399,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace Q2 Net Profit Drops to 157M Rupees, Revenue Rises Slightly",
            "Summary": "Unimech Aerospace and Manufacturing reported consolidated net profit of 157 million rupees in Q2, down from 181 million rupees in the same quarter last year. The company's revenue increased marginally to 620 million rupees compared to 615 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762957169041,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace Secures INR 35 Crore Order from Overseas Customer",
            "Summary": "Unimech Aerospace and Manufacturing Limited received a purchase order worth INR 35 crores from an overseas customer. The order involves manufacturing and supplying Ground Support Equipment for the aerospace segment. The contract is to be executed within 5 to 12 months. The company confirmed that promoters have no interest in the entity that awarded the order, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761539907840,
            "Source": "stock"
        },
        {
            "Title": "Unimech Aerospace Commissions Two New Manufacturing Facilities in Bengaluru",
            "Summary": "Unimech Aerospace and Manufacturing Limited has commissioned two new manufacturing facilities at KIADB Aerospace Park in Bengaluru. Unit 3 is a Precision Engineering Facility measuring approximately 33,000 sq. ft. that will manufacture high-precision components and systems for Nuclear, Aerospace, and Oil & Gas sectors. Unit 4 is a Fabrication Facility measuring approximately 30,000 sq. ft. that will focus on fabricating Engine Stands for LEAP Engines and other aero-engine programs, as well as self-elevating platforms for the domestic nuclear segment. The facilities were inaugurated by the company's founders. With these additions, the company's total manufacturing footprint has expanded to approximately 2,43,000 sq. ft., strengthening its capability base and aligning with its long-term growth and diversification strategy.",
            "Sentiment": "positive",
            "PublishDate": 1760963469012,
            "Source": "stock"
        },
        {
            "Title": "Unimech Aerospace Reports Revenue Slowdown Due to U.S. Tariffs",
            "Summary": "Unimech Aerospace And Manufacturing is experiencing a continued slowdown in revenues. The company expects revenues for Q2 to be marginally lower than Q1. The decline is attributed to the imposition of U.S. tariffs affecting the aerospace manufacturer's business operations.",
            "Sentiment": "negative",
            "PublishDate": 1759456935467,
            "Source": "stock"
        },
        {
            "Title": "Unimech Aerospace And Manufacturing Reports Revenue Decline in Q2 Due to U.S. Tariffs",
            "Summary": "Unimech Aerospace And Manufacturing experienced a slight revenue drop in its quarterly results, attributed to U.S. tariffs impacting the company's business operations.",
            "Sentiment": "negative",
            "PublishDate": 1759321400025,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace Resubmits Q1 FY26 Financial Results in Machine-Readable Format",
            "Summary": "Unimech Aerospace and Manufacturing Limited resubmitted its financial results for the quarter ended June 30, 2025, in machine-readable format after NSE flagged that 2 pages of the original submission were not in the required format. The company reported consolidated revenue from operations of Rs 6,298.85 lakhs and profit after tax of Rs 1,912.43 lakhs for the quarter. On standalone basis, revenue was Rs 1,170.55 lakhs with profit after tax of Rs 886.20 lakhs. The company's IPO proceeds utilization shows Rs 11,293.10 lakhs utilized out of Rs 23,091.10 lakhs received, with Rs 11,798.00 lakhs remaining unutilized. Akash Shetty was appointed as Company Secretary and Compliance Officer effective July 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754390982040,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace Reports 6% Revenue Growth in Q1 FY26 Despite Tariff Uncertainties",
            "Summary": "Unimech Aerospace and Manufacturing Limited reported quarterly revenue of INR63 crores, up 6% year-on-year, with EBITDA at INR20 crores (31% margin). The company added three new customers across defense, electronics, and medical robotics, bringing total customer count to 35. Order book stands at INR81 crores. The company submitted four EMCCR tenders worth INR400+ crores for nuclear power stations and expects more nuclear reactor tenders worth INR500+ crores each. Management maintains FY26 guidance of 35-40% revenue growth despite ongoing tariff discussions affecting shipment timing. Aero tooling contributed 82% of revenue while precision and assembly segment contributed 18%. The company delivered 4,769 SKUs, adding 381 new ones during the quarter. Employee costs increased to over 20% due to new hiring, ESOP implementation, and salary increments. Capacity utilization remained at 58% with management targeting 85-90% utilization in next 24 months.",
            "Sentiment": "neutral",
            "PublishDate": 1753857457371,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace Reports Deviation in IPO Fund Utilization, Parks Working Capital in Liquid Funds",
            "Summary": "Unimech Aerospace and Manufacturing Limited reported a deviation in the utilization of funds raised through its Initial Public Offering of INR 2,500 million on December 27, 2024. The company has temporarily parked working capital funds in liquid funds pending their use for the stated IPO objectives. The deviation report for the quarter ended June 30, 2025 was reviewed by the Audit Committee and Board of Directors. The IPO funds were originally allocated for capital expenditure on machinery and equipment expansion, working capital requirements, investment in material subsidiary for equipment purchase and working capital, and general corporate purposes. Care Ratings Limited serves as the monitoring agency for the fund utilization. The company explained that the working capital funds are parked in liquid funds for interim purposes in the best interest of the organization while awaiting deployment towards stated IPO objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1753379507534,
            "Source": "stock"
        },
        {
            "Title": "Unimech Aerospace Reports Deviation in IPO Fund Utilization, Invests in Liquid Mutual Funds",
            "Summary": "Unimech Aerospace and Manufacturing Limited's monitoring agency report for the quarter ended June 30, 2025, revealed a deviation from stated IPO fund utilization plans. The company invested part of its Rs. 250 crore IPO proceeds in liquid mutual funds before utilizing them for working capital requirements, contrary to the requirement of keeping funds in scheduled commercial banks as per the red herring prospectus. Out of the total IPO proceeds, Rs. 129.35 crore has been utilized while Rs. 120.65 crore remains unutilized. The company faced delays in machinery procurement due to regulatory approval issues from Japanese authorities, with Makino Asia Pte Ltd refunding purchase amounts. The company transferred Rs. 13.46 crore for its working capital requirements and Rs. 23.33 crore for its subsidiary's working capital needs. Care Ratings Limited, the appointed monitoring agency, highlighted this deviation in their quarterly report submitted to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753378440965,
            "Source": "corporate_action"
        },
        {
            "Title": "Unimech Aerospace Plans 171% Capacity Expansion and Diversification Into Defence, Nuclear, and Semiconductor Sectors",
            "Summary": "Unimech Aerospace is implementing a significant capacity expansion of over 171% as it moves into FY26. The company is scaling its global OEM operations while diversifying into new verticals including defence, nuclear, and semiconductor sectors. The expansion strategy aims to improve margin leverage and increase order book volumes in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1753373290916,
            "Source": "stock"
        },
        {
            "Title": "Unimech Aerospace Reports Q1 FY26 Results with Revenue of INR 630 Million",
            "Summary": "Unimech Aerospace and Manufacturing Limited reported quarterly results with revenue of INR 630 million. The company achieved a gross margin of 66% and EBITDA margin of 31%. The company added three new customers during the quarter and has orders in hand worth Rs 810 million as of June 2025. Capacity utilization stood at 58% of installed machine capacity. The company increased its qualified SKUs to 4,769 as of June 2025 from 4,388 in March 2025, and employee count grew to 845 from 793. Revenue showed a 6% increase compared to the previous quarter but declined 23% year-over-year from INR 592.1 million in Q1 FY25. EBITDA decreased to INR 197.9 million from INR 257.2 million in the previous year. The company operates through two business segments: Aero Tooling/MRO Tooling and Precision Components and Assemblies, serving aerospace, defense, energy, and semiconductor industries across 7 countries with 35+ customers and 89%+ export revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1753372902695,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace Announces Quarterly Results and Key Leadership Appointments",
            "Summary": "Unimech Aerospace and Manufacturing Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company appointed Mr. Akash Shetty as Company Secretary and Compliance Officer effective July 24, 2025. Shetty is a Fellow Member of ICSI with over a decade of experience in governance and compliance across manufacturing and IT sectors, having previously led major capital raise initiatives including a ₹600 crore public issue with 99x oversubscription. The company also appointed RSM India as Internal Auditors for FY 2025-26. RSM India is a member of RSM International with over 3,000 professionals across 13 cities, providing internal audit, risk advisory, and consulting services to major corporates in banking, manufacturing, and IT sectors.",
            "Sentiment": "positive",
            "PublishDate": 1753367844967,
            "Source": "stock"
        },
        {
            "Title": "Unimech Aerospace Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Unimech Aerospace and Manufacturing reported consolidated net profit of 191 million rupees in Q1, down from 206 million rupees in the same period last year. The company's revenue increased to 630 million rupees compared to 592 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1753366911167,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace Approves Quarterly Results, Appoints New Company Secretary and Internal Auditors",
            "Summary": "Unimech Aerospace and Manufacturing Limited's Board of Directors approved un-audited standalone and consolidated financial results for the quarter ended June 30, 2025. The company appointed Mr. Akash Shetty as Company Secretary and Compliance Officer effective July 24, 2025. Shetty is a Fellow Member of ICSI with over a decade of experience in governance and compliance across manufacturing and IT sectors, having previously led capital raise initiatives including a ₹600 crore public issue with 99x oversubscription. The Board also appointed RSM India as Internal Auditors for Financial Year 2025-26. RSM India operates across 13 cities with over 3,000 professionals and provides internal audit, risk advisory, and consulting services using technology tools like ACL, Alteryx, and Power BI.",
            "Sentiment": "positive",
            "PublishDate": 1753366883148,
            "Source": "corporate_action"
        },
        {
            "Title": "Unimech Aerospace Schedules Q1 FY26 Earnings Conference Call for July 25, 2025",
            "Summary": "Unimech Aerospace and Manufacturing Limited has scheduled an earnings conference call on July 25, 2025, at 11:00 AM IST to discuss the company's Q1 FY26 financial results and business strategy. The call will be hosted by Anand Rathi Research and feature key company executives including Chairman & Managing Director Anil Kumar P, Whole-Time Director & CFO Ramakrishna Kamojhala, and other senior directors. The conference call is scheduled following the declaration of financial results for the quarter ended June 30, 2025. Participants can join through multiple access numbers including universal, international, and diamond pass options.",
            "Sentiment": "neutral",
            "PublishDate": 1753101705592,
            "Source": "earnings"
        },
        {
            "Title": "Unimech Aerospace and Manufacturing Reports Q4 Financial Results",
            "Summary": "Unimech Aerospace and Manufacturing has released its Q4 financial results. The company's EBITDA increased to 275 million rupees from 263 million rupees year-over-year. However, the EBITDA margin decreased to 40.25% from 42.17% compared to the same period last year. The consolidated net profit rose to 292 million rupees from 197 million rupees year-over-year and 155 million rupees quarter-over-quarter. Revenue for Q4 increased to 684 million rupees from 624 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748357937000,
            "Source": "result"
        },
        {
            "Title": "Unimech Aerospace: Expansion Plans and Successful IPO Debut",
            "Summary": "Unimech Aerospace and Manufacturing Ltd. made a strong market debut with shares listing at a 90% premium. The company plans to expand into different sectors beyond its current focus on aerospace tooling, ground support equipment, and precision components. The IPO funds of Rs 250 crore will be used for capital expenditure in two phases, including CNC machines and infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1735716535000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unimech Aerospace And Manufacturing Ltd.: Shares Soar 90% on Market Debut",
            "Summary": "Unimech Aerospace And Manufacturing Ltd. shares listed at Rs 1,491 on BSE, a 89.94% premium over the issue price of Rs 785. On NSE, it listed at Rs 1,460, an 85.99% premium. The IPO was subscribed 175.31 times, raising Rs 500 crore. Proceeds will fund expansion, working capital, and debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1735618616000,
            "Source": "normal_news"
        }
    ]
}