{
    "Symbol": "UNIONBANK",
    "ISIN": "INE692A01016",
    "News": [
        {
            "Title": "Union Bank Participates in MANTHAN Conference",
            "Summary": "Union Bank of India representatives participated in MANTHAN Systematix India Annual Conference on February 9, 2026, engaging with multiple institutional investors and asset management companies in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1770643865341,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Schedules Investor Meet on Feb 13, 2026",
            "Summary": "Union Bank of India announces one-to-one investor meeting with Ikigai Asset Manager Holdings Private Limited scheduled for February 13, 2026 in Mumbai under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770642197575,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Joins Axis Capital's Flagship Conference",
            "Summary": "Union Bank of India announces participation in Advantage India conference by Axis Capital Limited scheduled for February 10, 2026 in Mumbai under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770224288716,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Elevates Sarvesh Ranjan to Chief GM",
            "Summary": "Union Bank of India announces elevation of Shri Sarvesh Ranjan from General Manager to Chief General Manager effective February 01, 2026, following superannuation of Shri Bhaskara Rao Kare.",
            "Sentiment": "neutral",
            "PublishDate": 1769930718702,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Redeems ₹222.90 Cr Bonds via Call Option",
            "Summary": "Union Bank of India successfully redeemed bonds worth ₹222.90 crore on January 29, 2026, through call option exercise, completing full redemption of 205 NCDs under ISIN INE692A08136.",
            "Sentiment": "positive",
            "PublishDate": 1769687688574,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank CFO Change: CA Dhirendra Jain Takes Over",
            "Summary": "Union Bank of India announces CA Dhirendra Jain as new CFO effective February 01, 2026, replacing CA Avinash Vasant Prabhu who resigned for personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1769616532709,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Appoints New Company Secretary",
            "Summary": "Union Bank of India announces appointment of Mr. Ashish Mishra as Company Secretary and Compliance Officer, replacing Mr. Mangesh Mandrekar who was transferred.",
            "Sentiment": "neutral",
            "PublishDate": 1769616368264,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Expects Low Credit Costs, Manages Opex Growth",
            "Summary": "Union Bank of India anticipates low credit costs while implementing efficiency initiatives to manage operational expense growth, alongside stronger loan growth projections.",
            "Sentiment": "positive",
            "PublishDate": 1768534393645,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Expects Lower Provisions, Higher Q4 Loan Growth",
            "Summary": "Union Bank management confirms expectations for lower provisions going forward and higher Q4 loan disbursal growth compared to current quarter during concall updates.",
            "Sentiment": "positive",
            "PublishDate": 1768384170404,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank MD Rules Out Subsidiary Stake Sale",
            "Summary": "Union Bank of India's Managing Director confirms the bank has no current plans to monetise its stake in any subsidiary companies, indicating a strategy to retain ownership.",
            "Sentiment": "neutral",
            "PublishDate": 1768381764963,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Q3 Results: Shares Jump 8% on Asset Quality",
            "Summary": "Union Bank shares surge 8.3% as Q3 results show 9% YoY net profit growth to ₹5,017 cr with improved asset quality. GNPA ratio declined to 3.06% while slippages reduced to ₹1,853 cr sequentially.",
            "Sentiment": "positive",
            "PublishDate": 1768377372057,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Reports 7% Loan Growth vs 9-10% Guidance",
            "Summary": "Union Bank of India's loan growth came in at 7%, falling short of the bank's earlier guidance of 9-10%. The actual performance indicates a slower pace of credit expansion than anticipated.",
            "Sentiment": "negative",
            "PublishDate": 1768376916946,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Q3 Profit Rises 9.7% To Rs 5,073 Crore",
            "Summary": "Union Bank of India reported 9.7% increase in Q3 consolidated net profit to Rs 5,073 crore, driven by sharp decline in provisions. Gross NPA improved to 3.06% with lower fresh slippages.",
            "Sentiment": "positive",
            "PublishDate": 1768376891598,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Q3FY26 Net Profit Rises 9% to ₹5,017 Cr",
            "Summary": "Union Bank of India reports Q3FY26 net profit of ₹5,017 crore, up 9% YoY. NPA ratio improves to 3.06% from 3.85%. Fresh slippages decline to ₹1,660 crore from ₹1,980 crore QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1768376677947,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Q3FY26 Net Profit Jumps 9% to ₹5,017 Cr",
            "Summary": "Union Bank of India reports strong Q3FY26 results with net profit rising 9% YoY to ₹5,017 crores. NPA ratios improve significantly with gross NPAs declining to 3.06% from 3.85% last year.",
            "Sentiment": "positive",
            "PublishDate": 1768376110821,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Q3: Interest Income Drops 1.9% YoY to ₹26,440 Cr",
            "Summary": "Union Bank of India reports Q3 interest income of ₹26,440 crores, down from ₹26,960 crores YoY, while maintaining strong asset quality with GNPA at 3.06% and net profit growth of 8.6%.",
            "Sentiment": "neutral",
            "PublishDate": 1768375507111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Files Q3FY26 SEBI Compliance Certificate",
            "Summary": "Union Bank of India submitted its quarterly compliance certificate under SEBI Regulation 74(5) for Q3FY26, confirming proper dematerialisation processes and regulatory adherence through its registrar KFin Technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1768220539685,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Redeems ₹1,086 Cr Bonds via Call Option",
            "Summary": "Union Bank of India successfully redeemed bonds worth ₹1,085.93 crores on January 09, 2026, exercising call option two days ahead of maturity date. Full redemption completed with no outstanding amount remaining.",
            "Sentiment": "positive",
            "PublishDate": 1767964766608,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Q3FY26 Earnings Call Set for January 14",
            "Summary": "Union Bank of India schedules earnings call for January 14, 2026 to discuss Q3FY26 unaudited financial results with analysts and investors via virtual group call.",
            "Sentiment": "neutral",
            "PublishDate": 1767964149106,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Board Meet on Jan 14 for Q3FY26 Results",
            "Summary": "Union Bank of India has scheduled its Board of Directors meeting for January 14, 2026, to consider unaudited reviewed financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767947070717,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Q3 Results Review Set for January 14",
            "Summary": "Union Bank of India has scheduled to review its third quarter financial results on January 14, marking an important milestone for stakeholders and investors tracking the bank's performance.",
            "Sentiment": "neutral",
            "PublishDate": 1767946770747,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Reports 3.36% Growth in Global Deposits",
            "Summary": "Union Bank of India's global deposits reached ₹12.20 trillion with year-over-year growth of 3.36%, while domestic deposits also grew 3.35% to the same level, demonstrating steady deposit mobilization performance.",
            "Sentiment": "positive",
            "PublishDate": 1767358657680,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Q3FY26 Advances Grow 7.13% YoY",
            "Summary": "Union Bank of India reports 7.13% YoY growth in gross advances to ₹10,16,805 crores as of December 31, 2025. RAM advances surge 11.49% while CASA ratio improves to 33.95%.",
            "Sentiment": "positive",
            "PublishDate": 1767358028897,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Bond Interest Payment Completed",
            "Summary": "Union Bank of India successfully paid ₹55.69 crores as annual interest on bonds due December 23, 2025, maintaining compliance with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1766492263768,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Pays ₹126 Cr Bond Interest on Schedule",
            "Summary": "Union Bank of India successfully paid ₹126 crores annual interest on its bonds dated December 20, 2025, maintaining compliance with SEBI regulations and investor commitments.",
            "Sentiment": "positive",
            "PublishDate": 1766229915064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Union Bank Gets $18.37M from Malaysia JV Liquidation",
            "Summary": "Union Bank of India received USD 18.37 million as interim distribution from the voluntary liquidation of India International Bank Malaysia, representing its 25% stake in the joint venture.",
            "Sentiment": "positive",
            "PublishDate": 1766159078549,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Credit Ratings Reaffirmed by CRISIL",
            "Summary": "CRISIL reaffirmed Union Bank of India's credit ratings at AA+/Stable for Tier-1 bonds and AAA/Stable for Tier-2 bonds on December 11, 2025. The bank shows improved asset quality with GNPA at 3.30% and strong capital adequacy at 17.10%.",
            "Sentiment": "positive",
            "PublishDate": 1765544025151,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank of India Exercises Call Option to Redeem Bonds Worth ₹1,205 Crores",
            "Summary": "Union Bank of India announced the redemption of two bond series totaling ₹1,205 crores through call option exercise, subject to regulatory approval. The redemption includes ₹1,000 crores of 8% coupon bonds due January 12, 2026, and ₹205 crores of 6% coupon bonds due January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764932300708,
            "Source": "corporate_action"
        },
        {
            "Title": "Union Bank of India Pays ₹172.35 Crore Annual Interest on Bonds",
            "Summary": "Union Bank of India made timely annual interest payments totaling ₹172.35 crore on November 29, 2025, across two bond series with ISINs INE692A08201 and INE692A08219. The payments were made on schedule to bondholders as per the record date of November 14, 2025, with applicable TDS deducted from the interest amounts.",
            "Sentiment": "positive",
            "PublishDate": 1764418007910,
            "Source": "corporate_action"
        },
        {
            "Title": "Union Bank of India Pays ₹71.80 Crore Annual Interest on Bonds",
            "Summary": "Union Bank of India successfully paid ₹71.80 crore as annual interest on its bonds with ISIN INE692A08102 on the scheduled due date of November 26, 2025. The payment was made as per investor mandate and beneficiary position, with applicable TDS deducted, fulfilling the bank's debt servicing obligations.",
            "Sentiment": "positive",
            "PublishDate": 1764159472476,
            "Source": "corporate_action"
        },
        {
            "Title": "Union Bank of India Faces ₹8.43 Lakh RBI Penalty for Operational Deficiencies",
            "Summary": "Reserve Bank of India imposed a penalty of ₹8,43,000 on Union Bank of India for deficiencies in soiled notes remittances to RBI and ATM cash out violations. The bank disclosed the penalty amount and stated the impact is not significant on its financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764158829388,
            "Source": "corporate_governance"
        },
        {
            "Title": "Union Bank of India Exercises Call Option to Redeem ₹500 Crore Bonds",
            "Summary": "Union Bank of India has exercised its call option to redeem bonds worth ₹500 crores carrying 8.73% interest rate, with redemption payment scheduled for December 15, 2025. The redemption is subject to regulatory approval and affects bondholders with record date set as November 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764080761464,
            "Source": "corporate_action"
        },
        {
            "Title": "Union Bank of India Appoints Shri Amresh Prasad as Executive Director",
            "Summary": "Union Bank of India appointed Shri Amresh Prasad, Chief General Manager of Punjab National Bank, as Executive Director for three years effective November 24, 2025. The appointment brings over 32 years of banking experience in corporate credit, monitoring, and branch operations to Union Bank's leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1764056331945,
            "Source": "corporate_governance"
        },
        {
            "Title": "Union Bank of India Completes Rs 174 Crore Annual Interest Payment on Bonds",
            "Summary": "Union Bank of India paid Rs 174 crore as annual interest on its Rs 2,000 crore bonds on November 24, 2025, with a two-day delay from the original due date of November 22, 2025. The payment was made to investors as per the beneficiary position on the record date of November 7, 2025, with the delay attributed to the original due date falling on a non-business day.",
            "Sentiment": "neutral",
            "PublishDate": 1763987529921,
            "Source": "corporate_action"
        },
        {
            "Title": "Union Bank of India Receives ₹1.35 Lakh Penalty from RBI for Currency Chest Deficiencies",
            "Summary": "Reserve Bank of India imposed a penalty of ₹1,35,250 on Union Bank of India for deficiencies observed during inspection of Currency-Chests. The bank stated the impact is not significant and has taken preventive measures to avoid recurrence of such instances.",
            "Sentiment": "negative",
            "PublishDate": 1763640381529,
            "Source": "corporate_governance"
        },
        {
            "Title": "Union Bank of India Completes Annual Interest Payment of Rs 89.30 Crore on Bonds",
            "Summary": "Union Bank of India paid annual interest of Rs 89.30 crore on its bonds with ISIN INE112A08051 on November 10, 2025. The payment was due on November 8, 2025, but was made on the next business day as per standard practice when the due date falls on a non-business day. The interest payment record date was October 24, 2025. The bank's previous interest payment on these bonds was made on November 8, 2024. The payment was made in compliance with SEBI listing regulations, with applicable TDS deducted.",
            "Sentiment": "neutral",
            "PublishDate": 1762803581191,
            "Source": "corporate_action"
        },
        {
            "Title": "Union Bank of India Chairman Srinivasan Varadarajan's Tenure Ends",
            "Summary": "Srinivasan Varadarajan's tenure as Non-Executive Chairman and Part Time Non-Official Director of Union Bank of India ended on November 6, 2025. He ceased to be a Director of the Bank effective November 7, 2025. The bank informed stock exchanges BSE and NSE about this leadership change in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762498255122,
            "Source": "corporate_governance"
        },
        {
            "Title": "Union Bank of India Reports Q2 Net Profit of Rs 4,249 Crores, Focuses on Margin Protection Over Growth",
            "Summary": "Union Bank of India reported a net profit of Rs 4,249 crores for Q2 FY26, marking a 3.25% quarter-on-quarter increase. For the first half of FY26, net profit reached Rs 8,365 crores. The bank's ROA stood at 1.16% and return on equity at 15.08%, with a strong capital adequacy ratio of 17.07%. Asset quality improved significantly with gross NPA reducing by 107 basis points year-on-year to 3.29% and net NPA declining by 43 basis points to 0.55%. The bank strategically reduced high-cost bulk deposits by 21.85% year-on-year to protect margins, resulting in NIM being maintained at 2.67%. Credit cost dropped to 22 basis points from 109 basis points in the previous year's quarter. Total deposits grew 1.98% year-on-year while advances registered 4.99% growth. Retail lending showed strong growth of 23.98% and MSME lending grew 14.88%. The bank aims to shift its portfolio mix toward retail, agriculture, and MSME segments, targeting 58% from the current 55%. Managing Director Asheesh Pandey indicated the bank expects to achieve system-level growth going forward, aspiring for 9-10% growth on both asset and liability sides.",
            "Sentiment": "positive",
            "PublishDate": 1762406207463,
            "Source": "earnings"
        },
        {
            "Title": "Union Bank of India Reports Strong Q2 Performance with 8.14% Credit Growth and Improved Asset Quality",
            "Summary": "Union Bank of India announced its quarterly results for the period ended September 30, 2025. The bank achieved 8.14% year-over-year growth in RAM (Retail, Agriculture, MSME) advances, reaching ₹5.54 lakh crores. Net profit increased to ₹4,720 crores compared to ₹4,604 crores in the previous year quarter. The bank's asset quality improved significantly with Gross NPA declining to 3.29% from 4.38% year-over-year, while Net NPA reduced to 0.55% from 1.03%. Credit cost decreased substantially to 0.22% from 1.09% in the same quarter last year. The bank maintained a strong capital adequacy ratio of 17.07% with CET-1 at 14.37%. Net Interest Income grew to ₹8,812 crores, though Net Interest Margin compressed to 2.67% from 2.90%. The bank's deposit base reached ₹12.35 trillion with CASA ratio at 32.56%. Return on Assets improved to 1.16% and Return on Equity reached 15.08%. The bank continued its digital transformation initiatives and maintained its focus on inclusive banking through various government schemes.",
            "Sentiment": "positive",
            "PublishDate": 1761839891371,
            "Source": "earnings"
        },
        {
            "Title": "Union Bank of India Reports Fresh Slippages of ₹19.8 Billion",
            "Summary": "Union Bank of India reported fresh slippages of ₹19.8 billion compared to ₹22 billion in the previous quarter, showing a quarter-on-quarter decrease of ₹2.2 billion in new non-performing assets.",
            "Sentiment": "positive",
            "PublishDate": 1761811008178,
            "Source": "earnings"
        },
        {
            "Title": "Union Bank Of India Reports 3.24% Business Growth With Improved Asset Quality",
            "Summary": "Union Bank Of India reported a 3.24% year-over-year growth in total business. The bank's gross advances increased by 4.99% year-over-year, while total deposits grew by 1.90% year-over-year. Asset quality improved as gross non-performing assets (NPA) dropped to 3.29%.",
            "Sentiment": "positive",
            "PublishDate": 1761809910690,
            "Source": "stock"
        },
        {
            "Title": "Union Bank of India Reports Q2 Net Profit Drop to Rs 42.5 Billion",
            "Summary": "Union Bank of India reported Q2 net profit of Rs 42.5 billion, down from Rs 47.2 billion in the same quarter last year. Revenue remained relatively stable at Rs 266.5 billion compared to Rs 267 billion year-over-year. The bank showed improvement in asset quality with provisions for non-performing assets declining to Rs 5.26 billion from Rs 11.52 billion in the previous quarter. Gross non-performing assets improved to 3.29% from 3.52% quarter-over-quarter, while net non-performing assets decreased to 0.55% from 0.62% in the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1761807987672,
            "Source": "earnings"
        },
        {
            "Title": "Government Considers Merger of Union Bank and Bank of India to Create Second Largest Bank",
            "Summary": "The government is considering a merger between Union Bank and Bank of India. This potential consolidation would create the second largest bank in the country.",
            "Sentiment": "positive",
            "PublishDate": 1761707857776,
            "Source": "order&deals"
        },
        {
            "Title": "Union Bank of India Shares Fall 2.1% After Fifth Consecutive Quarter of Single-Digit Loan Growth",
            "Summary": "Union Bank of India shares declined 2.1% to ₹135.9 following the release of quarterly business results. The bank reported loan growth of 5.3% year-over-year to ₹9.42 lakh crore, marking the fifth consecutive quarter of single-digit growth in gross advances. Sequential loan growth was modest at 0.4%. Deposits increased 1.9% annually to ₹12.34 lakh crore but declined 0.4% sequentially, representing the seventh straight quarter of single-digit deposit growth. The bank's RAM (Retail, Agri, MSME) segment grew 9.3% to ₹5.54 lakh crore, falling short of management's earlier guidance for double-digit growth. Retail loans within the segment performed strongly with 24% growth. Domestic CASA balances reached ₹4.01 lakh crore, up 1.4% year-over-year but down 0.3% from the previous quarter. The stock had gained 8% over the past month before the decline.",
            "Sentiment": "negative",
            "PublishDate": 1759478959334,
            "Source": "stock"
        },
        {
            "Title": "Union Bank Of India Reports Strong 23.96% Growth in Domestic Retail Advances",
            "Summary": "Union Bank Of India reported a 23.96% yearly growth in domestic retail advances by September 30, 2025. The bank also posted a 3.24% rise in total global business year over year and a 1.90% increase in total global deposits year over year.",
            "Sentiment": "positive",
            "PublishDate": 1759475781440,
            "Source": "stock"
        },
        {
            "Title": "Asheesh Pandey Assumes Charge as MD & CEO of Union Bank of India",
            "Summary": "Asheesh Pandey has assumed charge as Managing Director and Chief Executive Officer of Union Bank of India. Pandey brings over 27 years of banking experience, having started his career at Corporation Bank in Mumbai and working in investment and international banking divisions. He previously served as executive director at Bank of Maharashtra for nearly four years, overseeing corporate credit, treasury, and digital lending initiatives. At Union Bank, he previously held the role of chief general manager and chief operating officer, leading integration of the amalgamated entity and implementing digital solutions including WhatsApp banking, video KYC, and doorstep banking. Throughout his career, he has managed portfolios spanning credit, treasury, foreign transactions, compliance, marketing and customer relations. Pandey holds a mechanical engineering degree and postgraduate management qualification specializing in finance and marketing, along with certifications from the Indian Institute of Bankers and executive training from IIM Bangalore.",
            "Sentiment": "positive",
            "PublishDate": 1759243469118,
            "Source": "corporate_governance"
        },
        {
            "Title": "Union Bank of India Extends Executive Director Ramasubramanian S.'s Term Until 2027",
            "Summary": "The Department of Financial Services, Ministry of Finance has extended the term of office for Shri Ramasubramanian S., Executive Director of Union Bank of India. His term, which was scheduled to end on November 20, 2025, has been extended until his superannuation on June 30, 2027, or until further orders, whichever is earlier. The extension was announced through a government notification dated September 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758018789145,
            "Source": "corporate_governance"
        },
        {
            "Title": "Union Bank of India Extends Executive Director Nitesh Ranjan's Term by Three Years",
            "Summary": "The Department of Financial Services, Ministry of Finance, Government of India has extended the term of office for Shri Nitesh Ranjan, Executive Director of Union Bank of India, for a period of three years beyond his current term ending on March 9, 2026, or until further orders. The extension was notified on September 15, 2025, and affects the bank's senior leadership continuity.",
            "Sentiment": "positive",
            "PublishDate": 1758018414971,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyan Kumar Expected to Lead Union Bank as Banking Sector Reshuffle Unfolds",
            "Summary": "Kalyan Kumar is likely to become head of Union Bank of India while Lalit Tyagi may move to Central Bank of India, according to a reshuffle recommended by the department of financial services. This development means Asheesh Pandey, executive director of Bank of Maharashtra, will be dropped from the top post despite being recommended by the Financial Services Institutions Bureau (FSIB) in May for Union Bank's MD & CEO position. Kumar currently serves as executive director of Punjab National Bank, while Tyagi holds the same position at Bank of Baroda. Union Bank has been without a head since A Manimekhalai completed her term in June, and Central Bank's chief M V Rao finished his term in July. Pandey was previously recommended for Indian Bank's top post but faced objections from the Reserve Bank of India regarding his conduct. Manimekhalai's departure followed controversy over the procurement of nearly 2 lakh copies of a book for ₹7.25 crore without board approval.",
            "Sentiment": "neutral",
            "PublishDate": 1757124534078,
            "Source": "corporate_governance"
        },
        {
            "Title": "Union Bank of India to Participate in 'Build India, New India' Investor Conference",
            "Summary": "Union Bank of India will participate in the 'Build India, New India' investor conference organized by Antique Stock Broking Limited on August 20, 2025 in Mumbai. The meeting will be held in-person and no unpublished price sensitive information will be shared during the event. The bank will refer to publicly available documents for discussions during the interaction. The disclosure has been made available on the bank's website.",
            "Sentiment": "neutral",
            "PublishDate": 1755181341860,
            "Source": "stock"
        }
    ]
}