{
    "Symbol": "UNIPARTS",
    "ISIN": "INE244O01017",
    "News": [
        {
            "Title": "Uniparts India Q3FY26 Earnings Call on Feb 10",
            "Summary": "Uniparts India Limited announces earnings conference call on February 10, 2026 at 12:00 PM IST to discuss Q3 and nine months FY26 financial results for period ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770105240560,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uniparts India Shareholders Approve Remuneration Hike",
            "Summary": "Uniparts India Limited shareholders approved revision in managerial remuneration for Whole Time Director Ms. Tanushree Bagrodia through postal ballot with 99.29% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1769519174070,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uniparts India postal ballot for remuneration revision",
            "Summary": "Uniparts India Limited announces postal ballot notice for revision in managerial remuneration of Whole Time Director Ms. Tanushree Bagrodia with e-voting from December 28, 2025 to January 26, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766828041040,
            "Source": "stocks"
        },
        {
            "Title": "Uniparts India Appoints Tanushree Bagrodia As Group CEO",
            "Summary": "Uniparts India has appointed Tanushree Bagrodia as Group CEO, with her tenure set to begin on January 1, 2026. This leadership appointment affects the company's executive structure and signals a planned transition in top management.",
            "Sentiment": "positive",
            "PublishDate": 1764949969603,
            "Source": "corporate_governance"
        },
        {
            "Title": "Uniparts India Allots 1,045 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Uniparts India Limited allotted 1,045 equity shares of Rs. 10 each to eligible employees under its Employee Stock Option Scheme 2023, increasing the paid-up share capital from Rs. 45,13,37,580 to Rs. 45,13,48,030. The newly allotted shares will rank pari-passu with existing equity shares and the company will apply for listing on NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1764166024618,
            "Source": "corporate_action"
        },
        {
            "Title": "Uniparts India Reports 14% YoY Growth in Q2 with Strong EBITDA Margin Expansion",
            "Summary": "Uniparts India delivered 14% year-on-year revenue growth to Rs. 283 crores in Q2 with EBITDA expanding to 22.6%, driven by rupee depreciation benefits and operational stability despite North India flooding. The company maintains a net debt-free position with Rs. 226 crores cash, paid interim dividend of Rs. 37.7 crores, and secured new business awards worth Rs. 200 crores annually while targeting mid-teen growth for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763728720595,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Reports Strong Q2FY26 Results with 14.6% Revenue Growth",
            "Summary": "Uniparts India Limited delivered Q2FY26 consolidated revenue of Rs 2,827 million, marking 14.6% year-on-year growth, while EBITDA surged 52.6% to Rs 640 million and PAT jumped 86.3% to Rs 394 million. The global off-highway vehicle components manufacturer maintained consistent performance despite market softness, with EBITDA margins expanding to 22.6% from 17.0% in the previous year, reinforcing management's confidence in achieving double-digit growth for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763143464291,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Declares Special Interim Dividend of Rs. 22.50 Per Share",
            "Summary": "Uniparts India Limited's Board of Directors declared a Special Interim Dividend of Rs. 22.50 per equity share (225% on face value of Rs. 10 each) with October 23, 2025 as the record date. The dividend will be paid within 30 days of declaration. The company cited its strong cash position as the reason for this decision, stating it represents prudent capital allocation and reflects confidence in ongoing cash generation capabilities. The board also mentioned it will continue evaluating inorganic growth opportunities aligned with strategic objectives.",
            "Sentiment": "positive",
            "PublishDate": 1760359899157,
            "Source": "corporate_action"
        },
        {
            "Title": "Uniparts India Promoter Group Acquires Additional 0.23% Stake from Open Market",
            "Summary": "M/s Soni Holdings, a partnership firm and promoter group entity of Uniparts India Limited, has acquired 104,910 equity shares representing 0.23% of the company's share capital through open market purchases. The acquisition was disclosed under SEBI's Substantial Acquisition of Shares and Takeovers Regulations. The disclosure was signed by Jatin Mahajan, Head Legal, Company Secretary and Compliance Officer of Uniparts India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758633826276,
            "Source": "stock"
        },
        {
            "Title": "Uniparts India Reports 8.25% Quarter-on-Quarter Revenue Growth with Strong EBITDA Margins",
            "Summary": "Uniparts India Limited reported quarterly revenue of INR 273 crores, reflecting an 8.25% quarter-on-quarter increase and 4.2% year-on-year growth. EBITDA stood at INR 57.89 crores, up 39% from the previous quarter and 26% year-on-year, achieving a 20% EBITDA margin. The company maintains a net debt-free position with net cash of INR 241.6 crores. New business awards over the past 12 months totaled approximately INR 200 crores in annualized potential value. The off-highway industry continues facing volatility with tariff uncertainties affecting demand in the Americas, while Europe shows early signs of recovery. Management expects mid-teens growth for the full year, driven by new business wins across construction equipment, large agriculture, and aftermarket segments. The company's dual shore manufacturing capabilities help navigate market volatility and mitigate tariff-related risks. Capex outflow during the quarter was approximately INR 7 crores, with operating cash flow generation of INR 54 crores.",
            "Sentiment": "positive",
            "PublishDate": 1755162648472,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Reports Strong Q1 Performance with 39% Jump in Net Profit",
            "Summary": "Uniparts India delivered robust quarterly results with consolidated net profit rising to 345 million rupees from 248 million rupees year-over-year. Revenue grew to 2.7 billion rupees compared to 2.6 billion rupees in the same period last year. EBITDA increased significantly to 524 million rupees from 418 million rupees, while EBITDA margin expanded to 19.15% from 16% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754871987679,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Secures ₹200+ Cr New Business Wins, Expands into High-HP Tractors and Asia-Pacific Markets",
            "Summary": "Uniparts India has secured new business wins worth over ₹200 crores and is strategically expanding into high-horsepower tractors, large construction equipment, and Asia-Pacific markets. The company is leveraging its dual-shore manufacturing capabilities to target market outperformance despite facing industry headwinds.",
            "Sentiment": "positive",
            "PublishDate": 1754665835885,
            "Source": "stock"
        },
        {
            "Title": "Uniparts India Reports Strong Q1 Growth with Higher Profits and Announces Interim Dividend",
            "Summary": "Uniparts India delivered robust quarterly performance with EBITDA rising to 524 million rupees from 418 million rupees year-over-year, while EBITDA margin expanded to 19.15% from 16%. Consolidated net profit increased to 345 million rupees compared to 248 million rupees in the same period last year. Revenue grew to 2.7 billion rupees from 2.6 billion rupees year-over-year. The company declared a second interim dividend of ₹8.25 per share for FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1754657012185,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Schedules Board Meeting to Approve Q1 FY2025-26 Results and Consider Interim Dividend",
            "Summary": "Uniparts India Limited has scheduled a Board of Directors meeting for August 8, 2025 to approve standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The board will also consider declaring the first interim dividend for FY 2025-26 and fix the record date. The trading window for company shares has been closed since July 1, 2025 and will remain closed until August 10, 2025 for the announcement of the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753957467837,
            "Source": "corporate_action"
        },
        {
            "Title": "Uniparts India: Targets 20% EBITDA Margin by FY28, Maintains Mid-Teens Revenue Growth",
            "Summary": "Uniparts India aims to achieve a 20% EBITDA margin by FY28 through cost control and strong order books. The company maintains its mid-teens revenue growth guidance for FY26. COO Tanushree Bagrodia expects ROEs to approach 30% in 2-3 years. The company is expanding globally, with new business wins in Europe and the US, and is setting up a new warehouse in Mexico.",
            "Sentiment": "positive",
            "PublishDate": 1752200164000,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Reports Q4 Financial Results",
            "Summary": "Uniparts India has released its Q4 financial results. The company's EBITDA for Q4 was 353 million rupees, down from 474 million rupees year-over-year. The EBITDA margin decreased to 13.96% from 16.35% in the same period last year. Consolidated net profit for Q4 was 228 million rupees, compared to 286 million rupees year-over-year and 191 million rupees quarter-over-quarter. Q4 revenue stood at 2.5 billion rupees, down from 2.9 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748357760000,
            "Source": "result"
        },
        {
            "Title": "Uniparts India Reports Lower Q3 EBITDA and Margin",
            "Summary": "Uniparts India has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 319 million rupees, down from 410 million rupees in the same quarter of the previous year. The EBITDA margin also decreased, falling to 15.31% from 15.82% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738851956000,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Reports Decline in Q3 FY24 Financial Results",
            "Summary": "Uniparts India has announced its financial results for the third quarter of fiscal year 2024. The company's consolidated net profit decreased to 191 million rupees, down from 260 million rupees year-over-year and 212 million rupees quarter-over-quarter. Revenue also saw a decline, falling to 2.1 billion rupees from 2.59 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738851905000,
            "Source": "earnings"
        },
        {
            "Title": "Uniparts India Reports Q2 EBITDA Decline",
            "Summary": "Uniparts India's Q2 EBITDA decreased to 365.8 million rupees from 536 million rupees year-over-year. The company's EBITDA margin also fell to 15.15% from 18.26% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730986350000,
            "Source": "result"
        },
        {
            "Title": "Uniparts India Reports Q2 Revenue Decline",
            "Summary": "Uniparts India has reported a revenue of 2.4 billion rupees for the second quarter, compared to 2.94 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730986326000,
            "Source": "result"
        },
        {
            "Title": "Uniparts India Reports Q2 FY24 Financial Results",
            "Summary": "Uniparts India has announced its consolidated net profit for the second quarter of the fiscal year 2024. The company reported a net profit of 211 million rupees, which represents a decrease from 330 million rupees in the same quarter last year (YoY). However, it shows an increase from 248.9 million rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1730986318000,
            "Source": "result"
        }
    ]
}