{
    "Symbol": "UNITECH",
    "ISIN": "INE694A01020",
    "News": [
        {
            "Title": "Unitech Q3FY26 Loss Widens to Rs 679 Crore",
            "Summary": "Unitech Limited reported a net loss of Rs 679.33 crore for Q3FY26, significantly higher than Rs 419.33 crore in Q3FY25. Revenue declined to Rs 99.41 crore from Rs 130.70 crore year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770882154068,
            "Source": "co_actions_results"
        },
        {
            "Title": "Unitech Limited Reports Rs 805.67 Crore Loss for Q2 FY26 Amid Ongoing Supreme Court Proceedings",
            "Summary": "Unitech Limited reported a net loss of Rs 805.67 crore for the quarter ended September 30, 2025, compared to Rs 468.59 crore loss in the same period last year. Revenue from operations increased to Rs 138.08 crore from Rs 19.08 crore year-on-year. The company operates under a government-appointed board following Supreme Court directions from January 2020. The Resolution Framework for the Unitech group remains pending approval from the Supreme Court. The company faces significant challenges including Rs 10,530.22 crore in outstanding loans from banks and financial institutions, unpaid public deposits of Rs 529.13 crore, and material uncertainty regarding its ability to continue as a going concern. Auditors have issued a disclaimer of conclusion citing multiple legacy issues inherited from previous management, including insufficient evidence for asset valuations and pending reconciliations across various financial items.",
            "Sentiment": "negative",
            "PublishDate": 1763025563365,
            "Source": "earnings"
        },
        {
            "Title": "SEBI and Stock Exchanges Waive Penalties on Unitech, Remove Trading Restrictions",
            "Summary": "SEBI, NSE, and BSE have agreed to waive fines and penalties imposed on Unitech for non-compliances from its previous management. BSE will move Unitech's securities from the blacklisted Z category to the actively traded B category from October 7, while NSE will transfer the company from the restricted BZ series to the default EQ series. The fines waived were Rs 3.3 crore from BSE and Rs 3.5 crore from NSE. Unitech's government-appointed board, led by chairman Yudhvir Singh Malik, had been advocating for these changes since taking control. The Supreme Court approved seven directors to the company board in January 2020 after the government takeover. A forensic audit revealed that funds were siphoned by Unitech promoters from 74 projects, leading to project delays for homebuyers. The new management has resumed work at most stalled projects.",
            "Sentiment": "positive",
            "PublishDate": 1759248968036,
            "Source": "stock"
        },
        {
            "Title": "Unitech Limited Board Approves Auditor Appointments and Reviews Quarterly Financial Results",
            "Summary": "Unitech Limited's Board of Directors held a meeting on August 13, 2025, approving the appointment of M/s Pant S. & Associates as Cost Auditors for FY 2025-26 and CS Kiran Amarpuri as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The board also reviewed unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 5,246.59 lakhs and consolidated revenue of Rs. 10,500.26 lakhs for the quarter. The company recorded a standalone net loss of Rs. 40,835.85 lakhs and consolidated net loss of Rs. 73,866.02 lakhs for the quarter. The auditors issued disclaimer opinions on both standalone and consolidated results citing multiple concerns including going concern uncertainties, impairment assessment issues, and legacy problems inherited from previous management. The company continues to operate under Supreme Court supervision with a government-appointed board since January 2020.",
            "Sentiment": "negative",
            "PublishDate": 1755064329545,
            "Source": "corporate_action"
        },
        {
            "Title": "Unitech Ltd: Delhi High Court Grants Bail to Founder in Money Laundering Case",
            "Summary": "The Delhi High Court granted bail to Unitech Ltd.'s founder Ramesh Chandra, 88, in a money laundering case. Chandra was arrested by the Enforcement Directorate in October 2021 and had been on interim bail since 2022 due to medical reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1742548537000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Unitech Sells Wholly-Owned Subsidiary Unitech Power Transmission",
            "Summary": "Unitech, a real estate company, has announced the sale of its wholly-owned subsidiary, Unitech Power Transmission. This divestment represents a significant corporate action, potentially aimed at restructuring or focusing on core business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741695135000,
            "Source": "corporate_action"
        },
        {
            "Title": "Unitech Approves 100% Equity Disinvestment of UPTL",
            "Summary": "Unitech has approved a 100% equity disinvestment of UPTL (presumably Unitech Power Transmission Limited) for 508.9 million rupees. The disinvestment process is expected to be completed within 90 days of the execution of the Share Purchase Agreement (SPA).",
            "Sentiment": "neutral",
            "PublishDate": 1737115457000,
            "Source": "corporate_action"
        }
    ]
}