{
    "Symbol": "UNITDSPR",
    "ISIN": "INE854D01024",
    "News": [
        {
            "Title": "United Spirits seeks shareholder approval for new director",
            "Summary": "United Spirits Limited has issued a postal ballot notice seeking member approval for the appointment of Ms. Julie Bramham as Non-Executive Non-Independent Director, with e-voting scheduled from February 10 to March 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770620069240,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits COO Rajesh V Menon Transfers to Subsidiary",
            "Summary": "United Spirits Limited announces the transfer of Chief Operating Officer Rajesh V Menon to its wholly owned subsidiary Royal Challengers Sports Private Limited, effective February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769777776430,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits Completes ₹3.2 Crore Investment in Sober",
            "Summary": "United Spirits Limited has completed its additional investment of ₹3.2 crore in V9 Beverages Private Limited (Sober), increasing its stake from 15% to 25% on a fully diluted basis.",
            "Sentiment": "positive",
            "PublishDate": 1769613974932,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Spirits in focus as Poonawalla eyes RCB bid",
            "Summary": "United Spirits shares gain attention after Adar Poonawalla announces competitive bid for Royal Challengers Bengaluru IPL franchise. Company recently reported 24.77% jump in Q3 net profit to ₹418 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769140624323,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits shares drop 3% post Q3 results",
            "Summary": "United Spirits shares fell over 3% despite reporting 24.77% rise in Q3 net profit to ₹418 crore, as 2.71% revenue growth failed to impress investors.",
            "Sentiment": "negative",
            "PublishDate": 1768971923821,
            "Source": "co_actions_results"
        },
        {
            "Title": "CLSA Sets Hold Rating on United Spirits at ₹1,300",
            "Summary": "CLSA maintains Hold rating on United Spirits with target price of ₹1,300, reflecting cautious outlook on the alcoholic beverages company's near-term prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768968041060,
            "Source": "stocks"
        },
        {
            "Title": "Nuvama Maintains Buy Rating on United Spirits",
            "Summary": "Nuvama Securities maintains a Buy rating on United Spirits with a target price of ₹179.00, indicating positive outlook for the alcoholic beverages company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1768967893304,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits increases stake in V9 Beverages to 25%",
            "Summary": "United Spirits Limited board approves additional ₹3.20 crore investment in V9 Beverages Private Limited (Sober), increasing shareholding from 15% to 25% through subscription of preference shares.",
            "Sentiment": "positive",
            "PublishDate": 1768921382826,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Spirits Appoints Julie Bramham as Director",
            "Summary": "United Spirits Limited announces the appointment of Ms. Julie Bramham as Additional Director (Non-Executive Non-Independent Director) effective January 21, 2026, following board approval based on Nomination and Remuneration Committee recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1768921198395,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits Q3FY26 Results: Revenue Up 2.55% YoY",
            "Summary": "United Spirits reported Q3FY26 standalone revenue of ₹7,928 cr (up 2.55% YoY) with net profit rising 11.84% to ₹529 cr. Board declared interim dividend of ₹6 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768918731819,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nomura Initiates United Spirits with Buy Rating",
            "Summary": "Nomura Securities has initiated coverage on United Spirits with a Buy rating and set a target price of ₹1,650.00, indicating positive outlook for the alcoholic beverages company.",
            "Sentiment": "positive",
            "PublishDate": 1768537921230,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits Block Trade Worth ₹26.70 Crores",
            "Summary": "United Spirits Ltd. witnessed a significant block trade on NSE involving 200,611 shares valued at ₹26.70 crores, executed at ₹1,330.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1768371103880,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Spirits schedules Q3FY26 earnings call",
            "Summary": "United Spirits Limited has scheduled an investor and analyst call for January 21, 2026, at 4:00 PM IST to discuss its Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768221665563,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Spirits Board Meet Set for Jan 20, 2026",
            "Summary": "United Spirits Limited announces board meeting on January 20, 2026, to review Q3FY26 financial results and consider interim dividend declaration. Record date fixed as January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768221248563,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Spirits Board Meet on Jan 20 for Q3 Results",
            "Summary": "United Spirits Limited has scheduled a board meeting on January 20, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration with record date set for January 27.",
            "Sentiment": "neutral",
            "PublishDate": 1768220592429,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Spirits Block Trade Worth ₹27.64 Crores",
            "Summary": "United Spirits Ltd. witnessed a significant NSE block trade of ₹27.64 crores involving 202,184 shares at ₹1,366.90 per share, indicating substantial institutional activity in the alcoholic beverages company.",
            "Sentiment": "neutral",
            "PublishDate": 1767681988236,
            "Source": "co_actions_results"
        },
        {
            "Title": "United Spirits VP Commercial Finance Resigns",
            "Summary": "United Spirits Limited announces resignation of Mr. Diwaker Vij, Vice President - Commercial Finance, effective December 31, 2025, to pursue opportunities outside the company after 7 years of service.",
            "Sentiment": "neutral",
            "PublishDate": 1767184865259,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits Faces ₹0.40 Cr Penalty Order",
            "Summary": "United Spirits Limited receives penalty order from Punjab Excise Commissioner for ₹0.40 crores related to inadvertent operational lapse in printing of TT barcodes, with 30-day payment deadline.",
            "Sentiment": "negative",
            "PublishDate": 1766591907791,
            "Source": "stocks"
        },
        {
            "Title": "Investec Maintains 'Buy' on United Spirits at ₹1,673",
            "Summary": "Investec continues its positive outlook on United Spirits with a 'Buy' rating and price target of ₹1,673, reflecting confidence in the alcoholic beverages company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766115263443,
            "Source": "stocks"
        },
        {
            "Title": "United Spirits Limited Receives ESG Score of 73 for 2025",
            "Summary": "United Spirits Limited received an ESG score of 73 for 2025 from NSE Sustainability Ratings and Analytics Limited, down from a score of 75 for 2024. The rating was independently determined based on the company's public disclosures without any engagement from United Spirits Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765290370347,
            "Source": "stock"
        },
        {
            "Title": "United Spirits Limited Receives Improved ESG Rating of 72.8 for 2025",
            "Summary": "United Spirits Limited received an ESG score of 72.8 for 2025 from SEBI-registered ESG Rating Provider SESES ESG Research, showing improvement from the previous year's score of 70.4. The rating was independently determined based on the company's public disclosures without any engagement from United Spirits, demonstrating enhanced environmental, social, and governance performance.",
            "Sentiment": "positive",
            "PublishDate": 1763983749526,
            "Source": "stock"
        },
        {
            "Title": "United Spirits Appoints Walker Chandiok as New Statutory Auditor for Five-Year Term",
            "Summary": "United Spirits Limited's Board has recommended appointing Walker Chandiok & Co. LLP as statutory auditors for a five-year term from the 27th AGM in FY2026-27 to the 32nd AGM in FY2031-32, replacing PriceWaterhouseCo. who will complete their second five-year term. The appointment requires shareholder approval at the upcoming AGM, with Walker Chandiok being one of India's leading audit firms serving over 100 listed entities.",
            "Sentiment": "neutral",
            "PublishDate": 1763732358996,
            "Source": "corporate_action"
        },
        {
            "Title": "United Spirits Seeks Shareholder Approval for Independent Director Appointment",
            "Summary": "United Spirits Limited has initiated a postal ballot process for shareholders to approve the appointment of Mr. Narayan K. Seshadri as an Independent Director for a three-year term from October 9, 2025 to October 8, 2028. The e-voting period runs from November 21, 2025 to December 20, 2025, with results to be announced by December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763619683910,
            "Source": "corporate_action"
        },
        {
            "Title": "United Spirits Limited Receives Information Request from Ministry of Corporate Affairs",
            "Summary": "United Spirits Limited disclosed that it received a notice from the Ministry of Corporate Affairs calling for information under section 217(2) of the Companies Act, 2013. The notice was sent via email on October 31, 2025, and forwarded to the company's Compliance Officer on November 3, 2025. The company stated that the delay in intimation was due to assessing the nature and other aspects of the notice. The company indicated that there is no impact on financial, operational or other activities at this stage.",
            "Sentiment": "neutral",
            "PublishDate": 1762581211977,
            "Source": "corporate_governance"
        },
        {
            "Title": "United Spirits Initiates Strategic Review of Royal Challengers Sports Investment",
            "Summary": "United Spirits has announced the commencement of a strategic review regarding its investment in Royal Challengers Sports. The company expects to complete this review process by March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762343700613,
            "Source": "stock"
        },
        {
            "Title": "United Spirits Limited Closes Hyderabad Manufacturing Unit After Receiving Excise License Transfer Approval",
            "Summary": "United Spirits Limited has closed operations at its manufacturing unit located at Industrial Development Area, Nacharam, Hyderabad on November 1, 2025. The closure follows approval received from the Office of Commissioner, Prohibition and Excise, Telangana, Hyderabad to transfer the unit's excise license for manufacturing Indian Made Foreign Liquor. The approval was received on November 1, 2025 at 2:00 PM, leading to immediate cessation of operations. This closure is part of a multi-year supply chain agility program approved by the Board of Directors on January 24, 2023. During the financial year 2023-24, the unit contributed 1.5% to the company's revenue from operations. The company had initially estimated the closure date as July 31, 2025 in its February disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1762007505372,
            "Source": "corporate_action"
        },
        {
            "Title": "United Spirits Plans to Maintain Mid-to-High Teen EBITDA Margins",
            "Summary": "United Spirits announced plans to maintain EBITDA margins in the mid-to-high teens range for several years before implementing changes. The company targets bottom line growth that outpaces top line growth.",
            "Sentiment": "positive",
            "PublishDate": 1761991719516,
            "Source": "stock"
        },
        {
            "Title": "United Spirits Reports Strong Q2 Performance with 84% Jump in Net Profit",
            "Summary": "United Spirits Limited reported net profit of ₹498 crores for the quarter ended September 30, 2025, representing an 84% increase from ₹271 crores in the same quarter last year. Revenue from operations grew 8% to ₹7,192 crores compared to ₹6,671 crores in the previous year quarter. For the half-year period, net profit reached ₹721 crores versus ₹622 crores last year, while revenue increased 4% to ₹13,015 crores from ₹12,500 crores. The company acquired Nao Spirits & Beverages for ₹49 crores in June 2025, gaining 97% ownership after additional capital infusion of ₹56 crores. United Spirits recognized exceptional charges of ₹30 crores related to severance costs for a closed unit. The beverage alcohol segment generated ₹5,722 crores in revenue for the half-year, up from ₹5,195 crores previously.",
            "Sentiment": "positive",
            "PublishDate": 1761850385352,
            "Source": "earnings"
        },
        {
            "Title": "United Spirits Reports Strong Q2 Performance with 31% Rise in EBITDA",
            "Summary": "United Spirits delivered robust quarterly results with EBITDA increasing to 6.7 billion rupees from 5.1 billion rupees year-over-year. The company's EBITDA margin expanded to 21.20% compared to 17.83% in the same period last year. Net profit rose to 4.7 billion rupees from 3.35 billion rupees year-over-year, while revenue grew to 31.7 billion rupees from 28.43 billion rupees in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1761829094105,
            "Source": "earnings"
        },
        {
            "Title": "United Spirits Appoints Narayan K Seshadri as Independent Director",
            "Summary": "United Spirits' board has appointed Mr. Narayan K Seshadri as a new Non-Executive Independent Director. The appointment is set to begin on October 9, 2025, for a three-year term. The appointment requires shareholder approval to become effective.",
            "Sentiment": "neutral",
            "PublishDate": 1759907037224,
            "Source": "corporate_governance"
        },
        {
            "Title": "High Court Overturns 4.43 Billion Rupee Water Fee Claims Against United Spirits",
            "Summary": "The High Court has overridden water fee claims totaling 4.43 billion rupees against United Spirits. The court has directed the Water Resources Department (WRD) to reassess the water charge allocation.",
            "Sentiment": "positive",
            "PublishDate": 1759325035124,
            "Source": "stock"
        },
        {
            "Title": "United Spirits Declines to Comment on RCB Stake Sale Speculation",
            "Summary": "United Spirits has stated it does not comment on speculation regarding a potential stake sale in RCB (Royal Challengers Bangalore). The company has chosen not to provide any details or confirmation about the rumored transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1759245060031,
            "Source": "stock"
        },
        {
            "Title": "Adar Poonawalla Joins RCB Acquisition Group as Franchise Targets $2B Valuation",
            "Summary": "Adar Poonawalla is among the buyers involved in the Royal Challengers Bangalore (RCB) acquisition. The cricket franchise is targeting a valuation of $2 billion.",
            "Sentiment": "positive",
            "PublishDate": 1759232522276,
            "Source": "stock"
        },
        {
            "Title": "Karnataka Plans Liquor License Auctions, Allows Restaurant Participation",
            "Summary": "Karnataka state is planning to auction liquor licenses as a revenue generation measure and is currently drafting new regulations for this process. The state has decided to allow restaurants to participate in these liquor license auctions alongside other eligible entities.",
            "Sentiment": "neutral",
            "PublishDate": 1758781493545,
            "Source": "stock"
        },
        {
            "Title": "Delhi Government Considers Lowering Beer Drinking Age and Returning Private Liquor Shops",
            "Summary": "The Delhi Government is considering reducing the legal drinking age for beer from 25 to 21 years. The government is also exploring the possibility of bringing back private liquor shops. These measures are being considered as strategies to reduce black market sales in the liquor sector. The policy changes could potentially impact companies in the alcoholic beverages sector including United Spirits and UBL.",
            "Sentiment": "positive",
            "PublishDate": 1757652796842,
            "Source": "stock"
        },
        {
            "Title": "United Spirits Sees Rs. 21.40 Crore Block Trade on NSE",
            "Summary": "United Spirits Ltd. witnessed a block trade worth Rs. 21.40 crores on the National Stock Exchange. The transaction involved approximately 163,483 shares at a price of Rs. 1,309.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755578051647,
            "Source": "order&deals"
        },
        {
            "Title": "United Spirits Appoints Pragya Kaul as Company Secretary, Authorizes Key Personnel for Disclosure Decisions",
            "Summary": "United Spirits Limited appointed Ms. Pragya Kaul as Company Secretary and Compliance Officer effective September 1, 2025. The Board authorized three Key Managerial Personnel to form a Disclosure Committee for determining materiality of events and information for stock exchange disclosures. The committee includes Managing Director and CEO Mr. Praveen Someshwar, Executive Director and CFO Mr. Pradeep Jain, and newly appointed Company Secretary Ms. Pragya Kaul. The Board meeting lasted from 14:45 hours to 18:56 hours IST.",
            "Sentiment": "neutral",
            "PublishDate": 1755102551104,
            "Source": "corporate_governance"
        },
        {
            "Title": "United Spirits Reports Mixed Q1 Performance with Revenue Decline and Profit Drop",
            "Summary": "United Spirits Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, revenue from operations declined to ₹5,823 crores from ₹5,829 crores in the same quarter last year, while profit dropped to ₹258 crores from ₹299 crores. On a consolidated basis, revenue increased to ₹6,295 crores from ₹6,238 crores year-over-year, but profit fell to ₹417 crores from ₹485 crores. The company operates in two segments: beverage alcohol and sports through its subsidiary Royal Challengers Sports Private Limited. During the quarter, United Spirits acquired Nao Spirits & Beverages Private Limited for ₹35 crores on June 26, 2025, obtaining a 97% stake. The company recorded exceptional items of ₹11 crores in standalone results and ₹14 crores in consolidated results, primarily related to employee severance costs and financial assistance for deceased fans due to a stampede incident. The beverage alcohol segment generated revenue of ₹2,549 crores while the sports segment contributed ₹478 crores.",
            "Sentiment": "negative",
            "PublishDate": 1755097767680,
            "Source": "earnings"
        },
        {
            "Title": "Diageo Reports 7.1% Net Sales Growth in India, Reopens Andhra Pradesh Operations After 5 Years",
            "Summary": "Diageo, the parent company of United Spirits, reported 7.1% growth in net sales in India during the quarter. The company experienced strong growth in its Black & White, Signature, and Royal Challenge brands, along with positive growth in McDowell's brand. Additionally, Diageo has reopened its operations in Andhra Pradesh after a 5-year absence from the state.",
            "Sentiment": "positive",
            "PublishDate": 1754374383968,
            "Source": "stock"
        },
        {
            "Title": "United Spirits Reports 9.4% Revenue Growth in Q1FY26 Despite Muted Demand Environment",
            "Summary": "United Spirits Limited reported consolidated net sales of INR 3,021 crores for the quarter ended June 30, 2025, representing a 9.4% increase from INR 2,761 crores in the same period last year. On a standalone basis, total revenue grew 8.4% to INR 2,549 crores. The P&A segment contributed INR 2,251 crores with 9.0% growth, while the Popular segment showed stronger growth of 13.6% reaching INR 250 crores. The Other/NBR segment declined 27.3% to INR 48 crores. The company noted it was comparing against a high prior year base that included proactive actions to mitigate potential supply chain disruptions due to Union Elections. Management stated that while the demand environment remains muted, they have sustained growth momentum. The board meeting to approve detailed unaudited results is scheduled for August 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754316654084,
            "Source": "earnings"
        },
        {
            "Title": "United Spirits Faces Tax Demands Worth 3.45 Billion Rupees",
            "Summary": "United Spirits has received tax demands totaling 1.79 billion rupees and 1.66 billion rupees. The combined tax demands amount to 3.45 billion rupees for the alcoholic beverages company.",
            "Sentiment": "negative",
            "PublishDate": 1754053551248,
            "Source": "stock"
        },
        {
            "Title": "United Spirits to Make Voluntary Customs Payment of Up to ₹1.25 Billion Following DSL Notice on Bulk Scotch Pricing",
            "Summary": "United Spirits received a notice from DSL regarding a pricing shortfall in bulk Scotch. The company will make a voluntary customs payment of up to ₹1.25 billion rupees. DSL will reimburse United Spirits up to ₹1.45 billion rupees in connection with this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1753713771289,
            "Source": "stock"
        },
        {
            "Title": "Indian Liquor Stocks Fall as India-UK Trade Deal Cuts Scotch Import Duties",
            "Summary": "Shares of Indian liquor companies declined following the signing of a free trade agreement between India and the United Kingdom. Radico Khaitan dropped 1.69%, Tilaknagar Industries fell 2.09%, and United Spirits was down 0.69%. The FTA will immediately reduce import duties on Scotch whisky and gin from 150% to 75%, with further cuts to 40% over ten years. This could lower consumer prices for imported spirits by Rs 100 to Rs 300 per bottle, benefiting multinational brands like Johnnie Walker, Chivas Regal, and Ballantine's. However, the actual consumer price impact may be limited due to state-level pricing mechanisms and excise duties. The Brewers Association of India noted that any price drops may be temporary or limited in scope.",
            "Sentiment": "negative",
            "PublishDate": 1753418734687,
            "Source": "stock"
        },
        {
            "Title": "United Spirits: Full Acquisition of NAO Spirits in ₹130-Crore Deal",
            "Summary": "United Spirits Limited (USL) to acquire 100% ownership of NAO Spirits & Beverages, maker of premium Indian craft gin brands, for ₹130 crore. The acquisition will be completed in stages by June 2026, with USL's stake increasing from 30% to 97.07% initially. The deal aims to strengthen USL's craft gin portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1750345208000,
            "Source": "corporate_action"
        },
        {
            "Title": "United Spirits Approves Additional Investment in Nao Spirits",
            "Summary": "United Spirits' Board has approved an additional investment of up to ₹200 million in Nao Spirits for working capital and expansion. The company has also acquired a majority stake in Nao Spirits & Beverages for ₹1.1 billion. Nao Spirits is known for producing premium Indian craft gins such as 'Greater Than' and 'Hapusa'.",
            "Sentiment": "positive",
            "PublishDate": 1750342638000,
            "Source": "default"
        },
        {
            "Title": "United Spirits: Maharashtra Excise Duty Hike Raises Concerns",
            "Summary": "Maharashtra increased excise duty on liquor by 50%, potentially impacting United Spirits Ltd. Analysts estimate 15-30% retail price hike, possibly leading to volume contraction. United Spirits derives 15% of revenue from Maharashtra. Brokerages await details on premium vs mass-market brand impact.",
            "Sentiment": "negative",
            "PublishDate": 1749698618000,
            "Source": "normal_news"
        },
        {
            "Title": "United Spirits Ltd. Block Trade on NSE",
            "Summary": "A block trade of United Spirits Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 168,378 shares at a price of Rs. 1520.00 per share, totaling Rs. 25.59 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749613669000,
            "Source": "block_details"
        },
        {
            "Title": "Maharashtra Increases Liquor Excise Duty",
            "Summary": "The Maharashtra state cabinet has approved an increase in excise duty on liquor. This decision will lead to a rise in liquor prices in the state. United Spirits, a liquor company, is mentioned in the context of this news.",
            "Sentiment": "neutral",
            "PublishDate": 1749600248000,
            "Source": "default"
        },
        {
            "Title": "Liquor Prices Rise in Maharashtra Following Excise Duty Hike",
            "Summary": "The state cabinet of Maharashtra has approved an increase in excise duty on liquor, resulting in higher prices for alcoholic beverages. United Spirits, a liquor company, is mentioned in the context of this price increase.",
            "Sentiment": "neutral",
            "PublishDate": 1749568527000,
            "Source": "default"
        },
        {
            "Title": "United Spirits: Denies Speculation on RCB Stake Sale",
            "Summary": "United Spirits Ltd. has officially denied reports about potential stake sale discussions regarding the IPL franchise Royal Challengers Bengaluru (RCB). The company stated that such media reports are speculative and that no such discussions are being pursued.",
            "Sentiment": "neutral",
            "PublishDate": 1749549738000,
            "Source": "normal_news"
        }
    ]
}