{
    "Symbol": "UNIVPHOTO",
    "ISIN": "INE03V001013",
    "News": [
        {
            "Title": "Universus Photo Imagings Updates on Associate Company Share Allotment",
            "Summary": "Universus Photo Imagings Limited informed exchanges that its associate company JPF Netherlands B.V. allotted 39,86,968 equity shares through rights issue exercise. The company clarified that despite the share allotment, there is no change in its percentage holding in the associate company.",
            "Sentiment": "neutral",
            "PublishDate": 1765007046582,
            "Source": "corporate_action"
        },
        {
            "Title": "Universus Photo Imagings Faces Appeal Challenge at NCLAT Over Dismissed Oppression Petition",
            "Summary": "Shareholder Mr. Ankit Jain has filed an appeal before the National Company Law Appellate Tribunal challenging the NCLT Allahabad's order dated 15.10.2025 that dismissed his oppression and mismanagement petition against Universus Photo Imagings Limited. The company states there are no expected financial implications from this legal challenge and is preparing its response to the appeal proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1764322391082,
            "Source": "stock"
        },
        {
            "Title": "Universus Photo Imagings Reports Mixed Quarterly Results with Standalone Profit but Consolidated Loss",
            "Summary": "Universus Photo Imagings Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported a profit of Rs 620 lakhs for the quarter compared to Rs 893 lakhs in the previous quarter. However, on a consolidated basis, the company posted a loss of Rs 1,451 lakhs for the quarter versus a loss of Rs 1,702 lakhs in the previous quarter. The company's revenue from operations declined to Rs 497 lakhs in the current quarter from Rs 899 lakhs in the previous quarter. During the quarter, the company invested Rs 12,518 lakhs as subscription towards a rights issue of shares offered by JPF Netherlands BV to all shareholders in proportion to their shareholding, with allotment pending as of September 30, 2025. The audit of foreign associate company JPF Netherlands BV for financial year 2024-25 remains incomplete, and consolidated results were prepared based on unaudited figures certified by management.",
            "Sentiment": "negative",
            "PublishDate": 1763003193708,
            "Source": "earnings"
        },
        {
            "Title": "Universus Photo Imagings Wins NCLT Case Against Shareholder Allegations",
            "Summary": "The National Company Law Tribunal (NCLT) dismissed a petition filed by shareholder Mr. Ankit Jain against Universus Photo Imagings Limited. Jain had filed the petition under Section 241-242 of the Companies Act, 2013, alleging instances of oppression and mismanagement in the company's affairs. The NCLT Allahabad Bench ruled in favor of Universus Photo Imagings and dismissed the petition with no costs on October 15, 2025. The company stated there are no expected financial implications, penalties, or restrictions resulting from this order, and no further action is required since the petition was dismissed.",
            "Sentiment": "positive",
            "PublishDate": 1761152636530,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Dismisses Oppression and Mismanagement Petition Against Universus Photo Imagings",
            "Summary": "The National Company Law Tribunal (NCLT) Allahabad Bench dismissed a petition filed by shareholder Ankit Jain against Universus Photo Imagings Limited. The petition, filed in 2022 under Sections 241-242 of the Companies Act 2013, alleged oppression and mismanagement in the company's affairs. The NCLT decided the matter in favor of the company during a hearing held on October 15, 2025. The company is awaiting the formal signed order and has stated it will comply with any directions contained in the order.",
            "Sentiment": "positive",
            "PublishDate": 1760606865124,
            "Source": "corporate_governance"
        },
        {
            "Title": "Universus Photo Imagings Approves Subscription to JPF Netherlands Rights Issue",
            "Summary": "Universus Photo Imagings Limited's Board of Directors approved the subscription to equity shares of JPF Netherlands B.V. through a rights issue. JPF Netherlands, an associate company with a turnover of Euro 492.65 million in FY 2024-25, operates in manufacturing of BOPP and other flexible packaging films. The acquisition will be made at Euro 3 per share on a cash basis. Universus Photo Imagings currently holds 39.87% shareholding in JPF Netherlands, and this percentage will remain unchanged after the rights issue subscription. The transaction is being conducted at arm's length basis with an expected completion timeframe of 3-4 months. No governmental or regulatory approvals are required for this acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1756304570477,
            "Source": "corporate_action"
        },
        {
            "Title": "Universus Photoimagings Ltd Approves Q1 FY2025-26 Financial Results and Key Auditor Appointments",
            "Summary": "Universus Photoimagings Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, during a board meeting held on August 13, 2025. The company reported standalone revenue from operations of Rs 497 lakhs and net profit of Rs 893 lakhs for the quarter. On a consolidated basis, the company posted a net loss of Rs 1,702 lakhs, primarily due to losses from its foreign associate JPF Netherlands BV, which reported losses of 7,291 thousand euros. The Board also appointed M/s. DMK Associates as Secretarial Auditor for a five-year term from FY2025-26 to FY2029-30, subject to shareholder approval. Additionally, Mr. Suresh Kumar was appointed as Internal Auditor for FY2025-26. The company trades on BSE (542933) and NSE (UNIVPHOTO).",
            "Sentiment": "neutral",
            "PublishDate": 1755100999199,
            "Source": "earnings"
        }
    ]
}