{
    "Symbol": "UNIVCABLES",
    "ISIN": "INE279A01012",
    "News": [
        {
            "Title": "Universal Cables Q3FY26 Net Profit Surges 93% YoY",
            "Summary": "Universal Cables Limited reported standalone net profit of ₹18.74 crore for Q3FY26, up 93% YoY. Nine-month revenue grew 25.83% to ₹2,182.40 crore with EBITDA margin expanding 176 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1770391732677,
            "Source": "co_actions_results"
        },
        {
            "Title": "Universal Cables Partners with TS Conductor Corp",
            "Summary": "Universal Cables approves strategic deal with TS Conductor Corp, USA to produce advanced High Temperature Low Sag (HTLS) conductors, expanding manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768396566995,
            "Source": "co_actions_results"
        },
        {
            "Title": "Universal Cables Senior Manager Amit Kasture Resigns",
            "Summary": "Universal Cables Limited announced the resignation of Mr. Amit Kasture, Assistant Vice-President (Works)/Factory Manager at Goa Unit, effective January 12, 2026, citing personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1768223554002,
            "Source": "stocks"
        },
        {
            "Title": "Universal Cables Limited VP Hemant Talele Resigns from Capacitor Production Role",
            "Summary": "Universal Cables Limited announced the resignation of Vice-President Capacitor Production Hemant Shrav Talele, effective from close of business hours on November 29, 2025, citing personal reasons. Talele, who served the company for eleven years, stated his decision was based on the necessity to move permanently near his native place.",
            "Sentiment": "neutral",
            "PublishDate": 1764423736942,
            "Source": "corporate_governance"
        },
        {
            "Title": "ICICI Prudential Mutual Fund Reduces Stake in Universal Cables by 2.118%",
            "Summary": "ICICI Prudential Mutual Fund sold 7,34,833 shares of Universal Cables Ltd through net disposal from September 06, 2024 to November 20, 2025, reducing its holding from 5.224% to 3.106%. The fund's shareholding decreased by more than 2% of the company's paid-up capital, triggering regulatory disclosure requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763726502474,
            "Source": "order&deals"
        },
        {
            "Title": "Universal Cables Reports Record H1 Revenue of Rs 1,414 Crore, Net Profit Surges 170%",
            "Summary": "Universal Cables Limited reported its highest-ever half-year revenue of Rs 1,414 crore for H1 FY2025-26, representing 25% growth. Standalone net profit jumped 170% to Rs 56.04 crore compared to the same period last year. The company achieved record quarterly revenue of Rs 814.29 crore in Q2, up 27.60% year-on-year. EBITDA margin improved by 152 basis points to 10.28%. The company secured significant export orders including a USD 38 million order for 400kV EHV Cable from Middle East and expects a USD 25 million order from Latin America. Pending order book stands at approximately Rs 2,945 crore. The board also appointed Shri Gopal Agarwal as Chief Financial Officer. Capacity expansion project worth Rs 525 crore is progressing with two CCV lines commissioned and operating at full capacity.",
            "Sentiment": "positive",
            "PublishDate": 1762991853371,
            "Source": "earnings"
        },
        {
            "Title": "Universal Cables Reports Strong Q2 Performance with 161% Jump in Net Profit",
            "Summary": "Universal Cables delivered robust quarterly results with consolidated net profit surging to 477 million rupees from 183 million rupees year-over-year. Revenue grew significantly to 8.14 billion rupees compared to 6.4 billion rupees in the same period last year. The company's EBITDA increased to 727 million rupees from 471 million rupees, while EBITDA margin improved to 8.93% from 7.38% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762958724202,
            "Source": "earnings"
        },
        {
            "Title": "Universal Cables CFO Amit Kumar Chopra Resigns Due to Personal Reasons",
            "Summary": "Universal Cables Limited announced that Mr. Amit Kumar Chopra has resigned from his position as Chief Financial Officer, effective from the close of business hours on September 22nd, 2025. The resignation is attributed to personal reasons as stated in his formal resignation letter dated July 26th, 2025. Chopra will also cease to be a Key Managerial Personnel under the Companies Act, 2013. In his resignation letter, Chopra expressed gratitude for the opportunity to serve as CFO and committed to ensuring a smooth transition during his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1758547177594,
            "Source": "corporate_governance"
        },
        {
            "Title": "Universal Cables Reports Strong Q1 Performance with Net Profit Surging to 329 Million Rupees",
            "Summary": "Universal Cables delivered robust quarterly results with consolidated net profit jumping to 329 million rupees from 55.90 million rupees year-over-year. Revenue grew to 6 billion rupees compared to 4.9 billion rupees in the same period last year. EBITDA increased significantly to 578 million rupees from 327 million rupees year-over-year, while EBITDA margin improved to 9.63% from 6.7% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754872106327,
            "Source": "earnings"
        },
        {
            "Title": "Universal Cables Reports Strong Q1 Performance with Profit Surge and Strategic Corporate Guarantee Approval",
            "Summary": "Universal Cables Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹60,019.29 lakhs compared to ₹48,870.13 lakhs in the same quarter last year. Standalone profit for the period increased significantly to ₹1,949.85 lakhs from ₹166.77 lakhs year-over-year. Consolidated profit reached ₹3,291.33 lakhs versus ₹559.19 lakhs in the previous year quarter. The Board approved issuing a corporate guarantee to Lightera, LLC for up to USD 11,307,300 (50% of total arrangement value of USD 22,614,600) to facilitate Birla Furukawa Fibre Optics Private Limited's import of preforms from Shin-Etsu Chemical Co., Ltd., Japan. Additionally, Sanjeev Dubey, Senior Vice President (Sales & EHV Operations), was designated as Senior Managerial Personnel effective August 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754664868499,
            "Source": "earnings"
        },
        {
            "Title": "EU Imposes Countervailing Duty on Indian Optical Fibre Cables",
            "Summary": "Universal Cables has informed that the European Union has imposed a countervailing duty on optical fibre cables imported from India. No specific details about the duty rate or its impact on the company were provided in the given information.",
            "Sentiment": "negative",
            "PublishDate": 1749774464000,
            "Source": "default"
        },
        {
            "Title": "EU Imposes Countervailing Duty on Indian Optical Fibre Cables",
            "Summary": "Universal Cables has reported that the European Union has imposed a countervailing duty on optical fibre cables imported from India. No specific details about the duty rate or its impact on the company were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749735935000,
            "Source": "default"
        },
        {
            "Title": "Universal Cables Reports Q4 Results and Dividend Recommendation",
            "Summary": "Universal Cables has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit was 497 million rupees, compared to 485.7 million rupees year-over-year and 158 million rupees quarter-over-quarter. Q4 revenue stood at 6.74 billion rupees, up from 5.8 billion rupees in the previous year. The Q4 EBITDA was 618 million rupees, slightly higher than the 611.7 million rupees in the same quarter last year. However, the EBITDA margin decreased to 9.17% from 10.54% year-over-year. The company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747925449000,
            "Source": "result"
        },
        {
            "Title": "Universal Cables Reports Q3 Financial Results and Capacity Expansion",
            "Summary": "Universal Cables announced its Q3 consolidated net profit of 158 million rupees, down from 239 million rupees year-over-year. However, Q3 revenue increased to 6.08 billion rupees from 4.66 billion rupees in the previous year. The company also reported ongoing capacity expansion projects at its Satna and Verna facilities, with an increased aggregate capital outlay from 2.77 billion rupees to 4.82 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739233242000,
            "Source": "earnings"
        },
        {
            "Title": "Universal Cables Expands Capacity with Increased Capital Outlay",
            "Summary": "Universal Cables has announced an expansion of its capacity expansion project at facilities in Satna, Madhya Pradesh and Verna, Goa. The company has significantly increased its capital outlay for these projects from 2.77 billion rupees to 4.82 billion rupees, indicating a substantial investment in growth and production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1739200370000,
            "Source": "corporate_action"
        },
        {
            "Title": "Universal Cables Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Universal Cables has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 346 million rupees from 407 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 5.70% from 8.72% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739199938000,
            "Source": "earnings"
        },
        {
            "Title": "Universal Cables Reports Mixed Q3 Financial Results",
            "Summary": "Universal Cables has announced its Q3 financial results. The company's consolidated net profit decreased to 158 million rupees from 239 million rupees in the same quarter last year. However, revenue increased to 6.08 billion rupees from 4.66 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739199934000,
            "Source": "earnings"
        },
        {
            "Title": "Universal Cables Reports Strong Q2 EBITDA Growth",
            "Summary": "Universal Cables has reported a significant increase in its Q2 EBITDA, which rose to 471 million rupees from 232 million rupees in the same quarter last year. The company's EBITDA margin also improved, increasing to 7.38% from 4.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729865033000,
            "Source": "result"
        },
        {
            "Title": "Universal Cables Reports Strong Q2 Financial Results",
            "Summary": "Universal Cables has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 183 million rupees, up from 116 million rupees year-over-year and 56 million rupees quarter-over-quarter. Revenue also saw a substantial rise to 6.4 billion rupees, compared to 4.94 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729864982000,
            "Source": "result"
        }
    ]
}