{
    "Symbol": "UNIVASTU",
    "ISIN": "INE562X01013",
    "News": [
        {
            "Title": "UNIVASTU Wins ₹9 Cr Myrtha Pools Contract",
            "Summary": "UNIVASTU India Limited secured a ₹9 crore contract from Sports Authority of Gujarat for Myrtha Pools installation, with completion timeline of 12-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1768808268359,
            "Source": "co_actions_results"
        },
        {
            "Title": "Univastu Wins ₹391.76 Cr Mumbai Metro Contract",
            "Summary": "Univastu India secures major work order from Larsen & Toubro for electrical and mechanical tasks on Mumbai Metro Line 4, including 5-year maintenance period with 100-week completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768539764432,
            "Source": "co_actions_results"
        },
        {
            "Title": "Univastu India gains 3% on ₹12.56 cr L&T order",
            "Summary": "Univastu India shares surge nearly 3% after securing ₹12.56 crore order from L&T for civil works on Mumbai-Ahmedabad bullet train project, adding to existing order book of ₹1,009 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767957974430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Univastu Secures ₹125.7 Cr Order from L&T",
            "Summary": "Univastu India Limited has secured a significant work order worth ₹125.7 crores from engineering giant Larsen & Toubro, marking a major business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1767873718821,
            "Source": "co_actions_results"
        },
        {
            "Title": "Univastu India Signs MOU with Sweden's Urban Systems",
            "Summary": "Univastu India Limited has approved a Memorandum of Understanding with Urban Systems AB, a Swedish company, marking a potential international collaboration in the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1766153881592,
            "Source": "co_actions_results"
        },
        {
            "Title": "Univastu India Sets October 13 as Ex-Date for 2:1 Bonus Issue",
            "Summary": "Univastu India has announced a 2:1 bonus issue with October 13 as the ex-date and record date. Shareholders holding shares by the end of October 12 will receive two bonus shares for every one share held. This marks the company's second bonus issue since listing, following a 1:1 bonus in December 2019. Univastu India operates as an engineering, procurement, and construction company focusing on civil infrastructure projects across industrial, institutional, and commercial sectors. The stock has shown positive performance with gains of 0.75% in the past day, 9.71% over the past week, 8.74% over three months, 12.53% over six months, and 24.66% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1760064578064,
            "Source": "corporate_action"
        },
        {
            "Title": "Univastu India Wins ₹22.89 Crore Olympic Swimming Pool Contract in Nagpur",
            "Summary": "Univastu India has secured a ₹22.89 crore contract from Super Construction Company to build an Olympic-standard swimming pool in Nagpur. The project is expected to be completed within 8 months after civil work begins.",
            "Sentiment": "positive",
            "PublishDate": 1756971576235,
            "Source": "order&deals"
        },
        {
            "Title": "Univastu India Secures 2.44 Billion Rupee Contract",
            "Summary": "Univastu India has been awarded a contract valued at 2.44 billion rupees, inclusive of GST. No further details about the nature of the contract or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747613564000,
            "Source": "default"
        },
        {
            "Title": "Univastu India Secures 2.44 Billion Rupee Contract",
            "Summary": "Univastu India has been awarded a contract valued at 2.44 billion rupees, inclusive of GST. No further details about the nature of the contract or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747403092000,
            "Source": "default"
        }
    ]
}