{
    "Symbol": "UNOMINDA",
    "ISIN": "INE405E01023",
    "News": [
        {
            "Title": "Uno Minda Issues Rs. 100 Crore Commercial Paper",
            "Summary": "Uno Minda Limited has issued unlisted Commercial Paper worth Rs. 100 Crore with allotment date February 06, 2026 and maturity date March 20, 2026, as informed to stock exchanges under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770381695152,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uno Minda Plans ₹7.64 Billion Maharashtra Plant",
            "Summary": "Uno Minda announces major expansion with new AW4W manufacturing facility in Maharashtra requiring investment of ₹7.64 billion, marking significant growth in automotive component sector.",
            "Sentiment": "positive",
            "PublishDate": 1770275121410,
            "Source": "stocks"
        },
        {
            "Title": "Uno Minda Q3 Net Profit Rises 20.69% to ₹2.8B",
            "Summary": "Uno Minda reported consolidated net profit of ₹2.8 billion for Q3, marking a 20.69% year-on-year growth from ₹2.32 billion, though falling short of analyst estimates of ₹3.02 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770274860787,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uno Minda Board Meeting on Feb 5 for Interim Dividend",
            "Summary": "Uno Minda Limited has scheduled a board meeting on February 05, 2026, to consider recommending interim dividend payment for FY26. The company has issued detailed tax guidelines for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1770126211703,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uno Minda schedules Q3 FY26 earnings call",
            "Summary": "Uno Minda Limited announces earnings call on February 5, 2026 at 3:30 PM to discuss Q3 & 9MFY26 operational and financial performance with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769511040372,
            "Source": "stocks"
        },
        {
            "Title": "Uno Minda invests ₹6.50 cr in renewable energy SPV",
            "Summary": "Uno Minda Limited and subsidiary approved ₹6.50 crore investment in Hexa Sunshine Private Limited SPV to source wind and solar power for Gujarat units, targeting up to 30% equity stake.",
            "Sentiment": "positive",
            "PublishDate": 1768802652481,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uno Minda Participates in CES 2026 Las Vegas",
            "Summary": "UNO Minda Limited showcases cutting-edge automotive solutions at Consumer Electronics Show 2026 in Las Vegas, exploring business cooperation with Autolink Information Technology Co., Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1767764354693,
            "Source": "stocks"
        },
        {
            "Title": "UNO Minda breaks symmetrical triangle pattern",
            "Summary": "UNO Minda stock broke out from symmetrical triangle formation on daily charts, opening room for upward movement. Experts suggest target above ₹1,400 levels for short-term traders.",
            "Sentiment": "positive",
            "PublishDate": 1767661085477,
            "Source": "stocks"
        },
        {
            "Title": "Uno Minda Subsidiary Receives GST Order Worth ₹25.10 Lakh",
            "Summary": "MI Torica India, subsidiary of Uno Minda, receives GST order demanding ₹25.10 lakh for excess input tax credit and RCM tax liability issues for FY 2019-20. Company plans to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1767616466436,
            "Source": "stocks"
        },
        {
            "Title": "Uno Minda Receives Tax Penalty Order Worth ₹1.16 Cr",
            "Summary": "Uno Minda Limited receives penalty order from Haryana Excise & Taxation Department for alleged short tax payment on outward supply for FY 2018-19, totaling ₹1.16 crores including tax, interest and penalty.",
            "Sentiment": "negative",
            "PublishDate": 1767260612592,
            "Source": "stocks"
        },
        {
            "Title": "Uno Minda Issues ₹100 Crore Commercial Paper",
            "Summary": "Uno Minda Limited has issued unlisted commercial paper worth ₹100 crores with allotment on December 24, 2025, maturing on February 10, 2026, under SEBI LODR Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1766578202886,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uno Minda Executes Restated JV Agreement",
            "Summary": "Uno Minda Limited executed a restated joint venture agreement with Toyoda Gosei Co. Ltd. following consolidation of shareholding in their joint venture company.",
            "Sentiment": "neutral",
            "PublishDate": 1766494043219,
            "Source": "co_actions_results"
        },
        {
            "Title": "UNO Minda Completes UMBM Acquisition",
            "Summary": "UNO Minda has successfully completed the acquisition of remaining shares in UMBM, making it a fully owned subsidiary through the purchase of outstanding equity stakes.",
            "Sentiment": "positive",
            "PublishDate": 1765809268464,
            "Source": "co_actions_results"
        },
        {
            "Title": "UNO Minda Allots 81,747 Shares Under ESOP Scheme",
            "Summary": "UNO Minda Limited allotted 81,747 equity shares under its Employee Stock Option Scheme 2019, increasing paid-up capital from ₹115.39 crores to ₹115.41 crores on December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765796215210,
            "Source": "co_actions_results"
        },
        {
            "Title": "UNO Minda Ends Joint Venture with Buehler, Signs New Technical License Agreement",
            "Summary": "UNO Minda has finalized agreements to terminate its joint venture partnership with Buehler while simultaneously entering into an updated technical license agreement. The restructuring affects the operational relationship between the two companies, potentially altering UNO Minda's business structure and technical collaboration framework.",
            "Sentiment": "neutral",
            "PublishDate": 1765014018808,
            "Source": "order&deals"
        },
        {
            "Title": "UnoMinda Allots 1,99,260 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "UnoMinda Limited's Nomination Remuneration Committee approved the allotment of 1,99,260 equity shares of Rs. 2 face value each under its Employee Stock Option Scheme 2019. The company's paid-up equity share capital increased from Rs. 115,35,41,166 to Rs. 115,39,39,686, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764572455401,
            "Source": "corporate_action"
        },
        {
            "Title": "UNO Minda Acquires 49.90% Stake in Joint Venture, Ends Partnership with Buehler Motor",
            "Summary": "UNO Minda Ltd purchased a 49.90% share in UNO Minda Buehler Motor Private Limited from Buehler Motor Gmbh, terminating their existing joint venture agreement. The company also allocated up to INR 40 crores for UNO Minda EV Systems Pvt. Ltd, indicating expansion in the electric vehicle segment.",
            "Sentiment": "positive",
            "PublishDate": 1764564795570,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda Reports Record Q2 Revenue of ₹4,814 Crores with 13.4% Growth",
            "Summary": "Uno Minda Limited delivered its highest quarterly revenue of ₹4,814 crores in Q2 FY26, marking 13.4% year-on-year growth. EBITDA increased 14% to ₹552 crores with margins improving to 11.5%. Profit after tax grew 24% to ₹304 crores. The company's switching systems business contributed ₹1,176 crores (25% of revenue) with 11% growth, while lighting systems generated ₹1,106 crores (23% of revenue) with 14% growth. Casting business recorded ₹917 crores revenue with 9% growth. Share of profit from associates rose to ₹63 crores from ₹48 crores, driven by strong performance from the airbag joint venture which saw 28% revenue growth. The company has 10 expansion projects underway with investment commitments of ₹2,356 crores. Net debt increased to ₹2,362 crores from ₹2,091 crores as of March 2025, with debt-to-equity ratio at 0.36. Management expressed optimism for the second half of FY26, citing festive momentum and favorable policy environment.",
            "Sentiment": "positive",
            "PublishDate": 1763011934876,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Reports Strong Q2 Performance with 21% Revenue Growth and Strategic Acquisitions",
            "Summary": "Uno Minda Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company's standalone revenue from operations increased to Rs 3,390.33 crores in Q2 compared to Rs 2,812.55 crores in the same quarter last year. Net profit after tax rose to Rs 254.58 crores from Rs 215.60 crores year-on-year. For the six-month period, revenue reached Rs 6,770.06 crores versus Rs 5,582.87 crores in the previous year, with net profit of Rs 515.20 crores compared to Rs 403.48 crores. The company completed several strategic initiatives including the allotment of 19.04 lakh equity shares under ESOP schemes, issuance of Rs 200 crores worth of non-convertible debentures, and investments in subsidiary companies. Uno Minda also completed acquisitions including E-drive business assets and equity stakes in various ventures. The Board recommended a final dividend of Rs 1.50 per equity share for the financial year ended March 31, 2025, which was approved by shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1762505095493,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Reports 13.4% Revenue Growth in Q2",
            "Summary": "Uno Minda reported quarterly revenue of 48.1 billion rupees compared to 42.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1762502445369,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Reports 22% Growth in Quarterly Net Profit to 3 Billion Rupees",
            "Summary": "Uno Minda reported quarterly consolidated net profit of 3 billion rupees compared to 2.45 billion rupees in the same period last year. The company's EBITDA increased to 5.5 billion rupees from 4.83 billion rupees year-over-year. EBITDA margin improved slightly to 11.46% from 11.38% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762502065571,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Completes Fractional Share Compensation Following Amalgamation Scheme",
            "Summary": "Uno Minda Limited has completed compensation for fractional share entitlements arising from its amalgamation scheme with three transferor companies - Kosei Minda Aluminum Company Private Limited, Kosei Minda Mould Private Limited, and Minda Kosei Aluminum Wheel Private Limited. The scheme was approved by NCLT New Delhi on December 18, 2024, and became effective from January 29, 2025. The company allotted 2,81,974 equity shares of INR 2 each on August 6, 2025, based on specified share exchange ratios of 13 shares for every 10,000 shares of Transferor Company 1 and 181 shares for every 10,000 shares of Transferor Company 2. A sole shareholder became entitled to 0.86 fractional shares, which was rounded off to 1 equity share and compensated on October 28, 2025, within the required 90-day timeline. Both the Audit Committee and Independent Directors have certified the proper compensation of fractional entitlements in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762198782573,
            "Source": "corporate_action"
        },
        {
            "Title": "UnoMinda Allots 61,600 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "UnoMinda Limited's Nomination Remuneration Committee approved the allotment of 61,600 equity shares with a face value of Rs. 2 each under the UnoMinda Employee Stock Option Scheme 2019. The allotment resulted from the exercise of options by grantees and increased the company's paid-up equity share capital from Rs. 115,34,17,966 to Rs. 115,35,41,166. The company is applying for listing of these shares on NSE and BSE. The newly allotted equity shares will rank pari passu with existing equity shares of the company. The company stated that this allotment is not material in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1762091615811,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda Schedules Earnings Call for Q2 & H1FY26 Results Discussion",
            "Summary": "Uno Minda Limited has announced an earnings call scheduled for November 7, 2025, at 4:00 PM IST to discuss the company's operational and financial performance for Q2 & H1FY26. The call will be participated by Group CFO Sunil Bohra and Head of Corporate Finance and Communications Ankur Modi. The company has provided multiple dial-in numbers for participants across different regions including India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1761630715423,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Issues Rs. 100 Crore Commercial Paper with 3-Month Maturity",
            "Summary": "Uno Minda Limited has issued unlisted commercial paper worth Rs. 100 crore. The commercial paper was allotted on October 16, 2025, and will mature on January 9, 2026, representing approximately a 3-month tenure. The ISIN for the commercial paper is INE405E14265I.",
            "Sentiment": "neutral",
            "PublishDate": 1760620794978,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda Subsidiary Mitil Polymer Faces Rs 48 Lakh Tax Demand for Excess Input Tax Credit",
            "Summary": "Mitil Polymer Private Limited, a step-down subsidiary of Uno Minda Limited, received an order from the Maharashtra State Tax Office demanding payment of Rs 48,06,579 for excess Input Tax Credit claimed in financial year 2019-20. The demand includes tax of Rs 25,60,082, interest of Rs 19,90,946, and penalty of Rs 2,55,551. The order was received on October 15, 2025. Mitil Polymer intends to contest the order based on case merits. Uno Minda does not foresee any material impact on its financial, operational or other activities from this matter.",
            "Sentiment": "negative",
            "PublishDate": 1760532139307,
            "Source": "stock"
        },
        {
            "Title": "Uno Minda Redeems Rs. 100 Crore Commercial Papers on Maturity",
            "Summary": "Uno Minda Limited has redeemed commercial papers worth Rs. 100 crore on October 10, 2025. The unlisted commercial papers were issued on July 14, 2025 with a maturity period of approximately three months and carried ISIN INE405E14240. The redemption was completed on the scheduled maturity date.",
            "Sentiment": "neutral",
            "PublishDate": 1760095614552,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda to Invest Up to ₹4.75 Crore in Solar Power SPV in Tamil Nadu",
            "Summary": "Uno Minda plans to invest up to ₹4.75 crore in a Special Purpose Vehicle (SPV) for solar power sourcing in Tamil Nadu. The investment represents the company's move into renewable energy infrastructure through the SPV structure.",
            "Sentiment": "positive",
            "PublishDate": 1757071106707,
            "Source": "stock"
        },
        {
            "Title": "Uno Minda Shares Hit Record High of ₹1,301, Surge 18% Following Strong Quarterly Results",
            "Summary": "Uno Minda shares reached a record high of ₹1,301, gaining 18% since August 6 when the auto components company reported strong June quarter results. Revenue from operations grew 18% to ₹4,489 crore while net profit jumped 46% to ₹291 crore, driven by double-digit growth in switches, lighting, seating, and other divisions. Operating margin improved by 142 basis points to 12.1% due to prior period state incentives and gross margin expansion. The company appointed Sanjeev Kulkarni as CEO and Garima Garg as HR head. Uno Minda has limited overseas revenue exposure at just over 10%, with the US not among its top five export destinations, providing protection from higher US tariffs. The company guided for capex of ₹1,600-₹1,700 crore for FY26, with three-fourths allocated for growth initiatives. It acquired land in Chhatrapati Sambhajinagar for ₹130 crore and announced ₹210 crore capex for EV four-wheel casting components. Emkay Global raised FY26-27 EPS estimates by 2%, while Asit C Mehta increased EPS estimates by over 4% for FY26 and FY27.",
            "Sentiment": "positive",
            "PublishDate": 1756427750044,
            "Source": "stock"
        },
        {
            "Title": "Uno Minda Limited Announces Senior Management Changes with New CEO and CHRO Appointments",
            "Summary": "Uno Minda Limited announced senior management changes effective August 2025. Kulithalai Srinivasan Ramesh stepped down from his position as CEO of ACS Domain on August 30, 2025, while Rakesh Mehta stepped down as Group CHRO on August 27, 2025. Both departures were voluntary. The company appointed Sanjeev Kulkarni as the new CEO of ACS Domain effective September 1, 2025. Kulkarni brings over 20 years of automotive industry experience, having previously served as Sr. Director at Harman International and held leadership roles at Visteon for more than 11 years. Garima Garg was appointed as the new Group CHRO effective August 27, 2025. Garg has over two decades of HR leadership experience across manufacturing, consulting, and banking sectors, most recently serving as CHRO at ReNew Manufacturing. She holds qualifications from XLRI Jamshedpur and Cornell University.",
            "Sentiment": "neutral",
            "PublishDate": 1756282808631,
            "Source": "corporate_governance"
        },
        {
            "Title": "Uno Minda Allots Rs 200 Crore Non-Convertible Debentures in Private Placement",
            "Summary": "Uno Minda Limited has allotted 20,000 non-convertible debentures worth Rs 200 crores through private placement. The NCD Committee approved the allotment in two series of Rs 100 crore each on August 19, 2025. Series 1 carries a 7.12% coupon rate with maturity on October 29, 2026, while Series 2 offers 7.11% coupon rate maturing on November 27, 2026. Each debenture has a face value of Rs 1 lakh. The debentures are unsecured, listed, rated, redeemable, non-cumulative and taxable. The company plans to list these debentures on BSE Ltd. Interest payments will be made annually, with the first coupon payments scheduled for October 29, 2025 for Series 1 and November 27, 2025 for Series 2.",
            "Sentiment": "neutral",
            "PublishDate": 1755596593909,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda Reports 16% Revenue Growth to Rs 4,420 Crores in Q1 FY26",
            "Summary": "Uno Minda Limited delivered strong financial performance in Q1 FY26 with consolidated revenue from operations reaching Rs 4,489 crores, including Rs 69 crores in prior period incentive income. Excluding this one-time income, normalized revenue stood at Rs 4,420 crores, representing 16% year-on-year growth. The company maintained stable EBITDA margins at 10.7% despite annual cost escalations and higher manpower costs. Key business segments showed robust performance: switching systems contributed Rs 1,111 crores (25% of revenue), lighting systems Rs 1,013 crores (23%), and casting business Rs 824 crores (19%). The company completed acquisition of remaining 49.9% stake in UMEVSPL joint venture with FRIWO, acquiring IPR, R&D team and technical know-how. Uno Minda became the first company in India to localize camera module production for RPAS/FPAS systems. The company has 13 ongoing expansion projects with several facilities expected to be commissioned during the current financial year, including Phase-1 of four-wheeler alloy wheel plant at Kharkhoda and lighting manufacturing facility in Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1754994684902,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Reports 16% Revenue Growth to Rs 4,420 Cr in Q1 FY26",
            "Summary": "Uno Minda Limited reported consolidated revenues of Rs 4,420 crores for Q1 FY26, marking a 16% year-on-year increase from Rs 3,818 crores in Q1 FY25. Group revenues including joint ventures and associates reached Rs 5,386 crores, up 14% year-on-year. EBITDA grew 16% to Rs 474 crores with margins at 10.7%. PAT attributable to Uno Minda shareholders increased 21% to Rs 239 crores. The company completed acquisition of FRIWO's shares in Uno Minda EV Systems, making it a wholly owned subsidiary, along with related technologies and R&D teams. Key operational highlights include starting India's first localized camera module manufacturing at Pune, completing 88 acres land acquisition at Chhatrapati Sambhajinagar, and approving Rs 210 crores capex for EV casting products. The company began commercial supplies of EVSE products to dealerships with OEM sales expected in 3-4 months. Switches division contributed 25% of revenue mix, followed by Lighting at 23% and Castings at 19%.",
            "Sentiment": "positive",
            "PublishDate": 1754470454628,
            "Source": "stock"
        },
        {
            "Title": "Uno Minda Reports Strong Q1 Results with 53% Profit Growth, Approves Key Board Changes and Strategic Investments",
            "Summary": "Uno Minda Limited reported quarterly results for the period ended June 30, 2025, with standalone net profit rising to Rs 273.86 crores compared to Rs 179.13 crores in the previous quarter. Revenue from operations reached Rs 3,373.23 crores. The Board approved the appointment of Mr. Randhir Singh Kalsi as Non-Executive Independent Director for a two-year term and recommended the re-appointment of Mrs. Rashmi Hemant Urdhwareshe for a second three-year term. The company allotted 2,81,974 equity shares under an amalgamation scheme and approved further investment of up to Euro 5 million in subsidiary Clarton Horn, S.A.U., Spain. The Board also gave in-principal approval for acquiring equity stake in joint venture Uno Minda Buehler Motor Private Limited. During the quarter, the company issued Rs 200 crores in commercial papers and invested Rs 20 crores in subsidiary Uno Minda EV Systems Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754466892857,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda Reports Strong Q1 FY2026 Results with 53% Jump in Net Profit, Approves Key Board Changes",
            "Summary": "Uno Minda Limited reported robust quarterly results with standalone net profit rising 53% to Rs 273.86 crores compared to Rs 179.13 crores in the previous quarter. Revenue from operations reached Rs 3,373.23 crores. The Board approved several strategic decisions including appointment of Randhir Singh Kalsi as Non-Executive Independent Director for a two-year term from August 11, 2025, and recommended re-appointment of Rashmi Hemant Urdhwareshe as Independent Director for a second three-year term. The company allotted 2,81,974 equity shares under the amalgamation scheme of three transferor companies. Additional approvals included further investment of up to Euro 5 million in Spanish subsidiary Clarton Horn through Global Mazinkert, and in-principal approval for acquiring equity stake in joint venture Uno Minda Buehler Motor Private Limited. The Board also approved a postal ballot notice for shareholder approval of director appointments and recommended a final dividend of Rs 1.50 per equity share for FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1754466155078,
            "Source": "earnings"
        },
        {
            "Title": "UNO MINDA Reports 33% Jump in Q1 EBITDA to 5.4 Billion Rupees",
            "Summary": "UNO MINDA reported Q1 EBITDA of 5.4 billion rupees compared to 4.07 billion rupees in the same period last year. The company's EBITDA margin improved to 12.1% from 10.68% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754465678098,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Reports 45% Jump in Q1 Net Profit to 2.9 Billion Rupees",
            "Summary": "Uno Minda reported consolidated net profit of 2.9 billion rupees in Q1, representing a 45% increase from 2 billion rupees in the same quarter last year. The company's revenue grew to 44.9 billion rupees compared to 38.17 billion rupees in the previous year's corresponding quarter, marking an 18% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1754465129296,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Issues Rs. 100 Crore Commercial Paper with 3-Month Maturity",
            "Summary": "Uno Minda Limited has issued unlisted Commercial Paper worth Rs. 100 crore with allotment on July 23, 2025 and maturity on October 16, 2025. The commercial paper has ISIN INE405E14257. The company notified stock exchanges NSE and BSE about this issuance under regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753277799485,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda Issues Commercial Paper Worth ₹1 Billion",
            "Summary": "Uno Minda has issued unlisted commercial paper valued at ₹1 billion. The commercial paper represents a short-term debt instrument used by companies to raise funds for immediate operational needs.",
            "Sentiment": "neutral",
            "PublishDate": 1753277367785,
            "Source": "stock"
        },
        {
            "Title": "Uno Minda Redeems Rs. 100 Crore Commercial Papers on Maturity",
            "Summary": "Uno Minda Limited has redeemed its listed Commercial Papers worth Rs. 100 crore on July 23, 2025, as per the scheduled maturity date. The Commercial Papers were originally issued on April 25, 2025, with a three-month tenure and carried the ISIN INE40SE14232. The company informed stock exchanges NSE and BSE about the completion of the redemption process.",
            "Sentiment": "neutral",
            "PublishDate": 1753274215260,
            "Source": "corporate_action"
        },
        {
            "Title": "Uno Minda Acquires E-Drives Business Assets from Friwo in Vietnam",
            "Summary": "Uno Minda has completed the acquisition of e-drives business assets in Vietnam from Friwo. The transaction expands Uno Minda's presence in the electric vehicle components sector in the Vietnamese market.",
            "Sentiment": "positive",
            "PublishDate": 1753187969929,
            "Source": "order&deals"
        },
        {
            "Title": "UNO Minda Clarifies No Proposal for Rare Earth Magnets Production",
            "Summary": "UNO Minda has issued a clarification stating that there is currently no proposal for rare earth magnets production that has been submitted to the company's board. This statement appears to be in response to speculation or rumors about potential new business ventures for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1752493588000,
            "Source": "default"
        },
        {
            "Title": "Uno Minda Unit Acquires E-Drive Business Assets from Friwo Group",
            "Summary": "A unit of Uno Minda has completed the purchase of E-Drive business assets, intellectual property, expertise, and R&D team from Germany's Friwo Group. The acquisition includes assets related to electric vehicle technology, specifically the E-Drive business segment.",
            "Sentiment": "positive",
            "PublishDate": 1751522904000,
            "Source": "default"
        },
        {
            "Title": "Uno Minda Ltd: CLSA Initiates Coverage with 'Outperform' Rating and 17% Upside",
            "Summary": "CLSA initiates coverage on Uno Minda Ltd with an 'Outperform' rating and a price target of ₹1,304, implying 17% upside. The firm expects Uno Minda to deliver industry-beating growth, projecting a 32% CAGR in earnings over FY26-28. Key growth drivers include ABS, sunroofs, four-wheeler lighting, and EV components. CLSA anticipates strong free cash flow generation, potentially leading to net cash positive status by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1751253185000,
            "Source": "normal_news"
        },
        {
            "Title": "Transport Ministry Plans ABS Mandate for Two-Wheelers from 2026",
            "Summary": "The Transport Ministry is planning to introduce a mandate for Anti-lock Braking Systems (ABS) on all two-wheelers in India, effective from January 1, 2026. This regulation would apply to motorcycles and scooters, potentially impacting manufacturers like Uno Minda.",
            "Sentiment": "neutral",
            "PublishDate": 1750392830000,
            "Source": "default"
        },
        {
            "Title": "Uno Minda: Board Approves ₹210 Crore Manufacturing Facility in Sambhajinagar",
            "Summary": "Uno Minda's board committee approved a detailed project report for a new ₹210 crore manufacturing facility in Sambhajinagar, Aurangabad. The casting division facility aims to meet increasing OEM demands for EV casting parts. The project will add 3,629 MT annual capacity over five years, with phase 1 expected to start in Q2 FY2027. Financing will be through internal accruals and term loans.",
            "Sentiment": "positive",
            "PublishDate": 1750325352000,
            "Source": "corporate_action"
        },
        {
            "Title": "UNO Minda Plans ₹210 Crore Investment in New Aurangabad Casting Facility",
            "Summary": "UNO Minda has announced plans to invest ₹210 crore in a new casting facility in Aurangabad. The investment is aimed at catering to the growing demand for electric vehicle (EV) parts. The company is expanding its manufacturing capabilities to meet the increasing needs of the EV market.",
            "Sentiment": "positive",
            "PublishDate": 1750320039000,
            "Source": "default"
        },
        {
            "Title": "Uno Minda Ltd: Q4 Profit Dips 4% Amid Strong Annual Growth",
            "Summary": "Uno Minda Ltd reported a 4% decline in Q4 FY25 net profit to Rs 289.24 crore, despite revenue growth. FY25 saw 20% revenue growth, with expansion in key segments. The board approved a Rs 1.50 per share dividend and plans to raise up to Rs 2,500 crore through various financial instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1747830302000,
            "Source": "earnings"
        },
        {
            "Title": "Uno Minda Ltd: Q4 Profit Down, Revenue Up; Stock Falls",
            "Summary": "Uno Minda reported Q4 FY23 results with net profit down 7.5% YoY to ₹266 crore. Revenue increased 19.4% YoY to ₹4,528 crore. EBITDA rose 11% YoY to ₹526.8 crore, but margin contracted by 90 bps to 11.6%. Stock closed 1.22% lower at ₹970 after results.",
            "Sentiment": "neutral",
            "PublishDate": 1747823097000,
            "Source": "earnings"
        },
        {
            "Title": "UNO MINDA Reports Q4 Results and Announces Plant Relocation",
            "Summary": "UNO MINDA reported Q4 revenue of 45.3 billion rupees, up from 37.9 billion year-over-year. Q4 EBITDA was 5.26 billion rupees compared to 4.74 billion last year, with EBITDA margin decreasing to 11.63% from 12.49%. Q4 consolidated net profit was 2.66 billion rupees, down from 2.87 billion year-over-year. The company also announced plans to shift its two-wheeler lighting manufacturing plants from Bahadurgarh and Sonipat to Kharkhoda, Haryana, with operations at the new plant expected to commence in Q4 FY26-27.",
            "Sentiment": "neutral",
            "PublishDate": 1747821335000,
            "Source": "result"
        }
    ]
}