{
    "Symbol": "UPL",
    "ISIN": "INE628A01036",
    "News": [
        {
            "Title": "UPL Submits Q3 FY26 Rights Issue Monitoring Report",
            "Summary": "UPL Limited filed its quarterly monitoring agency report for Q3 FY26, showing ₹74.8 crore utilized during the quarter from its ₹3,377.74 crore rights issue proceeds with no deviations reported.",
            "Sentiment": "neutral",
            "PublishDate": 1770045263475,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL Q3 Net Profit Drops 52% to ₹4 Billion",
            "Summary": "UPL reported consolidated net profit of ₹4 billion in Q3, declining 52% from ₹8.3 billion year-on-year, missing analyst estimates of ₹6 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770024202662,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL becomes first company to list GDRs on NSE IX",
            "Summary": "UPL Limited achieves milestone as first issuer to complete secondary listing of Global Depository Receipts on NSE IX platform, effective January 30, 2026, expanding trading options for investors.",
            "Sentiment": "positive",
            "PublishDate": 1769699752715,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL Board Meeting Set for Feb 2 to Review Q3FY26 Results",
            "Summary": "UPL Limited has scheduled its board meeting for February 2, 2026, to consider Q3FY26 financial results for quarter and nine months ended December 31, 2025, followed by earnings call at 16:00 hrs IST.",
            "Sentiment": "neutral",
            "PublishDate": 1769497644574,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL clarifies Davos meeting with Karnataka Minister",
            "Summary": "UPL Limited clarifies that CEO Jai Shroff's meeting with Karnataka Minister MB Patil at WEF Davos was informal discussion on scaling operations, with no agreements signed or regulatory disclosure required.",
            "Sentiment": "neutral",
            "PublishDate": 1768913320557,
            "Source": "stocks"
        },
        {
            "Title": "UPL Subsidiary Acquires Final 25% Stake in UPL Agro",
            "Summary": "UPL's subsidiary has completed the acquisition of the remaining 25% stake in UPL Agro, making it a fully owned entity. This strategic move consolidates UPL's ownership structure in its agricultural business segment.",
            "Sentiment": "positive",
            "PublishDate": 1767888681491,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL Acquires 25% Stake in UPL Agro for $17.86 Million",
            "Summary": "UPL Limited's Hong Kong subsidiary completed acquisition of remaining 25% stake in UPL Agro Limited for USD 17.86 million, making it a wholly owned subsidiary with operations in China's crop protection market.",
            "Sentiment": "positive",
            "PublishDate": 1767887992438,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL Forms Colombian Subsidiary Under Regulation 30",
            "Summary": "UPL Limited announced incorporation of step-down subsidiary UPL GCC LATAM S.A.S in Colombia on January 8, 2026, with $2,650 initial investment for business management activities and shared service center operations.",
            "Sentiment": "positive",
            "PublishDate": 1767866263934,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Raises UPL Target Price to ₹925 on Advanta Growth",
            "Summary": "HSBC maintains 'buy' rating on UPL with target price hiked from ₹850 to ₹925, citing strong growth prospects for subsidiary Advanta Seeds and potential value unlocking opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1767843608782,
            "Source": "stocks"
        },
        {
            "Title": "UPL Acquires Hybrid Seeds Vietnam for $2,000",
            "Summary": "UPL announces strategic acquisition of Hybrid Seeds Vietnam Company through its subsidiary Advanta Holdings for $2,000, expanding its presence in the Vietnamese agricultural market.",
            "Sentiment": "positive",
            "PublishDate": 1766449169136,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL Sees ₹75.57 Cr NSE Block Trade at ₹744.50",
            "Summary": "UPL Limited witnessed a significant block trade on NSE worth ₹75.57 crores involving 1,015,109 shares executed at ₹744.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765518749385,
            "Source": "co_actions_results"
        },
        {
            "Title": "UPL Limited Issues Final Forfeiture Notice to Shareholders for Unpaid Rights Issue Call Money",
            "Summary": "UPL Limited's Rights Issue Committee approved a final reminder cum forfeiture notice to holders of partly paid-up equity shares who have not paid the first call (₹90 per share) or second and final call (₹180 per share) money with 10% interest. Shareholders must pay the outstanding amounts by December 31, 2025, or face forfeiture of their partly paid-up equity shares including amounts already paid.",
            "Sentiment": "negative",
            "PublishDate": 1764228373880,
            "Source": "corporate_action"
        },
        {
            "Title": "UPL Limited's Independent Director Dr. Vasant Gandhi Completes Final Term",
            "Summary": "Dr. Vasant Gandhi completed his second and final term as Independent Director of UPL Limited on November 22, 2025, ceasing to hold the position from close of business hours that day. The Board acknowledged his valuable contributions and guidance during his association with the agrochemicals company.",
            "Sentiment": "neutral",
            "PublishDate": 1763883135593,
            "Source": "corporate_governance"
        },
        {
            "Title": "UPL Ltd. Sees Rs. 50.07 Crore Block Trade on NSE",
            "Summary": "UPL Ltd. witnessed a block trade worth Rs. 50.07 crores on NSE involving approximately 661,451 shares at Rs. 756.95 per share. The transaction represents a significant institutional or bulk investor activity in the agrochemical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763620819266,
            "Source": "order&deals"
        },
        {
            "Title": "UPL Ltd. Sees Rs. 57.53 Crore Block Trade on NSE",
            "Summary": "UPL Ltd. witnessed a block trade worth Rs. 57.53 crores on the National Stock Exchange involving approximately 758,417 shares at Rs. 758.60 per share. The transaction represents a significant institutional or bulk investor activity in the agrochemical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763100439350,
            "Source": "order&deals"
        },
        {
            "Title": "UPL Limited Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "UPL Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no variation or deviation in the utilization of funds from its rights issue worth ₹3,377.74 crore. CARE Ratings Limited, serving as the monitoring agency, confirmed that the company has utilized ₹2,989.7 crore for debt repayment, ₹257.4 crore for general corporate purposes, and ₹23.1 crore for issue-related expenses. The company has ₹86.0 crore in unutilized funds, with ₹38.1 crore in the allotment account, ₹7.9 crore in the monitoring account, and ₹70.0 crore placed as fixed deposits with MUFG Bank Limited. There is a pending amount of ₹4.7 crore to be collected towards the first call and ₹20.0 crore towards the second and final call from investors. The rights issue period was from December 5, 2024, to December 17, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1762462265329,
            "Source": "corporate_action"
        },
        {
            "Title": "UPL Appoints Ravishankar Cherukuri as Senior Management Personnel",
            "Summary": "UPL Limited has appointed Mr. Ravishankar Cherukuri as Senior Management Personnel effective November 6, 2025. Cherukuri currently serves as Chief Executive Officer Whole-time Director at UPL Sustainable Agri Solutions Limited, a subsidiary of UPL. He holds an MBA from the Indian School of Business and a Bachelor's degree in Chemical Engineering from IIT Kharagpur. Cherukuri brings over a decade of leadership experience in agriculture and chemicals sectors, having held key roles at Bayer and served as Managing Director CEO of Monsanto India. His professional background spans sales, supply chain management, strategic planning, and private equity consulting, with prior experience at Boston Consulting Group and Unilever. He currently heads the Crop Protection Business in India at UPL Sustainable Agri Solutions Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762459947132,
            "Source": "corporate_governance"
        },
        {
            "Title": "UPL Limited Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "UPL Limited announced its unaudited consolidated and standalone financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results at their meeting held on November 6, 2025. The consolidated results show revenue from operations of ₹12,019 crore for the quarter, compared to ₹9,216 crore in the previous year quarter. However, the company reported a consolidated net loss of ₹611 crore for the quarter versus a loss of ₹276 crore in the same period last year. For the half year, consolidated revenue was ₹21,090 crore against ₹20,235 crore in the previous year, with net profit of ₹134 crore compared to a loss of ₹513 crore previously. The company's crop protection segment generated revenue of ₹9,736 crore for the quarter, while seeds & post-harvest contributed ₹1,676 crore. Finance costs for the quarter were ₹784 crore. The results were reviewed by the Audit Committee and statutory auditors expressed an unmodified review conclusion.",
            "Sentiment": "negative",
            "PublishDate": 1762457804054,
            "Source": "earnings"
        },
        {
            "Title": "UPL Reports Q2 Revenue Growth and Raises FY26 EBITDA Guidance",
            "Summary": "UPL reported quarterly revenue of 120 billion rupees compared to 111 billion rupees in the same period last year, representing year-over-year growth. The company has revised its FY26 EBITDA growth guidance upward to 12-16% from the previously announced range of 10-14%.",
            "Sentiment": "positive",
            "PublishDate": 1762418527304,
            "Source": "earnings"
        },
        {
            "Title": "UPL Reports Strong Q2 Turnaround with 5.5B Rupees Net Profit",
            "Summary": "UPL reported a consolidated net profit of 5.5 billion rupees for Q2, marking a significant turnaround from a loss of 4.4 billion rupees in the same period last year. The company's EBITDA increased to 20 billion rupees compared to 13.5 billion rupees year-over-year. EBITDA margin improved to 16.65% from 12.2% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762418127416,
            "Source": "earnings"
        },
        {
            "Title": "FMC Reduces Forecast Amid Price Pressures in Latin America and Asia",
            "Summary": "FMC has lowered its forecast due to ongoing price declines in Latin America and Asia. The company cited rising generic competition and challenging economic conditions for farmers in Latin America as key factors impacting performance.",
            "Sentiment": "negative",
            "PublishDate": 1761797030634,
            "Source": "stock"
        },
        {
            "Title": "UPL Schedules Q2 Financial Results Review for November 6",
            "Summary": "UPL has announced that it will review its Q2 financial results on November 6. The company has set this date for the quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1761721613990,
            "Source": "earnings"
        },
        {
            "Title": "UPL in Advanced Talks with PepsiCo for Long-Term Agro Chemical Supply Deal",
            "Summary": "UPL is in advanced discussions with PepsiCo for a long-term supply deal. PepsiCo could require UPL's agro chemicals for its global farming contracts. The companies are exploring a partnership that would involve UPL providing agricultural chemicals to support PepsiCo's farming operations worldwide.",
            "Sentiment": "positive",
            "PublishDate": 1759477026063,
            "Source": "stock"
        },
        {
            "Title": "Advanta Mauritius Completes Acquisition of UPL's Post Harvest Business",
            "Summary": "Advanta Mauritius Limited, a subsidiary of Advanta Enterprises Limited, has completed the acquisition of the post harvest business housed under Decco Holdings UK Limited. The acquired business was a subsidiary of UPL Corporation Limited, which is wholly owned by UPL Limited. UPL Limited announced the completion of this transaction, which integrates the post harvest business (DECCO) with Advanta's seed business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1759245516839,
            "Source": "order&deals"
        },
        {
            "Title": "UPL Announces $502 Million Internal Realignment as Advanta Mauritius Acquires Decco Holdings UK",
            "Summary": "UPL's subsidiary Advanta Mauritius has approved the $502 million acquisition of Decco Holdings UK, a wholly owned subsidiary of UPL Corporation Mauritius. The related-party transaction is part of an internal business realignment to consolidate UPL's post-harvest operations under its seed platform. Decco generated consolidated revenue of ₹933 crore, representing 1.98% of UPL's revenue, with a net worth of ₹431 crore. The deal requires shareholder approval and is expected to close by December 31, 2025. Following completion, Decco's operations will integrate with Advanta's seed business, where UPL will maintain a 78.21% effective stake. The company expects operational synergies, enhanced digitalization opportunities, and scale advantages across emerging markets. UPL shares closed 2.45% lower at ₹710.15 ahead of the announcement. Separately, UPL Global Ltd signed an agreement to acquire a 49% stake in Thailand's Grow Chemical Co. Ltd for $0.76 million.",
            "Sentiment": "neutral",
            "PublishDate": 1756813834051,
            "Source": "order&deals"
        },
        {
            "Title": "UPL to Integrate Post Harvest Business DECCO with Advanta Seed Business",
            "Summary": "UPL announced plans to integrate its Post Harvest Business (DECCO) with its Advanta Seed Business through an internal realignment. The integration represents a strategic restructuring of the company's business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1756811196114,
            "Source": "stock"
        },
        {
            "Title": "UPL Ltd. Executes Rs. 51.92 Crore Block Trade on NSE",
            "Summary": "UPL Ltd. completed a block trade on the National Stock Exchange worth Rs. 51.92 crores. The transaction involved approximately 719,662 shares at a price of Rs. 721.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756786211456,
            "Source": "order&deals"
        },
        {
            "Title": "UPL's UK Subsidiary Acquires 49% Stake in Thailand's Grow Chemical for $760,000",
            "Summary": "UPL's UK subsidiary is acquiring a 49% stake in Thailand-based Grow Chemical for $760,000. This acquisition represents UPL's expansion into the Thai market through its international subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1756725590684,
            "Source": "order&deals"
        },
        {
            "Title": "UPL Shares Surge 7% as Quarterly Loss Narrows to Rs 176 Crore",
            "Summary": "UPL shares jumped 7% to Rs 711.80 following the company's quarterly results showing a narrowed consolidated net loss of Rs 176 crore compared to Rs 527 crore in the same period last year. Consolidated total income increased to Rs 9,359 crore from Rs 9,165 crore year-over-year, while total expenses rose slightly to Rs 9,558 crore from Rs 9,539 crore. The company reported reduced net debt of Rs 21,371 crore, down from Rs 27,500 crore a year earlier, attributed to lower working capital requirements and improved gearing ratios. UPL highlighted macro challenges including low commodity prices affecting grower incomes in Brazil and uncertain grower sentiment in the US due to potential tariff risks. Motilal Oswal maintained a 'Neutral' rating with Rs 700 target price, projecting 7% revenue CAGR and 13% EBITDA CAGR for FY25-27. Antique raised its target price to Rs 730 from Rs 710 while maintaining a 'Buy' rating, though it cut FY26 and FY27 earnings estimates by 13% and 10% respectively due to higher finance costs and adverse forex impact.",
            "Sentiment": "positive",
            "PublishDate": 1754285344571,
            "Source": "earnings"
        },
        {
            "Title": "UPL Limited Dispatches Second and Final Call Notice for Rights Issue Shares",
            "Summary": "UPL Limited has dispatched the Second and Final Call Notice for payment on partly paid-up equity shares issued through a rights issue. The record date was set as August 01, 2025. The notice, along with detailed instructions, ASBA Application Form and Payment Slip, has been sent to shareholders whose names appear in the Register of Members as of the record date. The documents are available on the company's website and its Registrar & Transfer Agents' website. The rights issue was originally pursuant to a Letter of Offer dated November 20, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1754148736895,
            "Source": "corporate_action"
        },
        {
            "Title": "UPL Management Forecasts Stronger Growth in Second Half of FY26, Targets $130M Revenue from New Product Launches",
            "Summary": "UPL's management expects growth in FY26 to accelerate in the second half of the fiscal year. The company is targeting an additional $130 million in revenue from new product releases during the current year.",
            "Sentiment": "positive",
            "PublishDate": 1754122278099,
            "Source": "stock"
        },
        {
            "Title": "UPL Limited Reports No Deviation in Rights Issue Fund Utilization for June 2025 Quarter",
            "Summary": "UPL Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing proper utilization of proceeds from its ₹3,377.74 crore rights issue. CARE Ratings Limited, serving as the monitoring agency, confirmed no variation or deviation in fund usage. The company utilized ₹1,485.1 crore for debt repayment at UPL Limited and UPL Sustainable Agri Solutions Limited, ₹165.5 crore for general corporate purposes including vendor payments and advance tax, and ₹23.1 crore for issue-related expenses. A balance of ₹8.1 crore remains in the allotment account. The rights issue was conducted from December 5-17, 2024, and all fund deployment aligns with the original offer document objectives.",
            "Sentiment": "positive",
            "PublishDate": 1754049009471,
            "Source": "corporate_action"
        },
        {
            "Title": "UPL Limited Reports 14% EBITDA Growth in Q1 FY26 Despite Revenue Challenges",
            "Summary": "UPL Limited reported quarterly results with revenue of ₹9,216 crores, up 2% year-on-year, driven by strong performance in UPL SAS (+13%), Advanta (+20%), and SUPERFORM (+9%), partially offset by a 3% decline in UPL Corp due to lower Brazil volumes. The company achieved significant margin expansion with contribution margin improving 390 basis points to 43.4%, leading to EBITDA growth of 14% to ₹1,303 crores. EBITDA margin expanded 150 basis points to 14.1%. The company improved its reported PATMI by approximately ₹300 crores compared to the previous year, reducing losses from ₹384 crores to ₹88 crores. Net working capital days decreased by 35 days to 86 days, and net debt reduced by over ₹6,100 crores year-on-year to ₹21,371 crores, improving the net debt to EBITDA ratio from 5.4x to 2.6x. The company completed a $400 million perpetual bond redemption and expects proceeds of $200 million from a second call by September end. UPL maintained its FY26 guidance of 4-8% revenue growth and 10-14% EBITDA growth.",
            "Sentiment": "positive",
            "PublishDate": 1754039905030,
            "Source": "earnings"
        },
        {
            "Title": "UPL Confirms EBITDA Margin Target of 10-14% and Revenue Growth Goal of 4-8%",
            "Summary": "UPL has confirmed its EBITDA margin target of 10-14% and revenue growth goal of 4-8%. The company's CFO highlighted that their focus on operational excellence has improved EBITDA margins, creating a solid foundation for strong performance in the upcoming year.",
            "Sentiment": "positive",
            "PublishDate": 1754039548386,
            "Source": "stock"
        },
        {
            "Title": "UPL Reports Q1 Revenue of 92B Rupees with Improved EBITDA Margin",
            "Summary": "UPL reported Q1 revenue of 92 billion rupees compared to 91 billion rupees in the previous year. The company's EBITDA increased to 13.96 billion rupees from 11.01 billion rupees year-over-year, with EBITDA margin improving to 15.15% from 12.14%. UPL posted a consolidated net loss of 880 million rupees, which was significantly lower than the previous year's loss of 3.84 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1754038750938,
            "Source": "earnings"
        },
        {
            "Title": "Morgan Stanley Asia Acquires 15.8 Lakh UPL Shares Worth ₹82.24 Crore",
            "Summary": "Morgan Stanley Asia purchased 15.8 lakh shares of UPL Ltd at ₹520.54 per share in a block deal worth ₹82.24 crore. UPL reported strong quarterly results with 11% revenue growth to ₹15,573 crore and 68% EBITDA growth. The company's EBITDA margin improved to 20.79% from 13.7% in the same quarter last year. Revenue growth was driven by volume increases across crop protection, seeds and specialty chemical markets. UPL reduced its net debt to ₹8,320 crore from ₹13,860 crore, supported by strong operating free cash flow of ₹4,450 crore and proceeds from capital transactions. UPL shares closed at ₹703.90, down 2.51% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753977107541,
            "Source": "order&deals"
        },
        {
            "Title": "UPL Limited Schedules Board Meeting on August 1, 2025 to Approve Q1 FY2026 Financial Results",
            "Summary": "UPL Limited will hold a Board of Directors meeting on August 1, 2025 to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company will conduct an earnings call at 16:00 hrs IST on the same day to discuss performance. The trading window for designated persons remains closed from June 30, 2025 until 48 hours after results are disseminated to stock exchanges. UPL is a global agriculture solutions provider with annual revenue exceeding $5 billion, present in more than 140 countries with over 12,000 employees worldwide.",
            "Sentiment": "neutral",
            "PublishDate": 1753344690417,
            "Source": "corporate_action"
        },
        {
            "Title": "UPL Ltd. Sees Rs. 51.23 Crore Block Trade on NSE",
            "Summary": "UPL Ltd. witnessed a block trade worth Rs. 51.23 crores on the National Stock Exchange. The transaction involved approximately 726,358 shares executed at a price of Rs. 705.25 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753080816852,
            "Source": "order&deals"
        },
        {
            "Title": "UPL Anticipates Export Recovery in Second Half of FY26",
            "Summary": "According to UPL's annual report, the company projects a recovery in exports during the second half of FY26. This information suggests that UPL is optimistic about its future export performance, particularly in the latter part of the fiscal year 2025-2026.",
            "Sentiment": "positive",
            "PublishDate": 1751546586000,
            "Source": "normal_news"
        },
        {
            "Title": "UPL's Advanta Seeds to Sell Serra Bonita Assets in Brazil for $125 Million",
            "Summary": "Advanta Seeds, a part of the UPL Group in Brazil, has agreed to sell its Serra Bonita assets for $125 million. The specific details of the assets or the buyer are not mentioned in the provided news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749428066000,
            "Source": "default"
        },
        {
            "Title": "UPL's Subsidiary Advanta Seeds to Sell Serra Bonita Assets for $125 Million",
            "Summary": "Advanta Seeds, a subsidiary of the UPL Group in Brazil, is planning to divest its Serra Bonita assets for $125 million. The sale involves assets related to Advanta Seeds' operations in Brazil, though specific details about the Serra Bonita assets are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1749211402000,
            "Source": "default"
        },
        {
            "Title": "UPL Unit Acquires Corn Assets from K-Adriatica",
            "Summary": "A unit of UPL has acquired key corn assets from K-Adriatica to strengthen its European portfolio. The acquisition is aimed at enhancing UPL's presence in the European market, particularly in the corn sector.",
            "Sentiment": "positive",
            "PublishDate": 1748856631000,
            "Source": "default"
        },
        {
            "Title": "UPL Ltd: Analysts Divided as Debt Reduction and Growth Plans Announced",
            "Summary": "UPL Ltd reported 8% revenue growth for FY2024, with EBITDA up 47%. The company reduced net debt to $1.6 billion from $2.7 billion. Management guided 4-8% revenue growth and 10-14% EBITDA growth for FY2026, with plans to launch new products worth over $130 million. Jefferies maintains a 'buy' rating, while Motilal Oswal remains 'neutral'.",
            "Sentiment": "neutral",
            "PublishDate": 1747121178000,
            "Source": "earnings"
        },
        {
            "Title": "UPL Ltd: Q4 Profit Soars 2,150% YoY, Stock Drops 5%",
            "Summary": "UPL Ltd reported a Q4FY25 net profit of Rs 900 crore, up 2,150% YoY. Revenue grew 11% to Rs 15,570 crore. EBITDA increased 68% to Rs 3,240 crore. Despite strong results, shares fell 5% to Rs 642. The company announced a dividend of Rs 6 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747121145000,
            "Source": "earnings"
        },
        {
            "Title": "UPL Provides Cautious Guidance for FY24 Amid Global Uncertainties",
            "Summary": "UPL has provided guidance for the upcoming financial year, expecting revenue growth of 4-8% and EBITDA growth of 10-14%. The company anticipates reduced interest costs due to cash generation during the year. UPL remains cautious in its outlook due to geopolitical turmoil and commodity trade volatility. They expect Q1 and Q2 to be subdued but are confident in delivering on their full-year guidance. For their sustainable solutions segment, UPL projects a CAGR of about 13% between FY25 and FY30.",
            "Sentiment": "neutral",
            "PublishDate": 1747107338000,
            "Source": "default"
        },
        {
            "Title": "UPL Ltd: Q4 Net Profit Surges, Revenue Up 10%",
            "Summary": "UPL Ltd reported a net profit of Rs 896 crore in Q4 FY25, with revenue increasing 10.6% to Rs 15,573 crore. EBITDA rose 73% to Rs 3,191 crore, and margin improved to 20.5%. The board recommended a final dividend of Rs 6 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747038083000,
            "Source": "earnings"
        },
        {
            "Title": "UPL Reports Strong FY25 Performance and Provides FY26 Guidance",
            "Summary": "UPL has reported robust financial results for FY25, exceeding its guidance in key areas. The company achieved 8% revenue growth (vs. 4-8% guidance), 47% EBITDA growth (vs. 50% guidance), and operational free cash flow of USD 530M (vs. USD 300-400M guidance). For FY26, UPL has set guidance for EBITDA growth at 10-14% and revenue growth at 4-8%.",
            "Sentiment": "positive",
            "PublishDate": 1747036851000,
            "Source": "default"
        },
        {
            "Title": "UPL Reduces Net Debt by Rs 83.2 Billion",
            "Summary": "UPL, a global agrochemical company, has announced in a press release that it has successfully reduced its net debt by Rs 83.2 billion. The company's net debt now stands at Rs 138.6 billion after this significant reduction.",
            "Sentiment": "positive",
            "PublishDate": 1747036008000,
            "Source": "default"
        },
        {
            "Title": "UPL Reports Strong Q4 FY23 Results, Declares Dividend",
            "Summary": "UPL announced its Q4 FY23 financial results, showing significant year-over-year improvements. EBITDA rose to 31.9 billion rupees from 18.4 billion, exceeding estimates of 29.7 billion. EBITDA margin increased to 20.5% from 13%, slightly above the estimated 20%. Revenue grew to 156 billion rupees from 141 billion, surpassing expectations of 148 billion. The company declared a dividend of 6 rupees per share. Consolidated net profit jumped to 9 billion rupees from 400 million, though falling short of the estimated 11.21 billion.",
            "Sentiment": "positive",
            "PublishDate": 1747035160000,
            "Source": "result"
        },
        {
            "Title": "UPL Ltd: Q4 Results Date Set, Dividend Consideration and Earnings Call Announced",
            "Summary": "UPL Ltd will announce Q4 and FY2025 results on May 12, 2025. The board will consider dividend recommendation. An earnings call, 'UPL Capital Markets Day 2025', is scheduled for the same day at 4 p.m. in Mumbai. The trading window is closed for designated persons until 48 hours post-results disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1746849600000,
            "Source": "corporate_action"
        }
    ]
}