{
    "Symbol": "URAVIDEF",
    "ISIN": "INE568Z01015",
    "News": [
        {
            "Title": "Uravi Defence Delays Q3 Results Due to Subsidiary Data",
            "Summary": "Uravi Defence and Technology postpones financial results consideration as subsidiary SKL India fails to provide required data despite follow-ups, citing regulatory compliance issues.",
            "Sentiment": "negative",
            "PublishDate": 1770905337035,
            "Source": "stocks"
        },
        {
            "Title": "Uravi Defence EGM Scheduled for March 02, 2026",
            "Summary": "Uravi Defence And Technology Limited announces Extra Ordinary General Meeting on March 02, 2026 to approve auditor appointment and disinvestment of 50.01% stake in SKL India Private Limited for ₹11,25,19,540.",
            "Sentiment": "neutral",
            "PublishDate": 1770873566614,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uravi Defence Warrants Conversion Update",
            "Summary": "Uravi Defence and Technology Limited reports conversion of 4 lakh warrants into equity shares while 11 lakh warrants lapsed upon expiry of exercise period on December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765884564923,
            "Source": "co_actions_results"
        },
        {
            "Title": "Uravi Defence and Technology's Statutory Auditor Resigns Over Remuneration Disagreement",
            "Summary": "GBCA Associates LLP resigned as statutory auditor of Uravi Defence and Technology Limited on November 11, 2025, citing inability to reach agreement on audit remuneration. The auditing firm was appointed on September 30, 2024, for a five-year term until the 25th AGM in 2029. The company stated there were no concerns raised by the resigning auditor regarding management, and no material reason for resignation beyond the remuneration dispute. The Audit Committee and Board will consider appointing new statutory auditors to fill the casual vacancy.",
            "Sentiment": "neutral",
            "PublishDate": 1762896387530,
            "Source": "corporate_governance"
        },
        {
            "Title": "Uravi Defence and Technology Reports Quarterly Loss of Rs 51.76 Lakhs",
            "Summary": "Uravi Defence and Technology Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a net loss of Rs 51.76 lakhs for the quarter compared to a loss of Rs 78.05 lakhs in the same period last year. For the half-year period, the net loss was Rs 74.56 lakhs versus Rs 78.05 lakhs in the previous year. On a consolidated basis, the company posted a quarterly net loss of Rs 59.55 lakhs and half-yearly loss of Rs 108.08 lakhs. The Board of Directors approved these results in a meeting held on November 10, 2025. The company operates in automotive and defence segments, with the automotive segment generating revenue of Rs 0.54 lakhs and defence segment Rs 200.85 lakhs during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762820926512,
            "Source": "earnings"
        },
        {
            "Title": "Uravi Defence and Technology Submits Revised Financial Results for Q1 Due to Filing Error",
            "Summary": "Uravi Defence and Technology Limited submitted revised quarterly financial results for the quarter ended June 30, 2025, due to an inadvertent error in the previously filed unaudited financial results. The company requested stakeholders to disregard the earlier submission. The revised standalone results show income from operations of Rs 836.00 lakhs compared to Rs 910.98 lakhs in the previous quarter, with net profit of Rs 37.06 lakhs versus Rs 64.21 lakhs in the prior quarter. On a consolidated basis, income from operations was Rs 1,002.17 lakhs compared to Rs 1,139.69 lakhs in the previous quarter, with net profit after tax of Rs 52.82 lakhs versus Rs 92.37 lakhs in the prior quarter. The company operates in automotive and defence segments, with the automotive segment contributing Rs 909.77 lakhs and defence segment Rs 92.40 lakhs to consolidated revenue. During the quarter, the company converted 1,00,000 share warrants into equity shares at an average price of Rs 330 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757672322324,
            "Source": "earnings"
        },
        {
            "Title": "Uravi Defence and Technology Reports 34% Decline in Quarterly Revenue to Rs 1,002 Lakhs",
            "Summary": "Uravi Defence and Technology Limited reported consolidated revenue of Rs 1,002.17 lakhs for the quarter ended June 30, 2025, down from Rs 1,139.69 lakhs in the previous quarter. The automotive segment generated Rs 909.77 lakhs while the defence segment contributed Rs 92.40 lakhs. Profit after tax decreased to Rs 52.82 lakhs from Rs 80.63 lakhs in the prior quarter. The automotive segment's EBITDA was Rs 131.76 lakhs and defence segment's EBITDA was Rs 30.10 lakhs. Total segment assets stood at Rs 8,920.03 lakhs compared to Rs 9,516.71 lakhs in the previous quarter. The company operates through two main business segments - automotive and defence.",
            "Sentiment": "negative",
            "PublishDate": 1755013084036,
            "Source": "earnings"
        },
        {
            "Title": "Uravi T and Wedge Lamps Reports Q2 Financial Results",
            "Summary": "Uravi T and Wedge Lamps has reported its Q2 financial results. The company's net profit decreased to 3 million rupees from 6 million rupees in the same quarter last year. However, revenue increased slightly to 111 million rupees from 106 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731504252000,
            "Source": "result"
        }
    ]
}