{
    "Symbol": "URBANCO",
    "ISIN": "INE0CAZ01013",
    "News": [
        {
            "Title": "Urban Company GST Appeal Rejected, ₹7.30 Cr Demand Upheld",
            "Summary": "Urban Company's appeal against GST demand of ₹7.30 crore for July 2017-March 2022 period rejected by appellate authority. Company plans further appeal with legal advisor support.",
            "Sentiment": "negative",
            "PublishDate": 1770895851532,
            "Source": "stocks"
        },
        {
            "Title": "Urban Company seeks shareholder approval for ESOP amendments",
            "Summary": "Urban Company Limited has issued a postal ballot notice seeking member approval for amendments to its Employee Stock Option Scheme 2015, including increasing the ESOP pool from 18,75,25,000 to 20,33,00,000 options and implementing the scheme through trust route.",
            "Sentiment": "neutral",
            "PublishDate": 1769702305732,
            "Source": "co_actions_results"
        },
        {
            "Title": "Urban Company Partners HDFC Pension for NPS Platform",
            "Summary": "Urban Company collaborates with HDFC Pension to launch NPS platform for over 50,000 service workers, enabling voluntary retirement savings enrollment for gig economy workforce.",
            "Sentiment": "positive",
            "PublishDate": 1769586313124,
            "Source": "stocks"
        },
        {
            "Title": "Urban Company Expects EBITDA Losses Due To InstaHelp",
            "Summary": "Urban Company anticipates continued adjusted EBITDA losses in the short term as it maintains ongoing investments in its InstaHelp platform to drive future growth.",
            "Sentiment": "neutral",
            "PublishDate": 1769171884969,
            "Source": "stocks"
        },
        {
            "Title": "Urban Company Files Q3FY26 IPO Proceeds Report",
            "Summary": "Urban Company Limited filed its quarterly monitoring agency report for Q3FY26, showing utilization of ₹56.47 crores from its ₹472 crore IPO proceeds across technology development, office leases, and marketing activities.",
            "Sentiment": "neutral",
            "PublishDate": 1769168498576,
            "Source": "co_actions_results"
        },
        {
            "Title": "Urban Company Q3FY26 Loss Widens to ₹21.26 Cr",
            "Summary": "Urban Company reported consolidated net loss of ₹21.26 crores for Q3FY26, compared to ₹231.84 crores profit in Q3FY25. Revenue grew 33% to ₹382.68 crores driven by Native and InstaHelp segments.",
            "Sentiment": "negative",
            "PublishDate": 1769163352319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Urban Company Grants 70.82 Lakh Stock Options",
            "Summary": "Urban Company's board committee approved grant of 70,82,350 stock options under ESOP Scheme 2015 to eligible employees at exercise price of ₹1 per option on January 21, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769011190168,
            "Source": "co_actions_results"
        },
        {
            "Title": "Urban Company Q3FY26 earnings call on Jan 23",
            "Summary": "Urban Company Limited schedules board meeting and earnings call for January 23, 2026, to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768493684053,
            "Source": "co_actions_results"
        },
        {
            "Title": "Urban Company Q3FY26 Results Call on Jan 23",
            "Summary": "Urban Company schedules board meeting and earnings call for January 23, 2026, to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768493655374,
            "Source": "co_actions_results"
        },
        {
            "Title": "Urban Company establishes UAE subsidiary for trading",
            "Summary": "Urban Company Limited announces incorporation of step-down subsidiary Urban Essentials General Trading L.L.C. in UAE on January 12, 2026, for general trading activities including product sales to aggregators and Native products distribution.",
            "Sentiment": "positive",
            "PublishDate": 1768299110033,
            "Source": "stocks"
        },
        {
            "Title": "Urban Company Grants 565,100 Stock Options to Employees",
            "Summary": "Urban Company's board committee approved grant of 565,100 stock options under ESOP Scheme 2015 to eligible employees at exercise price of ₹1 per option, exercisable within 10 years of vesting.",
            "Sentiment": "positive",
            "PublishDate": 1768282316456,
            "Source": "stocks"
        },
        {
            "Title": "Urban Company faces ₹51.30 cr GST demand order",
            "Summary": "Urban Company receives GST demand order of ₹51.30 crores plus ₹5.13 crores penalty from CGST authorities for period April 2021 to March 2025. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766220786984,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Sets Urban Company Target at ₹119",
            "Summary": "Morgan Stanley maintains 'Underweight' rating on Urban Company with a price target of ₹119, reflecting cautious outlook on the home services platform.",
            "Sentiment": "negative",
            "PublishDate": 1765424936727,
            "Source": "stocks"
        },
        {
            "Title": "Urban Company Shareholders Approve Employee Stock Option Plans and Articles Amendment",
            "Summary": "Urban Company shareholders passed five special resolutions through postal ballot with overwhelming support of 96.79-97.01%, including ratification of employee stock option schemes for 2015 and 2022, extension of benefits to group companies, and amendments to Articles of Association. The voting concluded on December 6, 2025, with over 104 crore shares participating in the electronic voting process conducted through NSDL platform.",
            "Sentiment": "positive",
            "PublishDate": 1765198120199,
            "Source": "corporate_action"
        },
        {
            "Title": "Urban Company Shares Jump 8% After Five-Day Decline Following Quarterly Results",
            "Summary": "Urban Company shares gained 8% on Tuesday, breaking a five-day losing streak that saw the stock fall 15%. The home services provider reported a net loss of ₹59 crore in its first quarterly results after listing, with India business margins contracting due to increased investments in the Insta Help business. Trading volume reached over 1 crore shares in the first two hours, three times the 20-day average. The stock had nearly doubled after listing, reaching a high of ₹201 on September 22 compared to its ₹103 issue price, but remains 33% below that peak. Shares closed at ₹142.6, still 40% above the issue price.",
            "Sentiment": "neutral",
            "PublishDate": 1762839305360,
            "Source": "stock"
        },
        {
            "Title": "Urban Company Shares Drop 6% in Fifth Consecutive Session, Nearing IPO Price",
            "Summary": "Urban Company shares fell over 6% on Monday, extending losses to five straight sessions with a total decline of 15% during this streak. The stock has dropped 33% from its post-listing high of ₹201 reached on September 22, closing at ₹133.4 and approaching its IPO price of ₹103. Trading volume reached 87 lakh shares worth ₹119 crore, with 48% marked for delivery. The company's IPO was oversubscribed 100 times with retail portion subscribed 41 times. In its first quarterly results post-listing, Urban Company reported a net loss of ₹59 crore, with India business margins contracting due to increased Insta Help investments. Management indicated that continued Insta Help investments could further impact EBITDA and profitability.",
            "Sentiment": "negative",
            "PublishDate": 1762771767819,
            "Source": "stock"
        },
        {
            "Title": "Urban Company Reports 31% Revenue Growth to Rs 380 Crores in Q2, Launches InstaHelp Service",
            "Summary": "Urban Company reported net transaction value growth of 31% year-on-year to Rs 1,030 crores for the quarter ended September 30, 2025. Revenue from operations grew 37% to Rs 380 crores. The company's core India services business remained profitable with adjusted EBITDA of Rs 18 crores. International operations in UAE and Singapore achieved adjusted EBITDA breakeven. The company launched InstaHelp, a daily housekeeping service, which scaled to 4.7 lakh monthly orders by October but incurred an adjusted EBITDA loss of Rs 44 crores. Overall business reported adjusted EBITDA loss of Rs 35 crores primarily due to InstaHelp investments. Native business grew 164% in net transaction value to Rs 97 crores. Management indicated FY26 as an investment year with margins expected to remain similar to FY25 levels, targeting long-term adjusted EBITDA margins of 9-10% for core India services.",
            "Sentiment": "neutral",
            "PublishDate": 1762450334787,
            "Source": "earnings"
        },
        {
            "Title": "Urban Company Allots 1.02 Crore Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Urban Company's Nomination and Remuneration Committee approved the allotment of 1,02,07,638 equity shares with face value of ₹1 each to eligible employees upon exercise of vested stock options. The allotment includes 88,07,638 shares under the Employee Stock Option Scheme 2015 and 14,00,000 shares under the Employee Stock Option Plan 2022. Following this allotment, the company's paid-up equity share capital increased from ₹1,43,59,01,931 to ₹1,44,61,09,569, consisting of 1,44,61,09,569 equity shares of ₹1 face value each. The newly allotted shares rank pari-passu with existing equity shares of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762318923787,
            "Source": "corporate_action"
        },
        {
            "Title": "Urban Company Reports Wider Q2 Loss Despite 37% Revenue Growth",
            "Summary": "Urban Company reported a consolidated net loss of Rs 59 crore for Q2FY26, significantly higher than the Rs 2 crore loss in the same quarter last year. The company achieved 37% year-on-year revenue growth to Rs 380 crore from Rs 277 crore. The adjusted EBITDA loss of Rs 35 crore was primarily driven by a Rs 44 crore loss from new vertical Insta Help. Excluding Insta Help, the company posted an adjusted EBITDA profit of Rs 10 crore. The India Consumer Services segment showed 19% growth in Net Transaction Value to Rs 762 crore, while the Native segment demonstrated strong 164% NTV growth to Rs 97 crore. International operations grew 73% in NTV to Rs 160 crore and achieved adjusted EBITDA breakeven across UAE and Singapore markets.",
            "Sentiment": "neutral",
            "PublishDate": 1762139446096,
            "Source": "earnings"
        },
        {
            "Title": "Urban Company Re-designates Vamsi Krishna Duvvuri from Nominee Director to Non-Executive Non-Independent Director",
            "Summary": "Urban Company's Board of Directors approved the re-designation of Vamsi Krishna Duvvuri (DIN: 07212414) from Nominee Director to Non-Executive Non-Independent Director, effective November 1, 2025. The change occurred because VY Capital's nomination rights ceased following the company's equity shares listing. Duvvuri has been associated with Urban Company since September 10, 2024, and holds degrees from IIT Kanpur and IIM Ahmedabad. He was previously associated with Religare Capital Markets Limited and VY Capital, and is a founder and managing partner at Dharana Capital. He has over 12 years of experience and is not related to any other company directors. His new position makes him liable to retire by rotation.",
            "Sentiment": "neutral",
            "PublishDate": 1761990621510,
            "Source": "corporate_governance"
        },
        {
            "Title": "Urban Company Reports Quarterly Loss, Approves UAE Subsidiary and Saudi Arabia Exit",
            "Summary": "Urban Company Limited announced quarterly results showing a consolidated net loss of ₹57.33 crore for the quarter ended September 30, 2025, compared to a profit of ₹14.24 crore in the previous quarter. Revenue from operations stood at ₹380.03 crore. The board approved incorporation of a wholly-owned subsidiary in UAE with an initial investment of ₹3 crore for general trading activities. The company also decided to wind up its step-down subsidiary Urban Company Arabia in Saudi Arabia, as operations have been transferred to a joint venture. Additionally, the board approved a postal ballot notice for ratification of employee stock option schemes and amendment to Articles of Association to grant promoters the right to nominate directors. Mr. Vamsi Krishna Duvvuri was re-designated from Nominee Director to Non-Executive Non-Independent Director.",
            "Sentiment": "negative",
            "PublishDate": 1761989105259,
            "Source": "corporate_action"
        },
        {
            "Title": "Urban Company Reports Strong Revenue Growth But Turns Loss-Making Due to InstaHelp Investments",
            "Summary": "Urban Company reported consolidated revenue growth of 37% YoY to INR 380 crores for Q2 FY26, driven by broad-based growth across all segments. However, the company moved from Adjusted EBITDA profitability to a loss of INR 35 crores, primarily due to investments in its new housekeeping vertical InstaHelp, which incurred a loss of INR 44 crores. Excluding InstaHelp, the business generated an Adjusted EBITDA profit of INR 10 crores. India Consumer Services grew 24% YoY in revenue to INR 262 crores, Native business surged 179% YoY to INR 75 crores, and International operations (excluding KSA) grew 66% YoY to INR 41 crores, achieving breakeven. The company's cash position strengthened to INR 2,136 crores following its recent IPO. Management expects continued losses in the near term as they invest meaningfully in scaling InstaHelp, which has shown strong early traction with 468K orders in October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761988748374,
            "Source": "earnings"
        },
        {
            "Title": "Urban Company Reports 37% Revenue Growth But Net Loss Widens Significantly",
            "Summary": "Urban Company reported quarterly revenue of Rs 3.8 billion compared to Rs 2.77 billion in the same period last year. However, the company's net loss increased substantially to Rs 593.3 million from Rs 18.2 million in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761988406342,
            "Source": "earnings"
        },
        {
            "Title": "Urban Company Announces Q2 Results Date and Earnings Call Details",
            "Summary": "Urban Company Ltd. will announce its financial results for the quarter and half-year ended Sept. 30 on Saturday, Nov. 1. The Board of Directors meeting is scheduled to consider and approve the unaudited standalone and consolidated financial results. This marks the company's first quarterly earnings report since its IPO in September. The company will hold a 90-minute conference call at 6 p.m. on Nov. 1 to discuss financial performance, followed by a Q&A session. The trading window for company securities has been closed since Sept. 17 and will remain closed until 48 hours after the results announcement. Urban Company's IPO was subscribed 103.63 times with shares listing at a 57% premium. For the year ended March 31, the company reported revenue growth of 36% to Rs 1,260.68 crore and profit after tax of Rs 239.77 crore compared to a loss of Rs 92.77 crore in the previous fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1761886916716,
            "Source": "earnings"
        },
        {
            "Title": "Urban Company Shares Rise 8% as One-Month Lock-in Period Ends",
            "Summary": "Urban Company shares gained up to 8% on Wednesday, breaking a five-day losing streak that had pushed the stock below its listing price of ₹162. The stock had declined 12% over five sessions, hitting an intraday low of ₹149.69, and was down 26% from its post-listing high of ₹201. October 16 marks the end of the company's one-month shareholder lock-in period, which will free up 4.15 crore shares (3% of outstanding equity) worth ₹651 crore for trading eligibility. Urban Company had one of the most successful listings, debuting at a significant premium to its issue price of ₹103 and nearly doubling before the recent correction. Shares closed 9% higher at ₹162.45.",
            "Sentiment": "positive",
            "PublishDate": 1760505113332,
            "Source": "stock"
        }
    ]
}