{
    "Symbol": "URJA",
    "ISIN": "INE550C01020",
    "News": [
        {
            "Title": "Urja Global Q3 Net Profit Falls 53% to ₹2.5M",
            "Summary": "Urja Global reports consolidated net profit of ₹2.5 million in Q3, down from ₹5.3 million year-over-year. Revenue also declined to ₹146 million from ₹202 million in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1770032898125,
            "Source": "co_actions_results"
        },
        {
            "Title": "Urja Global Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirms Urja Global's BB- stable issuer rating, citing experienced management and diversified portfolio despite operational challenges and competitive pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1768037146994,
            "Source": "stocks"
        },
        {
            "Title": "Urja Global Signs Joint Venture Agreement With Solarmint Energies",
            "Summary": "Urja Global has entered into a joint venture agreement with Solarmint Energies. The partnership involves both companies collaborating through a formal JV structure.",
            "Sentiment": "positive",
            "PublishDate": 1763678844489,
            "Source": "order&deals"
        },
        {
            "Title": "Urja Global's Subsidiary Wins Rs. 42.90 Crore Tax Appeal on Share Premium Valuation",
            "Summary": "The Commissioner of Income Tax (Appeals) ruled in favor of Sahu Minerals and Properties Limited, a subsidiary of Urja Global, deleting a Rs. 42.90 crore addition made under Section 56(2)(viib) for alleged excess share premium. The CIT(A) accepted the company's share valuation of Rs. 550 per share after a District Valuation Officer report supported the property-based valuation, with Urja Global stating no material impact on its operations.",
            "Sentiment": "positive",
            "PublishDate": 1763561445607,
            "Source": "stock"
        },
        {
            "Title": "Urja Global Launches New Electric Scooter Battery and Charger",
            "Summary": "Urja Global launched its new 'URJA' electric scooter battery and charger on November 14. The product launch expands the company's presence in the electric vehicle components market.",
            "Sentiment": "positive",
            "PublishDate": 1763125165129,
            "Source": "stock"
        },
        {
            "Title": "Urja Global Limited Reconstitutes Audit Committee with New Chairperson",
            "Summary": "Urja Global Limited has reconstituted its Audit Committee with Mr. Mukul Jain appointed as Chairperson. The committee includes Mr. Gopalsetty Prasad Rao, Mr. Mohan Jagdish Agarwal, and Mrs. Saumya Srivastava as members. The reconstitution was approved by the Board of Directors in their meeting held on October 15, 2025. Mr. Mukul Jain serves as Non-Executive Independent Director and Chairperson, Mr. Gopalsetty Prasad Rao as Non-Executive Independent Director and Member, Mr. Mohan Jagdish Agarwal as Executive Director and Member, and Mrs. Saumya Srivastava as Non-Executive Independent Director and Member.",
            "Sentiment": "neutral",
            "PublishDate": 1760536971519,
            "Source": "corporate_governance"
        },
        {
            "Title": "Urja Global Limited Reports Quarterly Results with Multiple Regulatory Challenges",
            "Summary": "Urja Global Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended September 30, 2025. The company reported consolidated revenue of Rs 15.50 crores for the quarter, down from Rs 19.01 crores in the previous quarter. Net profit stood at Rs 4.15 crores for the quarter. The auditor's review highlighted significant concerns including missing documentation for Rs 463.53 crores in mine project investments due to GST department raids in 2021, outstanding receivables of Rs 67.82 crores with aging over 180 days, and pending liabilities of Rs 34.25 crores outstanding for more than 2 years. The company faces multiple legal notices including SEBI penalties of Rs 90 lakh for disclosure non-compliance and various GST demand orders totaling over Rs 80 crores. Outstanding tax liabilities include Rs 6.24 crores in income tax and Rs 8.52 lakh in TDS. The company operates in three segments: Electric Vehicles, Renewable Energy, and Batteries, with Electric Vehicles contributing the largest revenue share.",
            "Sentiment": "negative",
            "PublishDate": 1760535284327,
            "Source": "earnings"
        },
        {
            "Title": "Urja Global Limited Company Secretary Manish Kumar Resigns Due to Personal Reasons",
            "Summary": "Urja Global Limited announced that Manish Kumar has resigned from his position as Company Secretary and Compliance Officer, effective October 10, 2025. Kumar cited personal reasons for his departure and confirmed there are no other material reasons for his resignation. The resignation takes effect from the close of business hours on October 10, 2025. Managing Director Mohan Jagdish Agarwal signed the disclosure letter to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1760093788823,
            "Source": "corporate_governance"
        },
        {
            "Title": "URJA Global Limited Publishes Q1 FY2026 Financial Results",
            "Summary": "URJA Global Limited published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board approved these quarterly results on August 2, 2025, and they were subsequently published in Financial Express (English) and Jansatta (Hindi) newspapers on August 3, 2025. The company is listed on BSE (scrip code 526987) and NSE (symbol URJA). Additional details are available on the company's website at www.urjaglobal.in and on the stock exchange websites.",
            "Sentiment": "neutral",
            "PublishDate": 1754290162457,
            "Source": "earnings"
        },
        {
            "Title": "Urja Global Approves Q1 FY2026 Results, Plans $500M Fundraising and Appoints New Leadership",
            "Summary": "Urja Global Limited's board approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue of ₹1,129.08 lakh and net profit of ₹60.51 lakh. The company appointed Mrs. Saumya Srivastava as Additional Non-Executive Independent Director and Mr. Manish Kumar as Company Secretary and Compliance Officer. The board granted in-principle approval to raise up to $500 million through various securities including convertible instruments, warrants, and debt instruments via multiple routes. The 33rd Annual General Meeting is scheduled for September 24, 2025, to be held virtually. The auditor's report highlighted several concerns including missing documentation for mine project investments worth ₹46.35 crore, outstanding receivables of ₹73.18 crore with ₹65.62 crore aged over 180 days, and pending liabilities of ₹36.04 crore outstanding for more than two years. The company faces multiple regulatory notices including SEBI penalties of ₹90 lakh for disclosure non-compliance and various GST demands totaling several crores.",
            "Sentiment": "neutral",
            "PublishDate": 1754136527611,
            "Source": "earnings"
        },
        {
            "Title": "Urja Global Reports Q4 Revenue and Profit Growth",
            "Summary": "Urja Global has announced its Q4 financial results. The company's revenue increased to 171.8 million rupees, up from 130 million rupees in the same quarter last year. Consolidated net profit for Q4 rose to 8.1 million rupees, compared to 5 million rupees year-over-year and 5.3 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747839258000,
            "Source": "result"
        },
        {
            "Title": "Urja Global Reports Mixed Q3 Financial Results",
            "Summary": "Urja Global has released its Q3 financial results. The company's consolidated net profit decreased to 5.3 million rupees from 8.9 million rupees in the same quarter last year. However, revenue increased significantly to 202 million rupees from 109 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1736813575000,
            "Source": "earnings"
        },
        {
            "Title": "Urja Global Reports Q3 Financial Results",
            "Summary": "Urja Global has announced its financial results for the third quarter. The company's consolidated net profit decreased to 5.3 million rupees from 8.9 million rupees in the same quarter last year. However, revenue increased significantly to 202 million rupees, up from 109 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736774297000,
            "Source": "earnings"
        }
    ]
}