{
    "Symbol": "USHAMART",
    "ISIN": "INE228A01035",
    "News": [
        {
            "Title": "Usha Martin Q3 Net Profit Rises 18.8% to ₹1.1B",
            "Summary": "Usha Martin reported consolidated net profit of ₹1.1 billion in Q3, up from ₹926 million year-over-year. Revenue grew to ₹9.2 billion from ₹8.6 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1769692364222,
            "Source": "co_actions_results"
        },
        {
            "Title": "Usha Martin Q3 FY26 Earnings Call on Jan 30",
            "Summary": "Usha Martin Limited schedules earnings conference call for January 30, 2026 at 10:00 AM IST to discuss Q3 & 9M FY26 financial results with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769095839413,
            "Source": "co_actions_results"
        },
        {
            "Title": "Usha Martin Dissolves Spanish Subsidiary Operations",
            "Summary": "Usha Martin Limited announces voluntary dissolution of step-down subsidiary Usha Martin Espana S.L. with no impact on operations or financial position as Spanish market continues through other European units.",
            "Sentiment": "neutral",
            "PublishDate": 1766502142383,
            "Source": "stocks"
        },
        {
            "Title": "Peterhouse Investments Sells Usha Martin Shares",
            "Summary": "Peterhouse Investments Limited disclosed the sale of 200,000 equity shares of Usha Martin Limited on December 12, 2025, reducing its shareholding from 1.13% to 1.07%.",
            "Sentiment": "neutral",
            "PublishDate": 1765860376520,
            "Source": "co_actions_results"
        },
        {
            "Title": "Peterhouse Investments India reduces Usha Martin stake",
            "Summary": "Peterhouse Investments India Limited sold 2.30 million equity shares of Usha Martin Limited through NSE block deal on December 12, 2025, reducing its shareholding from 1.33% to 0.58%.",
            "Sentiment": "neutral",
            "PublishDate": 1765446154309,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajeev Jhawar Acquires Additional 6,000 Shares in Usha Martin Ltd",
            "Summary": "Rajeev Jhawar purchased 6,000 equity shares of Usha Martin Ltd through open market transactions on NSE, increasing his total shareholding to 41,78,000 shares. His stake in the company now stands at 1.37% of the total voting capital of 30,47,41,780 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765340728617,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajeev Jhawar Acquires Additional 9,000 Shares in Usha Martin Ltd",
            "Summary": "Rajeev Jhawar purchased 9,000 equity shares of Usha Martin Ltd through open market acquisition on NSE, increasing his total shareholding to 41,72,000 shares. His stake in the company has risen to 1.37% of the total equity share capital of 30,47,41,780 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765179260341,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajeev Jhawar Acquires Additional 18,000 Shares in Usha Martin Ltd",
            "Summary": "Rajeev Jhawar purchased 18,000 equity shares of Usha Martin Ltd through open market acquisition on NSE on December 3, 2025. His total shareholding increased from 41,45,000 shares (1.36%) to 41,63,000 shares (1.37%) of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764909474261,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Promoter Group Member Acquires Additional 15,000 Equity Shares",
            "Summary": "Susmita Jhawar, a promoter group member of Usha Martin Ltd, acquired 15,000 equity shares through open market transactions on NSE, increasing her holding from 16,85,000 to 17,00,000 shares. The acquisition represents 0.56% of the company's total equity share capital of 30,47,41,780 shares and was disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764666356966,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajeev Jhawar Acquires Additional 5,000 Shares in Usha Martin Ltd",
            "Summary": "Rajeev Jhawar purchased 5,000 equity shares of Usha Martin Ltd through open market acquisition on NSE, increasing his total shareholding to 41,35,000 shares. His stake in the company now stands at 1.36% of the total equity share capital of 30,47,41,780 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764579978944,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Receives ESG Rating of 66.8 from SEBI-Registered Provider",
            "Summary": "Usha Martin Limited has been voluntarily assigned an ESG rating of 66.8 by SEBI-registered ESG Rating Provider SESES ESG Research Private Limited, based on the company's financial year 2024-25 public domain data. The rating was conducted independently without the company's engagement and was communicated to Usha Martin on 28th November 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764401080331,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajeev Jhawar Acquires Additional 5,000 Shares in Usha Martin Ltd",
            "Summary": "Rajeev Jhawar purchased 5,000 equity shares of Usha Martin Ltd through open market acquisition on NSE, increasing his total shareholding from 40,85,000 shares to 40,90,000 shares. The acquisition maintains his shareholding percentage at 1.34% of the company's total equity share capital of 30,47,41,780 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764318726182,
            "Source": "corporate_action"
        },
        {
            "Title": "Peterhouse Investments Limited Sells 220,795 Equity Shares in Usha Martin Limited",
            "Summary": "Peterhouse Investments Limited sold 220,795 equity shares of Usha Martin Limited through open market transactions on the National Stock Exchange, reducing its shareholding from 1.30% to 1.23%. The transaction was disclosed under SEBI regulations, with the company maintaining additional GDRs that can be converted into 928,455 equity shares at the holder's option.",
            "Sentiment": "neutral",
            "PublishDate": 1764304471326,
            "Source": "corporate_action"
        },
        {
            "Title": "Stuti Jhawar Acquires Additional 9,000 Shares in Usha Martin",
            "Summary": "Stuti Jhawar purchased 9,000 equity shares of Usha Martin Ltd through open market transactions on NSE on November 21, 2025. Following this acquisition, Jhawar's total shareholding increased to 43,16,000 shares, representing 0.43% of the company's total equity share capital of 30,47,41,780 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764057146703,
            "Source": "stock"
        },
        {
            "Title": "Peterhouse Investments Sells 79,205 Usha Martin Shares in Open Market Transaction",
            "Summary": "Peterhouse Investments Limited, a promoter entity, sold 79,205 equity shares of Usha Martin Limited through open market transaction on the National Stock Exchange. The sale reduced their shareholding from 1.33% to 1.30% of the company's total share capital, with the entity also holding 185,691 GDRs convertible into 928,455 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763991993953,
            "Source": "corporate_action"
        },
        {
            "Title": "Peterhouse Investments and Stuti Jhawar File Shareholding Disclosures for Usha Martin",
            "Summary": "Peterhouse Investments India Ltd sold 200,000 equity shares of Usha Martin Limited through open market transactions, reducing its holding from 1.47% to 1.40%. Simultaneously, Stuti Jhawar acquired 6,000 equity shares, increasing her stake from 0.43% to 0.43% in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763721253019,
            "Source": "stock"
        },
        {
            "Title": "Vineeta Adityakumar Ruia Gifts 12.5 Lakh Usha Martin Shares",
            "Summary": "Vineeta Adityakumar Ruia, a promoter of Usha Martin Ltd, disposed of 12,50,000 equity shares through gift on November 19, 2025. The disposal reduced her shareholding from 42,74,000 shares (0.42%) to 30,24,000 shares (0.01%) in the steel wire manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1763622732277,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajeev Jhawar Acquires 12.5 Lakh Usha Martin Shares Through Gift Transaction",
            "Summary": "Rajeev Jhawar acquired 12,50,000 equity shares of Usha Martin Ltd through a gift transaction on November 19, 2025, increasing his shareholding from 0.93% to 1.34%. The acquisition was disclosed under SEBI regulations for substantial share acquisitions, with Usha Martin's total equity capital remaining at 30.47 crore shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763612191725,
            "Source": "corporate_action"
        },
        {
            "Title": "Peterhouse Investments Sells 40,000 Equity Shares in Usha Martin",
            "Summary": "Peterhouse Investments Limited, a promoter group entity, sold 40,000 equity shares of Usha Martin Limited through open market transaction on NSE. The sale reduced Peterhouse's shareholding from 1.34% to 1.33% of the total share capital, with the company maintaining additional GDRs convertible to 928,455 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763380912104,
            "Source": "stock"
        },
        {
            "Title": "Stuti Jhawar Acquires 9,000 Equity Shares in Usha Martin Ltd Through Open Market Purchase",
            "Summary": "Stuti Jhawar purchased 9,000 equity shares of Usha Martin Ltd through open market acquisition on NSE on November 14, 2025. Following this transaction, Jhawar's total shareholding increased to 43,01,000 shares, representing 0.43% of the company's total voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763364647609,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Reports 19.1% EBITDA Margin in Q2 FY26 with Strong Cash Generation",
            "Summary": "Usha Martin achieved consolidated revenue of INR 908 crore in Q2 FY26 with operating EBITDA of INR 173 crore at 19.1% margin, driven by Wire Rope segment's 2.6% growth and Wires segment's 14.2% growth, while LRPC division declined 26%. The company turned net cash positive with INR 111 crore, repaying INR 157 crore debt through internal accruals and generating robust operating cash flows of INR 390 crore with 123% EBITDA to cash conversion.",
            "Sentiment": "positive",
            "PublishDate": 1763129092274,
            "Source": "earnings"
        },
        {
            "Title": "Stuti Jnawar Acquires Additional 5,000 Shares in Usha Martin Ltd",
            "Summary": "Stuti Jnawar purchased 5,000 equity shares of Usha Martin Ltd through open market acquisition on NSE, increasing her total shareholding from 12,87,000 to 12,92,000 shares. The acquisition represents 0.00% of total shares but maintains her overall holding at 0.42% of the company's voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763098950730,
            "Source": "stock"
        },
        {
            "Title": "Peterhouse Investments Reduces Stake in Usha Martin Limited",
            "Summary": "Peterhouse Investments India Ltd, a promoter group entity, sold 100,000 equity shares of Usha Martin Limited through open market transactions on the National Stock Exchange. The sale reduced Peterhouse's shareholding from 1.50% to 1.47% of Usha Martin's total voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763055305356,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Limited Modifies Employee Welfare Trust, Appoints New Trustees",
            "Summary": "Usha Martin Limited has modified its Employee Welfare Trust deed to change trustees. The company appointed Ashwin Lakhani and Shahbaz Anwar Warsi as new trustees, replacing Gouri Shankar Rathi and Dhanraj Parihar. The supplemental trust deed was executed on November 8, 2025, under SEBI regulations for share-based employee benefits. The trust was originally established on September 23, 2024, to implement equity-based incentive and employee welfare schemes, including the Usha Martin Limited Employee Stock Option Plan-2024. All other provisions of the original trust deed remain unchanged except for the trustee composition.",
            "Sentiment": "neutral",
            "PublishDate": 1762614767104,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Reports Quarterly Results with Ongoing Legal Proceedings",
            "Summary": "Usha Martin Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The Board of Directors approved the unaudited financial results (standalone and consolidated) at their meeting held on November 8, 2025. The company continues to face legal proceedings including attachment of certain land parcels at Ranchi under the Prevention of Money Laundering Act, 2002 (PMLA) worth Rs. 19,037 lakhs related to iron ore sales. The Central Bureau of Investigation (CBI) has filed charges under the Prevention of Corruption Act, 1988 and Indian Penal Code, 1860 against the company and certain personnel. The company has received summons from the Enforcement Directorate regarding PMLA provisions. Management believes the company has a strong case and no adjustments to financial results have been made. The company's ongoing operations remain unaffected by these proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1762606064260,
            "Source": "earnings"
        },
        {
            "Title": "Usha Martin Reports Steady Q2 Performance with Revenue Growth",
            "Summary": "Usha Martin reported Q2 consolidated net profit of 1.1 billion rupees, matching the previous year's figure. Revenue increased to 9.07 billion rupees from 8.91 billion rupees year-over-year. EBITDA rose to 1.73 billion rupees compared to 1.61 billion rupees in the same period last year. The company's EBITDA margin improved to 19.06% from 18.04% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762602315461,
            "Source": "earnings"
        },
        {
            "Title": "Usha Martin Shareholders Approve Remuneration Revisions for Two Whole-Time Directors via Postal Ballot",
            "Summary": "Usha Martin Limited announced that shareholders have approved two special resolutions through postal ballot voting. The first resolution approved revision in remuneration for Whole-Time Director Sharng Bhrit Prasanna Bhanu Pratap Narayan Sharma (DIN: 08167106) effective from April 1, 2025, with 99.96% votes in favor. The second resolution approved remuneration revision for Whole-Time Director Chirantan Chatterjee (DIN: 10506056) effective from May 12, 2025, with 99.96% votes in favor. A total of 488 members representing 181,485,166 equity shares participated in the remote e-voting process. The voting period was from October 9, 2025 to November 7, 2025. The scrutinizer's report was prepared by Raj Kumar Banthia from MKB Associates.",
            "Sentiment": "positive",
            "PublishDate": 1762587814916,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Announces Release of USD 5 Million Corporate Guarantee by Export Import Bank of India",
            "Summary": "Usha Martin Limited disclosed that Export Import Bank of India has released a corporate guarantee of USD 5 million that was issued on behalf of Brunton Wire Ropes FZ Co., UAE, which is a wholly owned subsidiary of the company. The company received intimation of the guarantee release from the bank. The original corporate guarantee was issued in August 2023.",
            "Sentiment": "positive",
            "PublishDate": 1762528149896,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Schedules Q2 H1 FY26 Earnings Conference Call for November 10, 2025",
            "Summary": "Usha Martin Limited, a specialty wire rope solutions provider, will host an earnings conference call on November 10, 2025, at 10:30 AM IST for analysts and investors. The call will discuss Q2 H1 FY26 results, which will be declared on November 8, 2025. Senior management will present a brief discussion on the results followed by a Q&A session. The company operates wire rope manufacturing facilities in Ranchi, Hoshiarpur, Dubai, Bangkok and UK, and has a global R&D center in Italy. Usha Martin is listed on NSE (USHAMART), BSE (517146), and Luxembourg Stock Exchange (US9173002042).",
            "Sentiment": "neutral",
            "PublishDate": 1761923843760,
            "Source": "earnings"
        },
        {
            "Title": "Usha Martin's Ranchi Site Receives Bronze Medal from EcoVadis with Score of 63/100",
            "Summary": "Usha Martin Limited announced that its Ranchi site has been awarded a Bronze Medal by EcoVadis, a global sustainability rating provider, with an overall score of 63 out of 100. The rating was communicated to the company via email on October 13th, 2025. EcoVadis is described as one of the most trusted sustainability rating providers globally.",
            "Sentiment": "positive",
            "PublishDate": 1760422312727,
            "Source": "stock"
        },
        {
            "Title": "Stuti Jhawar Acquires 12,000 Additional Shares in Usha Martin Ltd",
            "Summary": "Stuti Jhawar, a promoter of Usha Martin Ltd, purchased 12,000 equity shares through open market transactions on NSE. The acquisition increased Jhawar's shareholding from 12,75,000 shares to 12,87,000 shares, maintaining a 0.42% stake in the company. The shares were acquired on February 19, 2025, and the disclosure was filed on September 22, 2025. Usha Martin's shares are listed on BSE and NSE, with GDRs listed on the Luxembourg Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1758602768452,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajeev Jhawar Acquires 10,000 Additional Shares in Usha Martin Ltd",
            "Summary": "Rajeev Jhawar, a promoter of Usha Martin Ltd, purchased 10,000 equity shares through open market transactions on NSE. The acquisition increased his shareholding from 28,25,000 shares to 28,35,000 shares, maintaining his stake at 0.93% of the company's total voting capital. The shares were acquired on September 19, 2025, and the disclosure was submitted to stock exchanges including BSE, NSE, and Luxembourg Stock Exchange where the company's shares and GDRs are listed.",
            "Sentiment": "neutral",
            "PublishDate": 1758516904673,
            "Source": "corporate_action"
        },
        {
            "Title": "Stuti Jhawar Acquires Additional 15,000 Shares in Usha Martin Ltd",
            "Summary": "Stuti Jhawar, a promoter of Usha Martin Ltd, purchased 15,000 equity shares of the company through open market transactions on NSE on September 18, 2025. The acquisition increased Jhawar's shareholding from 12,60,000 shares (0.41%) to 12,75,000 shares (0.42%) of the total voting capital. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers. Usha Martin Ltd is listed on BSE, NSE, and has GDRs listed on the Luxembourg Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1758263524790,
            "Source": "stock"
        },
        {
            "Title": "Stuti Jhawar Acquires Additional 10,000 Equity Shares in Usha Martin Ltd",
            "Summary": "Stuti Jhawar, identified as a promoter of Usha Martin Ltd, purchased 10,000 equity shares of the company through open market transactions on NSE on September 17, 2025. Following this acquisition, Jhawar's total shareholding increased from 12,50,000 shares to 12,60,000 shares, maintaining a 0.41% stake in the company's total voting capital. The disclosure was filed under SEBI regulations for substantial acquisition of shares and takeovers. Usha Martin Ltd is listed on BSE, NSE, and has GDRs listed on the Luxembourg Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1758174145610,
            "Source": "corporate_action"
        },
        {
            "Title": "Stuti Jhawar Acquires 10,000 Additional Shares in Usha Martin Ltd",
            "Summary": "Stuti Jhawar, identified as a promoter of Usha Martin Ltd, purchased 10,000 equity shares through open market transactions on NSE. The acquisition increased Jhawar's shareholding from 12,40,000 shares to 12,50,000 shares, maintaining a 0.41% stake in the company's total voting capital. The shares were acquired on September 12, 2025, with the disclosure filed on September 15, 2025. Usha Martin Ltd is listed on BSE, NSE, and has GDRs listed on the Luxembourg Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1757936455099,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Promoter Group Member Susmita Jhawar Acquires 10,000 Equity Shares",
            "Summary": "Susmita Jhawar, a promoter group member of Usha Martin Ltd, purchased 10,000 equity shares through open market acquisition on NSE. The transaction increased Jhawar's holding from 16,75,000 shares to 16,85,000 shares, maintaining a 0.55% stake in the company's total voting capital. The shares were acquired on September 10, 2025, and the disclosure was made under SEBI regulations. Usha Martin is listed on BSE, NSE, and has GDRs listed on Luxembourg Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1757679140824,
            "Source": "corporate_action"
        },
        {
            "Title": "Peterhouse Investments Sells 150,000 Equity Shares in Usha Martin Limited",
            "Summary": "Peterhouse Investments Limited sold 150,000 equity shares of Usha Martin Limited through open market transactions on the National Stock Exchange on September 10, 2025. The sale reduced Peterhouse's shareholding from 4,450,000 shares (1.46%) to 4,300,000 shares (1.41%) of Usha Martin's total equity capital. Peterhouse Investments is identified as belonging to the promoter/promoter group of Usha Martin. The company also holds 185,691 GDRs that can be converted into 928,455 equity shares. Usha Martin's shares are listed on BSE, NSE, and its GDRs are listed on the Luxembourg Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1757667929608,
            "Source": "corporate_action"
        },
        {
            "Title": "Peterhouse Investments Reduces Stake in Usha Martin by Selling 200,000 Shares",
            "Summary": "Peterhouse Investments Limited, a promoter group entity of Usha Martin Limited, sold 200,000 equity shares through open market transactions on the National Stock Exchange. The sale reduced Peterhouse's shareholding from 1.53% to 1.46% of Usha Martin's total share capital. The transaction represents 0.07% of the company's total voting capital. Peterhouse also holds 185,691 GDRs that can be converted into 928,455 equity shares. Usha Martin's shares are listed on BSE, NSE, and its GDRs are listed on the Luxembourg Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1757479709580,
            "Source": "corporate_action"
        },
        {
            "Title": "Promoter Group Members Acquire Additional Shares in Usha Martin Ltd",
            "Summary": "Two promoter group members of Usha Martin Ltd have acquired additional equity shares through open market transactions on NSE. Stuti Jhawar purchased 10,000 equity shares on September 5, 2025, increasing her holding from 12,10,000 shares to 12,20,000 shares, maintaining a 0.40% stake. Susmita Jhawar acquired 11,697 equity shares on the same date, raising her holding from 16,63,303 shares to 16,75,000 shares, with her stake remaining at 0.55%. Both transactions were disclosed under SEBI regulations for substantial acquisition of shares. Usha Martin Ltd is listed on BSE, NSE, and has GDRs listed on Luxembourg Stock Exchange.",
            "Sentiment": "positive",
            "PublishDate": 1757393314804,
            "Source": "corporate_action"
        },
        {
            "Title": "Usha Martin Signs Land Sale Agreement Worth 295.2 Million Rupees",
            "Summary": "Usha Martin has entered into an agreement with UGP Engineering for the sale of land valued at 295.2 million rupees. The deal represents a significant transaction for the company involving the disposal of real estate assets.",
            "Sentiment": "positive",
            "PublishDate": 1755788720574,
            "Source": "stock"
        },
        {
            "Title": "Usha Martin Reports 7.4% Revenue Growth in Q1 FY26 Despite Net Profit Decline",
            "Summary": "Usha Martin Limited reported consolidated revenue of Rs. 887 crore for Q1 FY26, up 7.4% year-on-year, driven by 10.4% volume growth across key segments. The company achieved operating EBITDA of Rs. 145 crore with a margin of 16.3%. However, net profit declined to Rs. 101 crore from Rs. 104 crore in Q1 FY25. The wire ropes segment, contributing 72% of total revenue, grew 7.9% while the wire segment registered strong 32.3% growth. The LRPC segment faced headwinds with a 3.4% revenue decline. The company's 'One Usha Martin' transformation program foundational phase is largely complete, with more tangible benefits expected in H2 FY26. Management targets 18% EBITDA margin for full year FY26 and 19-20% margins for FY27. The company faces challenges from 50% US tariffs on steel wire ropes but remains optimistic about passing costs to customers. New capacity expansion of 40,000 tons is underway, including 20,000 tons of rope capacity at the Ranchi plant.",
            "Sentiment": "neutral",
            "PublishDate": 1755611348232,
            "Source": "earnings"
        },
        {
            "Title": "Usha Martin Targets Growth Through Strategic Expansion and Global Orders",
            "Summary": "Usha Martin is implementing a 'One Usha Martin' strategy to drive growth, alongside expanding its Ranchi facility capacity. The company reports strong global orders and has achieved net-debt-free status. High international demand positions the company for rapid growth expected to begin in H2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755016984886,
            "Source": "stock"
        },
        {
            "Title": "Usha Martin Reports Quarterly Results with Revenue of Rs 88,719 Lakhs",
            "Summary": "Usha Martin Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 88,719 lakhs and profit after tax of Rs 10,081 lakhs for the quarter. The Wire & Wire Ropes segment generated revenue of Rs 87,075 lakhs while Others segment contributed Rs 1,644 lakhs. Earnings per share stood at Rs 3.31 for the quarter. The company faces ongoing legal proceedings related to land attachment under Prevention of Money Laundering Act concerning iron ore sales aggregating Rs 19,037 lakhs, with hearings scheduled for August 28, 2025 and September 8, 2025. Management believes the company has a strong legal case and no financial adjustments have been made regarding these proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1755002811110,
            "Source": "earnings"
        },
        {
            "Title": "Usha Martin Reports Q4 FY23 Financial Results",
            "Summary": "Usha Martin has released its Q4 financial results. The company reported revenue of 8.96 billion rupees, up from 8.29 billion rupees year-over-year. However, EBITDA decreased to 1.39 billion rupees from 1.52 billion rupees in the same period last year. The EBITDA margin also declined to 15.58% from 18.28% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747041066000,
            "Source": "result"
        },
        {
            "Title": "Usha Martin Declares Dividend of Rs 3 Per Share",
            "Summary": "Usha Martin Limited has announced a dividend of Rs 3 per share for its shareholders. This corporate action represents a distribution of profits to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1747040457000,
            "Source": "result"
        },
        {
            "Title": "Usha Martin Reports Q4 Net Profit of 1 Billion Rupees",
            "Summary": "Usha Martin, a steel wire rope manufacturer, has reported a consolidated net profit of 1 billion rupees for the fourth quarter, compared to 1.06 billion rupees in the same period last year. This represents a slight year-over-year decrease in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1747040408000,
            "Source": "result"
        },
        {
            "Title": "Usha Martin Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Usha Martin, a steel wire rope manufacturer, has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 1.42 billion rupees from 1.75 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 16.58% from 19.70% year-over-year, indicating a reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738138603000,
            "Source": "earnings"
        },
        {
            "Title": "Usha Martin Reports Decrease in Q3 Consolidated Net Profit",
            "Summary": "Usha Martin Limited has reported a consolidated net profit of 926 million rupees for the third quarter, down from 1.07 billion rupees in the same period last year. This represents a year-over-year decline in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1738138545000,
            "Source": "earnings"
        },
        {
            "Title": "Usha Martin to Consider Q3 Results on January 29",
            "Summary": "Usha Martin Limited has announced that it will be considering its financial results for the third quarter on January 29. This indicates the company is preparing to release its quarterly earnings report, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1737549224000,
            "Source": "result"
        },
        {
            "Title": "Usha Martin Subsidiary to Acquire 2.02% Stake in Usha Siam Steel Industries",
            "Summary": "A subsidiary of Usha Martin has entered into an agreement to acquire a 2.02% stake in Usha Siam Steel Industries Public Company. The cost of this acquisition is approximately 14.25 million Thai Baht.",
            "Sentiment": "neutral",
            "PublishDate": 1733486552000,
            "Source": "corporate_action"
        }
    ]
}