{
    "Symbol": "USK",
    "ISIN": "INE0N0Y01013",
    "News": [
        {
            "Title": "Udayshivakumar Infra Q3FY26 Loss Widens to ₹478.67 Cr",
            "Summary": "Udayshivakumar Infra reported a net loss of ₹478.67 crores for Q3FY26, compared to a profit of ₹150.13 crores in Q3FY25. Revenue declined 5.92% YoY to ₹4,740.70 crores despite strong infrastructure operations.",
            "Sentiment": "negative",
            "PublishDate": 1770646034167,
            "Source": "co_actions_results"
        },
        {
            "Title": "Udayshivakumar Infra Board Meet on Feb 9, 2026",
            "Summary": "Udayshivakumar Infra Limited has scheduled a board meeting on February 9, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770035190139,
            "Source": "co_actions_results"
        },
        {
            "Title": "Udayshivakumar Infra Reports Mixed Q2 Performance with Revenue Decline and EBITDA Recovery",
            "Summary": "Udayshivakumar Infra Limited posted quarterly revenue of INR 5,770.73 lakhs, down 0.78% from the previous quarter, while EBITDA surged 104.56% to INR 595.68 lakhs from a loss of INR 569.68 lakhs in the prior quarter. The infrastructure company, engaged in civil contracts, road construction, and smart city development, received an unmodified audit review for its quarterly results ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763174469196,
            "Source": "earnings"
        },
        {
            "Title": "Udayshivakumar Infra Reports No Deviation in IPO Fund Utilization for Quarter Ended September 2025",
            "Summary": "Udayshivakumar Infra Limited filed its quarterly statement showing no deviation or variation in the utilization of funds raised through its Initial Public Offering for the quarter ended September 30, 2025. The company had raised INR 6,599 lakhs through its IPO completed in March 2023, issuing 1,88,57,142 equity shares at ₹35 per share. The funds were allocated for incremental working capital requirements (₹4,500 lakhs) and general corporate purposes (₹1,615.84 lakhs originally, modified to ₹1,028.95 lakhs). The company got listed on BSE and NSE on April 3, 2023. Unutilized proceeds have been temporarily invested in bank accounts and deposits with State Bank of India.",
            "Sentiment": "neutral",
            "PublishDate": 1762938841164,
            "Source": "corporate_action"
        },
        {
            "Title": "Udayshivakumar Infra Reports 48% Revenue Decline and Widened Losses in Q1 FY2026",
            "Summary": "Udayshivakumar Infra Limited reported unaudited financial results for the quarter ended June 30, 2025. The company's revenue from operations decreased by 48.29% to INR 5,816.42 lakhs compared to INR 11,248.53 lakhs in the previous quarter. The company posted a net loss of INR 772.83 lakhs compared to a loss of INR 624.97 lakhs in the previous quarter. EBITDA stood at negative INR 569.68 lakhs, representing a 665.75% decrease from the previous quarter's negative INR 85.57 lakhs. Basic earnings per share was negative INR 1.40. The company operates in civil contracts including road construction, canal development, and NHAI toll collection. Supply of materials and services decreased by 34.55% to INR 5,496.01 lakhs. The company has a paid-up share capital of INR 5,535.71 lakhs consisting of 5,53,57,142 equity shares of INR 10 each.",
            "Sentiment": "negative",
            "PublishDate": 1755184402004,
            "Source": "earnings"
        },
        {
            "Title": "Udayshivakumar Infra Limited Schedules 6th AGM for August 20, 2025",
            "Summary": "Udayshivakumar Infra Limited has announced its 6th Annual General Meeting scheduled for August 20, 2025, at 12:30 PM IST at the company's registered office in Davangere, Karnataka. The AGM will address ordinary business including adoption of audited financial statements for FY 2024-25 and re-appointment of Ms. Manjushree Shivakumar as director. Special business items include ratification of cost auditor remuneration of Rs. 1 lakh, appointment of Mr. Gowdara Timmappa Govindappa as independent director, approval of related party transactions, and appointment of secretarial auditor. The company has set August 13, 2025 as the cut-off date for e-voting eligibility, with remote e-voting period from August 17-19, 2025. The notice includes detailed e-voting procedures and shareholder information.",
            "Sentiment": "neutral",
            "PublishDate": 1753801034238,
            "Source": "corporate_action"
        },
        {
            "Title": "Udayshivakumar Infra Limited Company Secretary Bharti Ramchandani Resigns Due to Personal Reasons",
            "Summary": "Bharti Ramchandani has resigned from her position as Company Secretary and Compliance Officer at Udayshivakumar Infra Limited, effective July 21, 2025. The resignation was attributed to personal reasons and took effect immediately. The company has informed BSE and NSE about this key managerial personnel change. Ramchandani holds FCS 11651 certification and submitted her resignation letter on the same date as her cessation.",
            "Sentiment": "neutral",
            "PublishDate": 1753158486013,
            "Source": "corporate_governance"
        }
    ]
}