{
    "Symbol": "UTIAMC",
    "ISIN": "INE094J01016",
    "News": [
        {
            "Title": "UTI AMC Announces Leadership Transition and Updates KMP List",
            "Summary": "UTI Asset Management Company announces CEO transition from Intaiyazur Rahman to Vetri Subramaniam effective February 1, 2026, with updated Key Managerial Personnel authorization list.",
            "Sentiment": "neutral",
            "PublishDate": 1769777848724,
            "Source": "stocks"
        },
        {
            "Title": "UTI AMC Q3FY26 Net Profit Drops 13% to ₹123.68 Cr",
            "Summary": "UTI Asset Management Company reported Q3FY26 net profit of ₹123.68 crore, down 13% YoY. Revenue grew 28% to ₹423.12 crore despite VRS exceptional charges of ₹108.49 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1768998480596,
            "Source": "co_actions_results"
        },
        {
            "Title": "UTI AMC's Ajay Tyagi flags high valuations, picks banks",
            "Summary": "UTI AMC's Head of Equities highlights elevated market valuations with large caps at 15-20% premium to historical averages. Identifies value opportunities in private banks, IT sector, and auto OEMs despite range-bound market outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1767945600456,
            "Source": "mutualfunds"
        },
        {
            "Title": "UTI AMC Appoints Kapil Udaiwal as President & HR Head",
            "Summary": "UTI Asset Management Company announces the appointment of Kapil Udaiwal as President & Head - Human Resources effective January 1, 2026. Udaiwal brings over 23 years of experience across ITES, IT, and BFSI sectors.",
            "Sentiment": "positive",
            "PublishDate": 1767347792619,
            "Source": "stocks"
        },
        {
            "Title": "UTI AMC's Srivatsa sees 2026 turnaround for equity markets",
            "Summary": "After a challenging 2025 with Nifty returning around 10%, UTI AMC's fund manager V. Srivatsa expects improved macros and earnings growth to drive better market performance in 2026, despite US trade tariff risks.",
            "Sentiment": "positive",
            "PublishDate": 1766720771637,
            "Source": "mutualfunds"
        },
        {
            "Title": "UTI AMC Director Flemming Madsen Resigns from Board",
            "Summary": "UTI Asset Management Company announces resignation of Non-Executive Nominee Director Flemming Madsen effective December 31, 2025, following end of his association with T. Rowe Price International Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1765962362038,
            "Source": "stocks"
        },
        {
            "Title": "UTI AMC Allots 30,304 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "UTI Asset Management Company's Nomination and Remuneration Committee approved the allotment of 30,304 equity shares of face value ₹10 each to eligible employees under the UTIAMC Employee Stock Option Scheme-2007. The allotment increases the company's issued and paid-up share capital from ₹1,28,31,70,860 to ₹1,28,34,73,900, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765258508657,
            "Source": "corporate_action"
        },
        {
            "Title": "UTI Asset Management Company Announces Board Changes as Two Independent Directors Complete Terms",
            "Summary": "UTI Asset Management Company disclosed that Dinesh Kumar Mehrotra and Narasimhan Seshadri will complete their terms as Non-Executive Independent Directors on November 27, 2025, with Mehrotra stepping down as Board Chairperson. The Board has unanimously selected Deepak Kumar Chatterjee as the new Chairperson effective November 28, 2025, and reconstituted various board committees following the leadership transition.",
            "Sentiment": "neutral",
            "PublishDate": 1764246158218,
            "Source": "corporate_governance"
        },
        {
            "Title": "UTI Asset Management Shareholders Approve Five Director Appointments in EGM",
            "Summary": "UTI Asset Management Company held its 9th Extra-Ordinary General Meeting on November 25, 2025, where shareholders approved the appointment of five directors including four Non-Executive Independent Directors and one Non-Executive Nominee Director. All resolutions were passed with requisite majority through remote e-voting and electronic voting, with over 99% approval rates across most appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1764159835101,
            "Source": "corporate_governance"
        },
        {
            "Title": "UTI AMC Grants 5.48 Lakh Stock Options Under ESOP Scheme 2007",
            "Summary": "UTI Asset Management Company's Board approved granting 5,48,522 stock options to employees under its ESOP Scheme 2007, with each option entitling holders to apply for one equity share of Rs. 10 face value. The company also updated its ESOP scheme to allow retired employees' unvested options to continue vesting according to original schedules rather than immediate vesting upon retirement.",
            "Sentiment": "neutral",
            "PublishDate": 1764064387684,
            "Source": "corporate_action"
        },
        {
            "Title": "UTI Asset Management Allots 22,732 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "UTI Asset Management Company Limited's Nomination and Remuneration Committee approved the allotment of 22,732 equity shares with a face value of ₹10 each under the UTI AMC Employee Stock Option Scheme-2007. The allotment was approved on November 12, 2025, following the exercise of options by eligible employees. Post-allotment, the company's issued and paid-up share capital increased from ₹1,28,27,53,540 (comprising 12,82,75,354 equity shares) to ₹1,28,29,80,860 (comprising 12,82,98,086 equity shares). The newly allotted equity shares will rank equally with existing equity shares in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1762926235991,
            "Source": "corporate_action"
        },
        {
            "Title": "UTI Asset Management Launches Voluntary Retirement Scheme with ₹857.9 Million Impact",
            "Summary": "UTI Asset Management has introduced a Voluntary Retirement Scheme that will impact the company's profit and loss statement by ₹857.9 million. The financial impact is directly attributed to the implementation of the VRS program.",
            "Sentiment": "negative",
            "PublishDate": 1762179330142,
            "Source": "stock"
        },
        {
            "Title": "UTI Asset Management Company's Group President HR Indranil Choudhury Resigns",
            "Summary": "UTI Asset Management Company Limited announced that Indranil Choudhury ceased to be the Group President Group Head-Human Resources with effect from closure of business hours on October 31, 2025. In his resignation letter dated July 31, 2025, Choudhury cited career aspirations and the need to direct his career on a path outside UTI AMC after 5 years and 8 months with the company. He requested early release from his 90-day notice period due to pressing personal matters, asking to be relieved on or before September 30, 2025. The company disclosed this senior management change under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761923850111,
            "Source": "corporate_governance"
        },
        {
            "Title": "UTI Asset Management Appoints Five New Directors to Board",
            "Summary": "UTI Asset Management Company Limited appointed five new directors to its board through a circular resolution on October 30, 2025. Four directors - Atul Dhawan, P.V. Bharathi, Philip Mathew, and Vishakha RM - were appointed as Additional Directors in Non-Executive Independent Category for a three-year term from October 30, 2025 to October 29, 2028, not liable to retire by rotation. Linsley Carruth was appointed as Additional Director in Non-Executive Nominee Category, liable to retire by rotation. All appointments are subject to shareholder approval. The new directors bring expertise across finance, risk management, banking, human resources, marketing, and corporate strategy. Dhawan is a Chartered Accountant with over four decades of experience, Bharathi has banking and credit experience, Mathew specializes in HR and business transformation, Vishakha RM is a Harvard ALI fellow with marketing expertise, and Carruth serves as Director of Investor Relations at T. Rowe Price Group with over two decades of experience in stockholder engagement.",
            "Sentiment": "positive",
            "PublishDate": 1761838908957,
            "Source": "corporate_governance"
        },
        {
            "Title": "UTI AMC Allots 39,284 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "UTI Asset Management Company Limited's Nomination and Remuneration Committee approved the allotment of 39,284 equity shares with face value of ₹10 each under the 'UTI AMC Employee Stock Option Scheme – 2007'. The allotment follows the exercise of options by eligible employees. The company's issued and paid-up share capital will increase from ₹1,28,23,60,700 (12,82,36,070 equity shares) to ₹1,28,27,53,540 (12,82,75,354 equity shares). The new equity shares will have equal rights with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761557767389,
            "Source": "corporate_action"
        },
        {
            "Title": "UTI AMC Reports Q2 Results with Leadership Transition and VRS Implementation",
            "Summary": "UTI Asset Management Company announced quarterly results for the period ended September 30, 2025, with consolidated core income of Rs. 390 crores, up 5% year-on-year. The company reported normalized consolidated core PAT of Rs. 127 crores after adjusting for a Rs. 25 crore family pension revision impact. UTI AMC's total AUM reached Rs. 22.42 lakh crore, growing 11% from the previous year, while mutual fund AUM stood at Rs. 3.78 lakh crores. The Board appointed Vetri Subramaniam as incoming MD and CEO effective February 1, 2026, with current MD Imtaiyazur Rahman serving as Strategic Advisor until June 2026. The company implemented a Voluntary Retirement Scheme for 479 eligible employees, with applications accepted until October 31, 2025. SIP inflows for the quarter were Rs. 2,338 crores, showing 12.04% year-on-year growth. The company launched UTI Multi Cap Fund in May, which reached Rs. 1,576 crores in assets by September. UTI captured 6.2% market share of industry gross sales during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761283978077,
            "Source": "earnings"
        },
        {
            "Title": "UTI AMC Shares Plunge 10% on Weak Quarterly Results and Rising Costs",
            "Summary": "UTI AMC shares fell 10%, marking their biggest single-day decline since listing in 2020, following disappointing quarterly results. Revenue dropped 23% sequentially, primarily due to a 91% decline in market-to-market income. Employee costs surged 23% due to one-off items, causing EBITDA margins to fall by 1,980 basis points. Profit after tax of ₹132 crore missed estimates on weaker margins. While quarterly average assets under management increased 5% to ₹3.78 lakh crore, market share declined across all key segments from 3.1% to 2.9%. The SIP stoppage ratio worsened to 76.27% in September from 74.51% in August. Management cited uncertainty regarding future employee costs but expects improvement in the second half of financial year 2026. UTI AMC's performance lagged peers, with equity AUM at only 26% compared to HDFC AMC's 65% and industry average of 56%.",
            "Sentiment": "negative",
            "PublishDate": 1760947019184,
            "Source": "earnings"
        },
        {
            "Title": "UTI Asset Management Reports Q2 FY26 Results with Profit Decline",
            "Summary": "UTI Asset Management Company Limited reported unaudited financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company recorded a quarterly profit of Rs 166.21 crore, down from Rs 201.20 crore in the same quarter last year. Revenue from operations decreased to Rs 390.22 crore from Rs 416.64 crore year-on-year. For the half year, standalone profit was Rs 382.34 crore compared to Rs 387.01 crore in the previous year. On a consolidated basis, quarterly profit attributable to owners was Rs 113.01 crore versus Rs 239.17 crore in the corresponding quarter of the previous year. The company paid a final dividend of Rs 26 per share and a special dividend of Rs 22 per share during the period. The Board approved a Voluntary Retirement Scheme for certain employee categories and revised family pension benefits, resulting in an incremental liability of Rs 24.91 crore.",
            "Sentiment": "negative",
            "PublishDate": 1760782828606,
            "Source": "earnings"
        },
        {
            "Title": "UTI Asset Management Appoints Vetri Subramaniam as Managing Director & CEO",
            "Summary": "UTI Asset Management Company Limited held its 8th Extraordinary General Meeting on September 30, 2025, via video conferencing. The meeting approved two key resolutions: the appointment of Vetri Subramaniam (DIN: 11106784) as Director and his appointment as Managing Director & Chief Executive Officer, both positions not liable to retire by rotation. 66 members participated in the meeting, which was chaired by Dinesh Kumar Mehrotra, Non-Executive Chairman and Independent Director. The resolutions were passed with requisite majority through e-voting, with voting rights based on shares held as of the cut-off date of September 26, 2025. The company submitted the meeting proceedings, scrutinizer's report, and e-voting results to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1759246351663,
            "Source": "corporate_action"
        },
        {
            "Title": "UTI Asset Management Promotes Vetri Subramaniam to Managing Director & CEO Designate",
            "Summary": "UTI Asset Management Company Limited announced a change in designation for Mr. Vetri Subramaniam, who has been promoted from Chief Investment Officer to Managing Director & Chief Executive Officer (Designate). The change in designation took effect on September 4, 2025. This represents an internal promotion rather than a new appointment, as Subramaniam was already serving as Chief Investment Officer at the company.",
            "Sentiment": "positive",
            "PublishDate": 1757043575342,
            "Source": "corporate_governance"
        },
        {
            "Title": "UTI Asset Management Appoints Gayatri Kannan as Compliance Officer of UTI Mutual Fund",
            "Summary": "UTI Asset Management Company has appointed Gayatri Kannan as the Compliance Officer of UTI Mutual Fund effective August 1, 2025. Kannan joined UTI in January 2022 and holds the position of Senior Vice President & Compliance Officer. She brings over 8 years of experience to the role, having previously worked as Compliance Officer at West End Housing Finance Limited. Kannan holds a B.Com degree and is qualified as both a Chartered Accountant and Company Secretary, with additional FRM certification from GARP US.",
            "Sentiment": "neutral",
            "PublishDate": 1754051041478,
            "Source": "corporate_governance"
        },
        {
            "Title": "UTI Mutual Fund Compliance Officer Suruchi Wanare Steps Down Due to Superannuation",
            "Summary": "Ms. Suruchi Wanare ceased to be the Compliance Officer of UTI Mutual Fund due to superannuation, effective from the close of business hours on July 31, 2025. UTI Asset Management Company Limited disclosed this senior management change to stock exchanges NSE and BSE. The cessation was a result of Ms. Wanare reaching the age of superannuation.",
            "Sentiment": "neutral",
            "PublishDate": 1753974346640,
            "Source": "corporate_governance"
        },
        {
            "Title": "UTI AMC Reports 60% Growth in Passive AUM and Record SIP Inflows",
            "Summary": "UTI AMC achieved a 60% year-over-year surge in passive assets under management alongside record SIP inflows. The company is focusing on retirement product scale-up and expanding its digital and IFA presence into Bharat markets as part of its growth strategy to unlock operating leverage and generate long-term sticky flows.",
            "Sentiment": "positive",
            "PublishDate": 1753369597702,
            "Source": "mutualfunds"
        },
        {
            "Title": "UTI Asset Management Reports Strong Q1 Results with 216% Profit Growth, Approves ₹45 Crore Subsidiary Loan",
            "Summary": "UTI Asset Management Company Limited reported standalone profit of ₹216.13 crore for the quarter ended June 30, 2025, representing a 16% increase from ₹185.81 crore in the same quarter last year. Total income rose to ₹438.31 crore from ₹390.01 crore year-over-year. On a consolidated basis, profit attributable to owners reached ₹236.85 crore compared to ₹254.17 crore in the previous year. The company's board approved an unsecured working capital loan of up to ₹45 crore to its wholly owned subsidiary UTI Alternatives Private Limited. The loan carries an interest rate based on 1-year SBI MCLR with quarterly interest payments and is repayable by March 31, 2028. Basic earnings per share increased to ₹16.88 from ₹14.60 in the corresponding quarter. The company had previously proposed a final dividend of ₹26 per share plus a special dividend of ₹22 per share.",
            "Sentiment": "positive",
            "PublishDate": 1753354928685,
            "Source": "earnings"
        },
        {
            "Title": "UTI Asset Management Sets July 24, 2025 as Record Date for Final Dividend",
            "Summary": "UTI Asset Management Company Limited has clarified that the record date for determining shareholder eligibility for the final dividend is set for Thursday, July 24, 2025. This clarification was provided in reference to the company's 22nd Annual General Meeting notice and Annual Report for the financial year ended March 31, 2025. The record date determination follows regulatory requirements for dividend entitlement to shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1753160675890,
            "Source": "corporate_action"
        },
        {
            "Title": "UTI Asset Management Company Ltd: Shares Hit 52-Week High Amid Positive Analyst Coverage",
            "Summary": "UTI AMC shares surged over 6% to a 52-week high, gaining in five out of the last six sessions. The stock is up 10.5% in July, continuing its third straight month of gains. Antique Stock Broking initiated coverage with a 'buy' rating and ₹1,500 price target, citing improving equity fund performance and strong SIP flows.",
            "Sentiment": "positive",
            "PublishDate": 1752132235000,
            "Source": "normal_news"
        },
        {
            "Title": "UTI Asset Management to Review Q1 Results on July 24",
            "Summary": "UTI Asset Management Company has announced that it will review its first quarter results on July 24. The company has not provided any additional details about the financial performance or expectations for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1750770292000,
            "Source": "default"
        },
        {
            "Title": "UTI Asset Management Company: Q4 Profit Drops 17.9%, Declares ₹48 Final Dividend",
            "Summary": "UTI AMC reported a 17.9% YoY decline in Q4 net profit to ₹124 crore. Revenue from operations fell 3.2% to ₹316.9 crore. The company announced a final dividend of ₹48 per share, including a special dividend of ₹22.",
            "Sentiment": "neutral",
            "PublishDate": 1745938906000,
            "Source": "earnings"
        },
        {
            "Title": "UTI AMC Declares Significant Dividends",
            "Summary": "UTI Asset Management Company (AMC) has announced a final dividend of ₹26 per equity share and a special dividend of ₹22 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745937309000,
            "Source": "result"
        },
        {
            "Title": "UTI AMC Reports Q4 FY23 Financial Results",
            "Summary": "UTI Asset Management Company (AMC) has reported its financial results for the fourth quarter of fiscal year 2023. The company's net profit decreased to 1.24 billion rupees, compared to 1.51 billion rupees in the same quarter last year and 1.4 billion rupees in the previous quarter. Revenue for Q4 stood at 3.16 billion rupees, down from 3.27 billion rupees in the corresponding period of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1745937231000,
            "Source": "result"
        },
        {
            "Title": "UTI AMC Reports Q3 FY24 Financial Results",
            "Summary": "UTI Asset Management Company (UTI AMC) has reported its financial results for the third quarter. The company's net profit decreased to 1.42 billion rupees, compared to 1.5 billion rupees in the same quarter last year and 2.01 billion rupees in the previous quarter. Revenue also declined to 3.29 billion rupees from 3.46 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738109903000,
            "Source": "earnings"
        },
        {
            "Title": "UTI AMC Reports Q3 Revenue Decline",
            "Summary": "UTI Asset Management Company (AMC) has reported its third-quarter revenue figures. The company's revenue for Q3 stood at 3.29 billion rupees, compared to 3.46 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738063432000,
            "Source": "earnings"
        },
        {
            "Title": "UTI AMC Reports Q3 Net Profit of 1.42 Billion Rupees",
            "Summary": "UTI Asset Management Company (AMC) has announced its financial results for the third quarter. The company reported a net profit of 1.42 billion rupees, which represents a decrease from 1.5 billion rupees in the same quarter last year (YoY) and 2.01 billion rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1738063424000,
            "Source": "earnings"
        },
        {
            "Title": "UTI AMC Reports Strong Q2 Financial Results",
            "Summary": "UTI Asset Management Company (AMC) has announced its financial results for the second quarter. The company's net profit increased to 2 billion rupees, up from 1.34 billion rupees year-over-year and 1.86 billion rupees quarter-over-quarter. Revenue also saw significant growth, reaching 4.17 billion rupees compared to 3.11 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729858016000,
            "Source": "result"
        },
        {
            "Title": "UTI Asset Management Company: Equity Shares Allotted Under Employee Stock Option Scheme",
            "Summary": "<p>UTI Asset Management Company has <span class='positive'>allotted</span> 29,200 equity shares of Rs 10 face value each to <span class='positive'>eligible employees</span> under the 'UTI AMC Employee Stock Option Scheme - 2007'. This <span class='positive'>increases</span> the company's <b>issued and paid-up share capital</b> from Rs 1,27,48,17,110 to Rs 1,27,51,09,110.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728374340000,
            "Source": "corporate_action"
        }
    ]
}