{
    "Symbol": "UTKARSHBNK",
    "ISIN": "INE735W01017",
    "News": [
        {
            "Title": "Utkarsh Small Finance Bank Q3 Loss Widens to ₹3.75B",
            "Summary": "Utkarsh Small Finance Bank reported a widened net loss of ₹3.75 billion in Q3 compared to ₹1.68 billion loss in the previous year, while revenue declined to ₹8.2 billion from ₹9.3 billion year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770033091668,
            "Source": "co_actions_results"
        },
        {
            "Title": "Utkarsh Small Finance Bank Postal Ballot Notice",
            "Summary": "Utkarsh Small Finance Bank issues postal ballot notice for three key resolutions including director appointments and CEO remuneration approval, with e-voting from January 30 to February 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769683137641,
            "Source": "stocks"
        },
        {
            "Title": "Utkarsh Small Finance Bank Q3FY26 Earnings Call Feb 2",
            "Summary": "Utkarsh Small Finance Bank announces board meeting and earnings call on February 02, 2026 to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769610683258,
            "Source": "co_actions_results"
        },
        {
            "Title": "Utkarsh SFB Q3 Update: Loans down 4%, deposits up 5%",
            "Summary": "Utkarsh Small Finance Bank reports mixed Q3FY26 performance with gross loan portfolio declining 3.9% YoY to ₹18,306 crores, while total deposits grew 4.5% YoY to ₹21,087 crores. Collection efficiency improves to 99.1%. Stock down 45.9% in past year.",
            "Sentiment": "neutral",
            "PublishDate": 1767617320082,
            "Source": "co_actions_results"
        },
        {
            "Title": "Utkarsh Small Finance Bank Gets CARE A Rating",
            "Summary": "CARE Ratings reaffirmed CARE A rating for Utkarsh Small Finance Bank's ₹200 crore Tier II Bonds but revised outlook to Negative from Stable due to microfinance segment stress affecting asset quality.",
            "Sentiment": "negative",
            "PublishDate": 1767611023515,
            "Source": "stocks"
        },
        {
            "Title": "Utkarsh Small Finance Bank Appoints Dr. Ram Jass Yadav",
            "Summary": "Utkarsh Small Finance Bank's board approves appointment of Dr. Ram Jass Yadav as Additional Non-Executive Director for five years, effective January 3, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767441205488,
            "Source": "stocks"
        },
        {
            "Title": "Utkarsh Small Finance Bank WTD Pramod Dubey Resigns",
            "Summary": "Utkarsh Small Finance Bank announces resignation of Whole Time Director Mr. Pramod Kumar Dubey effective December 31, 2025, as he pursues career opportunities outside the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1767190586063,
            "Source": "stocks"
        },
        {
            "Title": "Utkarsh Small Finance Bank Appoints New CCO",
            "Summary": "Utkarsh Small Finance Bank announces appointment of Mr. Ritesh Kumar as Chief Compliance Officer effective December 31, 2025. Kumar brings over 25 years of banking experience across multiple domains.",
            "Sentiment": "positive",
            "PublishDate": 1767169439833,
            "Source": "stocks"
        },
        {
            "Title": "Utkarsh Small Finance Bank Board Approves Key Appointments",
            "Summary": "Utkarsh Small Finance Bank's Board approved the permanent appointment of Ms. Suchita Chatterjee as Head-Internal Audit effective December 13, 2025, and re-appointment of Mr. Ajay Kumar Kapur as Independent Director for a second term from March 2026 to March 2029.",
            "Sentiment": "positive",
            "PublishDate": 1765636554178,
            "Source": "stocks"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Rs 348 Crore Net Loss in Q2 FY26 Amid MFI Stress",
            "Summary": "Utkarsh Small Finance Bank posted a net loss of Rs 348 crore for Q2 FY26 as regulatory changes under MFIN Guardrail 2.0 and legacy stress impacted its microfinance portfolio, leading to elevated NPAs and credit costs. The bank raised Rs 950 crore through rights issue to strengthen capital base and expects gradual recovery from Q3 onwards with improved collection efficiency and reduced fresh NPA slippages.",
            "Sentiment": "negative",
            "PublishDate": 1763553052610,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Sets Ambitious Growth Targets with 35% Loan Book CAGR and 17% ROE by FY27",
            "Summary": "Utkarsh Small Finance Bank has outlined aggressive expansion plans targeting 35% loan book CAGR and 17% ROE by FY27, focusing on MSME and affordable housing segments across Northern and Eastern India. The bank aims to expand its branch network to over 1,000 branches by FY27 while strengthening its liability franchise through CASA and retail deposits.",
            "Sentiment": "positive",
            "PublishDate": 1763137137019,
            "Source": "stock"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Loss, Appoints New Head, Grants Stock Options",
            "Summary": "Utkarsh Small Finance Bank reported a net loss of ₹78,384.14 lakh for the quarter ended September 30, 2025, and appointed Virender Sharma as Head-Micro Banking while granting 3.1 crore stock options to employees. The bank's financial performance shows continued challenges with negative profitability, though it maintains operations across rural banking and retail financial services.",
            "Sentiment": "negative",
            "PublishDate": 1763136720538,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reschedules Q2 FY26 Earnings Call Time",
            "Summary": "Utkarsh Small Finance Bank has rescheduled its earnings conference call with analysts and investors from 5:00 p.m. to 5:30 p.m. IST on November 14, 2025. The call will discuss the bank's unaudited financial results for the quarter and half year ended September 30, 2025, with participation from senior management including the MD & CEO and other key executives.",
            "Sentiment": "neutral",
            "PublishDate": 1763112497745,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Completes Rights Issue, Raises Rs. 949.08 Crores",
            "Summary": "Utkarsh Small Finance Bank has completed its rights issue, allotting 67,79,13,784 equity shares at Rs. 14 per share to eligible shareholders. The rights issue opened on October 24, 2025 and closed on November 03, 2025, raising approximately Rs. 949.08 crores. The allotment was approved by the bank's Capital Structuring and Fund Raise Committee on November 05, 2025. Following the allotment, the bank's paid-up share capital increased from Rs. 11,01,60,99,000 to Rs. 17,79,52,36,840, with the number of equity shares rising from 1,10,16,09,900 to 1,77,95,23,684. Each share has a face value of Rs. 10 and was issued at a premium of Rs. 4 per share.",
            "Sentiment": "positive",
            "PublishDate": 1762331312843,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Shares Surge 18% After Major Rights Issue Allotment",
            "Summary": "Utkarsh Small Finance Bank shares closed 18.25% higher at Rs 21.71 after announcing the allotment of over 5.71 crore shares to Madhusudan Kela's fund house Cohesion MK Best Ideas Sub-Trust as part of its rights issue. Other significant participants included India Capital Fund Ltd. (4.4 crore shares), Kotak Mahindra Life Insurance Company (4.21 crore shares), and ICICI Prudential Life Insurance Company (3.57 crore shares). The bank had received board approval to raise up to Rs 950 crore through the rights issue. Despite the day's gains, the stock has declined 47.14% over the past 12 months and 36.13% year-to-date. Analyst consensus shows a 12-month price target of Rs 27.17, indicating potential upside of 2.1%.",
            "Sentiment": "positive",
            "PublishDate": 1761309748150,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Confirms Rights Issue Applications from 37 Specific Investors",
            "Summary": "Utkarsh Small Finance Bank confirmed that all identified specific investors submitted applications for its rights issue of up to 67,79,13,784 fully paid-up equity shares on October 24, 2025. The bank disclosed applications from 37 specific investors including major institutional players like Kotak Mahindra Life Insurance Company Limited (4,21,42,857 shares), India Capital Fund Ltd Mauritius (4,40,00,000 shares), Cohesion MK Best Ideas Sub-Trust (5,71,42,857 shares), ICICI Prudential Life Insurance Company Limited (3,57,14,285 shares), and HDFC Life Insurance Company Limited (1,46,64,285 shares). Other participants include various funds, trusts, private companies and individual investors. The applications were submitted before 11 a.m. on the issue opening date in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761290704222,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Issues 5.7 Crore Shares to Madhu Kela's Investment Trust",
            "Summary": "Utkarsh Small Finance Bank has issued 5.7 crore shares to Cohesion MK Best Ideas Sub-Trust, which is associated with investor Madhu Kela. The share issuance represents a significant equity transaction for the small finance bank.",
            "Sentiment": "neutral",
            "PublishDate": 1761286669168,
            "Source": "stock"
        },
        {
            "Title": "Utkarsh Small Finance Bank Announces ₹950 Crore Rights Issue",
            "Summary": "Utkarsh Small Finance Bank's Board of Directors approved a rights issue of equity shares for up to ₹950 crores. The bank will issue up to 67.79 crore fully paid-up equity shares at ₹14 per share (including ₹4 premium) to eligible shareholders in an 8:13 ratio based on October 14, 2025 record date. The issue opens on October 24, 2025 and closes on November 3, 2025. Rights entitlements have been credited to eligible shareholders' demat accounts under ISIN INE735W20017. The promoter Utkarsh CoreInvest Limited will renounce its rights entitlements to specific investors. Issue materials were dispatched via email on October 16, 2025 to shareholders with Indian addresses.",
            "Sentiment": "neutral",
            "PublishDate": 1760695472615,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Announces Rs 950 Crore Rights Issue at 37.5% Discount",
            "Summary": "Utkarsh Small Finance Bank has set the price for its Rs 950 crore rights issue at Rs 14 per share, representing a 37.5% discount to Wednesday's closing price. The bank will issue approximately 68 crore equity shares with a face value of Rs 10, with the record date fixed for October 14. The promoter Utkarsh CoreInvest holds 68.92% stake, while institutional investors hold 13.14% and small investors own 17.94%. The stock closed at Rs 22.40 on BSE Wednesday, down 64% from its all-time high of Rs 62.75 in January 2024. The bank's share price has declined since April last year amid microfinance customer overindebtedness issues. The bank's gross non-performing assets ratio increased to 11.4% at the end of June from 2.8% a year earlier, resulting in a net loss of Rs 239 crore in the first quarter. Unsecured loans comprise about 55% of the bank's total portfolio of Rs 19,224 crore.",
            "Sentiment": "negative",
            "PublishDate": 1759929162098,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Board Approves Rights Issue Worth Up to ₹950 Crore",
            "Summary": "Utkarsh Small Finance Bank's board has approved a rights issue valued at up to ₹950 crore. The bank has scheduled a meeting for October 08, 2025 to confirm the details of this rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1759906711937,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reduces JLG Loan Exposure by 28.4%, Retail Deposits Surge",
            "Summary": "Utkarsh Small Finance Bank reported a decline in its gross loan portfolio by 2.3% to ₹18,655 crore during the September quarter. The bank continued its strategic shift away from Joint Liability Group (JLG) loans, reducing this portfolio by 28.4% to ₹7,613 crore, while non-JLG loans increased by 30.3% to ₹11,042 crore. Total deposits grew 10% to ₹21,447 crore, driven by retail term deposits which surged 28.8% to ₹12,257 crore, while bulk term deposits fell 23.5% to ₹4,712 crore. The CASA ratio improved to 20.9% from 19.6%, and the CASA plus retail term deposits ratio increased to 78% from 68.4%. Collection efficiency for microbanking loans stood at 98.6% and liquidity coverage ratio at 219%. The board approved a ₹950 crore rights issue with details to be finalized. Shares closed 2.1% higher at ₹22.23, remaining below the IPO price of ₹25.",
            "Sentiment": "neutral",
            "PublishDate": 1759713555320,
            "Source": "stock"
        },
        {
            "Title": "Bank Board Approves ₹950 Crore Rights Issue for Equity Shareholders",
            "Summary": "The bank's Board of Directors approved the issuance of equity shares through a rights issue for an amount not exceeding ₹950 crore. The rights issue will be offered to eligible equity shareholders, their renouncees, and specific investors as on the record date. The Capital Structuring & Fund Raise Committee is scheduled to meet on October 08, 2025 to determine the specific terms and conditions of the rights issue, including the issue price, entitlement ratio, record date, and payment terms. The board meeting was held on October 01, 2025, commencing at 6:00 p.m. and concluding at 7:44 p.m.",
            "Sentiment": "positive",
            "PublishDate": 1759332698222,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Sells Bad Loans to ARC for ₹11.40 Crore",
            "Summary": "Utkarsh Small Finance Bank has agreed to sell its bad loans and non-performing assets to an Asset Reconstruction Company (ARC) for ₹11.40 crore. This transaction involves the disposal of distressed assets from the bank's portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1759240474667,
            "Source": "stock"
        },
        {
            "Title": "Utkarsh Small Finance Bank Board to Consider Fundraising Through Equity Share Issuance",
            "Summary": "Utkarsh Small Finance Bank has scheduled a board meeting for October 1, 2025, to consider raising funds through equity share issuance. The bank previously approved plans to raise up to Rs 750 crore via share sale through various modes including qualified institutions placement, preferential issue, private placements, and further public offer. The Reserve Bank of India has approved the amalgamation of Utkarsh CoreInvest Ltd. with Utkarsh Small Finance Bank Limited, with the merger expected to be completed within 12-13 months. The bank, which began operations in January 2017, focuses on providing microfinance to underserved sections and operates primarily in rural and semi-urban locations.",
            "Sentiment": "positive",
            "PublishDate": 1759067471886,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Schedules Analyst Meetings from August 30 to September 8, 2025",
            "Summary": "Utkarsh Small Finance Bank Limited has scheduled analyst and investor meetings from August 30 to September 8, 2025, conducting one-on-one and group interactions in India. The meetings will focus on general business outlook and publicly available information, with no unpublished price sensitive information to be disclosed. The bank has attached a presentation including unaudited financial results for the quarter ended June 30, 2025. The bank reported a loss of ₹239 crore in Q1 FY26 compared to a profit of ₹137 crore in the previous year, with gross NPAs increasing to 11.4% from 2.8%. The bank operates 1,099 banking outlets across 27 states and UTs, with total advances of ₹19,224 crore and deposits of ₹21,489 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1756278309850,
            "Source": "stock"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Rs 239 Crore Net Loss in Q1 FY26 Amid JLG Portfolio Stress",
            "Summary": "Utkarsh Small Finance Bank reported a net loss of Rs 239 crores for Q1 FY26, primarily due to stress in its Joint Liability Group (JLG) microfinance portfolio. The bank's collection efficiency in micro-banking dropped to 82% from 96.2%, attributed to the implementation of MFIN Guardrail 2.0 which restricts microfinance customers to maximum 3 lenders. The JLG portfolio declined 7% during the quarter, while non-JLG portfolio grew 39% year-on-year. Total deposits registered marginal decline of 0.4% quarter-on-quarter but grew 18% year-on-year. The bank's secured loan share increased to 45% from 35% in the previous year. MSME portfolio expanded 46% year-on-year to Rs 4,001 crores, housing loans grew 30% to Rs 929 crores. The bank maintains capital adequacy ratio of 19.6% and plans to raise Rs 750 crores in equity funding. Management expects collection efficiency normalization and portfolio stabilization within 3-4 months, with credit costs expected to decline from Q3 onwards.",
            "Sentiment": "negative",
            "PublishDate": 1754569399255,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Makes Earnings Call Audio Recording Available",
            "Summary": "Utkarsh Small Finance Bank conducted an earnings conference call with investors and analysts on August 4, 2025, to discuss un-audited financial results for the quarter ended June 30, 2025. The audio recording of the call held at 16:00 hours IST is now available on the bank's website. The bank had previously submitted the investor presentation to stock exchanges on August 2, 2025, which is also available on their website. A transcript of the call will be submitted in accordance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754316631839,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Publishes Quarterly Financial Results in Newspapers",
            "Summary": "Utkarsh Small Finance Bank has published its unaudited financial results for the quarter ended June 30, 2025 in various newspapers including Financial Express (English), Jansatta (Hindi), and Aaj (Hindi) on August 04, 2025. The publication was made in compliance with SEBI Listing Regulations and the disclosure is also available on the bank's website. The results were signed by Muthiah Ganapathy and published as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754303155754,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports ₹239 Crore Net Loss in Q1 FY26 Amid Strategic Shift to Secured Lending",
            "Summary": "Utkarsh Small Finance Bank reported a net loss of ₹239 crore in Q1 FY26, compared to a profit of ₹137 crore in Q1 FY25. The bank's gross loan portfolio grew modestly by 2.3% year-on-year to ₹19,224 crore, while deposits increased 18.3% to ₹21,489 crore, driven by retail term deposits growth of 33.7%. The bank continued its strategic pivot toward secured lending, with secured loans now comprising 45% of the portfolio versus 35% a year earlier. Non-JLG loans showed strong momentum with 39% year-on-year growth. However, asset quality deteriorated with gross NPAs rising to 11.42% from 2.78% a year ago and 9.43% in the previous quarter. Net NPAs increased to 5.00% from 0.26% a year earlier. Pre-provision operating profit declined to ₹92 crore from ₹311 crore in Q1 FY25. The bank maintained comfortable capitalization with CRAR at 19.64% and Tier 1 capital at 16.71%. Management cited a difficult operating environment and adopted a prudent stance on new sourcing in unsecured micro-banking due to stress indicators, which impacted short-term interest income but aligns with long-term asset quality goals.",
            "Sentiment": "negative",
            "PublishDate": 1754153213082,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Approves Quarterly Results and Appoints New Head of Consumer Banking",
            "Summary": "Utkarsh Small Finance Bank's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025. The bank also appointed Dr. Sourabh Ghosh as Head-Consumer Banking, effective August 02, 2025, as part of the senior management team. Dr. Ghosh brings over 25 years of experience in banking, sales, strategy, and financial services, having previously worked with AU Small Finance Bank as President and National Business Manager - Branch Banking, along with roles at Kotak Mahindra Bank, ICICI Bank, and IDBI Bank. He holds a PhD in Management from Chitkara University and an MBA from University of Lucknow. The bank reported no outstanding secured listed non-convertible debt securities as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754150598798,
            "Source": "corporate_governance"
        },
        {
            "Title": "Utkarsh Small Finance Bank Schedules Board Meeting for Q1 FY2026 Results on August 2, 2025",
            "Summary": "Utkarsh Small Finance Bank will hold a Board meeting on August 2, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The bank has scheduled an earnings conference call on August 4, 2025, at 4:00 PM IST to discuss the quarterly results. Senior management including Managing Director and CEO Govind Singh, Executive Director Pramod Kumar Dubey, and CFO Sarjukumar Pravin Simaria will represent the bank during the call. The trading window will reopen on August 5, 2025, which is 48 hours after the declaration of financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753885152114,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Independent Director Nagesh Dinkar Pinge Steps Down After Completing Five-Year Term",
            "Summary": "Utkarsh Small Finance Bank announced that Mr. Nagesh Dinkar Pinge has ceased to be an Independent Director effective July 20, 2025, after completing his first term of five consecutive years. Pinge's directorship ended on July 19, 2025, following the completion of his tenure that began five years earlier. The bank acknowledged his contributions during his time on the board. The cessation was due to the natural completion of his term rather than resignation or removal.",
            "Sentiment": "neutral",
            "PublishDate": 1753099498547,
            "Source": "corporate_governance"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Q1 Growth in Loans and Deposits",
            "Summary": "Utkarsh Small Finance Bank has reported growth in its financial metrics for the first quarter. The bank's Gross Loan Portfolio increased by 2.3% year-over-year to ₹19,224 crore. Deposits saw a more significant rise, growing by 16.8% year-over-year to reach ₹21,489 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751846850000,
            "Source": "default"
        },
        {
            "Title": "Utkarsh Small Finance Bank: Q1 Deposits Up 18% YoY, Loan Portfolio Shrinks",
            "Summary": "Utkarsh Small Finance Bank reported an 18.3% YoY increase in total deposits to ₹21,489 crore for Q1 FY26. Gross loan portfolio grew 2.3% YoY but fell 2.2% QoQ. CASA deposits rose 22.1% YoY but decreased 10.2% sequentially. JLG loans dropped 23.1% YoY, while non-JLG loans surged 39.4% YoY. The bank maintained a strong liquidity profile with an LCR of 238%.",
            "Sentiment": "neutral",
            "PublishDate": 1751709015000,
            "Source": "result"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Q1FY26 Financial Growth",
            "Summary": "Utkarsh Small Finance Bank has reported financial growth in the first quarter of fiscal year 2026. The bank's gross loan portfolio increased by 2.3% year-over-year to ₹19,224 crore. Additionally, deposits saw a significant rise of 16.8% compared to the previous year, reaching ₹21,489 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751706158000,
            "Source": "default"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports 23.4% YoY Growth in Total Deposits for Q4 FY25",
            "Summary": "Utkarsh Small Finance Bank has released its provisional business update for the fourth quarter of fiscal year 2025. The bank's total deposits have shown significant growth, increasing by 23.4% year-over-year to reach ₹21,566 crore.",
            "Sentiment": "positive",
            "PublishDate": 1743994195000,
            "Source": "result"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports 7.5% YoY Growth in Gross Loan Portfolio for Q4 FY25",
            "Summary": "Utkarsh Small Finance Bank has released its provisional business update for the fourth quarter of fiscal year 2025. The bank's gross loan portfolio has grown to Rs 19,666 crore, representing a 7.5% year-over-year increase from Rs 18,299 crore in the same quarter of the previous fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1743993686000,
            "Source": "result"
        },
        {
            "Title": "Utkarsh Small Finance Bank to Raise Up to 7.50 Billion Rupees Through Equity Shares",
            "Summary": "Utkarsh Small Finance Bank has announced plans to raise up to 7.50 billion rupees through the issuance of equity shares. The bank intends to use either a Qualified Institutional Placement (QIP) or another permitted mode for this fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1740615381000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank: Board Approves Rs 750 Crore Share Sale",
            "Summary": "Utkarsh Small Finance Bank's board has approved raising up to Rs 750 crore through share sale via various methods, subject to shareholder and regulatory approvals. The bank recently reported a Q3 net loss of Rs 168 crore, compared to a profit of Rs 116 crore in the same period last year. Net interest income remained stable at Rs 480.13 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1740570057000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank: Board to Consider Share Issuance on February 26",
            "Summary": "Utkarsh Small Finance Bank's board will meet on February 26 to consider issuing new equity shares. The bank plans to seek shareholder approval through an EGM or postal ballot. This follows their initial public offering in July 2023, which raised ₹500 crore. The bank reported a net loss of ₹168 crore in the third quarter, with gross NPAs rising to ₹1,177 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1740361879000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Q3 Net Loss and Increased NPAs",
            "Summary": "Utkarsh Small Finance Bank has reported a net loss of 1.68 billion rupees in Q3, compared to a profit of 1.16 billion rupees in the same quarter last year. The bank's revenue increased to 9.3 billion rupees from 8.05 billion rupees year-over-year. However, the bank's asset quality deteriorated, with Gross Non-Performing Assets (GNPA) rising to 6.17% from 3.88% quarter-on-quarter, and Net Non-Performing Assets (NNPA) increasing to 2.50% from 0.89% quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739751326000,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Q3 Net Loss and Increased NPAs",
            "Summary": "Utkarsh Small Finance Bank has reported a net loss of 1.68 billion rupees in Q3, compared to a profit of 1.16 billion rupees in the same quarter last year. The bank's revenue increased to 9.3 billion rupees from 8.05 billion rupees year-over-year. However, the bank's asset quality deteriorated, with Gross Non-Performing Assets (GNPA) rising to 6.17% from 3.88% quarter-on-quarter, and Net Non-Performing Assets (NNPA) increasing to 2.50% from 0.89% quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739544836000,
            "Source": "earnings"
        },
        {
            "Title": "Utkarsh Small Finance Bank: Q3 Deposits Surge 33.5%, Loans Up 16.2%",
            "Summary": "Utkarsh Small Finance Bank reported a 33.5% YoY increase in total deposits to Rs 20,172 crore in Q3. Gross loan portfolio grew 16.2% YoY to Rs 19,057 crore. CASA ratio slightly decreased to 19.7%. Retail term deposits rose 40.6% to Rs 10,163 crore, while bulk deposits increased 24% to Rs 6,036 crore. The bank's liquidity coverage ratio stood at 184% as of December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1736165434000,
            "Source": "result"
        },
        {
            "Title": "Utkarsh Small Finance Bank Reports Strong Q3 Growth in Deposits and Loan Portfolio",
            "Summary": "Utkarsh Small Finance Bank has announced significant year-over-year growth in its third quarter financial results. The bank's total deposits increased by 33.5% compared to the same period last year. Additionally, the bank's gross loan portfolio experienced a 16.2% growth year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736157041000,
            "Source": "earnings"
        },
        {
            "Title": "RBI Approves Amalgamation of Utkarsh CoreInvest and Utkarsh Small Finance Bank",
            "Summary": "The Reserve Bank of India (RBI) has granted no-objection to the proposed amalgamation of Utkarsh CoreInvest Limited and Utkarsh Small Finance Bank Limited. This approval marks a significant step in the corporate restructuring of the Utkarsh group, potentially streamlining operations and enhancing the bank's financial position.",
            "Sentiment": "positive",
            "PublishDate": 1736122212000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank: RBI Approves Merger with Parent Company",
            "Summary": "The Reserve Bank of India has approved the amalgamation of Utkarsh CoreInvest Limited with Utkarsh Small Finance Bank Limited. The merger, aimed at simplifying operations and enhancing shareholder value, is expected to be completed within the next 12-13 months.",
            "Sentiment": "positive",
            "PublishDate": 1735906996000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Transfers Stressed MFI Loans to ARC",
            "Summary": "Utkarsh Small Finance Bank has transferred unsecured stressed microfinance institution (MFI) loans to an Asset Reconstruction Company (ARC). The transferred portfolio has an outstanding amount of 3.55 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1735689844000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Transfers Stressed MFI Loans to ARC",
            "Summary": "Utkarsh Small Finance Bank has transferred unsecured stressed microfinance institution (MFI) loans to an Asset Reconstruction Company (ARC). The transferred portfolio has an outstanding amount of 3.55 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1735652371000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Approves Sale of Non-Performing Assets",
            "Summary": "Utkarsh Small Finance Bank has approved the sale of non-performing assets (NPA) and written-off loans. The sale includes unsecured stressed microfinance institution (MFI) loans with a principal amount of 3.55 billion rupees. The bank has set a reserve price of 520 million rupees for these unsecured stressed MFI loans.",
            "Sentiment": "neutral",
            "PublishDate": 1735518174000,
            "Source": "corporate_action"
        },
        {
            "Title": "Utkarsh Small Finance Bank Approves Sale of Non-Performing Assets",
            "Summary": "Utkarsh Small Finance Bank has approved the sale of non-performing assets (NPA) and written-off loans. The sale includes unsecured stressed microfinance institution (MFI) loans with a principal amount of 3.55 billion rupees. The bank has set a reserve price of 520 million rupees for these unsecured stressed MFI loans.",
            "Sentiment": "neutral",
            "PublishDate": 1735302136000,
            "Source": "corporate_action"
        }
    ]
}