{
    "Symbol": "UTLSOLAR",
    "ISIN": "INE12UR01024",
    "News": [
        {
            "Title": "Fujiyama Power Systems Schedules Investor Meet",
            "Summary": "Fujiyama Power Systems Limited has scheduled a plant visit and management meeting with analysts and investors at its Greater Noida facility on February 12, 2026, with participation from PinPointX Capital and Envision Capital.",
            "Sentiment": "neutral",
            "PublishDate": 1770642277711,
            "Source": "stocks"
        },
        {
            "Title": "Fujiyama Power Systems Board Meet on Jan 31, 2026",
            "Summary": "Fujiyama Power Systems Limited has scheduled a board meeting for January 31, 2026, to consider Q3FY26 unaudited financial results and equity share issuance matters. Trading window closed until February 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769520864473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fujiyama Commissions 1 GW Solar Cell Plant at Dadri",
            "Summary": "Fujiyama Power Systems Limited commissioned its 1 GW solar cell manufacturing plant at Dadri, Uttar Pradesh with Rs. 300 crore investment, strengthening backward integration across solar value chain.",
            "Sentiment": "positive",
            "PublishDate": 1769015490939,
            "Source": "stocks"
        },
        {
            "Title": "Fujiyama Power Systems Receives ₹10.36 Cr GST Demand",
            "Summary": "Fujiyama Power Systems Limited received a GST demand order of ₹10.36 crores from Delhi GST authorities for FY 2021-22, including tax demand, interest, and penalty components totaling the amount.",
            "Sentiment": "negative",
            "PublishDate": 1767966176660,
            "Source": "stocks"
        },
        {
            "Title": "Fujiyama Power Systems Reports Strong Q3 Performance with 97% Profit Growth",
            "Summary": "Fujiyama Power Systems delivered robust quarterly results with net profit surging to 629M rupees from 319M rupees year-over-year, while revenue jumped to 5.68B rupees from 3.29B rupees. The company also improved its EBITDA margin to 18.14% from 15.22% year-over-year, with EBITDA doubling to 1B rupees from 500M rupees.",
            "Sentiment": "positive",
            "PublishDate": 1765249627466,
            "Source": "earnings"
        },
        {
            "Title": "Fujiyama Power Systems Appoints Cricketer Surya Kumar Yadav as Brand Ambassador",
            "Summary": "Fujiyama Power Systems Limited appointed cricket star Surya Kumar Yadav (SKY) as brand ambassador for FUJIYAMA SOLAR, joining existing ambassador Anil Kapoor for UTL SOLAR. The company plans to launch nationwide promotional campaigns highlighting its rooftop solar solutions, aiming to increase consumer confidence and accelerate India's shift towards green energy.",
            "Sentiment": "positive",
            "PublishDate": 1765211372260,
            "Source": "stock"
        }
    ]
}