{
    "Symbol": "UTTAMSUGAR",
    "ISIN": "INE786F01031",
    "News": [
        {
            "Title": "Uttam Sugar Mills Plans Aggressive Capacity Expansion with New Distillery and Refinery Projects",
            "Summary": "Uttam Sugar Mills announced plans for aggressive capacity expansion through new distillery and refinery projects, targeting ethanol blending capacity enhancement to 400 KLPD by FY27. The company is focusing on green energy and value-added sugar products while pursuing forward integration into biofuels and power generation segments to improve revenue visibility.",
            "Sentiment": "positive",
            "PublishDate": 1763137156090,
            "Source": "earnings"
        },
        {
            "Title": "Uttam Sugar Mills Subsidiary to Quadruple Distillery Capacity with ₹110 Crore Investment",
            "Summary": "Uttam Sugar Mills announced that its subsidiary Uttam Distilleries will expand its distillery capacity from 40 KLPD to 160 KLPD. The expansion requires an investment of ₹110 crore and is expected to be completed by March 2027. This represents a four-fold increase in the subsidiary's distillery production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1759131693593,
            "Source": "stock"
        },
        {
            "Title": "Uttam Sugar Mills Shareholders Approve Director Re-appointments and Secretarial Auditor Selection",
            "Summary": "Uttam Sugar Mills Limited held its 30th Annual General Meeting on September 19, 2025, where shareholders approved key appointments. Gurbachan Singh Matta was re-appointed as Non-Executive Non-Independent Director for a five-year term from September 30, 2025 to September 29, 2030, with no change in remuneration. Jasbir Singh was re-appointed as Independent Director for his second five-year tenure during the same period, also with unchanged remuneration. Additionally, M/s. N. K. Rastogi & Associates was appointed as Secretarial Auditor for five consecutive years from the 30th AGM until the 35th AGM. The secretarial auditor appointment was previously approved by the Board of Directors on May 23, 2025 and confirmed by shareholders at the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1758354593112,
            "Source": "corporate_governance"
        },
        {
            "Title": "Uttam Sugar Mills Sets September 12, 2025 as Record Date for Final Dividend",
            "Summary": "Uttam Sugar Mills Ltd has fixed September 12, 2025 as the record date for determining shareholder eligibility for final dividend for the financial year 2024-25. The company withdrew its earlier book closure period and opted for a record date instead. The final dividend, as recommended by the Board of Directors, is subject to approval at the upcoming Annual General Meeting and will be paid to eligible shareholders within the prescribed time if approved.",
            "Sentiment": "neutral",
            "PublishDate": 1755516948531,
            "Source": "corporate_action"
        },
        {
            "Title": "Uttam Sugar Mills Publishes Quarterly Financial Results in National Newspapers",
            "Summary": "Uttam Sugar Mills Ltd published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025 in Financial Express (English) and Veer Arjun (Hindi) newspapers on August 14, 2025. The company informed stock exchanges NSE and BSE about the newspaper publication as part of regulatory disclosure requirements. The communication was signed by Rajesh Garg on behalf of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755158241106,
            "Source": "earnings"
        },
        {
            "Title": "Uttam Sugar Mills Plans Revenue Diversification Through Ethanol and Green Energy Initiatives",
            "Summary": "Uttam Sugar Mills is implementing a multi-pronged strategy to drive revenue stability and improve margins. The company plans to leverage the ethanol blending push, expand capacity, and develop value-added sugar products. Additionally, the company is pursuing green energy initiatives to support profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1755102933066,
            "Source": "stock"
        },
        {
            "Title": "Uttam Sugar Mills Reports Strong Q1 Performance with Net Profit Surging to 145M Rupees",
            "Summary": "Uttam Sugar Mills delivered robust quarterly results with consolidated net profit rising to 145 million rupees compared to 58.2 million rupees in the same period last year. Revenue increased significantly to 6.3 billion rupees from 4.53 billion rupees year-over-year. The company's EBITDA grew to 504 million rupees versus 352 million rupees previously, while EBITDA margin improved to 8.02% from 7.75% in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1755089213177,
            "Source": "earnings"
        },
        {
            "Title": "Uttam Sugar Mills Reports Q4 Results and Recommends Dividend",
            "Summary": "Uttam Sugar Mills has recommended a dividend of 2.5 rupees per equity share. The company's Q4 EBITDA increased to 1.15 billion rupees from 824.9 million rupees year-over-year. The Q4 EBITDA margin improved to 20.84% from 17.73% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748009734000,
            "Source": "result"
        },
        {
            "Title": "Uttam Sugar Mills Reports Q4 Financial Results",
            "Summary": "Uttam Sugar Mills has reported its financial results for the fourth quarter. The company's net profit increased to 679 million rupees, up from 421.4 million rupees year-over-year and 325 million rupees quarter-over-quarter. Revenue for Q4 rose to 5.5 billion rupees, compared to 4.65 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748009648000,
            "Source": "result"
        },
        {
            "Title": "Uttam Sugar Mills: Q3 Profit Drops 28.23% YoY Amid Revenue Decline",
            "Summary": "Uttam Sugar Mills reported Q3 FY25 results with profit at ₹31.2 crore, down 28.23% YoY. Revenue decreased by 17.98% to ₹424.65 crore. Operating income fell 24.73% YoY but increased 661.03% QoQ. EPS stood at ₹8.18, down 28.25% YoY. Selling, general & administrative expenses rose 30.25% QoQ and 3.83% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739598949000,
            "Source": "earnings"
        },
        {
            "Title": "Uttam Sugar Mills Reports Q3 EBITDA and Margin Results",
            "Summary": "Uttam Sugar Mills has reported its Q3 EBITDA at 618 million rupees, compared to 739 million rupees in the same quarter last year, indicating a year-over-year decrease. However, the company's Q3 EBITDA margin improved to 15.31% from 14.28% in the previous year, showing an increase in profitability despite lower earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1739534016000,
            "Source": "earnings"
        },
        {
            "Title": "Uttam Sugar Mills Reports Q3 Financial Results",
            "Summary": "Uttam Sugar Mills has reported its Q3 financial results. The company's net profit decreased to 325 million rupees from 435 million rupees year-over-year. Compared to the previous quarter, the company reported a loss of 156 million rupees. Revenue for Q3 declined to 4.04 billion rupees from 5.18 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739533896000,
            "Source": "earnings"
        },
        {
            "Title": "Uttam Sugar Mills Reports Significant Drop in Q2 EBITDA",
            "Summary": "Uttam Sugar Mills experienced a substantial decline in its Q2 EBITDA, which fell to 36 million rupees from 429 million rupees year-over-year. The company's EBITDA margin also decreased significantly, dropping to 0.94% from 7.1% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731591745000,
            "Source": "result"
        },
        {
            "Title": "Uttam Sugar Mills Reports Q2 Financial Results",
            "Summary": "Uttam Sugar Mills announced its Q2 financial results. The company reported a net loss of 156 million rupees, which is unchanged from the same quarter last year. However, this represents a decline from a profit of 64 million rupees in the previous quarter. The company's revenue for Q2 stood at 3.85 billion rupees, down from 6.04 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731591691000,
            "Source": "result"
        }
    ]
}