{
    "Symbol": "UYFINCORP",
    "ISIN": "INE152C01025",
    "News": [
        {
            "Title": "U.Y. Fincorp Q3 FY26 Net Profit Surges 704% to ₹1,678 Lakhs",
            "Summary": "U.Y. Fincorp Limited reported exceptional Q3 FY26 results with net profit jumping 704% YoY to ₹1,678.12 lakhs. Total revenue increased 183% to ₹4,215.73 lakhs driven by strong growth across all segments.",
            "Sentiment": "positive",
            "PublishDate": 1770225386184,
            "Source": "co_actions_results"
        },
        {
            "Title": "UY Fincorp Board Approves Office Shift to Maharashtra",
            "Summary": "UY Fincorp Limited's board approved shifting registered office from West Bengal to Maharashtra and material related party transactions for FY2025-26, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770207582688,
            "Source": "stocks"
        },
        {
            "Title": "U.Y. Fincorp Board Meet Set for Feb 4 for Q3FY26 Results",
            "Summary": "U.Y. Fincorp Limited has scheduled a board meeting on February 4, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769516178071,
            "Source": "co_actions_results"
        },
        {
            "Title": "U.Y. Fincorp Limited Discloses Related Party Transactions for Half Year Ended September 30, 2025",
            "Summary": "U.Y. Fincorp Limited submitted a disclosure on related party transactions for the half year ended September 30, 2025 to BSE and NSE. The disclosure was made in accordance with SEBI Listing Obligations and Disclosure Requirements Regulations, 2018. The related party transactions included dealings with entities controlled by key management personnel such as Quality Laminators Limited, Zircon Traders Limited, Central Financial Services, and Som Dutt Landmark Hotels & Recreations Private Limited. The transactions involved various financial arrangements including loans, advances, and remuneration payments. The disclosure was signed by Executive Director Dinesh Burman and Managing Director Udai Kothari.",
            "Sentiment": "neutral",
            "PublishDate": 1762568051848,
            "Source": "corporate_action"
        },
        {
            "Title": "U.Y. Fincorp Reports Quarterly Results, Announces Joint Venture and Fundraising Plans",
            "Summary": "U.Y. Fincorp Limited announced its unaudited standalone financial results for the quarter ended June 30, 2025. The company reported total revenue from operations of Rs. 3,563.32 lakhs and profit after tax of Rs. 508.46 lakhs. The company entered into a joint venture agreement with Fintech Cloud Private Limited on April 9, 2025, to expand into small ticket size personal and business loans under the brand name 'FUNDOBABA'. U.Y. Fincorp received in-principle approval from BSE and NSE on July 15, 2025, for a proposed private placement of equity shares not exceeding Rs. 50 crores through Qualified Institutional Placements. The company's equity shares were voluntarily delisted from Calcutta Stock Exchange effective July 17, 2025. The company holds a 33.33% stake in associate Purple Advertising Services Private Limited, which is under liquidation, leading to an impairment of Rs. 900 lakhs in financial year 2023-2024.",
            "Sentiment": "positive",
            "PublishDate": 1755092944650,
            "Source": "earnings"
        },
        {
            "Title": "U.Y. Fincorp's Independent Director Govind Kumar Goyal Steps Down After Completing Second Term",
            "Summary": "Mr. Govind Kumar Goyal ceased to be an Independent Director of U.Y. Fincorp Limited effective July 23, 2025, following the completion of his second and final five-year term. The cessation was due to regulatory requirements under Section 149(11) of the Companies Act, 2013, which limits independent directors to two consecutive terms of five years each. The Board of Directors and Management acknowledged Goyal's contribution, guidance, and services during his tenure as Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1753364364637,
            "Source": "corporate_governance"
        },
        {
            "Title": "U.y. Fincorp: Q2 Profit Plummets 93% Despite Revenue Surge",
            "Summary": "U.y. Fincorp's Q2 2024 results show a 93.23% YoY drop in profit to ₹3.47 crore, while revenue increased 55.45% to ₹45.24 crore. EPS fell 94.07% to ₹0.18. Operating income declined 12.18% QoQ but rose 215.52% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1731798427000,
            "Source": "result"
        }
    ]
}