{
    "Symbol": "V2RETAIL",
    "ISIN": "INE945H01013",
    "News": [
        {
            "Title": "V2 Retail Completes QIP Fund Utilization Worth ₹39,999.99 Lakhs",
            "Summary": "V2 Retail Limited successfully utilized entire QIP proceeds of ₹39,999.99 lakhs for working capital, debt repayment, and general corporate purposes by December 31, 2025, with monitoring agency confirming no deviations.",
            "Sentiment": "positive",
            "PublishDate": 1770370547523,
            "Source": "co_actions_results"
        },
        {
            "Title": "V2 Retail schedules investor meet at Nuvama Conference",
            "Summary": "V2 Retail Limited announces participation in Nuvama India Conference 2026 on February 11, 2026, for analyst and institutional investor meetings in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1770364082818,
            "Source": "stocks"
        },
        {
            "Title": "V2 Retail Announces 1:10 Equity Share Split",
            "Summary": "V2 Retail has announced a subdivision of its equity shares in the ratio of 1:10, which will increase the number of shares outstanding while proportionally reducing the face value per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770129275853,
            "Source": "co_actions_results"
        },
        {
            "Title": "V2 Retail Q3 Net Profit Surges 95% to ₹993M",
            "Summary": "V2 Retail reported strong Q3 performance with net profit jumping 95% to ₹993 million and revenue growing 58% to ₹9.30 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770121955380,
            "Source": "co_actions_results"
        },
        {
            "Title": "V2 Retail schedules Q3 FY26 earnings call for Feb 4",
            "Summary": "V2 Retail Limited announces earnings conference call on February 4, 2026 at 12:00 pm IST to discuss Q3 & 9MFY26 operational and financial performance with management team led by CEO Akash Agarwal.",
            "Sentiment": "neutral",
            "PublishDate": 1769578542206,
            "Source": "co_actions_results"
        },
        {
            "Title": "V2 Retail Opens 300th Store, Adds 111 New Outlets",
            "Summary": "V2 Retail reaches significant milestone by opening its 300th store, having launched 111 new stores in the current financial year, demonstrating strong expansion momentum in retail sector.",
            "Sentiment": "positive",
            "PublishDate": 1768540313918,
            "Source": "stocks"
        },
        {
            "Title": "V2 Retail Reports 57% Revenue Growth in Q3 FY26",
            "Summary": "V2 Retail delivered strong Q3 FY26 performance with standalone revenue of ₹927 crore, marking 57% YoY growth. The company achieved 12.8% normalized same store sales growth despite festive season shifts.",
            "Sentiment": "positive",
            "PublishDate": 1767580662604,
            "Source": "co_actions_results"
        },
        {
            "Title": "V2 Retail Adds 105 New Stores in 9MFY26",
            "Summary": "V2 Retail expands aggressively with 105 new store additions in 9MFY26, focusing on high-growth Tier 2 and 3 markets across Maharashtra, Punjab, Rajasthan, and South India.",
            "Sentiment": "positive",
            "PublishDate": 1767430778695,
            "Source": "stocks"
        },
        {
            "Title": "V2 Retail Q3FY26: 57% YoY Revenue Growth to ₹927 Cr",
            "Summary": "V2 Retail delivers strong Q3FY26 performance with 57% YoY revenue growth to ₹927 crores, normalized SSSG of 12.80%, and aggressive expansion adding 35 new stores during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1767418718794,
            "Source": "co_actions_results"
        },
        {
            "Title": "V2 Retail Reports 86% Revenue Growth in Q2 FY26, Plans 130 Store Openings This Year",
            "Summary": "V2 Retail Limited delivered robust quarterly results with 86% year-on-year revenue growth to INR 708.6 crores and 465% EBITDA growth to INR 44.4 crores on pre-IndAS basis. The company opened 43 new stores during the quarter, taking total count to 259 stores, and raised guidance from 100 to 130 new store openings for the year with plans for 150 stores next year.",
            "Sentiment": "positive",
            "PublishDate": 1763531374514,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Shares Jump 5% as Company Swings to Profit with 86% Revenue Growth in Q2",
            "Summary": "V2 Retail shares gained 5% to Rs 2,493 after reporting Q2 FY26 revenue growth of 86% to Rs 709 crore and swinging to Rs 17.2 crore net profit from Rs 1.9 crore loss last year. The retailer expanded aggressively with 43 new stores added during the quarter, achieving 23.4% same store sales growth and 12.1% EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1763355542557,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Reports Strong Q2 Performance with 86% Revenue Growth and Approves Rs 400 Crore QIP",
            "Summary": "V2 Retail Limited delivered robust quarterly results with consolidated revenue growing 86% to Rs 708.6 crores and profit after tax surging 990% to Rs 17.2 crores for Q2FY26. The company's Fund-Raising Committee approved allotment of 18.74 lakh equity shares to qualified institutional buyers at Rs 2,134 per share, raising Rs 400 crores through QIP.",
            "Sentiment": "positive",
            "PublishDate": 1763174384257,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Raises ₹400 Crore Through QIP, Reports 86% Revenue Growth",
            "Summary": "V2 Retail completed its qualified institutional placement, raising ₹399.99 crore by allotting 18.74 lakh equity shares at ₹2,134 per share to institutional investors. The issue price included a 4.98% discount from the floor price. Major allotments went to Motilal Oswal Small Cap Fund (25% stake), Subhkam Ventures I (14.97%), and Malabar India Fund Limited (10.02%). The company's paid-up equity capital increased from ₹34.59 crore to ₹36.46 crore. V2 Retail reported standalone revenue of ₹705 crore, representing 86% year-on-year growth from ₹380 crore. Same Store Sales Growth reached 23.4% year-on-year, with normalized growth at 10.3% after adjusting for festival timing. The company added 43 new stores during the quarter, bringing total store count to 259 with 27.94 lakh sq. ft retail footprint. Monthly sales per square feet stood at ₹938. V2 Retail shares closed at ₹2,500, up 2.06%.",
            "Sentiment": "positive",
            "PublishDate": 1762194700946,
            "Source": "stock"
        },
        {
            "Title": "V2 Retail Completes QIP Offer Period, Sets Share Price at ₹2,134",
            "Summary": "V2 Retail has completed its Qualified Institutional Placement (QIP) offer period and set the share price at ₹2,134 per share.",
            "Sentiment": "positive",
            "PublishDate": 1762184644809,
            "Source": "corporate_action"
        },
        {
            "Title": "V2 Retail Approves QIP with Minimum Price of ₹2245.75 Per Share",
            "Summary": "V2 Retail has approved a Qualified Institutional Placement (QIP) with a minimum price set at ₹2245.75 per share. This corporate action allows the company to raise capital by issuing shares to qualified institutional investors at the specified floor price.",
            "Sentiment": "positive",
            "PublishDate": 1761831607229,
            "Source": "corporate_action"
        },
        {
            "Title": "V2 Retail Reports 86% Revenue Growth to ₹705 Crore with Strong Store Expansion",
            "Summary": "V2 Retail reported revenue of ₹705 crore for Q2 FY26, representing 86% year-over-year growth. The company achieved same-store sales growth of 23.4% during the quarter. V2 Retail expanded its retail footprint by adding 43 new stores, bringing its total store count to 259.",
            "Sentiment": "positive",
            "PublishDate": 1759464890286,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Raises Store Expansion Target and Revenue Growth Expectations",
            "Summary": "V2 Retail has increased its store opening target from 100 to 125 stores. The company expects higher growth than its 8-10% same-store sales growth guidance and aims for approximately 50% revenue growth with 8-10% same-store sales growth.",
            "Sentiment": "positive",
            "PublishDate": 1759124639765,
            "Source": "stock"
        },
        {
            "Title": "V2 Retail Reports 52% Revenue Growth to ₹632 Crores in Q1 FY26, Plans Aggressive Store Expansion",
            "Summary": "V2 Retail Limited delivered strong quarterly results with revenue growing 52% year-on-year to ₹632 crores and net profit surging 51% to ₹24.7 crores. The company opened 28 stores during the quarter, bringing total count to 216 stores, with plans to open 100-120 stores in FY26. Same-store sales growth stood at 5%, or 10% on normalized basis after adjusting for early Eid shift. EBITDA grew 63% to ₹52.5 crores with margins improving from 7.8% to 8.3%. The company reported ROE of 27.5%, up from 23% in FY25. Full price sales contributed 92% of total sales, indicating strong inventory management. Management announced plans for a QIP fundraise to accelerate growth, become debt-free, and invest in technology and supply chain infrastructure. The company targets 50% revenue growth going forward, driven by 8-10% same-store sales growth and expansion into new geographies across 25 states.",
            "Sentiment": "positive",
            "PublishDate": 1754278605141,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Plans Expansion with 25+ New Stores and Private Label Launch",
            "Summary": "V2 Retail is targeting profitable growth through multiple strategic initiatives. The company plans to open over 25 new stores and launch private label products. The retailer is expanding its presence in the value fashion segment while focusing on improving same-store sales performance. V2 Retail expects bottom line recovery following recent back-end operational changes.",
            "Sentiment": "positive",
            "PublishDate": 1753889146134,
            "Source": "stock"
        },
        {
            "Title": "V2 Retail Reports Strong Q1 FY26 Results with 52% Revenue Growth",
            "Summary": "V2 Retail Limited reported consolidated revenue of ₹632.2 crores for Q1 FY26, marking a 52% year-on-year increase from ₹415.0 crores in Q1 FY25. The company's gross profit rose 55% to ₹186.2 crores with margins at 29.5%. EBITDA grew 57% to ₹87.2 crores (13.8% margin), while PAT increased 51% to ₹24.7 crores (3.9% margin). The retailer expanded its footprint to 216 stores across 165+ cities, opening 28 new stores and closing 1 during the quarter. Same-store sales growth stood at 5%, with normalized growth at 10%. Volume growth reached 50% year-on-year. Sales per square feet was ₹960 per month, while average selling price increased to ₹303 from ₹260 in the previous year. The company operates with a revenue mix of Men's Wear (41%), Ladies Wear (29%), Kids Wear (24%), and Lifestyle products (6%). Net working capital days improved to 34 days from 37 days in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1753887078292,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Board Approves Rs. 400 Crore Fundraising Plan Through Multiple Instruments",
            "Summary": "V2 Retail Limited's Board of Directors approved raising funds up to Rs. 400 crores through various securities including equity shares and other eligible instruments convertible into equity. The fundraising will be conducted through qualified institutional placements, public offerings, private placements, or preferential allotments in one or more tranches. The board constituted a committee to handle all matters related to the proposed fundraising and approved issuing a notice for a shareholder meeting to seek approval for the fund raising proposal. The initiative requires shareholder approval and other regulatory clearances.",
            "Sentiment": "positive",
            "PublishDate": 1753881860292,
            "Source": "corporate_action"
        },
        {
            "Title": "V2 Retail Secures Approval for Up to 4 Billion Rupees in Funding",
            "Summary": "V2 Retail has received approval for funding of up to 4 billion rupees. The approval represents a significant capital raising opportunity for the retail company.",
            "Sentiment": "positive",
            "PublishDate": 1753880918367,
            "Source": "stock"
        },
        {
            "Title": "V2 Retail Reports Strong Q1 Growth with 75% Jump in Net Profit",
            "Summary": "V2 Retail delivered robust quarterly performance with net profit rising to 277 million rupees from 158.6 million rupees year-over-year. Revenue increased significantly to 6.3 billion rupees compared to 4.15 billion rupees in the same period last year. The company's EBITDA grew to 905 million rupees from 533.8 million rupees, while EBITDA margin improved to 14.37% from 12.86% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753879605154,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Adds Fund-Raising Proposal to Board Meeting Agenda",
            "Summary": "V2 Retail Limited has updated its board meeting agenda scheduled for July 30, 2025, to include consideration of a fund-raising proposal through Qualified Institutional Placement (QIP) or other appropriate modes. This is in addition to the previously announced financial matters that were to be discussed at the meeting. The fund-raising proposal will be subject to requisite approvals as decided by the board.",
            "Sentiment": "neutral",
            "PublishDate": 1753525354854,
            "Source": "corporate_action"
        },
        {
            "Title": "V2 Retail: Considering QIP for Expansion and Debt Clearance",
            "Summary": "V2 Retail is evaluating a QIP to fund new store openings and clear existing loans. The company aims to increase store opening guidance and boost Pre-Ind AS Ebitda margin to 10% in 2-3 years. V2 Retail plans to unify its labels under 'No Brand Only Fashion' and maintain its value-driven model without significant price increases.",
            "Sentiment": "positive",
            "PublishDate": 1751770136000,
            "Source": "corporate_action"
        },
        {
            "Title": "V2 Retail Expands Store Count and Reports Q1 Revenue Growth",
            "Summary": "V2 Retail has increased its store count to 216 by opening 28 new locations, focusing on Tier 2 and 3 cities. The company reported Q1 revenue of ₹628 crores, representing a 51% increase from ₹415 crores in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1751514132000,
            "Source": "default"
        },
        {
            "Title": "V2 Retail Reports 5% Same-Store Sales Growth for the Quarter",
            "Summary": "V2 Retail announced a 5% same-store sales growth for the quarter. The company experienced strong double-digit increases in May and June, which were partially offset by a temporary decline in April due to an early Eid shift.",
            "Sentiment": "positive",
            "PublishDate": 1751513967000,
            "Source": "default"
        },
        {
            "Title": "V2 Retail: Ambitious Expansion Plan Targets 600-700 Stores in Five Years",
            "Summary": "V2 Retail plans to open 100 new stores annually for the next 3-4 years, aiming for 600-700 outlets within five years. The company targets a pre-IndAS Ebitda margin of 10% in three years through store expansion, increased full-price sales, and higher revenue per square foot. V2 Retail is cautiously entering e-commerce with an omnichannel approach, expecting online sales to reach 5-10% of total business.",
            "Sentiment": "positive",
            "PublishDate": 1750726605000,
            "Source": "normal_news"
        },
        {
            "Title": "V2 Retail Outlines Growth Strategy and Financial Guidance",
            "Summary": "V2 Retail shared updates on its business strategy and financial outlook during a conference call. The company is focusing on increasing its private label offerings, aiming to reach 60% by summer 2026 and 80% by 2027, up from the current 35-40%. They reported a 43% volume growth and plan to open at least 100 new stores annually. V2 Retail provided guidance for 40-50% full-year growth and 8-10% same-store sales growth. The company expects to be PAT positive in all quarters of the coming year and targets an EBITDA margin of 8-9% in FY26 and FY27. Revenue growth is projected at 45-50% for FY26 and FY27.",
            "Sentiment": "positive",
            "PublishDate": 1748489835000,
            "Source": "default"
        },
        {
            "Title": "V2 Retail Reports Q4 Financial Results",
            "Summary": "V2 Retail has announced its financial results for the fourth quarter. The company's net profit increased to 67 million rupees, compared to 38.7 million rupees in the same quarter of the previous year. However, it decreased from 509 million rupees in the previous quarter. Revenue for Q4 grew to 4.98 billion rupees, up from 2.96 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748390412000,
            "Source": "default"
        },
        {
            "Title": "V2 Retail Reports Improved Q4 Financial Results",
            "Summary": "V2 Retail has announced its Q4 financial results. The company's EBITDA increased to 573 million rupees from 303 million rupees year-over-year. The EBITDA margin improved to 11.49% from 10.24% in the same period last year. Net profit rose to 67 million rupees from 38.7 million rupees year-over-year, but decreased from 509 million rupees quarter-over-quarter. Revenue for Q4 grew to 4.98 billion rupees, up from 2.96 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748362322000,
            "Source": "result"
        },
        {
            "Title": "V2 Retail: CEO Manshu Tandon Resigns, Shares Hit Lower Circuit",
            "Summary": "V2 Retail's CEO Manshu Tandon resigned effective April 28, citing personal reasons and plans to pursue entrepreneurial opportunities. The company's shares fell 5%, hitting the lower circuit. No successor has been named yet.",
            "Sentiment": "negative",
            "PublishDate": 1745832490000,
            "Source": "corporate_governance"
        },
        {
            "Title": "V2 Retail Reports 69% Year-over-Year Revenue Growth in Q4 FY25",
            "Summary": "V2 Retail has announced its standalone revenue for the fourth quarter of fiscal year 2025. The company reported revenue of Rs 499 crore, compared to Rs 296 crore in the same quarter of the previous year, representing a significant year-over-year growth of 69%.",
            "Sentiment": "positive",
            "PublishDate": 1743576549000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Reports Strong Same Store Sales Growth for FY25",
            "Summary": "V2 Retail, an Indian retail company, has announced impressive same store sales growth of 29% for the fiscal year 2025. This significant increase in sales performance indicates robust growth and potentially improved market positioning for the company.",
            "Sentiment": "positive",
            "PublishDate": 1743576493000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Reports 24% Same-Store Sales Growth",
            "Summary": "V2 Retail has announced a significant same-store sales growth (SSG) of 24%. This metric is a key indicator of retail performance, measuring the year-over-year growth in sales for stores that have been open for at least one year.",
            "Sentiment": "positive",
            "PublishDate": 1743576454000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail: Ambitious Expansion Plan Targets 100 New Stores Annually",
            "Summary": "V2 Retail aims to open 100 stores annually for the next three years, focusing on tier-two and tier-three cities. The company targets 40-50% revenue growth, expecting to reach Rs 1,800-1,850 crore in FY25. It plans to achieve double-digit same-store sales growth in FY26 and has set a revenue target of Rs 1,200 per square foot per month.",
            "Sentiment": "positive",
            "PublishDate": 1742720935000,
            "Source": "normal_news"
        },
        {
            "Title": "V2 Retail Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "V2 Retail has announced its financial results for the third quarter, showing substantial year-over-year growth. The company's net profit more than doubled to 509 million rupees, up from 241 million rupees in the same period last year. Revenue also saw a significant increase, rising to 5.9 billion rupees from 3.74 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737678281000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Reports Strong Q3 EBITDA Growth",
            "Summary": "V2 Retail has announced its Q3 financial results, showing significant improvement in profitability. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.11 billion rupees, up from 606 million rupees in the same quarter of the previous year. Additionally, V2 Retail's EBITDA margin expanded to 18.76%, compared to 16.20% in the year-ago period, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737633684000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Reports Strong Q3 Financial Performance",
            "Summary": "V2 Retail has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit more than doubled to 509 million rupees, compared to 241 million rupees in the same quarter last year. Revenue also saw substantial growth, increasing to 5.9 billion rupees from 3.74 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737633678000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail: Q3 Revenue Soars 58%, Triggers Stock Surge",
            "Summary": "V2 Retail reported a 58.1% increase in Q3 FY25 standalone revenue to ₹591.03 crore. The company achieved 25% same-store sales growth, opened 21 new stores, and expanded its total retail area to 17.22 lakh square feet. For 9M FY25, revenue grew 59% YoY to ₹1,385.19 crore with 31% SSG. The stock hit its 5% upper circuit at ₹1,725.90.",
            "Sentiment": "positive",
            "PublishDate": 1735885027000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Reports Strong Q3 FY25 Financial Performance",
            "Summary": "V2 Retail has announced its financial results for the third quarter of fiscal year 2025. The company reported revenue of 5.91 billion rupees, representing a significant year-over-year growth of 58%. Additionally, V2 Retail achieved a same-store sales growth of 25% for the same period.",
            "Sentiment": "positive",
            "PublishDate": 1735827311000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail: Targets Rs 1,800-Crore Turnover in FY25, Boosted by Wedding Season",
            "Summary": "V2 Retail aims for Rs 1,800 crore turnover in FY25, up from Rs 1,150 crore last year. Q2 saw 64.2% YoY revenue growth to Rs 380 crore. The company expects 40-50% revenue growth and double-digit same-store sales growth in Q3. V2 Retail plans to reach Rs 1.2 crore revenue per store per month in 18-24 months.",
            "Sentiment": "positive",
            "PublishDate": 1732941044000,
            "Source": "earnings"
        },
        {
            "Title": "V2 Retail Reports Improved Q2 EBITDA Performance",
            "Summary": "V2 Retail has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 307.6 million rupees, up from 188 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 8.10% from 8.13% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729786433000,
            "Source": "result"
        },
        {
            "Title": "V2 Retail Reports Significant Revenue Growth in Q2",
            "Summary": "V2 Retail, an Indian retail company, has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 3.8 billion rupees, compared to 2.3 billion rupees in the same quarter of the previous year, representing a year-over-year growth of approximately 65%.",
            "Sentiment": "positive",
            "PublishDate": 1729786425000,
            "Source": "result"
        },
        {
            "Title": "V2 Retail Reports Q2 Financial Results",
            "Summary": "V2 Retail has reported a net loss of 25.1 million rupees for the second quarter, showing an improvement from the 57 million rupee loss in the same quarter last year. However, this represents a decline from the 158.6 million rupee profit reported in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729786413000,
            "Source": "result"
        },
        {
            "Title": "V2 Retail: Stock Hits Record High as Nuvama Raises Target Price",
            "Summary": "<p>V2 Retail's share price <span class='positive'>surged 4%</span> to a new <span class='positive'>52-week high</span> after Nuvama brokerage <span class='positive'>increased</span> the stock's target price by <span class='positive'>30%</span>. The company aims to <span class='positive'>add 60 stores</span> in FY25 while maintaining <span class='positive'>double-digit same-store sales growth</span>. Nuvama <span class='positive'>upgraded</span> its FY25 store addition/SSSG target to <span class='positive'>50/20%</span> and expects <span class='positive'>49% revenue CAGR</span> over FY24–26. The brokerage <b>reaffirmed a 'BUY' rating</b> with a <span class='positive'>revised target price of ₹1,754</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728027271000,
            "Source": "normal_news"
        }
    ]
}