{
    "Symbol": "VADILALIND",
    "ISIN": "INE694D01016",
    "News": [
        {
            "Title": "Vadilal Industries Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Vadilal Industries reported Q2 consolidated net profit of 334 million rupees, down from 390 million rupees in the same quarter last year. The company's Q2 revenue increased to 3.4 billion rupees compared to 3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762939407989,
            "Source": "earnings"
        },
        {
            "Title": "Vadilal Industries Re-designates Three Executive Directors to Non-Executive Roles",
            "Summary": "Vadilal Industries Limited's board approved the re-designation of three promoter directors from executive to non-executive roles. Mr. Rajesh R. Gandhi, Mr. Devanshu L. Gandhi, and Mr. Janmajay V. Gandhi will transition from Executive Directors to Non-Executive Non-Independent Directors effective September 29, 2025, or upon appointment of a CEO, whichever occurs earlier. This change is mandated by the company's articles of association. All three directors will continue serving until May 13, 2030, completing their remaining appointment terms. The decision was made based on the Nomination and Remuneration Committee's recommendation during a board meeting held on September 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757770309585,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vadilal Industries Appoints Himanshu Kanwar as CEO for Five-Year Term",
            "Summary": "Vadilal Industries Limited appointed Himanshu Kanwar as Chief Executive Officer and Key Managerial Personnel, effective September 29, 2025. The Board of Directors approved the appointment on September 9, 2025, based on the recommendation of the Nomination & Remuneration Committee. Kanwar will serve a five-year term. He brings over two decades of consumer business experience, including senior leadership roles at Hindustan Unilever Limited where he served as Business Head for Ice Creams and Global Brand Director for South Asia Haircare portfolio. He currently works as General Manager, Growth & Marketing Practice with XTO10X, mentoring consumer businesses across various sectors. Kanwar holds an MBA from Indian Institute of Management Calcutta and a Computer Engineering degree from Delhi College of Engineering.",
            "Sentiment": "positive",
            "PublishDate": 1757399851865,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vadilal Industries Reports Strong Q1 FY26 Results, Appoints New Auditors and Schedules AGM",
            "Summary": "Vadilal Industries Limited's board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹424.76 crore compared to ₹401.77 crore in the same quarter last year, with net profit after tax of ₹53.36 crore versus ₹63.06 crore in the previous year. On a consolidated basis, revenue from operations reached ₹505.91 crore compared to ₹464.25 crore, while net profit was ₹66.98 crore against ₹77.42 crore in the corresponding quarter. The board appointed M/s. SPAN & Co., Practicing Company Secretaries as secretarial auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company scheduled its 41st Annual General Meeting for September 19, 2025, to be conducted via video conferencing, with book closure from September 13-19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755002786020,
            "Source": "earnings"
        },
        {
            "Title": "Vadilal Industries Q4 Results and Dividend Announcement",
            "Summary": "Vadilal Industries reported its Q4 financial results. Revenue increased to 2.74 billion rupees from 2.51 billion rupees year-over-year. However, EBITDA decreased to 387.7 million rupees from 457.7 million rupees, with EBITDA margin falling to 14.13% from 18.2%. Consolidated net profit declined to 220 million rupees from 276 million rupees year-over-year, but increased from 119.3 million rupees quarter-on-quarter. The company also recommended a dividend of 21 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748262364000,
            "Source": "result"
        },
        {
            "Title": "Vadilal Industries: Family Dispute Settled, Management Restructuring Announced",
            "Summary": "Vadilal Industries' promoters, the Gandhi family, have settled their dispute and agreed to restructure the company's management. The family will step down from key positions, appoint professional management, and merge promoter-owned companies into Vadilal Industries. The 'Vadilal' brand will be housed within the company, and four independent directors will be appointed to enhance corporate governance.",
            "Sentiment": "positive",
            "PublishDate": 1743349151000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vadilal Industries: Penny Stock Soars 73,686% in 21 Years",
            "Summary": "Vadilal Industries' stock price has risen from ₹5.60 to ₹4,132 over 21 years, representing a 73,686% increase. The company reported a 29% rise in net profit for Q3 FY2024, with revenue up 17% to ₹204 crore. Year-to-date, the stock has gained 3.68%.",
            "Sentiment": "positive",
            "PublishDate": 1741080590000,
            "Source": "normal_news"
        },
        {
            "Title": "Vadilal Industries Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Vadilal Industries has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) has more than doubled year-over-year, reaching 260 million rupees compared to 110 million rupees in the same quarter last year. Additionally, the EBITDA margin has seen a significant increase, rising to 12.75% from 6.31% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738311142000,
            "Source": "earnings"
        },
        {
            "Title": "Vadilal Industries Reports Increased Q3 Profit and Revenue",
            "Summary": "Vadilal Industries has announced its Q3 financial results, showing improvements in both profit and revenue. The company's consolidated net profit rose to 119 million rupees, up from 92 million rupees in the same quarter last year. Revenue also increased to 2 billion rupees from 1.74 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738311064000,
            "Source": "earnings"
        },
        {
            "Title": "Vadilal Industries Reports Q2 EBITDA Growth",
            "Summary": "Vadilal Industries has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 610 million rupees, up from 590 million rupees in the same quarter last year. The EBITDA margin also improved slightly to 20.61% from 20.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731577181000,
            "Source": "result"
        },
        {
            "Title": "Vadilal Industries Reports Q2 Revenue Growth",
            "Summary": "Vadilal Industries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 3 billion rupees, compared to 2.89 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731577085000,
            "Source": "result"
        },
        {
            "Title": "Vadilal Industries Reports Slight Increase in Q2 Consolidated Net Profit",
            "Summary": "Vadilal Industries has announced its Q2 consolidated net profit of 390 million rupees, showing a marginal increase from 380 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731577064000,
            "Source": "result"
        }
    ]
}