{
    "Symbol": "VAIBHAVGBL",
    "ISIN": "INE884A01027",
    "News": [
        {
            "Title": "Vaibhav Global Allots 16,717 Equity Shares to ESOP Trust",
            "Summary": "Vaibhav Global Limited has allotted 16,717 equity shares worth Rs. 2/- each to its Employee Stock Option Welfare Trust under employee benefit schemes, increasing paid-up capital to Rs. 33,40,99,214.",
            "Sentiment": "neutral",
            "PublishDate": 1770208952003,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vaibhav Global Q3FY26 Results & Rs 1.50 Dividend",
            "Summary": "Vaibhav Global reported Q3FY26 consolidated revenue of Rs 1,06,602.51 lakhs with net profit of Rs 8,980.42 lakhs. Board declared 3rd interim dividend of Rs 1.50 per share with record date February 3, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769541914588,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vaibhav Global US Unit Gets $2.76M ERC Grant",
            "Summary": "Vaibhav Global's step-down subsidiary SHOPLC Global Inc. received US$2.76 million grant under Employee Retention Credit Scheme from US Treasury Department under CARES Act.",
            "Sentiment": "positive",
            "PublishDate": 1769063851073,
            "Source": "stocks"
        },
        {
            "Title": "Vaibhav Global schedules Q3 FY26 earnings call",
            "Summary": "Vaibhav Global Limited announces earnings conference call for January 28, 2026, to discuss Q3 & 9M FY26 financial results with investors and analysts under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768473280734,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ruchira Papers Opens Special Window for Share Transfers",
            "Summary": "Ruchira Papers Limited announces special window from July 7, 2025 to January 6, 2026 for re-lodgement of physical share transfer requests rejected prior to April 1, 2019 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767335289544,
            "Source": "stocks"
        },
        {
            "Title": "Vaibhav Global Allots 64,933 Equity Shares to Employee Stock Option Trust",
            "Summary": "Vaibhav Global Limited allotted 64,933 equity shares of Rs. 2 each on December 24, 2025, to its Employee Stock Option Welfare Trust under employee benefit schemes. The allotment increased the company's paid-up equity share capital to Rs. 33,40,65,780, consisting of 16,70,32,890 equity shares of Rs. 2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764672799694,
            "Source": "corporate_action"
        },
        {
            "Title": "ShopLC US Wins Entrepreneurial Vision Award at Greater Austin Business Awards 2025",
            "Summary": "ShopLC (US), a subsidiary of Vaibhav Global Limited, received the Entrepreneurial Vision Award at Greater Austin Business Awards 2025 for its purpose-driven business model and social impact initiatives. The award recognizes the company's omnichannel retail approach and community contribution, including delivering over 57 million meals to children in the US through its 'your purchase feeds' program.",
            "Sentiment": "positive",
            "PublishDate": 1764234850784,
            "Source": "stock"
        },
        {
            "Title": "Vaibhav Global Reports 10.2% Revenue Growth to INR 877 Crores in Q2 FY26",
            "Summary": "Vaibhav Global Limited reported consolidated revenue of INR 877 crores for Q2 FY26, reflecting 10.2% year-on-year growth, exceeding their guidance range of 7-9%. The company maintained gross margins at 63.5% and achieved EBITDA margin expansion of 130 basis points to 10%. PAT increased 71% year-on-year to INR 48 crores. Digital sales contributed 42% of B2C revenue, with the company targeting 50% by FY27. Regional performance showed US and UK growing 6.7% and 5.7% respectively in dollar terms, while Germany remained flat. The company began jewelry casting operations in the US to address tariff uncertainties. Germany operations are expected to achieve EBITDA breakeven for the full year after reporting EUR 750,000 loss in H1. The Board declared a second interim dividend of INR 1.5 per equity share. Lab-grown diamonds now represent 10.3% of total sales, up from 5.5% last year. The company maintains its FY26 revenue guidance of 7-9% growth.",
            "Sentiment": "positive",
            "PublishDate": 1762275872197,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global Reports 71% Jump in Q2 Profit, Declares Rs 1.50 Interim Dividend",
            "Summary": "Vaibhav Global Limited reported strong quarterly results with revenue rising 10.2% year-on-year to Rs 877 crores, exceeding company guidance. Profit After Tax surged 71% to Rs 48 crores, while EBITDA increased 28% with margins expanding 130 basis points to 10%. The company maintained gross margins at 63.5% through efficient product mix and pricing discipline. Digital revenue contributed 42% of B2C revenue, while in-house brands increased to 41% of gross B2C revenue from 31% in the previous year. The company declared a second interim dividend of Rs 1.50 per equity share with a 53% payout ratio. Unique customers reached an all-time high of 7.14 lakhs, up 5% year-on-year. The company maintains its FY26 revenue guidance of 7-9% growth. Vaibhav Global operates as an omni-channel retailer of fashion jewellery and lifestyle products across US, UK, and Germany markets.",
            "Sentiment": "positive",
            "PublishDate": 1761766554914,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global Declares Rs 1.50 Interim Dividend, Approves Quarterly Results",
            "Summary": "Vaibhav Global Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company declared a second interim dividend of Rs 1.50 per equity share for financial year 2025-26, with record date set for November 6, 2025. The dividend will be paid within 30 days of declaration. The board also designated Sabaresh Kumar as Group Chief Human Resources Officer under Senior Management Personnel category. Kumar brings 24 years of HR experience and was originally appointed on August 21, 2025, with the senior management designation effective from October 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761765623847,
            "Source": "corporate_action"
        },
        {
            "Title": "Vaibhav Global Schedules Q2 FY26 Earnings Conference Call for October 30, 2025",
            "Summary": "Vaibhav Global Limited has scheduled an earnings conference call with investors and analysts for Thursday, October 30, 2025 at 4:00 PM IST to discuss operational and financial performance for Q2 and H1 FY26. The call will be led by Managing Director Sunil Agrawal and Group CFO Nitin Panwad. Access will be provided through multiple phone numbers including primary Indian numbers and international toll-free numbers for USA, UK, Singapore, and Hong Kong. The company noted that unforeseen circumstances may lead to changes in the scheduled date or time.",
            "Sentiment": "neutral",
            "PublishDate": 1760449410719,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global Schedules Board Meeting for Q2 Results and Interim Dividend Consideration",
            "Summary": "Vaibhav Global Limited has scheduled a Board of Directors meeting for October 29, 2025, to consider and approve unaudited financial results for the quarter and half year ended September 30, 2025. The board will also consider declaring a second interim dividend on equity share capital for financial year 2025-26. The company's trading window for share dealings will remain closed until October 31, 2025, which is 48 hours after the board meeting date.",
            "Sentiment": "neutral",
            "PublishDate": 1760362913807,
            "Source": "corporate_action"
        },
        {
            "Title": "Vaibhav Global Receives Excellence in Manufacturing Award from Indo-American Chamber of Commerce",
            "Summary": "Vaibhav Global Limited received the 'Excellence in Manufacturing Award' from the Indo-American Chamber of Commerce at the 21st Indo-American Corporate Excellence Conclave 2025. The recognition was awarded after evaluation by industry veterans and honors companies that have achieved benchmarks in operational excellence, manufacturing efficiency, and responsible production. The company stated this recognition reinforces their commitment to expanding operations in the US. Aswini Agarwal, Head of Supply Chain-Asia, noted that VGL has built in-house manufacturing capabilities supporting quality, scale, and sustainable growth, and thanked IACC for acknowledging their efforts in promoting Indian jewelry and lifestyle products in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1758606457283,
            "Source": "stock"
        },
        {
            "Title": "Vaibhav Global Shares Surge 9% on High Trading Volumes",
            "Summary": "Vaibhav Global shares rallied 9% on Tuesday, September 16, continuing a strong performance with gains in five of the last seven sessions. The stock has climbed 18% over the past seven trading days and is up 25% in September, marking its best monthly performance of 2025. Trading volumes were significantly elevated at 12 lakh shares compared to the 20-day average of 1 lakh shares. The rally has reduced the company's year-to-date losses to 12%. The stock has broken above key technical resistance levels, surpassing the 100-day moving average at ₹234 and the 200-day moving average at ₹247.",
            "Sentiment": "positive",
            "PublishDate": 1758009140299,
            "Source": "stock"
        },
        {
            "Title": "Vaibhav Global Receives Draft Tax Assessment Order with Rs 2,048 Crore Proposed Adjustments",
            "Summary": "Vaibhav Global Limited received a draft assessment order from the Income Tax Department for assessment year 2022-23 under Section 144(C) of the Income Tax Act. The order proposes major adjustments of Rs 2,048,658,409 related to transfer pricing issues. The company plans to file objections against the proposed adjustments before the Dispute Resolution Panel. Vaibhav Global states it has obtained favorable decisions from ITAT in earlier assessment years on similar transfer pricing matters and does not expect any material financial impact based on internal assessment. No penalties or sanctions have been imposed, and the expected overall financial implication will be determined only upon the final assessment order.",
            "Sentiment": "neutral",
            "PublishDate": 1757082339775,
            "Source": "stock"
        },
        {
            "Title": "Vaibhav Global Targets Mid-Teen Growth Beyond FY26 Through Digital Expansion and Innovation",
            "Summary": "Vaibhav Global is targeting mid-teen growth beyond FY26 despite global headwinds. The company plans to achieve this growth through digital expansion, innovation-led brand strategies, and operational leverage.",
            "Sentiment": "positive",
            "PublishDate": 1754407479842,
            "Source": "stock"
        },
        {
            "Title": "Vaibhav Global Reports 8% Revenue Growth and 37% PAT Growth in Q1 FY26",
            "Summary": "Vaibhav Global Limited reported quarterly sales of Rs. 814 crores, marking an 8% year-over-year growth. The company achieved a 37% increase in profit after tax (PAT) and maintained a net cash positive position of Rs. 174 crores. The unique customer base reached an all-time high of 713,000 customers, representing a 12% year-over-year increase. The company recommended its first dividend of Rs. 1.50 per equity share with a 66% payout ratio. Strong cash flows were recorded with operating cash flow of Rs. 22 crores and free cash flow of Rs. 15 crores. The company operates as a vertically-integrated digital retailer of fashion jewellery and lifestyle products across TV channels and digital platforms in the US, UK, and Germany markets. EBITDA margin improved to 9.2% from 8.7% in the previous year, while gross margins were maintained at 63.8%. The company's acquired businesses including Ideal World maintained EBITDA profitability during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754405950947,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global Reports Q1 FY2026 Results, Declares Rs. 1.50 Interim Dividend and Grants Employee Stock Options",
            "Summary": "Vaibhav Global Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs. 81,373.71 lakhs compared to Rs. 75,600.92 lakhs in the same quarter last year. Consolidated profit for the period increased to Rs. 3,763.19 lakhs from Rs. 2,744.91 lakhs year-over-year. Basic earnings per share stood at Rs. 2.26 versus Rs. 1.67 in the previous year quarter. The Board declared an interim dividend of Rs. 1.50 per equity share with a record date of August 14, 2025, to be paid within 30 days. The company granted 86,810 stock options under VGL MSOP Plan 2021 and 7,188 restricted stock units under VGL RSU Plan 2019 to eligible employees. Geographically, the United States contributed Rs. 49,467.98 lakhs to segment revenue, followed by the United Kingdom at Rs. 22,821.88 lakhs and India at Rs. 14,737.74 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754400600616,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Upgrades Vaibhav Global's Credit Rating for Rs. 110 Crore Bank Facilities",
            "Summary": "ICRA Limited upgraded the credit rating for Vaibhav Global Limited's bank facilities worth Rs. 110 crore. The long-term fund-based limits of Rs. 105 crore were upgraded to [ICRA]A+ with a stable outlook from the previous [ICRA]A rating with positive outlook. The short-term non-fund based limits of Rs. 5 crore were upgraded to [ICRA]A1+ from [ICRA]A1. The upgrade affects the company's total bank facilities and reflects an improvement in its creditworthiness assessment.",
            "Sentiment": "positive",
            "PublishDate": 1753196999368,
            "Source": "stock"
        },
        {
            "Title": "Vaibhav Global Schedules Q1 FY26 Earnings Call for August 6, 2025",
            "Summary": "Vaibhav Global Limited has scheduled an earnings conference call with investors and analysts for Wednesday, August 6, 2025 at 11:00 AM IST to discuss operational and financial performance for Q1 FY26. The call will be led by Managing Director Sunil Agrawal and Group CFO Nitin Panwad. Access will be provided through multiple phone numbers including primary Indian numbers and international toll-free numbers for USA, UK, Singapore, and Hong Kong. The company noted that unforeseen circumstances may lead to changes in the scheduled date or time.",
            "Sentiment": "neutral",
            "PublishDate": 1753189043022,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global Schedules Board Meeting for Q1 Results and Interim Dividend Consideration",
            "Summary": "Vaibhav Global Limited has scheduled a Board of Directors meeting for August 5, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025, and to consider declaration of interim dividend on equity share capital for financial year 2025-26. The company's trading window will remain closed until August 7, 2025, which is forty-eight hours after the board meeting date.",
            "Sentiment": "neutral",
            "PublishDate": 1753165213299,
            "Source": "corporate_action"
        },
        {
            "Title": "Vaibhav Global Receives Favorable Tax Ruling from ITAT Jaipur",
            "Summary": "Vaibhav Global has received a favorable ruling from the Income Tax Appellate Tribunal (ITAT) in Jaipur. The ruling cancels tax liabilities of approximately Rs. 91.81 crore for the fiscal year 2020-21 and Rs. 58.85 crore for the fiscal year 2021-22. This decision significantly reduces the company's tax burden for these two financial years.",
            "Sentiment": "positive",
            "PublishDate": 1751906686000,
            "Source": "default"
        },
        {
            "Title": "Vaibhav Global Reports Improved Q4 Financial Results",
            "Summary": "Vaibhav Global has announced its Q4 financial results. The company's EBITDA increased to 623 million rupees from 534.7 million rupees year-over-year. The EBITDA margin improved to 7.33% from 6.77% in the same period. Consolidated net profit rose to 341 million rupees from 214 million rupees year-over-year. Revenue for Q4 grew to 8.5 billion rupees from 7.9 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747880179000,
            "Source": "result"
        },
        {
            "Title": "Vaibhav Global Receives Draft Assessment Order for Tax with Proposed Adjustments",
            "Summary": "Vaibhav Global has received a draft assessment order from the Income Tax Department. The order proposes significant adjustments related to transfer pricing issues, amounting to 2.05 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1743552587000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vaibhav Global Receives Draft Assessment Order for Tax with Proposed Adjustments",
            "Summary": "Vaibhav Global has received a draft assessment order from the Income Tax Department. The order proposes significant adjustments related to transfer pricing issues, amounting to 2.05 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1743520111000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vaibhav Global Ltd: Lab-Grown Diamonds Drive Growth Amid Tariff Uncertainty",
            "Summary": "Vaibhav Global's CFO reports rising demand for lab-grown diamonds due to affordability. The company's diverse sourcing strategy is yielding higher margins. Potential US tariffs pose a challenge, but the company's global sourcing network may mitigate risks. Weak consumer demand in Europe and the UK has led to trimmed guidance. German operations are growing at 30% since re-entry in 2021.",
            "Sentiment": "neutral",
            "PublishDate": 1743311285000,
            "Source": "normal_news"
        },
        {
            "Title": "Vaibhav Global Reports Improved Q3 EBITDA and Margin",
            "Summary": "Vaibhav Global has announced its Q3 financial results, showing an increase in EBITDA to 1.1 billion rupees from 934 million rupees year-over-year. The company's EBITDA margin also improved to 11.22% from 10.52% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738202318000,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global Reports Strong Q3 Financial Results",
            "Summary": "Vaibhav Global has announced its Q3 financial results, showing significant growth. The company's consolidated net profit increased to 638 million rupees from 474 million rupees year-over-year. Revenue also saw an uptick, rising to 9.77 billion rupees from 8.88 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738202284000,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global to Consider Q3 Results on January 29",
            "Summary": "Vaibhav Global Limited has announced that it will consider and approve its financial results for the third quarter of the current fiscal year on January 29.",
            "Sentiment": "neutral",
            "PublishDate": 1736516453000,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Global Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Vaibhav Global Ltd shares occurred on the National Stock Exchange (NSE) during pre-open trading. The transaction involved approximately 2,500,533 shares, valued at Rs. 75.77 crores, with each share priced at Rs. 303.00.",
            "Sentiment": "neutral",
            "PublishDate": 1734579650000,
            "Source": "block_deals"
        },
        {
            "Title": "Vaibhav Global Declares Second Interim Dividend",
            "Summary": "Vaibhav Global has announced a second interim dividend of ₹1.50 per equity share. This corporate action reflects the company's decision to distribute profits to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731333394000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vaibhav Global Reports Q2 Financial Results",
            "Summary": "Vaibhav Global announced its Q2 financial results. The company's EBITDA for the quarter was 602 million rupees, compared to 634 million rupees in the same quarter last year. The EBITDA margin decreased to 7.55% from 9.00% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731333336000,
            "Source": "result"
        },
        {
            "Title": "Vaibhav Global Reports Q2 Financial Results",
            "Summary": "Vaibhav Global announced its Q2 consolidated financial results. The company reported a net profit of 278 million rupees, slightly down from 294 million rupees year-over-year, but up from 277 million rupees quarter-over-quarter. Revenue for Q2 increased to 7.96 billion rupees from 7 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731333283000,
            "Source": "result"
        }
    ]
}