{
    "Symbol": "VAKRANGEE",
    "ISIN": "INE051B01021",
    "News": [
        {
            "Title": "Vakrangee partners with Tyger Capital for credit access",
            "Summary": "Vakrangee Limited announces strategic alliance with Tyger Capital Private Limited to offer MSME loans, used tractor loans, and commercial vehicle loans through its Vakrangee Kendra network, targeting underserved regions.",
            "Sentiment": "positive",
            "PublishDate": 1770799721889,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vakrangee Gets RBI Nod for White Label ATMs",
            "Summary": "Vakrangee receives fresh authorization from Reserve Bank of India to operate white label ATMs, marking a significant regulatory approval for the company's financial services expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770124958937,
            "Source": "stocks"
        },
        {
            "Title": "Vakrangee grants 1 lakh stock options to employees",
            "Summary": "Vakrangee Limited's NRC Committee approved grant of 1,00,000 stock options to eligible employees at Rs. 2 per option under ESOP Scheme 2014 on January 24, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769250676358,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vakrangee Q3FY26 Profit Jumps 96% to ₹371.93 Crores",
            "Summary": "Vakrangee Limited reported strong Q3FY26 results with standalone net profit rising 95.67% to ₹371.93 crores. Revenue grew 2.87% to ₹4,754.01 crores while consolidated profit reached ₹315.01 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769249658114,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vakrangee Gets ₹28.91 Lakh IT Penalty Notice for AY 2018-19",
            "Summary": "Vakrangee Limited receives Income Tax penalty order of ₹28,90,765 for assessment year 2018-19. Company plans to file appeal, expects no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1767179527874,
            "Source": "stocks"
        },
        {
            "Title": "Vakrangee Files Share Capital Consolidation Petition",
            "Summary": "Vakrangee Limited has filed a company petition with NCLT Mumbai for share capital consolidation under Section 61(1)(b) of Companies Act 2013. Hearing scheduled for January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767096761591,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vakrangee Limited Faces Rs 6.26 Lakh GST Demand from Maharashtra Authorities",
            "Summary": "Vakrangee Limited received a GST order from Maharashtra State authorities demanding Rs 6,26,904 comprising tax of Rs 2,38,256, interest of Rs 3,36,889, and penalty of Rs 51,759 due to disallowance of input tax credit. The company states there is no material impact on its financial, operational or other activities and disclosed the matter after missing initial timeline requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764670180502,
            "Source": "stock"
        },
        {
            "Title": "Vakrangee Limited Forfeits 3.63 Crore Warrants Worth Rs 98 Crore After Conversion Period Expires",
            "Summary": "Vakrangee Limited forfeited 3,63,33,433 warrants after the 18-month conversion period expired on September 30, 2025. The company had issued 6 crore fully convertible warrants at Rs 27 each for Rs 162 crore through preferential allotment. Only Rs 88.94 crore was raised from warrant holders, with the remaining Rs 73.06 crore lost due to non-conversion. The forfeited warrants include 2 crore from promoters (100% of their allocation) and 1.63 crore from non-promoters (41% of their allocation). The company's share price stood at Rs 8.12 on September 30, 2025, substantially below the warrant exercise price of Rs 27. CARE Ratings Limited, the monitoring agency, reported that all raised proceeds have been utilized across business expansion, loan repayment, strategic investments, subsidiary investments, working capital, and general corporate purposes. The company revised the total cost of objects to Rs 88.94 crore from the original Rs 162 crore following the warrant forfeiture.",
            "Sentiment": "negative",
            "PublishDate": 1762947997789,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Limited CFO Ajay Jangid Resigns Due to Other Professional Commitments",
            "Summary": "Ajay Jangid has resigned from his position as Chief Financial Officer and Key Managerial Personnel at Vakrangee Limited, effective from the close of business hours on October 30, 2025. In his resignation letter, Jangid cited his commitments and personal pre-occupations as the reason for his departure, confirming there are no other material reasons for his resignation. His resignation also terminates his authority as Key Managerial Personnel for determining materiality of events and making disclosures to stock exchanges. Jangid has requested removal of his name as an authorized signatory from all bank accounts and financial instruments, and has committed to ensuring a smooth transition of responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1761831501119,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vakrangee Reports Mixed Performance with Revenue Decline in Q2 FY26",
            "Summary": "Vakrangee Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported standalone revenue from operations of ₹4,412.71 lakhs, down from ₹4,744.59 lakhs in the previous quarter and ₹4,539.66 lakhs in the same quarter last year. Total standalone income was ₹4,480.76 lakhs. On a consolidated basis, revenue from operations was ₹6,907.96 lakhs compared to ₹6,883.83 lakhs in the previous quarter. The company's profit before tax on standalone basis was ₹397.10 lakhs for the quarter. Vakrangee granted 20,00,000 new stock options under its ESOP Scheme 2014 to eligible employees during the quarter. The Board also approved withdrawal of its in-principle application for preferential allotment of 35,00,000 warrants convertible into equity shares. The company operates primarily through Vakrangee Kendra services and also has an ATM products/services segment.",
            "Sentiment": "neutral",
            "PublishDate": 1761302677971,
            "Source": "earnings"
        },
        {
            "Title": "Vakrangee Reports Strong Q2 Performance with 40% Jump in Net Profit",
            "Summary": "Vakrangee delivered robust quarterly results with consolidated net profit surging to 29 million rupees from 7 million rupees year-over-year. Revenue grew to 691 million rupees compared to 652 million rupees in the same period last year. The company's EBITDA increased to 73 million rupees from 52 million rupees year-over-year, while EBITDA margin expanded to 10.53% from 8.04% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761297076765,
            "Source": "earnings"
        },
        {
            "Title": "Vakrangee Partners with SBI General Insurance to Expand Rural Insurance Access",
            "Summary": "Vakrangee has entered into a partnership with SBI General Insurance to expand access to comprehensive insurance products across rural and semi-urban areas in India.",
            "Sentiment": "positive",
            "PublishDate": 1756984118624,
            "Source": "order&deals"
        },
        {
            "Title": "Vakrangee Partners with Muthoot Fincorp to Offer Loan Products Across India",
            "Summary": "Vakrangee has entered into a collaboration with Muthoot Fincorp Limited to provide loan products on a nationwide basis. The partnership aims to expand the availability of financial services through Vakrangee's network.",
            "Sentiment": "positive",
            "PublishDate": 1756788584772,
            "Source": "order&deals"
        },
        {
            "Title": "Vortex Engineering Secures Rs 12.81 Crore ATM Contract with UCO Bank",
            "Summary": "Vortex Engineering Private Limited, a subsidiary of Vakrangee Limited, has signed a service level agreement with UCO Bank to provide end-to-end solutions for 300 new ATMs. The seven-year contract is valued at Rs 12.81 crore and includes supply, installation, and maintenance services. Vortex has previously deployed over 14,000 ATMs across various locations and maintains an annual production capacity of 12,000 units. The company holds 9 registered patents in ATM and cash dispenser technologies and has developed PERFO, a remote ATM monitoring platform for real-time oversight and fleet management.",
            "Sentiment": "positive",
            "PublishDate": 1754027410110,
            "Source": "order&deals"
        },
        {
            "Title": "Vakrangee Reports 18% Revenue Growth and 48.5% Profit Surge in Q1 FY2025-26",
            "Summary": "Vakrangee Limited announced strong quarterly results with total income rising 18% to Rs. 7,034.7 lakhs and profit after tax jumping 48.5% to Rs. 331.9 lakhs year-over-year. The company's gross transaction value reached Rs. 13,928.4 crores with 2.6 crore transactions during the quarter. Its subsidiary Vortex Engineering delivered 23.2% revenue growth and shipped 657 ATM machines, representing 57.6% growth in units shipped. The company secured strategic software deals from Caribbean Island and Africa, while receiving a letter of intent from Punjab & Sind Bank for 600 new ATM machines. Vakrangee operates 22,892 outlets across 33 states with presence in 605 districts, maintaining a debt-free status. The company is focusing on expanding non-cash banking services including account opening, loans, insurance, and mutual funds to drive financial inclusion.",
            "Sentiment": "positive",
            "PublishDate": 1753430776429,
            "Source": "earnings"
        },
        {
            "Title": "Vakrangee Limited Approves Q1 2025 Results, Share Consolidation, and Board Changes",
            "Summary": "Vakrangee Limited's Board approved unaudited financial results for the first quarter ended June 30, 2025. The Board proposed consolidating every 10 equity shares with face value of Rs. 1 each into 1 equity share with face value of Rs. 10 each, subject to shareholder and regulatory approvals. The consolidation aims to enhance share liquidity and rebuild investor confidence. The company modified its existing ESOP policy and appointed Mrs. Kalpana Srinivasan as Secretarial Auditor for a 5-year term from 2025-26 to 2029-30. Board changes include appointing Mr. Sandeep J Gaware, a banking veteran with 36 years of experience, as Non-Executive Independent Director, and re-appointing Mr. H.C. Mittal as Non-Executive Independent Director for a second 5-year term from July 31, 2025 to July 30, 2030. All appointments are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1753429913296,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners With Shriram General Insurance for Nationwide Distribution",
            "Summary": "Vakrangee has entered into a partnership with Shriram General Insurance to provide general insurance products across the country. The collaboration will enable Vakrangee to offer insurance services through its network.",
            "Sentiment": "positive",
            "PublishDate": 1753172618936,
            "Source": "order&deals"
        },
        {
            "Title": "Vakrangee Partners with Ageas Federal Life Insurance",
            "Summary": "Vakrangee has formed a distribution partnership with Ageas Federal Life Insurance Company. This partnership will allow Vakrangee to offer Ageas Federal Life Insurance products through its distribution network.",
            "Sentiment": "positive",
            "PublishDate": 1750671184000,
            "Source": "default"
        },
        {
            "Title": "Vakrangee Partners with Universal Sompo for General Insurance Products",
            "Summary": "Vakrangee has entered into a partnership with Universal Sompo General Insurance Company Ltd. This collaboration will allow Vakrangee to offer general insurance products across its network. The partnership aims to expand the availability of insurance services through Vakrangee's distribution channels.",
            "Sentiment": "positive",
            "PublishDate": 1748623521000,
            "Source": "default"
        },
        {
            "Title": "Vakrangee's Unit Vortex Engineering Receives LOI from Punjab & Sind Bank for ATM Supply",
            "Summary": "Vakrangee's subsidiary, Vortex Engineering, has received a Letter of Intent (LOI) from Punjab & Sind Bank for the supply, commissioning, and maintenance of 600 ATMs and UPS. The contract includes AMC for 5 years and is valued at Rs. 39.38 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748520114000,
            "Source": "default"
        },
        {
            "Title": "Vakrangee Reports Q4 EBITDA Decline",
            "Summary": "Vakrangee's Q4 EBITDA decreased to 68 million rupees from 76 million rupees year-over-year. The company's EBITDA margin also fell to 10.81% from 14.12% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1745663090000,
            "Source": "result"
        },
        {
            "Title": "Vakrangee Reports Increased Q4 Profit and Revenue",
            "Summary": "Vakrangee Limited has announced its Q4 financial results. The company's consolidated net profit increased to 25 million rupees from 22 million rupees year-over-year. Revenue also saw growth, rising to 632 million rupees from 539 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745662854000,
            "Source": "result"
        },
        {
            "Title": "Vakrangee Plans Significant ATM Network Expansion",
            "Summary": "Vakrangee has announced plans to expand its ATM network by deploying 3,000 new ATM machines in the fiscal year 2025-26. This strategic move aims to enhance the company's presence in the financial services sector and improve accessibility to banking services.",
            "Sentiment": "positive",
            "PublishDate": 1742889532000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners with Aditya Birla Health Insurance for Health Coverage Products",
            "Summary": "Vakrangee has announced a strategic partnership with Aditya Birla Health Insurance to offer health insurance products through its platform. This collaboration aims to expand the availability of health insurance options to Vakrangee's customer base.",
            "Sentiment": "positive",
            "PublishDate": 1740488070000,
            "Source": "corporate_action"
        },
        {
            "Title": "RBI Renews Authorization for Vakrangee White Label ATMs",
            "Summary": "The Reserve Bank of India (RBI) has renewed the authorization for Vakrangee's White Label ATMs. The renewal extends the company's authorization to operate these ATMs until March 31, 2026. This development allows Vakrangee to continue providing ATM services under its own brand, potentially expanding its financial services footprint.",
            "Sentiment": "positive",
            "PublishDate": 1739364870000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners with Tata AIG for General Insurance Products",
            "Summary": "Vakrangee Limited has announced a strategic partnership with Tata AIG to offer general insurance products through its platform. This collaboration aims to expand Vakrangee's financial services portfolio and provide customers with access to a wider range of insurance options.",
            "Sentiment": "positive",
            "PublishDate": 1738854089000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Vakrangee Limited has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 55 million rupees from 62 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 8.06% from 12.07% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738760318000,
            "Source": "earnings"
        },
        {
            "Title": "Vakrangee Reports Q3 Financial Results",
            "Summary": "Vakrangee Limited has announced its Q3 financial results. The company reported a consolidated net profit of 10 million rupees, compared to 12 million rupees year-over-year and 6 million rupees quarter-over-quarter. Revenue for Q3 stood at 679 million rupees, up from 516 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738760231000,
            "Source": "earnings"
        },
        {
            "Title": "Vakrangee and Bank of Baroda Renew Partnership Agreement",
            "Summary": "Vakrangee Limited has renewed its agreement with Bank of Baroda for providing banking services across India. This partnership allows Vakrangee to continue offering Bank of Baroda's banking services through its extensive network of outlets nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1736214477000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners with Future Generali India Insurance for General Insurance Products",
            "Summary": "Vakrangee has entered into a partnership with Future Generali India Insurance Company Limited to offer general insurance products across its network. This collaboration will allow Vakrangee to expand its insurance product offerings to its customers through its distribution channels.",
            "Sentiment": "positive",
            "PublishDate": 1735562708000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners to Offer Life Insurance Products",
            "Summary": "Vakrangee has entered into a partnership to provide life insurance products. This collaboration aims to expand the company's financial services offerings and potentially increase its revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1735539038000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners with Shriram Life Insurance",
            "Summary": "Vakrangee Limited has entered into a partnership with Shriram Life Insurance. This collaboration suggests that Vakrangee will likely offer Shriram Life Insurance products through its distribution network, potentially expanding its financial services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1735538872000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Approves Issuance of Convertible Warrants via Preferential Allotment",
            "Summary": "Vakrangee's board has approved the issuance of 35 crore convertible warrants through preferential allotment to 11 non-promoter investors. This move is expected to raise Rs 980 crore, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1734777913000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners with Canara Bank as Corporate Business Correspondent",
            "Summary": "Vakrangee has entered into an agreement with Canara Bank to act as a Corporate Business Correspondent (CBC). This partnership will allow Vakrangee to offer banking services through its Vakrangee Kendra network, potentially expanding access to financial services in areas served by Vakrangee's outlets.",
            "Sentiment": "positive",
            "PublishDate": 1734530821000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Board to Consider Fund Raising Options",
            "Summary": "Vakrangee Limited has announced a board meeting scheduled for December 21 to discuss and consider various options for raising funds, including the possibility of a Qualified Institutional Placement (QIP).",
            "Sentiment": "neutral",
            "PublishDate": 1734098753000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners with Central Bank of India for Nationwide Banking Services",
            "Summary": "Vakrangee Limited has entered into a partnership with Central Bank of India to offer banking services across India. This collaboration will likely expand Vakrangee's reach in providing financial services and potentially increase Central Bank of India's customer base through Vakrangee's network.",
            "Sentiment": "positive",
            "PublishDate": 1733211472000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee Partners with Bangiya Gramin Vikash Bank for Banking Services",
            "Summary": "Vakrangee has entered into a partnership with Bangiya Gramin Vikash Bank to offer banking services. This collaboration aims to expand Vakrangee's financial service offerings and potentially increase its presence in rural areas.",
            "Sentiment": "positive",
            "PublishDate": 1732105824000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vakrangee: Shares Hit Upper Circuit on Private Label Launch",
            "Summary": "<p><span class=\"positive\">Vakrangee's</span> stock reached <span class=\"positive\">5% upper circuit</span> at Rs 29.09 after <b>launching its own private label apparel products</b>. The company plans to <span class=\"positive\">leverage</span> its <span class=\"neutral\">Vakrangee Kendra network</span> for distribution and may <span class=\"positive\">expand</span> into other retail categories in the future.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728369019000,
            "Source": "normal_news"
        },
        {
            "Title": "Vakrangee Launches Private Label Apparel Products",
            "Summary": "<p>Vakrangee has introduced its own <span class='positive'>private label</span> apparel products across its <span class='neutral'>Kendra network</span>. This move suggests an <span class='positive'>expansion</span> of the company's product offerings and potentially a <span class='positive'>new revenue stream</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728350460000,
            "Source": "corporate_action"
        }
    ]
}