{
    "Symbol": "VALIANTORG",
    "ISIN": "INE565V01010",
    "News": [
        {
            "Title": "Valiant Organics Board Meet Set for Feb 13, 2026",
            "Summary": "Valiant Organics Limited has scheduled its Board of Directors meeting for February 13, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770624410001,
            "Source": "co_actions_results"
        },
        {
            "Title": "Valiant Organics Allots 15,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Valiant Organics Limited allotted 15,000 equity shares of face value Rs. 10 each at an exercise price of Rs. 10 per share to an eligible employee under its ESOP 2022 scheme. The allotment increased the company's paid-up equity share capital from Rs. 28,00,46,100 to Rs. 28,01,96,100, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764403096214,
            "Source": "corporate_action"
        },
        {
            "Title": "Valiant Organics Reports Strong Q2 FY26 Recovery with 13.48% EBITDA Margin",
            "Summary": "Valiant Organics Limited delivered operational revenue of INR 1,573 million in Q2 FY26 with EBITDA margin expanding to 13.48%, marking a significant turnaround from losses in Q2 FY25 to PAT of INR 56 million. The specialty chemicals manufacturer achieved improved gross margins of 46% driven by better raw material efficiency, enhanced product mix, and disciplined cost control across its diversified portfolio serving agrochemicals, pharmaceuticals, and dyes industries.",
            "Sentiment": "positive",
            "PublishDate": 1763197076044,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics Reports Mixed Quarterly Results and Expands Senior Management Team",
            "Summary": "Valiant Organics Limited reported unaudited financial results for the quarter and half year ended September 30, 2025, showing standalone net profit of Rs 359.62 lakhs for the quarter versus a loss of Rs 815.85 lakhs in the previous quarter. The company appointed 10 new senior management personnel across various operational roles and decided not to proceed with a previously considered fund-raising proposal, having arranged requisite funding through banking channels.",
            "Sentiment": "positive",
            "PublishDate": 1763054103228,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics Grants 1,000 Employee Stock Options Under ESOP Scheme",
            "Summary": "Valiant Organics Limited's Nomination and Remuneration Committee approved the grant of 1,000 employee stock options to eligible employees under the Valiant-Employees Stock Option Plan 2022. The options carry an exercise price of Rs. 10 per option, with each option entitling the holder to apply for one equity share of face value Rs. 10. The options are exercisable within three years from the date of vesting. The ESOP scheme complies with SEBI regulations and is administered by the company's Nomination and Remuneration Committee based on eligibility criteria. The exercise price is determined by the committee but cannot be less than the face value of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763036927664,
            "Source": "corporate_action"
        },
        {
            "Title": "Valiant Organics Shareholders Approve Director Re-appointments and New Secretarial Auditor",
            "Summary": "Valiant Organics Limited shareholders approved key appointments at their 20th Annual General Meeting held on September 26, 2025. The company re-appointed Shri Mahek M. Chheda as Executive Director and Shri Kiritkumar H. Desai as Non-Executive Director, both liable to retire by rotation. Additionally, shareholders approved the appointment of M/s Mehta & Mehta as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. Mahek M. Chheda brings over 8 years of experience in finance, marketing, human resources and business development. Kiritkumar H. Desai has extensive experience of over 32 years in R&D and quality control in chemical and pharma industries, having developed more than 200 products. M/s Mehta & Mehta is a practicing company secretaries firm with over 25 years of experience in legal and secretarial consultancy services.",
            "Sentiment": "positive",
            "PublishDate": 1758888280350,
            "Source": "corporate_governance"
        },
        {
            "Title": "Valiant Organics Reports Strong Q1 FY26 Recovery with 58% EBITDA Growth",
            "Summary": "Valiant Organics Limited reported significant improvement in Q1 FY26 results. Revenue from operations reached INR 2,044 million, growing 21.7% year-on-year from INR 1,679 million. Operating EBITDA surged 58% to INR 248 million with margins expanding 278 basis points to 12.13%. The company turned profitable with PAT of INR 82 million compared to a loss of INR 6 million in the previous year. Quarter-on-quarter performance showed EBITDA growth of 22.2% and PAT increase of 95.2%. The Hydrogenation segment contributed 53% of revenue at INR 1,082 million, followed by Ammonolysis at 23% and Chlorination at 19%. Total production volume reached 7,987 MT across all segments. The specialty chemicals manufacturer operates 6 manufacturing units with 70,000 TPA capacity and maintains a market capitalization of approximately INR 11,612 million.",
            "Sentiment": "positive",
            "PublishDate": 1755670853858,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics Reports Strong Q1 Results with 22% Revenue Growth and Improved Margins",
            "Summary": "Valiant Organics Limited reported consolidated revenue growth of 22% to Rs 205.48 crore for the quarter ended June 30, 2025. Net profit increased significantly to Rs 8.20 crore compared to Rs 0.62 crore in the same quarter last year. EBITDA margin improved to 9.6% from 5.7% in the previous year, while consolidated EBITDA rose 53% to Rs 19.75 crore. The company's earnings per share improved to Rs 2.93 from Rs 0.23. Management expects 15-20% revenue growth for the full year and EBITDA margins to sustain in the 10-12% range. The company plans capital expenditure of Rs 100-120 crore for capacity expansion and new products.",
            "Sentiment": "positive",
            "PublishDate": 1755245100021,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics Reports Strong Q1 Performance with 757.84 Lakhs Net Profit, Appoints New Secretarial Auditor",
            "Summary": "Valiant Organics Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs. 757.84 lakhs compared to a loss of Rs. 44.19 lakhs in the same quarter last year. Revenue from operations increased to Rs. 20,440.64 lakhs from Rs. 16,791.70 lakhs year-over-year. Basic earnings per share improved to Rs. 2.71 from negative Rs. 0.16 in the previous year quarter. On a consolidated basis, net profit reached Rs. 820.28 lakhs versus a loss of Rs. 61.99 lakhs in the corresponding quarter. The Board also appointed M/s. Mehta and Mehta as Secretarial Auditor for five consecutive years from FY 2025-2026 to FY 2029-2030, subject to shareholder approval. The firm brings over 25 years of experience in legal and secretarial consultancy services.",
            "Sentiment": "positive",
            "PublishDate": 1755088172217,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics to Explore Fundraising Options",
            "Summary": "Valiant Organics has announced plans to explore fundraising opportunities. The company's board is scheduled to meet on June 25 to discuss and consider these potential funding options.",
            "Sentiment": "positive",
            "PublishDate": 1750338216000,
            "Source": "default"
        },
        {
            "Title": "Valiant Organics Withdraws ₹500 Million Rights Issue Proposal",
            "Summary": "Valiant Organics has decided to withdraw its proposed ₹500 million rights issue. The company cited regulatory changes as the reason for pulling back the proposal. No further details about the specific regulatory shifts or their impact were provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1749731131000,
            "Source": "default"
        },
        {
            "Title": "Valiant Organics Reports Q3 Financial Results",
            "Summary": "Valiant Organics has reported its financial results for the third quarter. The company posted a net profit of 46 million rupees, compared to a loss of 67 million rupees in the same quarter last year. However, this represents a decline from the previous quarter, where the company reported a loss of 112 million rupees. Revenue for Q3 increased to 1.86 billion rupees from 1.4 billion rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1739492279000,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics Reports Significant Increase in Q3 EBITDA",
            "Summary": "Valiant Organics has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 153 million rupees, up from 38 million rupees in the same quarter of the previous year. This represents a significant year-over-year growth. Additionally, the EBITDA margin improved to 8.20% from 2.68% in the corresponding quarter last year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739447796000,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics Reports Q3 Financial Results",
            "Summary": "Valiant Organics has reported its financial results for the third quarter. The company posted a net profit of 46 million rupees, compared to a loss of 67 million rupees in the same quarter last year. However, this represents a loss of 112 million rupees compared to the previous quarter. Revenue for Q3 increased to 1.86 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739447740000,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Organics Reports Significant Drop in Q2 EBITDA",
            "Summary": "Valiant Organics has reported a substantial decrease in its Q2 EBITDA, which fell to 23.6 million rupees from 173 million rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 1.47% from 9.48% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731516273000,
            "Source": "result"
        },
        {
            "Title": "Valiant Organics Reports Q2 Revenue Decline",
            "Summary": "Valiant Organics has reported a revenue of 1.6 billion rupees for the second quarter, down from 1.82 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731516264000,
            "Source": "result"
        },
        {
            "Title": "Valiant Organics Reports Q2 Net Loss",
            "Summary": "Valiant Organics has reported a net loss of 111.6 million rupees in the second quarter, compared to a profit of 39 million rupees in the same period last year. The company also reported a loss of 4.4 million rupees, though it's unclear if this is for a different period or segment.",
            "Sentiment": "negative",
            "PublishDate": 1731516249000,
            "Source": "result"
        }
    ]
}