{
    "Symbol": "VALIANTLAB",
    "ISIN": "INE0JWS01017",
    "News": [
        {
            "Title": "Valiant Labs Gets ₹12.53 Cr GST Show-Cause Notice",
            "Summary": "Valiant Laboratories receives GST demand notice of ₹12.53 crores from CGST authorities over IPO expenses, turnover mismatch, and corporate guarantee issues dated January 14, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1768472508293,
            "Source": "stocks"
        },
        {
            "Title": "Valiant Laboratories Board Addresses Stock Exchange Fine for Rights Issue Committee Meeting Delay",
            "Summary": "Valiant Laboratories Limited's Board of Directors reviewed and commented on fines imposed by BSE Limited and National Stock Exchange for non-compliance with listing regulations. The company was penalized for delayed prior intimation of a Rights Issue Committee Meeting held on July 15, 2025. The Board stated the non-compliance was not deliberate and resulted from practical challenges in scheduling the committee meeting. The Rights Issue Committee was authorized to determine key terms including issue price, record date, and entitlement ratio. The committee meeting was scheduled promptly after receiving in-principle approvals from stock exchanges (NSE approval on July 11, 2025, and BSE approval on July 14, 2025). Both stock exchanges imposed fines of ₹2,11,800 each (inclusive of GST), which the company paid on August 20, 2025, within prescribed timelines. The Board considers the matter fully complied with and closed.",
            "Sentiment": "neutral",
            "PublishDate": 1762897987246,
            "Source": "corporate_governance"
        },
        {
            "Title": "Valiant Laboratories Reports Appropriate Utilization of Rights Issue Proceeds for Quarter Ended September 2025",
            "Summary": "Valiant Laboratories Limited submitted its monitoring agency report for the quarter ended September 30, 2025, confirming appropriate utilization of funds raised through its rights issue. India Ratings and Research Private Limited, serving as the monitoring agency, reported no deviation from the stated objects of the rights issue. The company raised funds through 1,08,62,500 rights issue equity shares at INR 75 per share with a face value of INR 10 each. The proceeds were utilized for adjustment of unsecured loans of promoter/promoter group (INR 5,800.51 lakhs), repayment of outstanding loans of existing promoters (INR 139.51 lakhs), capital expenditure (INR 1,956.48 lakhs), general corporate purposes (INR 1,674.22 lakhs), and issue-related expenses (INR 70.00 lakhs). The report was reviewed by the Audit Committee and Board of Directors. Unutilized funds totaling INR 270.00 lakhs were deployed in fixed deposits with banks.",
            "Sentiment": "neutral",
            "PublishDate": 1762888291077,
            "Source": "corporate_action"
        },
        {
            "Title": "Valiant Laboratories Reports Net Profit of Rs 270.37 Lakh in Q2 FY2026",
            "Summary": "Valiant Laboratories Limited announced its audited financial results for the quarter and half-year ended September 30, 2025. The company reported a standalone net profit of Rs 270.37 lakh for Q2, compared to a net loss of Rs 609.05 lakh in the same quarter last year. Revenue from operations increased to Rs 4,598.77 lakh in Q2 from Rs 2,147.90 lakh in the previous year quarter. For the half-year period, the company achieved a net profit of Rs 161.32 lakh versus a loss of Rs 1,016.07 lakh in the corresponding period last year. The consolidated results showed similar improvement with Q2 net profit of Rs 270.52 lakh compared to a loss of Rs 607.02 lakh in the previous year. The company operates in the chemicals manufacturing business and has one subsidiary, Valiant Advanced Sciences Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762885642725,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Laboratories Subsidiary Begins Production at New Gujarat Facility",
            "Summary": "Valiant Laboratories' subsidiary has commenced production at a new manufacturing facility in Gujarat. The facility focuses on producing acetic anhydride and was funded using proceeds from the company's IPO.",
            "Sentiment": "positive",
            "PublishDate": 1762499902472,
            "Source": "stock"
        },
        {
            "Title": "Valiant Laboratories Receives GST Show-Cause Notice for ₹70.81 Lakhs",
            "Summary": "Valiant Laboratories Limited received a show-cause notice from the Assistant Commissioner of CGST & Central Excise, Division-IV, Navi Mumbai Commissionerate. The notice relates to alleged wrong availment of Input Tax Credit on capital goods during the tax period April 2021 to March 2022. The notice proposes disallowance of ITC of ₹64.37 lakhs along with penalty, totaling approximately ₹70.81 lakhs. The company is evaluating appropriate representations regarding the matter.",
            "Sentiment": "negative",
            "PublishDate": 1759236227858,
            "Source": "stock"
        },
        {
            "Title": "Valiant Laboratories Announces Key Management Changes and Auditor Appointment",
            "Summary": "Valiant Laboratories Ltd announced management changes approved at their 4th Annual General Meeting held on September 25, 2025. The company re-appointed Mr. Santosh Vora as Managing Director, who was liable to retire by rotation. Mr. Paresh Shah's designation was changed from Executive Director & CFO to Whole-Time Director & CFO, with approval of his remuneration. The company also appointed M/s. Mehta & Mehta as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30. Mr. Paresh Shah holds a chemical engineering degree and has over 35 years of industry experience, overseeing factory operations and financial activities. Mr. Santosh Vora, the Managing Director, has a commerce degree and over 8 years of experience in chemical and pharmaceutical industry. Both directors confirmed they are not debarred from capital markets by SEBI or other authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1758803979235,
            "Source": "corporate_governance"
        },
        {
            "Title": "Valiant Laboratories Approves Executive Changes and Auditor Appointment",
            "Summary": "Valiant Laboratories Limited's board approved two key decisions during its August 8, 2025 meeting. The company changed Mr. Paresh Shah's designation from Executive Director to Whole-time Director and Key Managerial Personnel for a five-year term from September 25, 2025 to September 24, 2030. Mr. Shah, a Chemical Engineer with over 35 years of industry experience, oversees factory operations, legal matters, and financial activities including budgeting and project financing. Additionally, the board appointed M/s. Mehta & Mehta as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30. Mehta & Mehta is a Mumbai-based firm with over 25 years of experience specializing in secretarial audit and corporate compliance services. Both appointments are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1754656082429,
            "Source": "corporate_governance"
        },
        {
            "Title": "Valiant Laboratories Reports Q1 FY2026 Results with Standalone Net Profit of ₹181.57 Lakhs",
            "Summary": "Valiant Laboratories Limited announced its audited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹5,100.73 lakhs compared to ₹1,888.42 lakhs in the same quarter last year. Standalone net profit reached ₹181.57 lakhs versus a loss of ₹100.56 lakhs in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations was ₹4,682.27 lakhs against ₹1,888.42 lakhs in Q1 FY2025, with consolidated net profit of ₹182.09 lakhs compared to a loss of ₹50.93 lakhs in the year-ago period. Basic earnings per share improved to ₹0.42 from negative ₹0.23 in the standalone results. The company operates in the chemicals manufacturing business as a single segment entity. The consolidated results include subsidiary Valiant Advanced Sciences Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754653129124,
            "Source": "earnings"
        },
        {
            "Title": "Valiant Lab Announces Rights Issue at 75 Rupees Per Share",
            "Summary": "Valiant Lab has set the price for its rights issue at 75 rupees per share. The company has established an entitlement ratio of 1:4 for the rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1752583505000,
            "Source": "default"
        },
        {
            "Title": "Valiant Laboratories Reports Improved Q4 Financial Results",
            "Summary": "Valiant Laboratories has reported its Q4 financial results. The company's EBITDA improved to 38.3 million rupees, compared to a loss of 45.3 million rupees in the same quarter last year. Revenue increased to 577.9 million rupees from 305.9 million rupees year-over-year. The consolidated net profit for Q4 was 7.04 million rupees, compared to a loss of 12.4 million rupees in the previous year and a profit of 23.5 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747757829000,
            "Source": "result"
        }
    ]
}