{
    "Symbol": "VARDMNPOLY",
    "ISIN": "INE835A01029",
    "News": [
        {
            "Title": "Axis Bank Sets Record Date for Dividend Payment",
            "Summary": "Axis Bank Limited has declared January 31, 2025 as the record date for dividend payment under Regulation 42, with shareholders eligible to receive dividends on their holdings.",
            "Sentiment": "positive",
            "PublishDate": 1769147387540,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vardhman Polytex seeks shareholder approval for new ID",
            "Summary": "Vardhman Polytex Limited initiates postal ballot process for appointing Shubham Jain as Independent Director, with e-voting period from January 24 to February 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769083642315,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Polytex Reports ₹29.67 Cr Default on Loans",
            "Summary": "Vardhman Polytex Limited disclosed ₹29.67 crores in loan defaults out of ₹55.67 crores total outstanding as on December 31, 2025, under SEBI compliance requirements.",
            "Sentiment": "negative",
            "PublishDate": 1767763313707,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Polytex Limited Appoints New Independent Director as Sagar Bhatia Resigns",
            "Summary": "Vardhman Polytex Limited's board appointed Mr. Shubham Jain as Additional Non-Executive Independent Director for a 5-year term, while Mr. Sagar Bhatia resigned from his Independent Director position due to other professional commitments. The changes in board composition require shareholder approval for the new appointment and affect the company's governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764833983050,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Polytex Fully Utilizes Funds from Rights and Preferential Issues",
            "Summary": "Vardhman Polytex Limited announced that funds raised through Rights Issue in October 2024 and Preferential Issue in March 2025 have been completely utilized by quarter ended 31st March 2025. The company stated that deviation statement submission under SEBI LODR Regulation 32 is not applicable for quarter ended 30 September 2025 due to full fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1763119612264,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Polytex Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "Vardhman Polytex Limited's board approved unaudited financial results for the quarter and half-year ended September 30, 2025, showing a net profit before tax of Rs. 665.38 lakhs for the half-year compared to a loss of Rs. 1,012.44 lakhs in the previous year. The company's cash flow from operating activities remained negative at Rs. 591.73 lakhs, primarily due to increased inventory levels, while total assets stood at Rs. 28,605.27 lakhs with negative equity of Rs. 22,059.90 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1763118425257,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Polytex Completes Full Utilization of Rights and Preferential Issue Funds",
            "Summary": "Vardhman Polytex Limited announced complete utilization of funds raised through a Rights Issue in October 2024 and Preferential Issue in March 2025, as of the quarter ended March 31, 2025. The company will stop submitting Statement of Deviation/Variation for fund usage from the quarter ending June 30, 2025 onwards. The Audit Committee has taken note of this development.",
            "Sentiment": "positive",
            "PublishDate": 1755092720563,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Polytex Reports Quarterly Financial Results for June 2025",
            "Summary": "Vardhman Polytex Limited's board approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 13, 2025. The company submitted these results along with a Limited Review Report. The board meeting commenced at 03:30 PM and concluded at 04:30 PM. The financial statements were prepared in accordance with Indian Accounting Standard 34 and reviewed by Romesh K. Aggarwal & Associates, Chartered Accountants, who provided an independent auditor's review report confirming compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755086144678,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Polytex Closes Ludhiana Manufacturing Unit, Explores Real Estate Potential",
            "Summary": "Vardhman Polytex has announced the closure of operations at its manufacturing unit in Ludhiana. The company is now planning to explore the real estate potential of the land associated with this unit.",
            "Sentiment": "neutral",
            "PublishDate": 1741586025000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Polytex Approves Rights Issue and Warrant Issuance",
            "Summary": "Vardhman Polytex has approved raising up to 1.20 billion rupees through a rights issue of shares. Additionally, the company plans to issue warrants worth up to 909.2 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734528893000,
            "Source": "corporate_action"
        }
    ]
}