{
    "Symbol": "VARROC",
    "ISIN": "INE665L01035",
    "News": [
        {
            "Title": "Varroc Engineering Q3 EBITDA Grows 12.9% YoY",
            "Summary": "Varroc Engineering reported Q3 EBITDA of ₹2.10 billion, up from ₹1.86 billion year-on-year, with EBITDA margin improving to 9.20% from 8.96% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770283418161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varroc Engineering Wins ₹4.39 Billion EV Contract",
            "Summary": "Varroc Engineering secures major contract with global electric vehicle manufacturer, with projected annual business worth ₹4.39 billion at full capacity, strengthening its position in the EV market.",
            "Sentiment": "positive",
            "PublishDate": 1770120414853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varroc Engineering Issues Rs 50 Cr Commercial Paper",
            "Summary": "Varroc Engineering Limited has issued and allotted commercial paper worth Rs 50 crores to Kotak Mahindra Bank Limited with 30-day tenure at 7.20% discount rate, seeking NSE listing approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769602896696,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varroc Engineering clarifies NCD partial redemption",
            "Summary": "Varroc Engineering responds to BSE query on Non-Convertible Debentures partial redemption process, confirming face value reduction method while maintaining unchanged NCD count of 25,000 units.",
            "Sentiment": "neutral",
            "PublishDate": 1769513137332,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varroc Engineering Redeems Rs. 50 Crore Commercial Papers",
            "Summary": "Varroc Engineering Limited has successfully redeemed Commercial Papers worth Rs. 50 Crore issued to Kotak Mahindra Bank Limited on January 27, 2026, fulfilling its payment obligations under SEBI operational guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1769507470157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varroc Engineering Implements VRS for 411 Workmen",
            "Summary": "Varroc Engineering Limited announces implementation of Voluntary Retirement Scheme with 411 accepted applications out of 432 received, involving total payout of approximately ₹79.94 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768562624350,
            "Source": "stocks"
        },
        {
            "Title": "Varroc Engineering Reports No Fund Raising in Q3FY26",
            "Summary": "Varroc Engineering Limited confirms no fund-raising activity during Q3FY26 quarter ended December 31, 2025, with no deviation in utilization of previously raised ₹50 crore commercial paper proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1767332862211,
            "Source": "stocks"
        },
        {
            "Title": "Varroc Engineering Pays ₹19.64 Cr Interest & Principal",
            "Summary": "Varroc Engineering Limited has paid ₹19.64 crores comprising ₹15.63 crores principal and ₹4.02 crores interest on its Non-Convertible Securities for Q3FY26, maintaining compliance with debt obligations.",
            "Sentiment": "positive",
            "PublishDate": 1767261761535,
            "Source": "stocks"
        },
        {
            "Title": "Varroc Engineering Reports Q2 FY26 Results with Revenue Growth Despite Auditor Qualification",
            "Summary": "Varroc Engineering Limited reported unaudited quarterly results for September 30, 2025, with standalone revenue from operations of Rs. 20,378.56 million and profit after tax of Rs. 676.54 million. The auditors issued a qualified opinion due to a settlement offer from an overseas party regarding Rs. 209.89 million income recognized in the previous quarter, while the company faces arbitration claims of US$ 66.41 million from OPmobility Lighting Holding.",
            "Sentiment": "neutral",
            "PublishDate": 1764938426824,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Makes Timely Payment on Listed Debentures",
            "Summary": "Varroc Engineering Limited completed quarterly interest payment of Rs. 4.02 crores and partial principal redemption of Rs. 15.63 crores on its non-convertible debentures, with payments made on December 5, 2025, ahead of the December 7 due date. The company maintains Rs. 171.88 crores in outstanding debenture amount after the partial redemption, with payments made to ICICI Prudential Credit Risk Fund.",
            "Sentiment": "positive",
            "PublishDate": 1764926110731,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Shares Investor Presentation Ahead of November 28 Meet",
            "Summary": "Varroc Engineering Limited submitted an investor presentation to stock exchanges for its scheduled investor meet on November 28, 2025. The presentation showcases the company's transformation into a global auto technology group with revenue of USD 954 million, highlighting its diversified portfolio across E-mobility solutions, lighting, electronics, and powertrain systems for leading OEMs.",
            "Sentiment": "neutral",
            "PublishDate": 1764229986619,
            "Source": "stock"
        },
        {
            "Title": "HDFC Mutual Fund Increases Stake in Varroc Engineering to 7.21%",
            "Summary": "HDFC Mutual Fund increased its shareholding in Varroc Engineering Limited by 2.18% through open market purchases, bringing total holding to 7.21% as of November 21, 2025. The acquisition involved 33,34,601 shares, with the fund's aggregate holding now standing at 1,10,16,797 shares out of the company's paid-up equity capital of Rs. 15,27,86,400.",
            "Sentiment": "neutral",
            "PublishDate": 1763988328050,
            "Source": "stock"
        },
        {
            "Title": "Varroc Engineering Secures High Voltage Electronics Contract for E-Powertrain Components",
            "Summary": "Varroc Engineering has secured a significant contract to supply high voltage electronics for e-powertrain parts to an electric vehicle manufacturer. The deal positions the company in the growing electric vehicle components market, though financial terms and timeline details were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1763960819433,
            "Source": "stock"
        },
        {
            "Title": "Varroc Engineering Fully Redeems Rs. 50 Crore Commercial Papers",
            "Summary": "Varroc Engineering Limited has successfully fulfilled its payment obligation and fully redeemed Commercial Papers worth Rs. 50 Crore issued to Kotak Mahindra Bank Limited on November 20, 2025. The redemption was completed on the maturity date, with the company notifying stock exchanges NSE and BSE about the completion of this debt obligation.",
            "Sentiment": "positive",
            "PublishDate": 1763630743851,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Reports 6.1% Revenue Growth Despite Rare-Earth Supply Disruptions",
            "Summary": "Varroc Engineering achieved consolidated revenue of INR 22.7 billion with 6.1% year-on-year growth in Q2 FY26, though rare-earth magnet supply issues cost INR 750 million in potential revenue. The company significantly reduced net debt by INR 3,680 million and secured new business wins worth INR 8,928 million in annualized peak revenue, with 63% from EV customers.",
            "Sentiment": "positive",
            "PublishDate": 1763385233865,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Seeks Shareholder Approval for New Whole-Time Director Appointment",
            "Summary": "Varroc Engineering Limited has issued a postal ballot notice seeking shareholder approval to appoint Avinash Ramdas Chintawar as Director and Whole-Time Director for three years from November 12, 2025 to November 11, 2028. The appointment includes remuneration terms with basic salary ranging from Rs. 7.75 lakh to Rs. 11.50 lakh per month, along with allowances and variable pay components, with total annual remuneration capped at Rs. 5 crore per financial year.",
            "Sentiment": "positive",
            "PublishDate": 1763046356234,
            "Source": "corporate_governance"
        },
        {
            "Title": "Varroc Engineering Maintains Required Security Cover for Non-Convertible Debentures",
            "Summary": "Varroc Engineering Limited disclosed its asset cover certificate for secured non-convertible debentures worth Rs 250 crore for the quarter ended September 30, 2025. The company's NCDs are secured by exclusive charge on specific movable fixed assets, with asset cover exceeding the required 1.10 times as specified in the Debenture Trust Deed. Independent auditors SRBC & CO LLP confirmed the company maintained the mandatory 110% security cover and that book values of assets align with underlying financial records. The auditors noted a qualification regarding Rs 209.89 million income recognition dispute with an overseas party from the previous quarter, where resolution remains pending.",
            "Sentiment": "neutral",
            "PublishDate": 1763001440714,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Reports Q2 FY26 Results and Appoints New Whole-Time Director",
            "Summary": "Varroc Engineering Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board approved standalone revenue from operations of Rs. 20,378.56 million for Q2 and Rs. 40,857.13 million for H1. Consolidated revenue stood at Rs. 22,073.38 million for Q2 and Rs. 42,348.89 million for H1. The company reported standalone profit after tax of Rs. 676.54 million for Q2 and Rs. 1,246.92 million for H1. Consolidated profit after tax was Rs. 632.63 million for Q2 and Rs. 1,706.83 million for H1. The auditors included a qualification regarding a settlement offer from an overseas party alleging breach of agreement related to Rs. 209.89 million income recognized in the previous quarter. Additionally, the Board appointed Mr. Avinash Ramdas Chintawar as Additional Director and Whole-Time Director effective November 12, 2025, subject to shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1762962100088,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Reports Higher Quarterly Profit and Revenue",
            "Summary": "Varroc Engineering reported consolidated net profit of 609 million rupees compared to 557 million rupees in the same quarter last year. The company's revenue increased to 22.1 billion rupees from 20.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762940876274,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering's Thailand Step-down Subsidiary Changes Name",
            "Summary": "Varroc Engineering Limited announced that its step-down subsidiary in Thailand has been renamed to Varroc (Thailand) Co., Ltd, effective October 20, 2025. The company received official extracts from Thailand's Department of Business Development, Ministry of Commerce confirming the name change.",
            "Sentiment": "neutral",
            "PublishDate": 1762806199154,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Clarifies NCD Partial Redemption Structure to BSE",
            "Summary": "Varroc Engineering Limited responded to BSE's inquiry regarding its Non-Convertible Debentures (ISIN: INE665L07040) redemption process. The company clarified that redemptions occur through partial face value reduction rather than early full redemption. The NCDs maintain 25,000 units with original face value of Rs. 1,00,000 per NCD. Following the September 7, 2025 partial redemption of Rs. 6,250 per NCD, the post-redemption face value stands at Rs. 75,000 per NCD. The final maturity date remains September 7, 2028, with interest payments continuing on outstanding face value as scheduled.",
            "Sentiment": "neutral",
            "PublishDate": 1761899674779,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Appoints Avinash Chintawar as Chief Operating Officer",
            "Summary": "Varroc Engineering Limited appointed Avinash Chintawar as Chief Operating Officer effective October 15, 2025. Chintawar will oversee the Operations Vertical within Business I, focusing on strengthening efficiencies, enhancing performance, and ensuring alignment with the company's long-term strategic vision. He brings over four decades of experience in automotive and manufacturing sectors, having previously served as Managing Director of Bosch Chassis Systems India Pvt. Ltd. and Chairman of Bosch India Foundation. He holds a Bachelor of Engineering from Visvesvaraya National Institute of Technology and a Postgraduate Diploma in Management from IGNOU. Chintawar is not related to any directors or key managerial personnel of the company and holds no shares in Varroc Engineering.",
            "Sentiment": "positive",
            "PublishDate": 1760527183910,
            "Source": "corporate_governance"
        },
        {
            "Title": "Varroc Engineering Pays Rs 20.03 Crore in Interest and Principal on Non-Convertible Securities",
            "Summary": "Varroc Engineering Limited made payments totaling Rs 20.03 crore on its Non-Convertible Securities during the quarter ended September 30, 2025. The company paid Rs 4.40 crore as interest and Rs 15.63 crore as principal on September 4, 2025, for securities with ISIN INE665L07040. These securities carry a coupon rate of 8.60% per annum with quarterly payment frequency. The securities were originally issued for Rs 250 crore on September 7, 2023, with a maturity date of September 7, 2028, and currently have Rs 187.50 crore outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1759494192698,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering's Bulgarian Subsidiary Deregistered",
            "Summary": "Varroc Lighting Systems Bulgaria EOOD, a step-down subsidiary of Varroc Engineering Limited, has been deregistered and ceased to exist as a legal entity effective October 2, 2025. The subsidiary was incorporated under Bulgarian laws and registered with the Bulgarian Commercial Registrar. The entity had nil turnover, revenue, income and net worth for Financial Year 2024-25. Varroc Engineering informed stock exchanges NSE and BSE about the deregistration under applicable listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1759493862236,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Announces Rs 19.64 Crore Interest and Principal Payment Due December 2025",
            "Summary": "Varroc Engineering Limited disclosed details of upcoming payment obligations for its Non-Convertible Debentures. The company will pay interest of Rs 4.02 crore and principal of Rs 15.63 crore on December 5, 2025, for debentures with ISIN INE665L07040. The debentures carry an 8.60% annual coupon rate with quarterly payment frequency. The original issuance amount was Rs 250 crore, with current outstanding amount of Rs 171.88 crore after redemption. The debentures were issued on September 7, 2023, and mature on September 7, 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1756981940616,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Lists Rs. 50 Crore Commercial Papers on NSE",
            "Summary": "Varroc Engineering Limited has listed commercial papers worth Rs. 50 crores on the National Stock Exchange of India Limited. The commercial papers were issued on August 22, 2025 and listed on August 25, 2025. The debt securities have a 90-day tenure with a redemption date of November 20, 2025. The issue was subscribed by Kotak Mahindra Bank Limited at a discount rate of 6.90%. Each security has a face value of Rs. 5,00,000 with an issue price of Rs. 4,91,635.5, totaling 1000 units. ICICI Bank Limited serves as the Issue and Paying Agent. The record date for redemption payment is November 19, 2025, with the redemption amount of Rs. 50 crores due on November 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756120913899,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Raises Rs. 50 Crores Through Commercial Paper Issuance to Kotak Mahindra Bank",
            "Summary": "Varroc Engineering Limited has issued and allotted commercial paper worth Rs. 50 crores to Kotak Mahindra Bank Limited. The commercial paper carries a face value of Rs. 5,00,000 per unit with an issue price of Rs. 4,91,635.5 per unit, comprising 1000 units in total. The instrument offers a discount rate of 6.90% with a 90-day tenure, maturing on November 20, 2025. ICICI Bank Limited serves as the Issue and Paying Agent. The company is pursuing listing of the commercial paper on the National Stock Exchange of India Limited and is awaiting listing approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755872333328,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Redeems Rs. 50 Crore Commercial Papers to Kotak Mahindra Bank",
            "Summary": "Varroc Engineering Limited has fully redeemed Commercial Papers worth Rs. 50 crore issued to Kotak Mahindra Bank Limited. The payment was made on the maturity date of August 19, 2025, fulfilling the company's payment obligation. The Commercial Papers were originally issued on May 21, 2025, with ISIN INE665L14418. The company informed stock exchanges NSE and BSE about the successful redemption.",
            "Sentiment": "positive",
            "PublishDate": 1755596982601,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Reports 6.8% Revenue Growth with Strong EV Business Expansion",
            "Summary": "Varroc Engineering Limited reported consolidated revenue of INR 2,028 crores for the quarter ended June 30, 2025, marking a 6.8% year-over-year growth. The auto components manufacturer improved its EBITDA margin to 9.5% from 9.1% in the same quarter last year, while PBT increased to 4.1% of revenue from 2.8% previously. The company significantly reduced net debt by INR 300 crores to INR 448 crores, bringing the net debt to equity ratio to 0.3x. Revenue from EV customers doubled to 11% of total revenue compared to 5% in the previous year. India operations grew 7.2% year-over-year, outperforming overall market growth. The company secured new order wins with annualized peak revenue potential of INR 291 crores, with 67% coming from 2-wheeler and 3-wheeler segments. Varroc filed 10 new patents during the quarter and increased renewable energy sourcing to nearly 50% of total energy consumption. The company can supply INR 30,000 to INR 35,000 worth of content per 2-wheeler EV and INR 35,000 to INR 40,000 for 3-wheeler EVs. Management expects to reduce debt by another INR 100-150 crores by the end of the fiscal year while planning INR 150 crores investment for land acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1754889686286,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Reports No Deviation in Rs 50 Crore Commercial Paper Fund Utilization",
            "Summary": "Varroc Engineering Limited confirmed that it fully utilized Rs 50 crore raised through Commercial Paper during the quarter ended June 30, 2025, with no deviation from the purposes stated in its offer document. The Commercial Paper was allotted on May 21, 2025. The company reported no other fund-raising activities during the quarter. This confirmation was submitted to stock exchanges as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754562956591,
            "Source": "stock"
        },
        {
            "Title": "Varroc Engineering Reports 6.8% Revenue Growth and 54% Jump in PBT for Q1 FY26",
            "Summary": "Varroc Engineering Limited reported consolidated revenue of Rs. 20,276 million for Q1 FY26, marking a 6.8% year-on-year growth with India operations growing 7.2%. The company's profit before tax (before exceptional items and JV profit) increased 54% to Rs. 822 million, representing 4.1% of revenue compared to 2.8% in Q1 FY25. EBITDA improved to 9.5% from 9.1% on a year-on-year basis. Net debt was reduced by Rs. 3,002 million to Rs. 4,478 million, bringing the net debt-to-equity ratio below 0.3x. The company secured new business wins with annualized peak revenues of Rs. 2,905 million and received Rs. 3,400 million consideration from the sale of its China JV stake in May 2025. Revenue from EV customers accounted for 11% of total revenue. The automotive industry showed moderate growth across segments with 2W growing 0.7%, 3W growing 9.8%, PV growing 3.4%, and CV growing 2.6% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1754561725102,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Reports Strong Q1 Performance with 8.7% Revenue Growth Despite Overseas Settlement Dispute",
            "Summary": "Varroc Engineering Limited reported quarterly results with revenue from operations reaching Rs. 18,428.87 million compared to Rs. 16,946.21 million in the same quarter last year, marking an 8.7% increase. The company's profit for the period stood at Rs. 866.28 million versus Rs. 451.11 million in the previous year quarter. Earnings per share improved to Rs. 5.67 from Rs. 2.95. However, the company faces a settlement offer from an overseas party alleging breach of agreement regarding Rs. 209.89 million in revenue recognized during the current quarter. Additionally, Varroc is dealing with an arbitration case initiated by OPmobility Lighting Holding, France, claiming US$ 66.41 million plus legal costs for alleged covenant breaches. The company has also received GST orders totaling Rs. 629 million in dues along with penalties and interest, against which it has initiated appellate proceedings. On the operational front, the company completed the merger of its wholly-owned subsidiary Varroc Polymers Limited, which became effective in February 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754560578320,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Reports Strong Q1 Performance with Revenue Growth and Tripled Net Profit",
            "Summary": "Varroc Engineering delivered robust quarterly results with revenue increasing to 20 billion rupees from 18.98 billion rupees year-over-year. The company's EBITDA grew to 1.94 billion rupees compared to 1.74 billion rupees in the same period last year, while EBITDA margin improved to 9.6% from 9.2%. Consolidated net profit showed significant growth, rising to 1 billion rupees from 324 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754558999849,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Schedules Board Meeting on August 7, 2025 for Quarterly Results",
            "Summary": "Varroc Engineering Limited has scheduled a Board of Directors meeting on August 7, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The meeting will review both standalone and consolidated results. The company's trading window for securities remains closed from July 1, 2025 through August 9, 2025, extending 48 hours after the financial results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1753954732900,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Appoints Padmanabh Sinha as Independent Director",
            "Summary": "Varroc Engineering has appointed Mr. Padmanabh Sinha as an Independent Director. The news highlights that Mr. Sinha has previously held key roles at NIIF (National Investment and Infrastructure Fund), Temasek, and Tata Opportunities Fund.",
            "Sentiment": "neutral",
            "PublishDate": 1752839407000,
            "Source": "default"
        },
        {
            "Title": "Varroc Engineering Faces $66.4 Million Arbitration Claim",
            "Summary": "Varroc Engineering has received an arbitration request from Opmobility Lighting Holding. The claim quantum is reported to be $66.4 million, plus additional legal costs. The nature of the dispute and the specific reasons for the arbitration request were not provided in the given information.",
            "Sentiment": "negative",
            "PublishDate": 1752019629000,
            "Source": "default"
        },
        {
            "Title": "Varroc Engineering: Q4 Profit Plunges 63% Amid Rising Expenses",
            "Summary": "Varroc Engineering reported a 63.2% drop in Q4 net profit to ₹21 crore. Revenue increased 6.3% to ₹2,099.2 crore. EBITDA margin contracted to 10.56% from 11.18%. The board recommended a dividend of ₹1 per share. The company remains confident about long-term automotive industry growth despite global uncertainties.",
            "Sentiment": "negative",
            "PublishDate": 1748513103000,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Reports Q4 Financial Results",
            "Summary": "Varroc Engineering has released its Q4 financial results. The company's EBITDA remained stable at 2.2 billion rupees compared to the same period last year. However, the EBITDA margin decreased from 11.19% to 10.5% year-over-year. The company reported an exceptional item of 564 million rupees for Q4. Profit Before Tax (PBT) increased to 1.03 billion rupees from 998 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748509922000,
            "Source": "result"
        },
        {
            "Title": "Varroc Engineering Reports Q4 Net Profit of 206 Million Rupees",
            "Summary": "Varroc Engineering has reported a consolidated net profit of 206 million rupees for the fourth quarter, compared to 569 million rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1748509681000,
            "Source": "result"
        },
        {
            "Title": "Varroc Engineering Receives Full Settlement of RMB 310.5 Million",
            "Summary": "Varroc Engineering has announced the receipt of the full settlement amount of RMB 310.5 million, which is equivalent to approximately 364 crore Indian Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746610550000,
            "Source": "default"
        },
        {
            "Title": "Varroc Engineering Ordered to Transfer JV Stake to Beste Motors",
            "Summary": "A British Virgin Islands (BVI) court has ordered Varroc Engineering to transfer its 50% stake in the joint venture Varroc TYC Corporation to Beste Motors. The transfer is valued at RMB 310.5 million (approximately INR 360 crore) and enforces an arbitration award from the International Chamber of Commerce (ICC) in Singapore.",
            "Sentiment": "negative",
            "PublishDate": 1744884213000,
            "Source": "default"
        },
        {
            "Title": "Varroc Engineering Reports Q3 EBITDA and Margin Results",
            "Summary": "Varroc Engineering has announced its Q3 financial results. The company's EBITDA increased to 1.86 billion rupees from 1.76 billion rupees year-over-year. However, the EBITDA margin decreased to 8.95% from 9.32% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739175863000,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Reports Q3 Revenue Growth",
            "Summary": "Varroc Engineering, an automotive component manufacturer, has reported a revenue of 20.7 billion rupees for the third quarter, compared to 18.8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739175850000,
            "Source": "earnings"
        },
        {
            "Title": "Varroc Engineering Reports Q3 Consolidated Net Loss",
            "Summary": "Varroc Engineering has reported a consolidated net loss of 374 million rupees for the third quarter, compared to a profit of 3.8 billion rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1739175775000,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Merger of Varroc Polymers with Varroc Engineering",
            "Summary": "Varroc Engineering has announced that the National Company Law Tribunal (NCLT) has approved the amalgamation of Varroc Polymers with the company. This merger is a significant corporate action that will likely streamline operations and potentially create synergies within the Varroc group.",
            "Sentiment": "positive",
            "PublishDate": 1736727677000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of Varroc Polymers with Varroc Engineering",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the amalgamation of Varroc Polymers with Varroc Engineering. This merger is a significant corporate action that will likely streamline operations and potentially create synergies within the Varroc group.",
            "Sentiment": "positive",
            "PublishDate": 1736515025000,
            "Source": "corporate_action"
        },
        {
            "Title": "Singapore Tribunal Orders Varroc Engineering's Unit to Transfer Stake in Joint Venture",
            "Summary": "A Singapore tribunal has issued an order in a matter involving Varroc Engineering and Beste Motors Co. The order requires Varroc Engineering's subsidiary to transfer a 50% stake in Varroc TYC Corp to Beste Motors for RMB 310.5 million (approximately Rs 357.075 crore).",
            "Sentiment": "neutral",
            "PublishDate": 1733917518000,
            "Source": "corporate_action"
        },
        {
            "Title": "Varroc Engineering Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Varroc Engineering Ltd shares occurred on the National Stock Exchange (NSE). Approximately 406,344 shares were traded at a price of Rs. 529.60 per share, amounting to a total transaction value of Rs. 21.52 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1733722148000,
            "Source": "block_deals"
        },
        {
            "Title": "Varroc Engineering Reports Q2 Financial Results",
            "Summary": "Varroc Engineering announced its Q2 financial results. The company's EBITDA increased to 2.08 billion rupees, up from 1.94 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 10% from 10.3% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731489465000,
            "Source": "result"
        },
        {
            "Title": "Varroc Engineering Reports Q2 Revenue Growth",
            "Summary": "Varroc Engineering has reported a revenue of 20.8 billion rupees for the second quarter, compared to 18.9 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731489387000,
            "Source": "result"
        }
    ]
}