{
    "Symbol": "VASCONEQ",
    "ISIN": "INE893I01013",
    "News": [
        {
            "Title": "Vascon Engineers Q3FY26 Results Announced",
            "Summary": "Vascon Engineers Limited announced Q3FY26 quarterly results for quarter and nine months ended December 31, 2025 with board approval on February 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770662497844,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vascon Engineers Allots 23.80 Lakh Shares Under ESOS",
            "Summary": "Vascon Engineers Limited has allotted 23.80 lakh equity shares under its Employee Stock Option Scheme-2020, increasing paid-up share capital to ₹228.67 crores from ₹226.29 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765800266652,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vascon Engineers Wins ₹260.09 Cr Hospital Order",
            "Summary": "Vascon Engineers Limited secured a ₹260.09 crore contract to construct a super specialty hospital in Navi Mumbai with a 36-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1765784818358,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI CAP Trustee Company Releases Pledged Shares of Vascon Engineers",
            "Summary": "SBI CAP Trustee Company Limited released 1,95,17,124 pledged shares of Vascon Engineers Limited, representing 8.624% of the company's total share capital, which were held as security for credit facilities. Following the release on November 28, 2025, SBI CAP Trustee's holding in Vascon Engineers reduced to zero from its previous 8.624% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1764829617593,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Promoters Release Pledge on 1.95 Crore Equity Shares",
            "Summary": "Vascon Engineers Limited promoters released pledge on 1,95,17,124 equity shares that were pledged with SBI CAP Trustee Company Limited as collateral for working capital facility. The de-pledge process with the trustee is currently in progress, affecting the promoter group's shareholding structure.",
            "Sentiment": "positive",
            "PublishDate": 1763551007215,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Reports 14% Revenue Growth in Q2 FY26, Signs Strategic MOU with Adani Limited",
            "Summary": "Vascon Engineers achieved consolidated income of INR 229 crores in Q2 FY26 with 14% year-on-year growth and profit after tax of INR 11 crores, despite weather-related execution delays. The company signed a 5-year strategic MOU with Adani Limited for early engagement on projects totaling 13 million square feet in Mumbai, expected to contribute 30% of annual turnover.",
            "Sentiment": "positive",
            "PublishDate": 1763468018438,
            "Source": "earnings"
        },
        {
            "Title": "Vascon Engineers Reports 13% Revenue Growth in Q2 and H1 FY26",
            "Summary": "Vascon Engineers Ltd. announced its unaudited results for the second quarter ended September 30, 2025. The company reported 13% revenue growth in both Q2 and H1 FY26. H1 FY26 PAT increased 70% to INR 33.90 crore from INR 19.91 crore in H1 FY25. EBITDA rose to INR 53.30 crore from INR 34.24 crore in H1 FY25. Q2 FY26 PAT was INR 11.43 crore compared to INR 10.31 crore in Q2 FY25, while EBITDA increased to INR 19.76 crore from INR 16.64 crore. The EPC segment delivered INR 431 crore in revenue during H1 FY26 with a gross profit margin of 13%. The company maintains a robust order book of INR 2,800 crore, which is 2.8 times their FY25 EPC revenues, with 74% comprising government projects. During H1 FY26, new orders worth INR 386 crore were secured. The real estate segment recorded new sales bookings of 64,541 square feet for INR 74 crore and collections of INR 88 crore. The company launched new projects including Tulip Phase 3 in Coimbatore, Tower of Ascend in Kharadi, and Orchids in Santacruz.",
            "Sentiment": "positive",
            "PublishDate": 1762941816164,
            "Source": "earnings"
        },
        {
            "Title": "Vascon Engineers Reports Q2 FY26 Results with Revenue Growth and Divestment Dispute",
            "Summary": "Vascon Engineers Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company operates in two segments: Engineering, Procurement and Construction (EPC) and Real Estate Development. The results were reviewed by the Audit Committee and approved by the Board of Directors. The auditors issued an unmodified limited review report but highlighted an emphasis of matter regarding the company's divestment of its entire shareholding in Almet Corporation Limited under a Share Transfer Agreement dated March 31, 2025. Due to a dispute among transferees, the agreement has been kept in abeyance and the matter is under review. The company had previously sold its investment in optionally convertible redeemable debentures of Ascent Hotels Private Limited for Rs 45 crores, generating a profit of Rs 17.50 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762804485602,
            "Source": "earnings"
        },
        {
            "Title": "Vascon Engineers Targets 20% Annual Growth with ₹2,800Cr Order Book and Adani Group Partnership",
            "Summary": "Vascon Engineers has provided guidance for 20% annual growth in EPC revenue and profit before tax, supported by its ₹2,800 crore order book and a memorandum of understanding with Adani Group. The company is targeting ₹1,500-2,000 crore in new EPC orders for FY26. The company's balance sheet shows net debt of ₹54 crore and has working capital support to handle ₹3,000 crore in additional orders. Vascon Engineers is focusing on real estate debt optimization and faster project completion to improve margins.",
            "Sentiment": "positive",
            "PublishDate": 1762787692909,
            "Source": "stock"
        },
        {
            "Title": "Vascon Engineers Reports Strong H1 FY26 Performance with Rs 2,800 Cr Order Book",
            "Summary": "Vascon Engineers Limited reported robust performance in H1 FY26 with total revenue of Rs 446.30 crores compared to Rs 395.82 crores in H1 FY25. The company maintains a healthy order book of Rs 2,800 crores, comprising Rs 2,411 crores in external EPC orders and Rs 389 crores in internal orders. Government projects constitute 74% of the order book, providing execution visibility and cash flow predictability. Net debt stood at Rs 54 crores as of September 30, 2025. The company received new orders worth Rs 386 crores from Royal Rides Private Limited and Saudamini Building MSEB HCL. Real estate segment recorded new sales bookings of 64,541 sq.ft. valued at Rs 74 crores with total collections of Rs 88 crores in H1 FY26. EBITDA margin improved to 11% in H1 FY26 from 8% in the previous year. The company entered into a Memorandum of Understanding with Adani Group as an execution partner and is undergoing de-pledge process for promoter shares with SBI approval received.",
            "Sentiment": "positive",
            "PublishDate": 1762784541769,
            "Source": "stock"
        },
        {
            "Title": "Vascon Engineers Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "Vascon Engineers reported quarterly results showing revenue growth to 2.26 billion rupees from 1.9 billion rupees year-over-year. Consolidated net profit increased to 114 million rupees from 103 million rupees. EBITDA rose to 159 million rupees from 144 million rupees, while EBITDA margin slightly declined to 7.1% from 7.18% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762763688534,
            "Source": "earnings"
        },
        {
            "Title": "Vascon Engineers Schedules Earnings Conference Call for Q2 H1 FY26 Results",
            "Summary": "Vascon Engineers Limited has scheduled an earnings conference call for investors and analysts on November 12, 2025 at 11:30 AM IST. The call will discuss the unaudited financial results and developments for the quarter and first half year ended September 30, 2025. The session will be represented by Dr. Santosh Sundararajan, Whole Time Director Group CEO, and Mr. Somnath Biswas, Chief Financial Officer. Dial-in details have been provided for various international locations including Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762462645483,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Secures ₹161.18 Crore Contract for Saudamini Building Redevelopment",
            "Summary": "Vascon Engineers Limited received an intent letter worth ₹161.18 crores from MSEB Holding for the redevelopment of the Saudamini building. The project is scheduled to be completed within 36 months.",
            "Sentiment": "positive",
            "PublishDate": 1759994764939,
            "Source": "stock"
        },
        {
            "Title": "Vascon Engineers Receives Shareholding Change Notification from Blue Daimond Properties",
            "Summary": "Vascon Engineers Limited received a disclosure notification from Blue Daimond Properties Private Limited regarding changes in shareholding under SEBI's Substantial Acquisition of Shares and Takeover Regulations. The company has disclosed this notification to BSE Limited and National Stock Exchange of India Limited. The notification was signed by Company Secretary and Compliance Officer Neelam Piyush Pipada.",
            "Sentiment": "neutral",
            "PublishDate": 1759317175566,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Signs MoU with Adani Infra for Strategic Partnership",
            "Summary": "Vascon Engineers has entered into a Memorandum of Understanding with Adani Infra. The company aims to engage with Adani Group on projects that would contribute an additional amount equivalent to 30% of Vascon's annual turnover.",
            "Sentiment": "positive",
            "PublishDate": 1759104697994,
            "Source": "order&deals"
        },
        {
            "Title": "Vascon Engineers Partners with Adani Infra for 5-Year Mumbai Projects Collaboration",
            "Summary": "Vascon Engineers Limited signed a memorandum of understanding with Adani Infra (India) Limited for a five-year collaboration as execution partner under an early engagement model. The partnership covers three identified Mumbai projects totaling approximately 13.15 million square feet, with Vascon participating from the design stage. The company targets this collaboration to contribute an additional 30% to its annual turnover. Vascon also launched Vascon Orchids, a luxury residential project in Santacruz West, Mumbai, marking its entry into the Mumbai market. The redevelopment project has an expected gross development value of ₹300 crore and will feature 62 sale units across three wings with 2 and 3BHK homes. Vascon Engineers shares closed down 5.39% at ₹57.89.",
            "Sentiment": "positive",
            "PublishDate": 1758894888516,
            "Source": "order&deals"
        },
        {
            "Title": "Vascon Engineers Partners with Adani Infra as Execution Partner in Five-Year Strategic Collaboration",
            "Summary": "Vascon Engineers Limited signed a Memorandum of Understanding with Adani Infra (India) Limited to serve as their Execution Partner under an Early Engagement Model for five years. The partnership involves collaboration on selected projects from the design stage to ensure seamless integration of design and execution. Three projects totaling approximately 13.15 million sq. ft. have been identified in Mumbai. Vascon aims to engage with Adani Group on projects that would contribute an additional 30% to Vascon's annual turnover. The collaboration is structured as a long-term strategic partnership with annual performance reviews.",
            "Sentiment": "positive",
            "PublishDate": 1758888892998,
            "Source": "order&deals"
        },
        {
            "Title": "Blue Daimond Properties Private Limited Makes Substantial Share Acquisition in Vascon Engineers Limited",
            "Summary": "Vascon Engineers Limited received a disclosure notification from Blue Daimond Properties Private Limited regarding a substantial acquisition of shares under SEBI regulations. The notification was submitted to BSE Limited and National Stock Exchange of India Limited on September 17th, 2025. The disclosure was made under Regulation 29(2) of the SEBI (Substantial Acquisition of Shares and Takeover) Regulations, 2011, and was signed by Neelam Piyush Pipada, Company Secretary and Compliance Officer of Vascon Engineers Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758110213923,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Surges 10% with Record Trading Volume, Up 11x from Pandemic Lows",
            "Summary": "Vascon Engineers shares gained nearly 10% in Tuesday's trading session, marking the fifth day of gains in six trading sessions. The stock recorded its highest trading volume in 15 years with over 4.5 crore shares changing hands, significantly above the 20-day average of 15 lakh shares. Despite being up over 10x from its Covid-19 low of ₹6, the stock still trades below its IPO price of ₹165 from February 2010. The company has not issued bonus shares or conducted stock splits. Promoters hold 31% stake as of June quarter, with market veteran Vallabh Bhanshali holding 1.01% and Barclays Wealth Trustees India holding 2.25%. The stock has gained nearly 30% in the past month and turned positive year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1758015178728,
            "Source": "stock"
        },
        {
            "Title": "Vascon Engineers Reports Strong Q1 FY26 Performance with Rs 2,902 Cr Order Book",
            "Summary": "Vascon Engineers Limited reported revenue from operations of Rs 220.91 crores in Q1 FY26, up from Rs 195.83 crores in Q1 FY25. The company's profit after tax increased significantly to Rs 21.93 crores compared to Rs 8.66 crores in the previous year quarter. EBITDA margin improved to 14% from 9% year-over-year. The company maintains a robust total order book of Rs 2,902 crores, with external EPC order book at Rs 2,469 crores, representing approximately 3 times of FY25 EPC revenues. Government projects now constitute 73% of the order book. The company received a new order worth Rs 217 crores from Royal Rides Private Limited. Net debt stood at Rs 34.82 crores as of June 30, 2025. In real estate, the company achieved new sales bookings of 40,539 sq. ft. with total sales value of Rs 55 crores and collections of Rs 65 crores during the quarter. The company operates across two main segments: Engineering Procurement & Construction (EPC) and Real Estate Development, with 38 years of experience and presence across 30+ locations in India.",
            "Sentiment": "positive",
            "PublishDate": 1754326256525,
            "Source": "stock"
        },
        {
            "Title": "Vascon Engineers Q1 Net Profit Surges 137% Despite Revenue Decline",
            "Summary": "Vascon Engineers reported Q1 consolidated net profit of 225 million rupees, significantly higher than 95 million rupees in the same period last year. However, the company's revenue declined to 2.2 billion rupees from 2.7 billion rupees year-over-year. EBITDA decreased to 130 million rupees from 160 million rupees, with EBITDA margin compressing to 5.9% from 8.13% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754299980358,
            "Source": "earnings"
        },
        {
            "Title": "Vascon Engineers Delays Subsidiary Share Transfer Due to Partner Dispute",
            "Summary": "Vascon Engineers Limited has postponed the share transfer of its wholly-owned subsidiary Almet Corporation Limited due to a dispute among partners of Ramanuj Venture. The company had arranged to transfer shares to partners Mr. Sanjay Phoke and Mr. Raju Rathod, but the third partner Mr. Gopal Agrawal was unavailable during execution due to illness. Mr. Agrawal has since raised concerns over the transfer and launched a complaint. The Share Transfer Agreement dated March 31, 2025 has been put on hold until the dispute is resolved. The company is reviewing the matter and will take appropriate steps to address the concerns raised.",
            "Sentiment": "negative",
            "PublishDate": 1754046610084,
            "Source": "stock"
        },
        {
            "Title": "Vascon Engineers Schedules Q1FY26 Earnings Call for August 6, 2025",
            "Summary": "Vascon Engineers Limited has scheduled an earnings conference call for investors and analysts on August 6, 2025, at 11:30 AM IST to discuss unaudited financial results for the quarter ended June 30, 2025. The call will be represented by Dr. Santosh Sundararajan, Whole Time Director & Group CEO, and Mr. Somnath Biswas, Chief Financial Officer. Dial-in details have been provided for participants across multiple countries including India, Hong Kong, Singapore, UK, and USA. The company operates across 30+ cities in India with over 37 years of experience, having delivered 225+ projects covering 50+ million square feet across commercial, residential, institutional, hospitality, healthcare, industrial, airport, IT park, and EPC segments.",
            "Sentiment": "neutral",
            "PublishDate": 1753790126864,
            "Source": "earnings"
        },
        {
            "Title": "Vascon Engineers Reports Strong Q4 Financial Performance",
            "Summary": "Vascon Engineers has reported significant year-over-year improvements in its Q4 financial results. The company's EBITDA increased to 375 million rupees from 176 million rupees in the previous year, with EBITDA margin expanding to 9.69% from 5.25%. Consolidated net profit rose to 348 million rupees from 168 million rupees year-over-year, but decreased from 756 million rupees quarter-over-quarter. Revenue for Q4 grew to 3.9 billion rupees from 2.3 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747229336000,
            "Source": "result"
        },
        {
            "Title": "Vascon Engineers: Secures Two Construction Orders Worth ₹310 Crore",
            "Summary": "Vascon Engineers won two construction orders totaling ₹310.89 crore. The first order, worth ₹85.43 crore, is for a commercial building in Pune. The second, valued at ₹225.46 crore, is for a ropeway project in Goa. Both projects have a three-year completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1745478677000,
            "Source": "order&deals"
        },
        {
            "Title": "Vascon Engineers Secures 85.43 Crore Rupee Order",
            "Summary": "Vascon Engineers has announced winning a new order valued at 85.43 crore rupees. This development represents a significant business opportunity for the company and could potentially boost its revenue and project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1745474028000,
            "Source": "default"
        },
        {
            "Title": "Vascon Engineers Secures 2.25 Billion Rupee Contract for Goa Ropeway Project",
            "Summary": "Vascon Engineers has received a Letter of Intent from Royal Rides Pvt Ltd for a project worth 2.25 billion rupees. The project involves the construction of two terminal buildings and ropeway tower works in Panaji and Reis Magos, Goa.",
            "Sentiment": "positive",
            "PublishDate": 1745453442000,
            "Source": "default"
        },
        {
            "Title": "Vascon Engineers: Secures Rs 225-Crore Ropeway Project in Goa",
            "Summary": "Vascon Engineers Ltd. has received a Rs 225.46 crore order from Royal Rides Pvt. for constructing two terminal buildings and ropeway towers in Goa. The project, to be completed within 36 months, includes site development work at Panaji and Reis Magos.",
            "Sentiment": "positive",
            "PublishDate": 1745416307000,
            "Source": "order&deals"
        },
        {
            "Title": "Vascon Engineers Secures 2.25 Billion Rupee Contract for Goa Ropeway Project",
            "Summary": "Vascon Engineers has received a Letter of Intent from Royal Rides Pvt Ltd for a project worth 2.25 billion rupees. The project involves the construction of two terminal buildings and ropeway tower works in Panaji and Reis Magos, Goa.",
            "Sentiment": "positive",
            "PublishDate": 1745412783000,
            "Source": "default"
        },
        {
            "Title": "Vascon Engineers to Sell Entire Stake in Marathwada Realtors",
            "Summary": "Vascon Engineers has announced the sale of its entire stake in Marathwada Realtors. As a result of this transaction, Marathwada Realtors will no longer be a unit of Vascon Engineers. The company is set to receive 187.2 million rupees from this sale.",
            "Sentiment": "neutral",
            "PublishDate": 1743167797000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Ltd: Stock Plummets 58% from 52-Week High",
            "Summary": "Vascon Engineers Ltd's stock has fallen 58% from its 52-week high of Rs 83.90 in July 2024. The company's shares are down over 35% in 2025, closing at Rs 34.37 on the National Stock Exchange last Thursday.",
            "Sentiment": "negative",
            "PublishDate": 1742175277000,
            "Source": "normal_news"
        },
        {
            "Title": "Vascon Engineers: Targets Rs 1,200 Crore Orders in FY26",
            "Summary": "Vascon Engineers aims for orders worth Rs 1,200 crore in FY26, revising FY25 target to Rs 1,000 crore. Current order book stands at Rs 2,800 crore with additional projects pending LoI. The company plans to focus on Mumbai and Pune markets.",
            "Sentiment": "positive",
            "PublishDate": 1741917821000,
            "Source": "normal_news"
        },
        {
            "Title": "Vascon Engineers Ltd: Enters Mumbai with ₹300-Crore Luxury Project",
            "Summary": "Vascon Engineers Ltd launches 'Vascon Orchids,' a luxury residential redevelopment project in Santacruz West, Mumbai, with an expected Gross Development Value of ₹300 crore. The project will offer 62 units of 2 and 3 BHK homes across three wings, targeting the city's ₹30,000 crore redevelopment market.",
            "Sentiment": "positive",
            "PublishDate": 1741666105000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Launches Redevelopment Project in Mumbai",
            "Summary": "Vascon Engineers has announced its entry into the Mumbai market with a redevelopment project. The project is expected to have a Gross Development Value (GDV) of 300 crore rupees, marking a significant expansion for the company into one of India's prime real estate markets.",
            "Sentiment": "positive",
            "PublishDate": 1741587278000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Vascon Engineers has announced its financial results for the third quarter, reporting a consolidated net profit of 758 million rupees. This represents a substantial increase from the 186 million rupees reported in the same period last year, indicating a strong year-over-year growth in the company's profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737965768000,
            "Source": "earnings"
        },
        {
            "Title": "Vascon Engineers Focuses on High-Value Government and Private Contracts",
            "Summary": "Vascon Engineers has announced its strategic focus on securing large and high-value civil contracts from government agencies and reputable private companies, as revealed in their investor presentation. This move suggests the company is aiming to strengthen its project portfolio and potentially increase its revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1730214698000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vascon Engineers Reports Improved Q2 EBITDA and Margin",
            "Summary": "Vascon Engineers has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 73 million rupees to 143.5 million rupees. Additionally, the EBITDA margin expanded from 4.57% to 7.18%.",
            "Sentiment": "positive",
            "PublishDate": 1730187499000,
            "Source": "result"
        },
        {
            "Title": "Vascon Engineers: Secures Rs 57.22 Crore Mumbai Metro Contract",
            "Summary": "<p><span class=\"positive\">Vascon Engineers</span> has received a <span class=\"positive\">Letter of Acceptance</span> for a <b>Rs 57.22 crore</b> contract from <span class=\"neutral\">Mumbai Metro Rail Corporation</span>. The project involves <span class=\"neutral\">constructing a commercial building</span> at <span class=\"neutral\">Kalbadevi</span> for <span class=\"positive\">rehabilitating</span> Metro Line 2/3 Project Affected Persons.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728891360000,
            "Source": "normal_news"
        },
        {
            "Title": "Vascon Engineers Divests Stake in GMP Technical Solutions",
            "Summary": "<p>Vascon Engineers has completed the <span class='neutral'>disinvestment</span> of its entire <span class='positive'>100% equity stake</span> in GMP Technical Solutions Private Limited. The <span class='neutral'>transaction</span> was <span class='positive'>valued at Rs. 157.36 crore</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728548942000,
            "Source": "corporate_action"
        }
    ]
}