{
    "Symbol": "VASWANI",
    "ISIN": "INE590L01019",
    "News": [
        {
            "Title": "Vaswani Industries Board Approves Re-appointment of Whole-Time Director and Multiple Remuneration Revisions",
            "Summary": "Vaswani Industries Limited's Board approved the re-appointment of Mr. Yashwant Vaswani as Whole-Time Director for five years from December 10, 2025 to December 9, 2030, along with remuneration revision. The Board also approved a Postal Ballot Notice seeking shareholder approval for remuneration revisions of six key executives including CEO Mr. Kushal Vaswani and other family members holding offices of profit.",
            "Sentiment": "neutral",
            "PublishDate": 1765297144277,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vaswani Industries Receives Synchronization Permission for 50 MWp Solar Power Project in Chhattisgarh",
            "Summary": "Vaswani Industries Limited has received permission for synchronization and parallel running of its 50 MWp-DC solar power plant at Mohbhatta, District Bemetara, Chhattisgarh from CSPTCL on December 2, 2025. The company expects to commence power generation within seven days, subject to successful synchronization with the CSPTCL grid, marking a significant milestone in its renewable energy operations.",
            "Sentiment": "positive",
            "PublishDate": 1764860982809,
            "Source": "stock"
        },
        {
            "Title": "Vaswani Industries Receives Approval for Additional MS Billet Capacity Expansion",
            "Summary": "Vaswani Industries has obtained approval to add 1,05,000 tonnes per annum of MS (Mild Steel) billet manufacturing capacity. This capacity expansion will enhance the company's steel production capabilities and potentially increase its market presence in the steel billet segment.",
            "Sentiment": "positive",
            "PublishDate": 1763596954479,
            "Source": "stock"
        },
        {
            "Title": "Vaswani Industries Receives NSE Approval for Listing 16 Lakh Equity Shares Issued to Promoters",
            "Summary": "Vaswani Industries Limited has received in-principle approval from NSE for listing 16,00,000 equity shares of Rs. 10 each issued at a premium of Rs. 40 per share on a preferential basis to promoter allottees. The shares bear distinctive numbers from 31346154 to 32946153. NSE granted the approval and stated that the shares will be listed and admitted for trading upon receipt of confirmation from depositories NSDL/CDSL for credit to beneficiary accounts. The approval was issued under Regulation 30 of SEBI Listing Obligations and Disclosure Requirements Regulations, 2015.",
            "Sentiment": "positive",
            "PublishDate": 1761853831627,
            "Source": "corporate_action"
        },
        {
            "Title": "Vaswani Industries Appoints Devendra Kumar Jain as Independent Director, Schedules 22nd AGM",
            "Summary": "Vaswani Industries Ltd's Board of Directors approved the appointment of Mr. Devendra Kumar Jain as an Additional Director in the Non-Executive, Independent category, effective September 5, 2025, for a five-year term subject to shareholder approval. Jain is a qualified Chartered Accountant with over 10 years of professional experience in finance, accounting, and auditing. He is not related to any Director or Key Managerial Personnel of the company and is not debarred from holding directorial positions. The company also announced its 22nd Annual General Meeting will be held on September 30, 2025, through video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1757089203228,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vaswani Industries Completes Billet Capacity Expansion, Advances Solar Power Projects",
            "Summary": "Vaswani Industries Limited has completed expansion of its Billet manufacturing capacity from 66,000 MT to 150,000 MT per annum in June 2025. Trial runs are in progress with commercial production awaiting Consent to Operate approval from the Pollution Control Department. The company is developing solar power projects totaling 66.50 MWp across Chhattisgarh. A 16.25 MWp project in Gandai is already operational. A 13.75 MWp project in Mohbhatta has completed structure work but faced module installation delays due to heavy rainfall in July 2025, with operations expected by end of November 2025. Another 36.25 MWp project in Mohbhatta has completed land acquisition and structure work, secured bank finance from Union Bank of India, and commenced module installation with expected operations during November-December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756278299841,
            "Source": "stock"
        },
        {
            "Title": "Vaswani Industries Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Vaswani Industries Limited's Board of Directors approved the unaudited standalone financial results for the quarter ended June 30, 2025, during a board meeting held on August 14, 2025. The meeting, which ran from 4:30 p.m. to 6:00 p.m., also took on record the Limited Review Report issued by statutory auditors Amitabh Agrawal & Company. The auditors conducted their review in accordance with Standard on Review Engagements (SRE) 2410 and found no material misstatements in the financial results. The results were prepared following Indian Accounting Standard 34 for Interim Financial Reporting and comply with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755184833051,
            "Source": "earnings"
        },
        {
            "Title": "Vaswani Industries Allots 16 Lakh Equity Shares to Promoters, Raises ₹8 Crore",
            "Summary": "Vaswani Industries Limited's board approved the allotment of 16,00,000 equity shares at ₹50 per share to four promoter category allottees on August 13, 2025. The preferential allotment raised ₹8 crore in cash consideration. The shares have a face value of ₹10 each with a premium of ₹40 per share. The allottees include Mr. Ravi Vaswani, Mr. Yashwant Ravi Vaswani, Mr. Kushal Vaswani, and Smt. Manisha Vaswani, each receiving 4,00,000 shares for ₹2 crore each. Post-allotment, the company's paid-up capital increased from ₹31.35 crore to ₹32.95 crore. The newly allotted shares will rank equally with existing equity shares and are subject to an 18-month lock-in period from the trading approval date.",
            "Sentiment": "positive",
            "PublishDate": 1755101121856,
            "Source": "corporate_action"
        },
        {
            "Title": "Vaswani Industries Receives Stock Exchange Approval for ₹8 Crore Preferential Share Issue to Promoters",
            "Summary": "Vaswani Industries Limited has received in-principle approval from BSE and NSE for issuing 16,00,000 equity shares at a minimum price of ₹50 per share on a preferential basis to the company's promoters. The shares have a face value of ₹10 each, making the total issue size worth at least ₹8 crore. BSE granted approval on July 30, 2025, while NSE approved on July 31, 2025. The approval comes with standard conditions including filing listing applications post-allotment, obtaining statutory approvals, and compliance with SEBI regulations. NSE has advised the company to strengthen internal controls to monitor trading by proposed allottees and obtain undertakings from allottees confirming they will not engage in intra-day trading or sell shares until the allotment date.",
            "Sentiment": "positive",
            "PublishDate": 1753973912137,
            "Source": "corporate_action"
        }
    ]
}