{
    "Symbol": "VBL",
    "ISIN": "INE200M01039",
    "News": [
        {
            "Title": "Varun Beverages Expands Into African Alcoholic Market",
            "Summary": "Varun Beverages partners with Carlsberg to enter African alcoholic beverage market, plans new manufacturing plant by next year with focus on improving international profit margins through local production.",
            "Sentiment": "positive",
            "PublishDate": 1770175558886,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Plans Product Innovation Drive",
            "Summary": "Varun Beverages announces comprehensive product expansion including new energy flavors, Adrush mid-price segment growth, Nimbu-Jeera line launch, and regional INR 10 packs targeting 5%-7% portfolio share.",
            "Sentiment": "positive",
            "PublishDate": 1770175534291,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Eyes $100M Snacks Revenue Growth",
            "Summary": "Varun Beverages projects high-teens growth in snacks sales, targeting $100 million revenue within 2-3 years. Company plans reduced India capex for CY26 while expanding South African operations.",
            "Sentiment": "positive",
            "PublishDate": 1770175506543,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Releases Q4CY25 Conference Call Audio",
            "Summary": "Varun Beverages Limited has made available the audio recording of its investors and analysts conference call held on February 3, 2026, discussing Q4CY25 audited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1770116845514,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Limits Capex for Alcoholic Beverage",
            "Summary": "Varun Beverages announces limited capital allocation for alcoholic beverage distribution and overall capex restrictions for the current year during concall updates.",
            "Sentiment": "neutral",
            "PublishDate": 1770112102182,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Eyes Higher Margins, Growth Ahead",
            "Summary": "Varun Beverages management expresses optimism about improved margins and growth prospects as the upcoming season opens, signaling positive outlook for business performance.",
            "Sentiment": "positive",
            "PublishDate": 1770110615765,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Co-Chairman Confident in Growth",
            "Summary": "Varun Beverages Co-Chairman expresses strong confidence in the company's long-term growth prospects across both Indian domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1770101542029,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Reports Strong FY25 Performance",
            "Summary": "Varun Beverages Limited announced audited financial results for Q4 and FY25, with consolidated revenue reaching ₹222,255.84 million and net profit of ₹30,620.42 million for the year.",
            "Sentiment": "positive",
            "PublishDate": 1770101238572,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Q3 Net Profit Rises 39% to ₹2.51B",
            "Summary": "Varun Beverages reported consolidated net profit of ₹2.51 billion in Q3, up 39% from ₹1.80 billion year-on-year, though falling short of analyst estimates of ₹3.10 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1770100868816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Board Meet Set for Feb 3, 2026",
            "Summary": "Varun Beverages Limited has scheduled its board meeting for February 3, 2026, to consider Q4FY25 audited financial results and recommend final dividend for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1769599802313,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Block Trade Worth Rs. 27.89 Crores",
            "Summary": "Varun Beverages witnessed a significant NSE block trade involving 600,395 shares valued at Rs. 27.89 crores, executed at Rs. 464.45 per share, indicating institutional interest in the beverage company.",
            "Sentiment": "neutral",
            "PublishDate": 1769582615435,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Shares Drop 2.01% to ₹477.30",
            "Summary": "Varun Beverages stock declined 2.01% to ₹477.30 in Friday's trading session. The beverage company reported strong quarterly revenue of ₹7,017.37 crores in June 2025 with net profit of ₹1,326.68 crores.",
            "Sentiment": "negative",
            "PublishDate": 1769160698215,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Enhances Corporate Guarantee to $49.5M",
            "Summary": "Varun Beverages Limited has enhanced its corporate guarantee for wholly-owned subsidiary VBL DMCC from $27.50 million to $49.50 million to secure credit facilities with ICICI Bank Dubai branch.",
            "Sentiment": "neutral",
            "PublishDate": 1768376044991,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Bullish on Varun Beverages at 47x PE",
            "Summary": "Morgan Stanley maintains overweight rating on Varun Beverages with Rs. 600 target price despite 47x forward P/E, citing strong fundamentals and growth prospects in India business.",
            "Sentiment": "positive",
            "PublishDate": 1768046722710,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Sees ₹59.53 Cr NSE Block Trade",
            "Summary": "Varun Beverages witnessed a significant block trade on NSE worth ₹59.53 crores involving 1,229,006 shares at ₹484.35 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767674915237,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Acquires Twizza for ₹1,119 Crores",
            "Summary": "VBL's acquisition of South African beverage brand Twizza aims to double market share to 20% by 2027. Analysts raise target prices by 7% citing expansion potential and cost synergies.",
            "Sentiment": "positive",
            "PublishDate": 1767142705773,
            "Source": "co_actions_results"
        },
        {
            "Title": "BoFA Securities Sets Buy Rating on Varun Beverages",
            "Summary": "Bank of America Securities has issued a buy recommendation for Varun Beverages with a price target of ₹550.00, indicating positive analyst sentiment for the FMCG stock.",
            "Sentiment": "positive",
            "PublishDate": 1766461819184,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Sees ₹60.64 Cr NSE Block Trade",
            "Summary": "Varun Beverages witnessed a significant block trade on NSE worth ₹60.64 crores involving 1,272,048 shares at ₹476.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1766376970182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Citi Maintains Buy Rating on Varun Beverages at ₹675",
            "Summary": "Citi maintains its 'Buy' recommendation for Varun Beverages with a price target of ₹675, reflecting continued confidence in the beverage company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766375302654,
            "Source": "stocks"
        },
        {
            "Title": "Varun Beverages Proposes Full Takeover Of Twizza",
            "Summary": "Varun Beverages proposes complete acquisition of South African beverage manufacturer Twizza to strengthen its position in Africa's largest soft drinks market and drive regional growth expansion.",
            "Sentiment": "positive",
            "PublishDate": 1766303729128,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varun Beverages Shareholders Approve Alteration of Object Clause via Postal Ballot",
            "Summary": "Varun Beverages Limited shareholders approved a special resolution to alter the Object Clause of the company's Memorandum of Association through postal ballot with 99.95% votes in favor. The remote e-voting process concluded on November 29, 2025, with 3,635 shareholders participating, representing 89.24% of the total paid-up equity share capital of Rs. 676.39 crores.",
            "Sentiment": "positive",
            "PublishDate": 1764558148909,
            "Source": "corporate_action"
        },
        {
            "Title": "PepsiCo and Coca-Cola Lose Market Share to Campa in India",
            "Summary": "PepsiCo and Coca-Cola experienced market share declines of more than 10% in India for 2025, while Campa's market share increased by over 8%. This shift indicates changing competitive dynamics in the Indian beverage market, affecting major global brands and emerging local competitors.",
            "Sentiment": "negative",
            "PublishDate": 1764052774477,
            "Source": "sectoral"
        },
        {
            "Title": "Varun Beverages Sees Rs 98.13 Crore Block Trade on BSE",
            "Summary": "Varun Beverages witnessed a significant block trade worth Rs 98.13 crore involving approximately 2,206,503 shares executed at Rs 444.75 per share on BSE. The large-volume transaction represents substantial institutional or bulk investor activity in the beverage company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763957281441,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Establishes Wholly-Owned Subsidiary in Kenya",
            "Summary": "Varun Beverages has incorporated a wholly-owned subsidiary in Kenya focused on beverage manufacturing and distribution operations. This expansion move establishes the company's presence in the Kenyan market for its beverage business activities.",
            "Sentiment": "positive",
            "PublishDate": 1763597038563,
            "Source": "corporate_action"
        },
        {
            "Title": "Varun Beverages Block Trade Worth Rs. 95.37 Crores on NSE",
            "Summary": "Varun Beverages Ltd. executed a block trade on NSE involving approximately 2,031,561 shares at Rs. 469.45 per share, totaling Rs. 95.37 crores. The transaction represents a significant equity movement for the beverage company.",
            "Sentiment": "neutral",
            "PublishDate": 1762491762398,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Reports 2.4% Volume Growth in Q3 2025, Expands into Beer Distribution with Carlsberg",
            "Summary": "Varun Beverages Limited reported consolidated sales volume growth of 2.4% to 273.8 million cases in Q3 2025, with revenue increasing 1.9% to Rs. 48,966.5 million. While domestic volumes remained flat due to prolonged rainfall across India, international operations grew 9%, led by strong performance in South Africa. The company's profit after tax increased 18.5% to Rs. 7,451.9 million, supported by lower finance costs and higher other income. Gross margins improved 119 basis points to 56.7%, driven by higher contribution from packaged drinking water in international markets and backward integration benefits. The company announced a distribution agreement with Carlsberg Breweries A/S for beer in African territories and is incorporating a wholly-owned subsidiary in Kenya for dairy and beverages business. Management indicated readiness to compete at the Rs. 10 price point if market share is threatened and launched a new energy drink called Adrenaline Rush at Rs. 60. The company remains debt-free at consolidated level and expects double-digit growth as weather conditions improve.",
            "Sentiment": "positive",
            "PublishDate": 1762234030622,
            "Source": "earnings"
        },
        {
            "Title": "Varun Beverages Seeks Shareholder Approval to Enter Alcoholic Beverages and Renewable Energy Business",
            "Summary": "Varun Beverages Limited has issued a postal ballot notice seeking shareholder approval through a special resolution to alter its Memorandum of Association. The company proposes to expand its business activities into three new areas: manufacturing and marketing of packaging materials like preforms, bottles, and containers; generating and supplying solar, wind, and other renewable energy; and manufacturing, processing, and distributing Ready-to-Drink (RTD) and alcoholic beverages including beer, wine, liquor, spirits, brandy, whisky, gin, rum, and vodka in India and abroad. The remote e-voting period will commence on October 31, 2025, and end on November 29, 2025. Results will be announced by December 1, 2025. The Board of Directors approved this proposal at their meeting held on October 29, 2025, citing growing popularity of RTD and alcoholic beverages as an expansion opportunity.",
            "Sentiment": "positive",
            "PublishDate": 1761844422572,
            "Source": "corporate_action"
        },
        {
            "Title": "Varun Beverages Expects Strong Growth as Weather Conditions Improve",
            "Summary": "Varun Beverages anticipates strong growth following improved weather conditions. The company projects early-to-mid teens growth for its international operations next quarter and states it can handle 50% growth capacity.",
            "Sentiment": "positive",
            "PublishDate": 1761794988912,
            "Source": "stock"
        },
        {
            "Title": "Varun Beverages Reports 20% Net Profit Growth Despite Flat Volume Growth in India",
            "Summary": "Varun Beverages, a major PepsiCo bottling partner, reported quarterly results with consolidated sales volume growing 2.4% to 273.8 million cases. India volumes remained flat while international volumes grew 9% driven by South Africa performance. Revenue increased 2% to ₹4,896.7 crore. Net profit rose 20% to ₹742 crore from ₹619 crore, attributed to lower finance costs and higher other income including interest on deposits and favorable currency movements. Gross margins improved 119 basis points to 56.7% due to increased water mix in international markets. EBITDA remained flat at ₹1,150 crore with margins narrowing 60 basis points to 23.4%. The company is expanding into alcoholic beverages through a partnership with Carlsberg for distribution in South Africa and incorporating a subsidiary in Kenya for beverage manufacturing and distribution. Shares traded 3.27% higher at ₹469 following the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1761721309148,
            "Source": "earnings"
        },
        {
            "Title": "Varun Beverages Partners with Carlsberg for African Beer Operations",
            "Summary": "Varun Beverages has entered into a partnership with Carlsberg for beer operations in Africa. The company is planning to expand into the alcoholic beverages sector by manufacturing, selling, and distributing beer, wine, and spirits in India and other international markets.",
            "Sentiment": "positive",
            "PublishDate": 1761719961993,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Varun Beverages reported Q2 revenue of 50.5 billion rupees, up from 49 billion rupees in the same period last year. The company's consolidated net profit increased to 7.4 billion rupees from 6.2 billion rupees year-over-year. However, EBITDA declined to 11.4 billion rupees from 11.5 billion rupees, while EBITDA margin compressed to 22.7% from 23.34% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761719184434,
            "Source": "earnings"
        },
        {
            "Title": "Varun Beverages to Announce Q3 2025 Results on October 29",
            "Summary": "Varun Beverages, PepsiCo's largest bottling partner outside the United States, will announce its quarterly results for the period ended September 2025 on October 29. The company will hold an investor conference call at 2:30 p.m. IST the same day. The trading window remains closed from October 1 to October 31 for designated persons. In the previous quarter, the company reported a 2.5% decline in consolidated revenue to Rs 7,017 crore, while profit after tax increased 5% to Rs 1,325 crore and EBITDA margins improved to 28.5%. The stock has declined 3.33% in the last five trading sessions and is down 30.16% year-to-date, trading at Rs 454.55 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761630858277,
            "Source": "earnings"
        },
        {
            "Title": "Varun Beverages Block Trade Worth Rs. 24.80 Crores Executed on NSE",
            "Summary": "Varun Beverages Ltd. saw a block trade executed on the NSE involving approximately 537,547 shares at a price of Rs. 461.30 per share, with the total transaction value amounting to Rs. 24.80 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761537880471,
            "Source": "order&deals"
        },
        {
            "Title": "VBL Schedules Second Quarter Results Review for October 29",
            "Summary": "VBL has announced plans to review its second quarter results on October 29. The company will be examining its quarterly financial performance on the scheduled date.",
            "Sentiment": "neutral",
            "PublishDate": 1761129068378,
            "Source": "earnings"
        },
        {
            "Title": "Varun Beverages Acquires 26% Stake in Jager Renewables for Rs 26,000",
            "Summary": "Varun Beverages Limited has acquired a 26% equity stake in Jager Renewables Two Private Limited for Rs 26,000. Jager Renewables is a special purpose vehicle engaged in generating and supplying solar power to consumers in Rajasthan. The acquisition is aimed at obtaining solar power for Varun Beverages' captive consumption. The company confirmed the completion of this investment, which was previously disclosed in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759505544150,
            "Source": "stock"
        },
        {
            "Title": "Varun Beverages Sees Rs. 26.82 Crore Block Trade on NSE",
            "Summary": "Varun Beverages Ltd. witnessed a block trade worth Rs. 26.82 crores on the NSE involving approximately 575,586 shares at a price of Rs. 466.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758081423277,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Sees Rs. 96.29 Crore Block Trade on NSE",
            "Summary": "Varun Beverages Ltd. witnessed a block trade worth Rs. 96.29 crores on the NSE. The transaction involved approximately 2,024,937 shares executed at Rs. 475.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757492902273,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Block Trade Worth Rs. 89.66 Crores Executed on NSE",
            "Summary": "Varun Beverages Ltd. witnessed a block trade on the National Stock Exchange involving approximately 1,890,583 shares at a price of Rs. 474.25 per share. The total transaction value amounted to Rs. 89.66 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1757317021105,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Sees Rs. 72.45 Crore Block Trade on NSE",
            "Summary": "Varun Beverages Ltd. witnessed a block trade worth Rs. 72.45 crores on the National Stock Exchange. The transaction involved approximately 1,503,176 shares at a price of Rs. 482.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757046504919,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Incorporates Joint Venture for Refrigeration Equipment Manufacturing",
            "Summary": "Varun Beverages Ltd incorporated a joint venture entity called White Peak Refrigeration Pvt Ltd in India to manufacture visi-coolers and other refrigeration equipment. Additionally, the company's Investment and Borrowing Committee approved an investment of Rs 26,000 to acquire up to 26% equity in Jager Renewables Two Pvt Ltd, a special purpose vehicle for solar power supply in Rajasthan. The solar investment aims to provide captive power for VBL facilities in Kota, Alwar, Jaipur, Jodhpur, and Bhiwadi, with transaction completion expected by June 2, 2026. Jager Renewables was incorporated in June 2024 but has not yet commenced operations. VBL shares closed 3.11% lower at Rs 489.45 on Thursday.",
            "Sentiment": "neutral",
            "PublishDate": 1757039986456,
            "Source": "stock"
        },
        {
            "Title": "Varun Beverages Incorporates Joint Venture White Peak Refrigeration for Manufacturing Visi-Coolers",
            "Summary": "Varun Beverages Limited has incorporated a joint venture company in India named White Peak Refrigeration Private Limited to manufacture visi-coolers and other refrigeration equipment. The company confirmed the incorporation and stated that detailed disclosure requirements had been previously submitted on July 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756984047997,
            "Source": "stock"
        },
        {
            "Title": "Varun Beverages to Acquire Up to 26% Stake in Jager Renewables Two for Solar Power Supply",
            "Summary": "Varun Beverages plans to acquire up to 26% stake in Jager Renewables Two Pvt Ltd. The acquisition is intended for captive solar power supply in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1756896291019,
            "Source": "order&deals"
        },
        {
            "Title": "Varun Beverages Begins Cheetos Production in Morocco, Reports Resilient Quarterly Performance Despite Volume Decline",
            "Summary": "Varun Beverages reported quarterly results showing a 3% decline in consolidated sales volume due to domestic challenges, but maintained realizations per case and EBITDA margins, resulting in positive net profit. The company has commenced commercial production of Cheetos, a PepsiCo snack product, in Morocco, marking expansion beyond its core beverage portfolio into the snack category. Chairman Ravi Kant Jaipuria highlighted the company's focus on international expansion and diversification. The international segment drove growth, supported by strong currency movements in international markets. In South Africa, the company is building presence with a new can line in Durban and awaits regulatory approval for land purchase in Boksburg for capacity enhancement. The company has strengthened subsidiaries in Zambia, Democratic Republic of Congo, and South Africa through equity infusions. Jaipuria stated the company is positioned to capture opportunities and drive long-term value creation through capacities, expanding product portfolio, and focused distribution network.",
            "Sentiment": "positive",
            "PublishDate": 1754722414004,
            "Source": "stock"
        },
        {
            "Title": "Varun Beverages Issues $22 Million Corporate Guarantee for Zimbabwe Subsidiary",
            "Summary": "Varun Beverages Limited has issued a corporate guarantee of USD 22 million for its subsidiary Varun Beverages (Zimbabwe) (Private) Limited. The guarantee, valid until June 30, 2028, is in favor of ICICI Bank Limited, United Arab Emirates, to secure credit facility extended by the bank to the Zimbabwe subsidiary. The company states that promoters and group companies have no interest in this transaction, which is conducted at arm's length. The company indicates there is no impact of this corporate guarantee on the listed entity.",
            "Sentiment": "neutral",
            "PublishDate": 1754476716401,
            "Source": "corporate_action"
        },
        {
            "Title": "Varun Beverages Increases Ownership in South African Subsidiary Through Debt-to-Equity Conversion",
            "Summary": "Varun Beverages has increased its stake in its South African subsidiary Bevco by converting existing loans into equity. This corporate restructuring move allows the parent company to boost its ownership percentage in the subsidiary while reducing the debt burden on Bevco's balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1754319714264,
            "Source": "stock"
        },
        {
            "Title": "Varun Beverages Increases Stake in South African Subsidiary to 97.92%",
            "Summary": "Varun Beverages Limited has approved increasing its stake in The Beverage Company Proprietary Limited (Bevco), its South African subsidiary, from 97.42% to 97.92%. The increase will be achieved by converting an outstanding loan of ZAR 455.7 million into 1,005,000 ordinary shares at ZAR 453.47 per share, equivalent to INR 2,199.68 million. Bevco, incorporated in 2016, manufactures and distributes PepsiCo licensed and own-branded non-alcoholic beverages in South Africa, with franchise rights extending to Lesotho and Eswatini. The subsidiary reported consolidated turnover of ZAR 4,090 million for the financial year ended June 30, 2024. The company stated this conversion will enhance worth, reduce leverage, improve financial stability, and strengthen the equity base to support future expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1754305556169,
            "Source": "corporate_action"
        },
        {
            "Title": "Varun Beverages Reports Mixed Q2 2025 Results with 3% Volume Decline Due to Unseasonal Rains",
            "Summary": "Varun Beverages delivered a resilient performance despite challenging weather conditions in Q2 2025. The company reported a 2.5% year-on-year decline in revenue to Rs. 70,173 million, primarily due to a 3% drop in consolidated sales volume to 389.7 million cases. India volumes declined 7.1% due to abnormally high and unseasonal rainfall throughout the quarter, while international markets showed healthy growth of 15.1%, led by South Africa's 16.1% growth. EBITDA margin improved by 82 basis points to 28.5% at Rs. 19,987.7 million, driven by operational efficiencies and strong currency performance in international operations. PAT grew 5% to Rs. 13,254.9 million. The company commissioned four new Greenfield plants in India at Prayagraj, Damtal, Buxar, and Mendipathar, enhancing production capabilities. Varun Beverages Morocco commenced commercial production of Cheetos snacks, marking expansion into the snacks category. The Board approved a second interim dividend of Rs. 0.50 per share. The company operates at 70% capacity utilization and expects limited major CAPEX in India for the next two years, while actively pursuing international acquisitions and expansions.",
            "Sentiment": "neutral",
            "PublishDate": 1754281221981,
            "Source": "earnings"
        },
        {
            "Title": "Varun Beverages Shares Rise 4% as Quarterly Profit Jumps 81% Despite Revenue Decline",
            "Summary": "Varun Beverages shares climbed 4.3% to Rs 534 after reporting strong quarterly results. The PepsiCo bottling partner posted an 81.2% sequential jump in profit after tax to Rs 1,325.49 crore, marking a 5% year-on-year increase from Rs 1,261.83 crore. However, revenue from operations declined 2.3% to Rs 7,333.67 crore. The company declared an interim dividend of Rs 0.50 per share, requiring a cash outflow of approximately Rs 169.1 crore. EBITDA margin expanded 82 basis points to 28.5% despite higher fixed overheads from four newly commissioned plants in India. Domestic sales volumes fell 7.1% while international markets showed strength with 15.1% volume growth, led by South Africa's 16.1% increase. The company maintained a net debt-free position with free cash of Rs 514.90 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753856096754,
            "Source": "earnings"
        },
        {
            "Title": "Varun Beverages Doubts Meeting FY26 Outlet Growth Targets Due to Rain Impact",
            "Summary": "Varun Beverages expressed doubts about achieving its FY26 outlet growth goals, citing rain as the primary factor affecting expansion plans. The company indicated that apart from weather-related challenges, no other issues are impacting sales performance.",
            "Sentiment": "negative",
            "PublishDate": 1753781983048,
            "Source": "stock"
        },
        {
            "Title": "Varun Beverages Approves ₹0.50 Interim Dividend, Appoints New CFO and Plans Joint Venture",
            "Summary": "Varun Beverages Ltd announced its unaudited financial results for the quarter and half year ended June 30, 2025. The company approved a second interim dividend of ₹0.50 per equity share for Financial Year 2025, with August 2, 2025 set as the record date and payment starting August 5, 2025. The board appointed Pankaj Madan as Chief Financial Officer effective July 30, 2025, while Rajesh Chawla will continue in a defined role in the finance function. Madan brings 35 years of experience across aviation, hospitality, retail, telecom, BFSI and manufacturing sectors, having previously served as Group CFO at Interglobe Enterprises and CFO at organizations including IndiGo airlines and Bharti Walmart. The company also approved the formation of a joint venture called White Peak Refrigeration Private Limited with Everest International Holdings Limited to manufacture visi-coolers and refrigeration equipment. Both companies will hold 50% stake each, with a total paid-up share capital of ₹42.5 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753772448858,
            "Source": "corporate_action"
        }
    ]
}