{
    "Symbol": "VEDL",
    "ISIN": "INE205A01025",
    "News": [
        {
            "Title": "Vedanta Ltd NSE Block Trade Worth Rs. 16.37 Crores",
            "Summary": "Vedanta Ltd witnessed a significant NSE block trade worth Rs. 16.37 crores involving 251,609 shares at Rs. 650.45 per share, indicating substantial institutional activity in the mining giant's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1770354737398,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta schedules investor conferences Feb 9-24",
            "Summary": "Vedanta Limited announces participation in five analyst and institutional investor conferences from February 09-24, 2026, including events by Nuvama, Systematix, Axis Capital, Dolat Capital, and Kotak.",
            "Sentiment": "neutral",
            "PublishDate": 1770119810942,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Creates Encumbrance on Shares for $350M Facility",
            "Summary": "Vedanta Resources Limited disclosed creation of encumbrance over 2,204,724,753 equity shares (56.38% stake) of Vedanta Limited held by subsidiaries for US$ 350 million facility agreement dated January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770096089178,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Gets ESG Rating of 60.8 from SES ESG Research",
            "Summary": "Vedanta Limited receives an ESG rating of 60.8 based on 2024-25 data from SEBI-registered rating provider SES ESG Research, disclosed under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770095988188,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Block Trade Worth Rs. 20.56 Crores on NSE",
            "Summary": "Vedanta Ltd. witnessed a significant block trade on NSE involving 319,107 shares worth Rs. 20.56 crores at Rs. 644.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770013858533,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Clarifies on Balco Share Transfer Reports",
            "Summary": "Vedanta Limited issues official clarification denying existence of any arbitral award declaring Balco share transfer as void, refuting recent media reports about High Court proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1769777307618,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta's Kuraioli Coal Block Gets Key Clearance",
            "Summary": "Vedanta receives FC Stage 2 clearance for Kuraioli coal block in January 2026, with commissioning expected by Q4 FY26. New projects anticipated to enhance volumes and margins.",
            "Sentiment": "positive",
            "PublishDate": 1769743919964,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Targets Record $6B EBITDA for FY26",
            "Summary": "Vedanta anticipates Q4 FY26 results to exceed Q3 performance, targeting record annual EBITDA over $6 billion and achieving volume guidance of 3 million tons for alumina and aluminum.",
            "Sentiment": "positive",
            "PublishDate": 1769743842053,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Q3 EBITDA Surges 36.8% to ₹68.6B",
            "Summary": "Vedanta reports strong Q3 performance with EBITDA rising to ₹68.6 billion from ₹50.13 billion year-on-year, while maintaining steady EBITDA margin at 29.38%.",
            "Sentiment": "positive",
            "PublishDate": 1769685089174,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Appoints New Group CHRO, Announces Leadership Change",
            "Summary": "Vedanta Limited announces appointment of Ms. Neha Sharma as Group Chief Human Resource Officer effective February 10, 2026, replacing Ms. Madhu Srivastava who resigned after 13 years with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1769684237875,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta to sell up to 6.7 crore HZL shares via OFS",
            "Summary": "Vedanta Limited's Committee of Directors approved the sale of up to 6,70,00,000 equity shares of Hindustan Zinc Limited, representing 1.59% stake, through offer for sale mechanism on stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1769512464128,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Discovers Oil at Ambe-2A Well",
            "Summary": "Vedanta announces successful oil discovery at its Ambe-2A well, marking a significant development in the company's exploration activities and potentially expanding its hydrocarbon portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769170773054,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Board Meet Set for Jan 29 to Review Q3FY26 Results",
            "Summary": "Vedanta Limited has scheduled its board meeting for January 29, 2026, to consider Q3FY26 unaudited financial results, with earnings call at 5:00 PM IST and trading window closure from Jan 1-31.",
            "Sentiment": "neutral",
            "PublishDate": 1769167553674,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta hits 52-week high of ₹699 on commodity rally",
            "Summary": "Vedanta shares surged 3% to ₹699 as copper and zinc prices gained on LME. Nuvama revised target to ₹806 citing demerger value unlocking and strong commodity upcycle with 20% EBITDA CAGR expected over FY25-28E.",
            "Sentiment": "positive",
            "PublishDate": 1769160559836,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta's ₹2,500 cr ESOP creates employee wealth",
            "Summary": "Vedanta Ltd delivers ₹2,500 crore cumulative impact through ESOPs over five years, with latest ₹500 crore grant covering 1,200 employees at Re 1 exercise price across 40% of workforce.",
            "Sentiment": "positive",
            "PublishDate": 1769002086884,
            "Source": "stocks"
        },
        {
            "Title": "Odisha demands ₹1,255 cr from Vedanta's ESL Steel",
            "Summary": "ESL Steel receives demand notices worth ₹1,255.38 crores from Odisha government over alleged production shortfall in mining operations. Company plans to challenge the claims legally.",
            "Sentiment": "negative",
            "PublishDate": 1768794724863,
            "Source": "stocks"
        },
        {
            "Title": "LIC Reduces Vedanta Stake to 4.88% Through Market Sale",
            "Summary": "Life Insurance Corporation of India disclosed reduction of its shareholding in Vedanta Ltd from 6.89% to 4.88% through market sale of 78.5 million shares worth over ₹2,000 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768549276233,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta shares slip 2% after 12% rally streak ends",
            "Summary": "Vedanta shares fell 1.69% to ₹664.35 on Thursday, ending a four-day winning streak that saw 12% gains. The decline came amid broader metal sector weakness with elevated trading volumes.",
            "Sentiment": "neutral",
            "PublishDate": 1768542813606,
            "Source": "stocks"
        },
        {
            "Title": "Kotak raises Vedanta target to ₹780, sees ₹965 potential",
            "Summary": "Kotak Institutional Equities upgrades Vedanta price target to ₹780 from ₹650, citing metals rally and demerger benefits. At spot prices, target could reach ₹965 with 85% FY27 EBITDA from aluminium, zinc, silver.",
            "Sentiment": "positive",
            "PublishDate": 1768531012669,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Gets Strong ESG Rating of 67 from ESGRisk.ai",
            "Summary": "Vedanta Limited receives Strong category ESG rating of 67 from SEBI-registered ESG Rating Provider ESGRisk.ai on January 14, 2026. The rating was issued independently without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1768476141587,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Gets 67 ESG Rating in Strong Category",
            "Summary": "Vedanta Limited receives ESG rating of 67 in Strong category from SEBI-registered ESGRisk.ai, marking independent assessment of company's environmental, social and governance practices.",
            "Sentiment": "positive",
            "PublishDate": 1768474572835,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Hits Record High; Nuvama Sets ₹806 Target",
            "Summary": "Nuvama raises Vedanta's target price by 18% to ₹806, citing demerger progress and strong commodity outlook. Stock gains 3% to ₹656.5 with 27% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1768372046512,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta hits record high on commodity rally & demerger",
            "Summary": "Vedanta shares surged to record levels driven by global commodity price rally in silver, zinc, aluminium, copper and ongoing demerger value unlocking prospects with Nuvama setting ₹806 target.",
            "Sentiment": "positive",
            "PublishDate": 1768368569520,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Hits 52-Week High on Demerger Approval",
            "Summary": "Vedanta shares surge 2.81% to ₹627 after NCLT approves major restructuring scheme. Stock gains 39.89% in six months ahead of planned 1:5 demerger by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768205035385,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Ltd NSE Block Trade Worth ₹18.65 Crores",
            "Summary": "Vedanta Ltd witnessed a significant block trade on NSE involving 298,367 shares at ₹625.20 per share, totaling ₹18.65 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768193753518,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCLT Approves Vedanta's Power Unit Demerger Scheme",
            "Summary": "National Company Law Tribunal Mumbai sanctions scheme of arrangement for demerger of Vedanta Limited's merchant power undertaking to Talwandi Sabo Power Limited, with creditors approving by overwhelming majority.",
            "Sentiment": "positive",
            "PublishDate": 1768029278701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Gets NCLT Approval for Major Demerger Scheme",
            "Summary": "NCLT Mumbai sanctions Vedanta's restructuring scheme involving TSPL and other subsidiaries, enabling focused management of diversified businesses including aluminium, power, and metals operations.",
            "Sentiment": "positive",
            "PublishDate": 1768019866149,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Demerger Gets NCLT Approval for Power Unit",
            "Summary": "National Company Law Tribunal approves Vedanta's power business demerger after settlement with creditor Sepco. The approval clears final hurdle for the mining conglomerate's major restructuring plan.",
            "Sentiment": "positive",
            "PublishDate": 1767979138236,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Gets Delhi HC Notice on Contract Extension Case",
            "Summary": "Delhi High Court issues notice to Government of India on Vedanta's writ petition challenging refusal to extend Production Sharing Contract for Block CB-OS/2, directs status quo maintenance.",
            "Sentiment": "neutral",
            "PublishDate": 1767870040752,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta shares drop 4% amid metal sector selloff",
            "Summary": "Vedanta shares declined 4.4% to ₹595 as metal stocks faced broad selling pressure due to weak commodity prices. The company received NCLT approval for its five-way demerger plan.",
            "Sentiment": "negative",
            "PublishDate": 1767862922913,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta NCLT Approves Demerger into Five Companies",
            "Summary": "Mumbai NCLT approves Vedanta's landmark demerger into five independent companies. Silver hits record high of $71.99, copper rallies 43% YTD. Chairman announces ₹1 lakh crore Rajasthan investment.",
            "Sentiment": "positive",
            "PublishDate": 1767792960254,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Issues IEPF Transfer Notice for Unclaimed Shares",
            "Summary": "Vedanta Limited notifies shareholders about potential transfer of equity shares to IEPF for unclaimed dividends from 2018-19, with March 15, 2026 deadline to claim.",
            "Sentiment": "neutral",
            "PublishDate": 1767783203767,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delhi HC Orders Status Quo on Vedanta CB-OS/2 Block Dispute",
            "Summary": "Delhi High Court grants interim relief to Vedanta, staying Centre's direction to hand over CB-OS/2 offshore oil block to ONGC. Court maintains status quo until further orders.",
            "Sentiment": "positive",
            "PublishDate": 1767771831497,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta's BALCO receives ₹17L customs penalty order",
            "Summary": "Vedanta subsidiary BALCO received customs penalty order of ₹17 lakh from Kolkata customs office for incorrect IGST rate application during goods import, with company expecting no material impact.",
            "Sentiment": "negative",
            "PublishDate": 1767695522048,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Reports Record Q3 FY26 Alumina Production",
            "Summary": "Vedanta achieved record Q3 FY26 alumina production of 794 KT at Lanjigarh (+57% QoQ, +22% YoY) and aluminum production of 620 KT (+1% YoY), with strong 9-month performance totals.",
            "Sentiment": "positive",
            "PublishDate": 1767584756662,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Zinc India Records 276 KT Mined Metal Output",
            "Summary": "Vedanta's Zinc India division achieved record Q3 mined metal production of 276 KT with 4% YoY growth, while refined metal output reached 270 KT. Zinc International production surged 28% YoY to 59 KT.",
            "Sentiment": "positive",
            "PublishDate": 1767584727364,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Gets Court Nod for Green Copper Plant Application",
            "Summary": "Madras High Court allows Vedanta to file fresh application for green copper plant in Tamil Nadu. Court directs proper application process through competent authorities for Sterlite Copper unit's environmental initiative.",
            "Sentiment": "positive",
            "PublishDate": 1767518896595,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Q3 Update: Highest-ever aluminium, alumina output",
            "Summary": "Vedanta Limited achieves record quarterly aluminium production of 620kt and alumina production of 794kt in Q3FY26, with zinc operations also hitting new highs amid strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1767441490628,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Gets Credit Rating Reaffirmation from ICRA",
            "Summary": "ICRA Limited reaffirms Vedanta's credit ratings at ICRA AA/Watch Developing/ICRA A1+ despite ongoing business demerger process. Rating agency continues monitoring demerger developments.",
            "Sentiment": "neutral",
            "PublishDate": 1767357630625,
            "Source": "stocks"
        },
        {
            "Title": "Standard Engineering Technology Pledges 1.15 Cr Shares",
            "Summary": "S2 Engineering Services pledged 1,14,57,143 shares (5.74% stake) to SMFG India Credit and Tata Capital for ₹72.70 crores personal borrowing on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767331715203,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta drops to 7th in dividend yield rankings",
            "Summary": "Vedanta slips to seventh position in dividend yield rankings with 7.2% yield for FY25, down from 8.8% in October 2025. Multibase India takes top spot with 24.8% dividend yield.",
            "Sentiment": "negative",
            "PublishDate": 1767260554784,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta ESL Receives ₹54.61 Cr GST Penalty Order",
            "Summary": "Vedanta's ESL subsidiary receives GST penalty order of ₹54.61 crores from tax authorities for FY 2018-19 to FY 2022-23 period. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767173678620,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta's HZL Gets Final Order on Compounding Application",
            "Summary": "Hindustan Zinc Limited, a subsidiary of Vedanta, received final order from Ministry of Corporate Affairs regarding compounding application under Companies Act 2013, disclosed on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767161011602,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Receives Multiple GST Penalty Orders Worth ₹1.95 Cr",
            "Summary": "Vedanta Limited disclosed receiving two additional GST penalty orders totaling ₹1.95 crores from Delhi and Rourkela tax authorities, bringing total recent GST penalties to ₹2.61 crores.",
            "Sentiment": "negative",
            "PublishDate": 1767090507715,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta hits 52-week high on mining block win, silver rally",
            "Summary": "Vedanta shares surged 2.47% to Rs 616, a new 52-week high, driven by the Depo Graphite-Vanadium block win and strong silver prices boosting subsidiary Hindustan Zinc.",
            "Sentiment": "positive",
            "PublishDate": 1766969397650,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Wins Depo Graphite-Vanadium Mining Block Bid",
            "Summary": "Vedanta successfully secured the bid for the Depo graphite-vanadium mining block after fulfilling all necessary legal requirements, expanding its mineral portfolio in the strategic materials segment.",
            "Sentiment": "positive",
            "PublishDate": 1766761405172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Wins Depo Graphite-Vanadium Block Auction",
            "Summary": "Vedanta Limited has been declared the successful bidder for the Depo Graphite-Vanadium Block under Critical Mineral Auctions Tranche IV by the Ministry of Mines, strengthening its critical minerals portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1766761176317,
            "Source": "stocks"
        },
        {
            "Title": "Andhra Pradesh Clears Vedanta's Oil Wells Project",
            "Summary": "Andhra Pradesh government issues conditional NOC to Vedanta's Cairn Oil & Gas Division for drilling 20 onshore oil and gas wells in Krishna district under DSF Policy 2018.",
            "Sentiment": "positive",
            "PublishDate": 1766757058687,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Shares Surge 18% on NCLT Demerger Approval",
            "Summary": "Vedanta shares have gained 18.1% over 13 consecutive sessions following NCLT approval for its five-way demerger plan. The stock hit a 52-week high of ₹607.65 amid strong momentum.",
            "Sentiment": "positive",
            "PublishDate": 1766727285611,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta Gets NCLT Approval for Corporate Split",
            "Summary": "Vedanta Limited receives National Company Law Tribunal approval to proceed with its corporate restructuring plan to split into separate business entities.",
            "Sentiment": "positive",
            "PublishDate": 1766460601365,
            "Source": "co_actions_results"
        }
    ]
}