{
    "Symbol": "VEEDOL",
    "ISIN": "INE484C01030",
    "News": [
        {
            "Title": "Veedol Corporation Gets CARE AA Rating for Bank Facilities",
            "Summary": "CARE Ratings affirmed AA; Stable rating for Veedol Corporation's ₹99.00 crore bank facilities, including long-term and short-term credit arrangements with multiple banks.",
            "Sentiment": "positive",
            "PublishDate": 1770299577939,
            "Source": "stocks"
        },
        {
            "Title": "Veedol Corporation Q3FY26 Results & 700% Dividend",
            "Summary": "Veedol Corporation reports Q3FY26 standalone revenue of ₹395.02 crores and profit of ₹43.64 crores. Board declares second interim dividend of 700% (₹14 per share).",
            "Sentiment": "positive",
            "PublishDate": 1770050240758,
            "Source": "co_actions_results"
        },
        {
            "Title": "Veedol Corporation appoints new UK subsidiary auditor",
            "Summary": "Veedol Corporation Limited announces appointment of Hawsons Chartered Accountants as statutory auditor for its UK material subsidiary, replacing SHORTS Chartered Accountants effective January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769679164492,
            "Source": "stocks"
        },
        {
            "Title": "Veedol Corp Director Brajesh Kumar Srivastava Resigns",
            "Summary": "Veedol Corporation Limited announces resignation of Non-Executive Director Shri Brajesh Kumar Srivastava effective January 16, 2026, citing his departure from Ministry of Heavy Industries.",
            "Sentiment": "neutral",
            "PublishDate": 1768560844705,
            "Source": "stocks"
        },
        {
            "Title": "Veedol Corp closes German subsidiary operations",
            "Summary": "Veedol Corporation Limited officially closes its wholly owned subsidiary Veedol Deutschland GmbH in Germany. The liquidation has been entered in German commercial register with no impact on business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768477449201,
            "Source": "stocks"
        },
        {
            "Title": "Veedol Corporation Receives ISO 31000:2018 Certificate",
            "Summary": "Veedol Corporation Limited successfully obtained ISO 31000:2018 Risk Management certification from Bureau Veritas India, covering enterprise risk management across all business processes.",
            "Sentiment": "positive",
            "PublishDate": 1765452595218,
            "Source": "stocks"
        },
        {
            "Title": "Veedol Corporation's UK Subsidiaries Face Auditor Resignation",
            "Summary": "M/s. SHORTS, Chartered Accountants resigned as statutory auditors of Veedol UK Limited (material subsidiary), Veedol International Limited, and Granville Oil & Chemicals Limited with effect from December 4, 2025. The auditors stated no circumstances connected with their resignation need to be brought to members' or creditors' notice, and raised no concerns about company management.",
            "Sentiment": "neutral",
            "PublishDate": 1765017197384,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corporation Reports Mixed Q2 Performance with Interim Dividend Declaration",
            "Summary": "Veedol Corporation Limited (formerly TideWater Oil Co.) reported standalone quarterly revenue of Rs 351.51 crores and profit of Rs 16.39 crores for the quarter ended September 30, 2025, while declaring an interim dividend of Rs 22 per equity share (1100%). The company submitted machine-readable financial results to stock exchanges following their board meeting on November 10, 2025, with consolidated operations showing revenue of Rs 500.28 crores for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1764925005001,
            "Source": "earnings"
        },
        {
            "Title": "Veedol Corporation Completes Sale of Chennai Office Space for Rs 2 Crores",
            "Summary": "Veedol Corporation Limited has completed the disposal of its 2,780 sq.ft office space at JVL Plaza, Chennai for Rs 2 crores to Mrs. Revathy Varadaraj. The company stated the office space was not in use for a long time and the sale will not impact business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764602255268,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corporation Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Veedol Corporation Limited published its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported total income from operations of Rs. 378.70 crores for the quarter. Basic and diluted earnings per share stood at Rs. 25.11 for the quarter. The equity share capital remained at Rs. 8.34 crores. The company disclosed these results through newspaper advertisements in The Telegraph and Aajkaal, and filed them with stock exchanges NSE and BSE under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762989356710,
            "Source": "earnings"
        },
        {
            "Title": "Veedol Corporation Declares Rs. 22 Interim Dividend Per Share for 2025-26",
            "Summary": "Veedol Corporation Limited's Board of Directors declared an interim dividend of Rs. 22 per equity share of Rs. 2 each for 2025-26 at their meeting on November 10, 2025. The dividend will be paid within 30 days to shareholders whose names appear on the register as of November 14, 2025. The company has issued detailed guidelines on tax deduction at source (TDS) applicable to different categories of shareholders. For resident members, no TDS will be deducted if aggregate dividend doesn't exceed Rs. 10,000 annually, while amounts exceeding this threshold will attract 10% TDS for those with valid PAN. Non-resident shareholders will face 20% TDS plus applicable surcharge and cess, though beneficial Double Tax Avoidance Agreement rates may apply with proper documentation. The dividend will be paid electronically to shareholders' bank accounts, and various exemption forms and declarations must be submitted by November 14, 2025, to claim lower or nil TDS rates.",
            "Sentiment": "positive",
            "PublishDate": 1762943609587,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corporation Declares 1100% Interim Dividend, Reports Strong Q2 Results",
            "Summary": "Veedol Corporation Limited announced quarterly results for the period ended September 30, 2025, with standalone revenue from operations of Rs 351.87 crores and net profit of Rs 26.39 crores. The company declared a first interim dividend of 1100% (Rs 22 per share of face value Rs 2) for financial year 2025-26, with record date set for November 14, 2025. The Board approved the appointment of Abhijit Tikekar as Company Secretary Head Legal (KMP) effective November 10, 2025. Two Independent Directors, P.S. Bhattacharyya and P.Y. Gurav, will cease their directorships on November 12, 2025, due to completion of two consecutive terms. On consolidated basis, the company reported revenue of Rs 509.28 crores and net profit of Rs 40.93 crores for the quarter. The company's cash and cash equivalents stood at Rs 29.09 crores on standalone basis and Rs 92.38 crores on consolidated basis as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762803166601,
            "Source": "earnings"
        },
        {
            "Title": "Veedol Corporation Appoints Abhijit Tikekar as Head - Legal",
            "Summary": "Veedol Corporation Limited appointed Shri Abhijit Tikekar as Head - Legal (Senior Management Personnel) effective October 16, 2025. The appointment was approved by the Board of Directors upon recommendation of the Nomination and Remuneration Committee. Tikekar is an Associate Member of The Institute of Company Secretaries of India with qualifications including M.Com and LLB from Pune University, and is pursuing ACCA Final level. He brings 19 years of experience in Company Secretarial Functions, Legal Affairs, Finance, M&A, Statutory Compliances and Corporate Governance. His previous role was with Sandvik Group Legal at Stockholm, Sweden. The appointment is effective until superannuation.",
            "Sentiment": "positive",
            "PublishDate": 1760616048316,
            "Source": "corporate_governance"
        },
        {
            "Title": "Veedol Corporation Company Secretary Saptarshi Ganguly Resigns After 16 Years",
            "Summary": "Saptarshi Ganguly has resigned from his position as Company Secretary of Veedol Corporation Limited after serving the company for 16 years. In his resignation letter, Ganguly highlighted his involvement in several milestone achievements including the global acquisition of the 'Veedol' brand, establishment of overseas subsidiaries and joint ventures, corporate actions involving sub-divisions and bonus issues, implementation of ESOP schemes, and the company's name change to Veedol Corporation Limited. He served an 85-day notice period and his last working day was October 10, 2025. Ganguly expressed gratitude to the Chairman, Managing Director, other Directors, and colleagues for their support throughout his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1760341585806,
            "Source": "corporate_governance"
        },
        {
            "Title": "Veedol Corporation Launches Two New Fully Synthetic Engine Oils in India",
            "Summary": "Veedol Corporation has launched two new fully synthetic engine oils named 'SwiftPower' and 'SynthGlide' in India. Both products are developed using EstoBioLides Technology. The company is initially focusing on the domestic market with plans to export these products in the future.",
            "Sentiment": "positive",
            "PublishDate": 1758720816436,
            "Source": "stock"
        },
        {
            "Title": "Standard Greases & Specialities Acquires 343,500 Equity Shares in Veedol Corporation",
            "Summary": "Veedol Corporation Limited received a disclosure from Standard Greases & Specialities Private Limited, a joint promoter, regarding the acquisition of 343,500 equity shares of the company. The disclosure was received on September 16, 2025, under SEBI regulations on substantial acquisition of shares and takeovers. The company has informed the National Stock Exchange and BSE Limited about this share acquisition by its joint promoter.",
            "Sentiment": "neutral",
            "PublishDate": 1758083012219,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corporation Approves Share Acquisition by Joint Promoter Standard Greases",
            "Summary": "Veedol Corporation Limited's Committee of Directors approved a pre-dealing application from Standard Greases & Specialities Private Limited, a joint promoter, for the acquisition of 871,200 equity shares. The approval was granted on September 13, 2025, with the transaction required to be completed within 5 trading days from September 15 to September 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757740022747,
            "Source": "stock"
        },
        {
            "Title": "Veedol Corporation Seeks Shareholder Approval for Director Appointment Through Postal Ballot",
            "Summary": "Veedol Corporation Limited has issued a postal ballot notice dated August 26, 2025, seeking shareholder approval for the appointment of Brajesh Kumar Srivastava (DIN: 09835338) as a Non-Executive and Non-Independent Director. Srivastava was initially appointed as Additional Director on August 13, 2025, but his directorship ceased after the company's 102nd Annual General Meeting on August 25, 2025. The Board reappointed him on August 26, 2025, subject to shareholder approval. Srivastava holds an M.Sc. in Physics and MBA in Human Resource Management, with over 32 years of experience in various Government of India ministries. He currently serves as Deputy Secretary in the Ministry of Heavy Industries and as a Nominee Director at Andrew Yule and Company Limited. The voting period runs from August 29, 2025, to September 27, 2025, with results to be announced on September 27, 2025. Shareholders can vote through postal ballot or electronic voting, with the cut-off date set as August 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756379701888,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corporation Appoints Brajesh Kumar Srivastava as Non-Executive Director",
            "Summary": "Veedol Corporation Limited has appointed Mr. Brajesh Kumar Srivastava as a Non-Executive and Non-Independent Director effective August 26, 2025. The Board of Directors approved the appointment on August 26, 2025, subject to shareholder approval through postal ballot. Srivastava holds DIN 09835338 and is a postgraduate in Physics with an MBA in Human Resource Management. He has over 32 years of experience in various Government of India ministries across policy formulation, implementation, operations, human resources, finance and parliamentary matters. He currently works as Deputy Secretary in the Ministry of Heavy Industries and serves as Nominee Director on the Board of Andrew Yule and Company Limited. The company has issued a postal ballot notice dated August 26, 2025, seeking shareholder approval for the appointment through ordinary resolution via postal ballot forms and remote e-voting.",
            "Sentiment": "neutral",
            "PublishDate": 1756220777983,
            "Source": "corporate_governance"
        },
        {
            "Title": "Veedol Corporation Reports 39% Drop in Net Profit for Q1 FY2026",
            "Summary": "Veedol Corporation Limited reported declining financial performance for Q1 FY2026. Total income from operations decreased 3.2% to Rs 385.35 crore compared to Rs 398.23 crore in Q1 FY2025. Net profit after tax dropped significantly by 39.2% to Rs 16.29 crore from Rs 26.78 crore in the previous year. Net profit before tax and exceptional items declined 41.6% to Rs 19.70 crore versus Rs 33.74 crore. Total comprehensive income fell 38.6% to Rs 16.25 crore compared to Rs 26.48 crore. Earnings per share decreased to Rs 9.59 from Rs 15.76 in the same quarter last year. The company maintained its equity share capital at Rs 3.40 crore. The results show a decline across all major financial metrics compared to the same quarter in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755250451004,
            "Source": "earnings"
        },
        {
            "Title": "Veedol Corporation Reports 64% Drop in Quarterly Profit, Appoints New Director and Senior Management",
            "Summary": "Veedol Corporation Limited reported a standalone profit of Rs. 16.29 crores for the quarter ended June 30, 2025, down from Rs. 26.78 crores in the same period last year. Revenue from operations declined to Rs. 372.77 crores from Rs. 378.24 crores year-on-year. On a consolidated basis, profit increased to Rs. 49.67 crores from Rs. 37.11 crores in the previous year, with revenue rising to Rs. 513.62 crores from Rs. 478.87 crores. The Board appointed Brajesh Kumar Srivastava as Non-Executive and Non-Independent Director and Dr. Manish Khodaskar as Sr. General Manager for HR, Admin & CSR, expected to join September 16, 2025. Company Secretary Saptarshi Ganguly resigned effective October 10, 2025, to pursue other career opportunities. The company also appointed P G Bhagwat LLP as additional internal auditors and approved the disposal of Chennai office space for Rs. 2 crores to R V Law Associates.",
            "Sentiment": "negative",
            "PublishDate": 1755104715866,
            "Source": "earnings"
        },
        {
            "Title": "Veedol Corporation Director Vijay Mittal Resigns Due to Time Constraints",
            "Summary": "Vijay Mittal, a Non-Executive and Non-Independent Director of Veedol Corporation Limited, has resigned from his position citing time constraints for effectively discharging his duties as a Director. In his resignation letter dated July 14, 2025, Mittal requested the Board to consider and record his resignation in the next Board meeting. He expressed gratitude to the company for the opportunity to serve as a Director and thanked his Board colleagues for their support while extending best wishes for the company's continued success. The company disclosed this information to stock exchanges on July 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753158723684,
            "Source": "corporate_governance"
        },
        {
            "Title": "Veedol Corporation: Andrew Yule Completes 2% Stake Sale via OFS",
            "Summary": "Andrew Yule & Company successfully conducted a 2% stake sale in Veedol Corporation Ltd. through an Offer for Sale (OFS) on June 9, after a previous postponement. The OFS involved 3.48 lakh equity shares with a floor price of ₹1,566 per share. Andrew Yule held a 26.23% stake in Veedol Corporation as of March 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1749473163000,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corp Reports Q4 Results and Declares Interim Dividend",
            "Summary": "Veedol Corp announced its Q4 financial results and declared an interim dividend. The company's Q4 EBITDA increased to 672 million rupees from 476 million rupees year-over-year, with EBITDA margin improving to 12.63% from 9.78%. Consolidated net profit for Q4 rose to 597 million rupees, up from 429 million rupees year-over-year and 373 million rupees quarter-on-quarter. Q4 revenue stood at 5.3 billion rupees, compared to 4.87 billion rupees in the same quarter last year. Additionally, the company declared an interim dividend of 22 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748447210000,
            "Source": "result"
        },
        {
            "Title": "Veedol Corporation: Promoter Andrew Yule Withdraws OFS Due to Technical Glitch",
            "Summary": "Veedol Corporation's promoter Andrew Yule & Company Ltd. has withdrawn its planned 2% equity Offer For Sale (OFS) due to technical issues in transferring shares to NSE Clearing Corporation. The OFS, originally scheduled for May 23-26, 2025, with a floor price of ₹1,566 per share, has been postponed until further notice.",
            "Sentiment": "neutral",
            "PublishDate": 1747956585000,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corp Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Veedol Corp has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 380 million rupees, down from 420 million rupees in the same quarter last year. The EBITDA margin also decreased to 7.88% from 8.47% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738768291000,
            "Source": "earnings"
        },
        {
            "Title": "Veedol Corp Reports Q3 FY24 Financial Results",
            "Summary": "Veedol Corp has announced its Q3 financial results. The company's consolidated net profit increased to 373 million rupees, up from 340 million rupees year-over-year and 346 million rupees quarter-over-quarter. However, revenue decreased to 4.8 billion rupees from 4.96 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738768233000,
            "Source": "earnings"
        },
        {
            "Title": "Veedol Corp Announces 20 Rupees Per Share Dividend",
            "Summary": "Veedol Corp has declared a dividend of 20 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731431058000,
            "Source": "corporate_action"
        },
        {
            "Title": "Veedol Corp Reports Slight Decline in Q2 Net Profit",
            "Summary": "Veedol Corp announced its Q2 financial results. The company reported a net profit of 346 million rupees, down from 352 million rupees in the same quarter last year. Revenue for Q2 slightly increased to 4.76 billion rupees from 4.74 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731430975000,
            "Source": "result"
        }
    ]
}