{
    "Symbol": "VENKEYS",
    "ISIN": "INE398A01010",
    "News": [
        {
            "Title": "Venky's Q3FY26 Profit Surges 138% to ₹4,858 Lakhs",
            "Summary": "Venky's (India) Limited reported strong Q3FY26 results with net profit jumping 138% to ₹4,858 lakhs from ₹2,038 lakhs in Q3FY25. Revenue from operations increased 7.76% to ₹95,015 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770645240835,
            "Source": "co_actions_results"
        },
        {
            "Title": "Venky's Board Meeting Set for February 9, 2026",
            "Summary": "Venky's (India) Limited announces board meeting on February 9, 2026, to consider and approve audited financial results for Q3FY26 quarter ended December 31, 2025, as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769236524085,
            "Source": "co_actions_results"
        },
        {
            "Title": "Venkys India Reports Significant Losses in Poultry Segment During Q2 FY26",
            "Summary": "Venkys India Limited held its quarterly earnings conference call discussing results for the quarter ended September 30, 2025. The company's financial performance was severely impacted by unexpected profit margin declines in the poultry segment. Sales turnover and profitability suffered due to lower realizations in day-old broiler chicks, commercial broiler birds, and broiler hatching eggs. The poor performance was attributed to festivals including Ganesh Chaturthi, Navratri, Pitrapaksh, and abnormal rains and flooding in northern regions where the company operates. Day-old broiler chick prices fell to INR 26.48 per chick compared to INR 37.22 in the previous year, representing a decline of INR 10.74 per chick. Commercial broiler bird realization dropped to INR 80.57 per kg from INR 98.50 per kg, a decrease of INR 17.93 per kg. The poultry segment reported losses of approximately INR 60 crores for the quarter. However, the Animal Health Products segment registered satisfactory performance, and the oilseeds segment continued to improve. Management indicated that prices began recovering in the last week of October and expressed optimism for better performance in the second half with the onset of winter. Raw material prices for maize and soya have declined significantly, with both trading 25% below minimum support prices.",
            "Sentiment": "negative",
            "PublishDate": 1762985530302,
            "Source": "earnings"
        },
        {
            "Title": "Venky's India Reports Q2 Net Loss of 265M Rupees, Revenue Rises to 8.1B Rupees",
            "Summary": "Venky's India reported a net loss of 265 million rupees in Q2, compared to a profit of 77.6 million rupees in the same period last year. Revenue increased to 8.1 billion rupees from 7.74 billion rupees year-over-year. The company also posted an EBITDA loss of 311 million rupees, contrasting with a gain of 139 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762500316882,
            "Source": "earnings"
        },
        {
            "Title": "Venky's (India) Sets August 14, 2025 as Record Date for Rs.10 Per Share Dividend",
            "Summary": "Venky's (India) Limited announced August 14, 2025 as the record date for determining shareholder eligibility for a proposed dividend of Rs.10 per equity share. The dividend was recommended by the Board of Directors on May 12, 2025 for the year ended March 31, 2025, subject to approval at the Annual General Meeting. The company also released quarterly results for the quarter ended June 30, 2025, showing revenues from operations at Rs.865.83 crores, profit before tax at Rs.21.77 crores, profit after tax at Rs.15.83 crores, and earnings per share at Rs.11.24. The Poultry and Poultry Products segment faced challenges due to lower realizations from day-old chicks and grown-up birds, while the Animal Health Products segment performed satisfactorily and the Oilseed segment showed steady improvement.",
            "Sentiment": "neutral",
            "PublishDate": 1754639641759,
            "Source": "corporate_action"
        },
        {
            "Title": "Venky's (India) Limited Reports Quarterly Financial Results with Mixed Segment Performance",
            "Summary": "Venky's (India) Limited reported audited financial results for the quarter ended June 30, 2025. The company posted a profit of Rs 1,583 lakhs compared to Rs 1,330 lakhs in the previous quarter. Revenue from operations stood at Rs 86,583 lakhs versus Rs 84,315 lakhs in the prior quarter. The company operates across three segments: Poultry and Poultry Products generated Rs 47,124 lakhs in revenue, Animal Health Products contributed Rs 9,698 lakhs, and Oilseed segment recorded Rs 33,931 lakhs. Earnings per share remained at Rs 11.24 for both basic and diluted calculations. The Poultry segment faced challenges due to lower realizations from day-old chicks and grown-up birds sales, while the Animal Health Products segment showed satisfactory performance and the Oilseed segment demonstrated steady improvement. Total comprehensive income for the period was Rs 1,583 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1754637912591,
            "Source": "earnings"
        },
        {
            "Title": "Venky's India Reports Mixed Q1 Results with Revenue Growth but Sharp Profit Decline",
            "Summary": "Venky's India reported quarterly revenue of 8.6 billion rupees compared to 8.1 billion rupees in the same period last year, showing growth. However, the company's EBITDA dropped significantly to 236 million rupees from 1.03 billion rupees year-over-year, with EBITDA margin falling to 2.72% from 12.78%. Net profit also declined substantially to 158 million rupees from 751 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754637317563,
            "Source": "earnings"
        },
        {
            "Title": "Venky's (India) Q4 Results and Dividend Announcement",
            "Summary": "Venky's (India) has declared a dividend of 10 rupees per share. The company's Q4 revenue decreased to 8.4 billion rupees from 8.96 billion rupees year-over-year. Q4 EBITDA fell to 254 million rupees from 500 million rupees, with EBITDA margin dropping to 3.01% from 5.58%. Net profit for Q4 declined to 133 million rupees from 335 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747034205000,
            "Source": "result"
        },
        {
            "Title": "Venky's (India) to Consider Q4 Results on May 12",
            "Summary": "Venky's (India) Limited has announced that it will consider and approve its financial results for the fourth quarter on May 12. This is a standard corporate procedure where companies review and finalize their quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1745583392000,
            "Source": "default"
        },
        {
            "Title": "Venky's Shares Drop Amid Bird Flu Outbreaks in India",
            "Summary": "Venky's (India) Limited shares declined by 3.04% following reports of eight outbreaks of highly pathogenic H5N1 bird flu in Indian farms and backyard poultry, as reported by the World Organisation for Animal Health (WOAH). This news has likely impacted investor sentiment towards poultry-related stocks due to potential concerns about the industry's near-term outlook.",
            "Sentiment": "negative",
            "PublishDate": 1743151481000,
            "Source": "normal_news"
        },
        {
            "Title": "Venky's (India) Reports Decrease in Q3 Revenue",
            "Summary": "Venky's (India) has reported a decline in its third-quarter revenue. The company's revenue for Q3 stood at 8.8 billion rupees, compared to 9.5 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1738910830000,
            "Source": "earnings"
        },
        {
            "Title": "Venky's India Reports Significant EBITDA Improvement in Q3",
            "Summary": "Venky's (India) has reported a substantial turnaround in its Q3 financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) improved from a loss of 72 million rupees in the previous year to a profit of 291 million rupees in the current quarter. Additionally, the company achieved an EBITDA margin of 3.30% for Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738910809000,
            "Source": "earnings"
        },
        {
            "Title": "Venky's India Reports Profit in Q3 FY2024",
            "Summary": "Venky's (India) Limited has reported a net profit of 204 million rupees in the third quarter, marking a significant turnaround from a loss of 80 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738910722000,
            "Source": "earnings"
        },
        {
            "Title": "Venkys Reports Significant Decline in Q2 EBITDA",
            "Summary": "Venkys, a poultry and processed food company, has reported a substantial decrease in its Q2 EBITDA. The company's EBITDA for the quarter fell to 139 million rupees, down from 496 million rupees in the same period last year. Additionally, the EBITDA margin contracted to 1.79% from 5.44% year-over-year, indicating a significant reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1730963716000,
            "Source": "result"
        },
        {
            "Title": "Venkys Reports Q2 Revenue Decline",
            "Summary": "Venkys, a company likely in the food or agriculture sector, has reported its second quarter revenue. The company's revenue for Q2 stood at 7.7 billion rupees, showing a decrease from 9.1 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730963586000,
            "Source": "result"
        },
        {
            "Title": "Venkys Reports Significant Drop in Q2 Net Profit",
            "Summary": "Venkys, a poultry and processed food company, has reported a substantial decrease in its second-quarter net profit. The company's net profit for Q2 stood at 78 million rupees, down from 341 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730963527000,
            "Source": "result"
        }
    ]
}