{
    "Symbol": "VENTIVE",
    "ISIN": "INE781S01027",
    "News": [
        {
            "Title": "Deutsche Bank Releases Encumbrance on Ventive Shares",
            "Summary": "Deutsche Bank AG releases encumbrance over 52,104,896 equity shares of Ventive Hospitality Limited held by BRE Asia ICC Holdings Ltd, reducing encumbered shareholding from 32.36% to 10.05%.",
            "Sentiment": "neutral",
            "PublishDate": 1770725642343,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ventive Hospitality Gets ESG Score of 45.6 from SES ESG",
            "Summary": "Ventive Hospitality Limited receives independent ESG rating of 45.6 from SEBI-registered ESG Rating Provider SES ESG Research Pvt Ltd, disclosed under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770146400168,
            "Source": "stocks"
        },
        {
            "Title": "Ventive Hospitality Q3FY26 Revenue Jumps 27% to ₹722 Cr",
            "Summary": "Ventive Hospitality reported consolidated revenue of ₹722 crore in Q3FY26, up 27% YoY. Hospitality segment revenue grew 35% to ₹565 crore with EBITDA margin at 40%. PAT reached ₹141 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770050191300,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ventive Hospitality Postal Ballot Results Announced",
            "Summary": "Ventive Hospitality Limited announces postal ballot voting results with two ordinary resolutions passed by requisite majority, including material related party transaction approval and director appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1769883187973,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ventive Hospitality Board Meet on Feb 2 for Q3 Results",
            "Summary": "Ventive Hospitality Limited has scheduled a board meeting for February 02, 2026, to consider Q3FY26 unaudited financial results and interim dividend proposal under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769610084141,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deutsche Bank Releases Encumbrance on Ventive Shares",
            "Summary": "Deutsche Bank AG disclosed release of encumbrance over 23,465,150 equity shares (10.05%) of Ventive Hospitality Limited held by BREP Asia III India Holding Co VI Pte. Ltd on January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769600908480,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ventive Hospitality: 32.36% Shares Pledged to Lenders",
            "Summary": "Catalyst Trusteeship Limited disclosed pledge of 75,570,046 equity shares (32.36%) of Ventive Hospitality Limited by major shareholders to secure lending arrangements with international banks.",
            "Sentiment": "neutral",
            "PublishDate": 1768969071899,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ventive Hospitality invests ₹25 cr in Soham Leisure",
            "Summary": "Ventive Hospitality Limited announces additional ₹25 crore investment in Soham Leisure Ventures through optionally convertible debentures, strengthening its position in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1768295347859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ventive Hospitality shares worth ₹8,791 cr unlock",
            "Summary": "122.1 million shares of Ventive Hospitality, representing 52% of outstanding equity, become eligible for trading as one-year shareholder lock-in period ends on December 29.",
            "Sentiment": "neutral",
            "PublishDate": 1766973326332,
            "Source": "stocks"
        },
        {
            "Title": "Ventive Hospitality Issues Postal Ballot Notice",
            "Summary": "Ventive Hospitality sends postal ballot notice for USD 39.6M guarantee approval and director appointment, with e-voting from Dec 31, 2025 to Jan 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766466690351,
            "Source": "stocks"
        },
        {
            "Title": "Ventive Hospitality Reports Strong Q2 FY26 Results with 50% EBITDA Growth and Strategic Acquisitions",
            "Summary": "Ventive Hospitality delivered robust quarterly results with revenue growing 28% year-on-year to ₹554.5 crores and EBITDA surging 50% to ₹254.8 crores, driven by strong performance across India and Maldives portfolios with margin expansion of 7 percentage points to 46%. The company announced two strategic acquisitions - a 51% stake in Soho House India for ₹60 crores and 76% stake in Hilton Goa Resort for ₹320 crores enterprise value, positioning for expansion in luxury hospitality and membership-based lifestyle segments.",
            "Sentiment": "positive",
            "PublishDate": 1763732687395,
            "Source": "earnings"
        },
        {
            "Title": "Ventive Hospitality Invests ₹110.5 Crore in Soham Leisure Ventures for Hilton Goa Resort Acquisition",
            "Summary": "Ventive Hospitality has invested ₹110.5 crore in Optionally Convertible Debentures (OCDs) of Soham Leisure Ventures, with allotment confirmed. The investment is part of an ongoing acquisition of a Hilton resort property in Goa.",
            "Sentiment": "positive",
            "PublishDate": 1763507311933,
            "Source": "corporate_action"
        },
        {
            "Title": "Ventive Hospitality Reports Complete IPO Proceeds Utilization in Q2 Monitoring Report",
            "Summary": "Ventive Hospitality Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing Rs 15,194.56 million of IPO proceeds were fully utilized as planned, with Rs 14,000 million used for debt repayment and Rs 1,194.56 million for general corporate purposes. The report by Crisil Ratings Limited indicates no deviations from disclosed objectives, with Rs 45.93 million remaining unutilized from issue expenses and proceeds kept in designated bank accounts.",
            "Sentiment": "positive",
            "PublishDate": 1763130030860,
            "Source": "corporate_action"
        },
        {
            "Title": "Ventive Hospitality Reports Strong Q2 Turnaround with 526 Million Rupees Net Profit",
            "Summary": "Ventive Hospitality achieved a net profit of 526 million rupees in Q2, reversing from a 562 million rupees loss in the same period last year. The company's revenue nearly doubled to 4.9 billion rupees from 2.6 billion rupees year-over-year, while EBITDA grew to 1.9 billion rupees with margins improving to 38.75%.",
            "Sentiment": "positive",
            "PublishDate": 1763074721384,
            "Source": "earnings"
        },
        {
            "Title": "Ventive Hospitality Explores Acquisition of Soho House India Operations Through Subsidiary",
            "Summary": "Ventive Hospitality Limited is exploring a potential acquisition through its material subsidiary Panchshil Corporate Park Private Limited. The company proposes to enter into a non-binding agreement to explore acquiring an unnamed target entity's business. The proposed transaction would result in acquiring the target's subsidiaries that hold exclusive rights for Soho House expansion in India and operate Soho House Mumbai (Juhu). The proposal remains subject to due diligence completion, execution of definitive agreements, and compliance with applicable laws and regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1760627657390,
            "Source": "order&deals"
        },
        {
            "Title": "Ventive Hospitality Completes 76% Stake Acquisition in Soham Leisure Ventures (Hilton Goa Resort)",
            "Summary": "Ventive Hospitality Limited has completed the acquisition of a 76% equity stake in Soham Leisure Ventures Private Limited, which operates Hilton Goa Resort. The acquisition was completed on October 15, 2025, following board approval on September 25, 2025. The company stated this acquisition represents a significant milestone in their strategic growth plan and strengthens their position in the hospitality segment.",
            "Sentiment": "positive",
            "PublishDate": 1760623035153,
            "Source": "order&deals"
        },
        {
            "Title": "Ventive Hospitality Acquires 76% Stake in Hilton Goa Resort Owner for Rs 950 Crores",
            "Summary": "Ventive Hospitality Limited's board approved the acquisition of a 76% stake in Soham Leisure Ventures Private Limited, which owns the Hilton Goa Resort. The cash consideration is Rs 9.5 crores for the equity stake, with an enterprise value of approximately Rs 320 crores including land consideration. Soham Leisure Ventures, incorporated in 2011, operates in the hospitality business with a turnover of Rs 4,992.49 lakhs. The acquisition strengthens Ventive's leisure hospitality portfolio with entry into Goa and adds a Hilton-flagged resort with refurbishment and expansion potential of 64 additional keys and villa development. This aligns with Ventive's strategy to double its portfolio to approximately 4,000 keys over 5 years. The transaction is expected to complete before the end of Quarter III of Financial Year 2025-26 and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758819456792,
            "Source": "order&deals"
        },
        {
            "Title": "Ventive Hospitality Reports 18% Revenue Growth to INR 520 Crores in Q1 FY26",
            "Summary": "Ventive Hospitality Limited reported consolidated revenue of INR 520 crores, up 18% year-on-year, with consolidated EBITDA growing 13% to INR 220.3 crores. The hospitality segment drove growth with revenue increasing 23% to INR 386 crores. India hospitality revenue grew 13% to INR 179 crores with EBITDA margin expanding 4 percentage points to 35%. International operations, primarily in Maldives, showed strong performance with revenue up 33% to INR 207 crores and EBITDA growing 47%. The company signed management contracts for 3 new hotels with Marriott International and has a pipeline of over 2,000 keys, aiming to double its portfolio in 5 years. Management expects mid-teens revenue growth and high-teens EBITDA growth in the medium term, with cumulative EBITDA of INR 6,500 crores projected over the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1755596727839,
            "Source": "earnings"
        },
        {
            "Title": "Ventive Hospitality Reports Strong Q1 FY26 Results with 18% Revenue Growth and Strategic Acquisitions",
            "Summary": "Ventive Hospitality Limited reported consolidated revenue of ₹520 crore for Q1 FY26, marking an 18% year-on-year growth. The company's hospitality business generated revenue of ₹387 crore with 23% growth, while EBITDA reached ₹220 crore with 13% growth. Consolidated EBITDA margin stood at 42% and profit after tax was ₹38 crore. The Board approved acquisition of 12,93,380 equity shares (1.31%) in Urbanedge Hotels Private Limited for ₹1.81 crore, making it a wholly owned subsidiary. Directors also approved a corporate guarantee of up to USD 35 million for subsidiary Kudakurathu Island Resorts Private Limited's credit facilities with Standard Chartered Bank. The company's India hospitality business grew 13% in revenue with 28% EBITDA growth, while international operations showed 33% revenue growth and 47% EBITDA growth. Management highlighted strong performance despite travel disruptions from geopolitical tensions and signed management contracts with Marriott International for seven new hotels adding 1,548 keys over five years.",
            "Sentiment": "positive",
            "PublishDate": 1755100827396,
            "Source": "earnings"
        },
        {
            "Title": "Ventive Hospitality Reports Strong Revenue Growth Despite Margin Decline in Q1",
            "Summary": "Ventive Hospitality reported quarterly results showing significant revenue growth to 5.1 billion rupees from 1.15 billion rupees year-over-year. EBITDA increased to 2.1 billion rupees from 678 million rupees, though EBITDA margin declined to 40.93% from 59.01%. Consolidated net profit rose marginally to 269 million rupees from 264 million rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1755097865481,
            "Source": "earnings"
        },
        {
            "Title": "Ventive Hospitality: Partners with Marriott for Seven Luxury Hotels in India and Sri Lanka",
            "Summary": "Ventive Hospitality has entered an agreement with Marriott International to construct seven luxury hotels totaling 1,548 rooms in India and Sri Lanka. The partnership includes brand debuts in Varanasi, Pune, and Navi Mumbai. Three hotels will be developed by Ventive Hospitality, while four will be built by promoter group companies with potential transfer to Ventive Hospitality.",
            "Sentiment": "positive",
            "PublishDate": 1751967204000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ventive Hospitality Reports Strong Q4 Financial Results",
            "Summary": "Ventive Hospitality announced its Q4 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 1.3 billion rupees, up from 472 million rupees in the same quarter last year and 223 million rupees in the previous quarter. Revenue also saw a substantial rise to 6.97 billion rupees, compared to 1.2 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1747095763000,
            "Source": "default"
        },
        {
            "Title": "Ventive Hospitality Reports Strong Q4 Financial Results",
            "Summary": "Ventive Hospitality announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 3.5 billion rupees from 1.2 billion rupees in the previous year. However, the EBITDA margin decreased to 50.38% from 61.11%. The consolidated net profit rose to 1.3 billion rupees, up from 472 million rupees year-over-year and 223 million rupees quarter-over-quarter. Revenue for Q4 reached 6.97 billion rupees, a substantial increase from 1.2 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747061763000,
            "Source": "result"
        },
        {
            "Title": "Ventive Hospitality Ltd: Aggressive Acquisition Strategy with Rs 500 Crore Annual Free Cash Flow",
            "Summary": "Ventive Hospitality Ltd, backed by Blackstone, plans to deploy over Rs 500 crore free cash flow annually for acquisitions. CEO Ranjit Batra aims to double inventory in five years, focusing on chunky assets with good EBITDA. Upcoming additions include projects in Varanasi, Bengaluru, and Sri Lanka. The company currently manages over 2,000 hotel keys across luxury segments.",
            "Sentiment": "positive",
            "PublishDate": 1742896580000,
            "Source": "normal_news"
        },
        {
            "Title": "Ventive Hospitality: 31% EBITDA Growth in First Post-IPO Quarter",
            "Summary": "Ventive Hospitality Ltd reported strong Q3FY25 results with 31% YoY EBITDA growth to ₹277.6 crore and 15% revenue growth to ₹566.4 crore. Core hospitality segment saw 33% EBITDA growth. Occupancy rose 3% to 63%, and RevPAR grew 8%. The company completed its IPO in December 2024, raising ₹1,600 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739435001000,
            "Source": "earnings"
        },
        {
            "Title": "Ventive Hospitality Utilizes IPO Proceeds to Reduce Debt",
            "Summary": "Ventive Hospitality has used ₹14,000 million from its Initial Public Offering (IPO) proceeds to repay debt. As a result, the company's net debt has decreased to ₹17,366.44 million at the consolidated level. Additionally, the weighted average interest rate has been reduced to 8.02% per annum.",
            "Sentiment": "positive",
            "PublishDate": 1738714615000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ventive Hospitality Utilizes IPO Proceeds for Debt Repayment",
            "Summary": "Ventive Hospitality has used ₹14,000 million from its Initial Public Offering (IPO) proceeds to repay debt. As a result, the company's net debt has been reduced to ₹17,366.44 million at the consolidated level. Additionally, the weighted average interest rate has decreased to 8.02% per annum.",
            "Sentiment": "positive",
            "PublishDate": 1738675360000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ventive Hospitality Approves Investments in Maldives Properties",
            "Summary": "Ventive Hospitality has approved investments in two Maldives properties. The company will invest USD 51 million in Maldives Property Holdings and USD 41 million in SS & L Beach.",
            "Sentiment": "positive",
            "PublishDate": 1736520611000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ventive Hospitality: Strong Market Debut with 10% Premium",
            "Summary": "Blackstone-backed Ventive Hospitality Ltd. shares closed at Rs 706 on BSE, a 9.7% premium over the issue price of Rs 643. The Rs 1,600-crore IPO was oversubscribed 9.8 times. The company plans to use up to Rs 1,400 crore for debt repayment. Ventive Hospitality reported a 27% rise in net profit to Rs 166 crore in fiscal 2024.",
            "Sentiment": "positive",
            "PublishDate": 1735556707000,
            "Source": "result"
        },
        {
            "Title": "Ventive Hospitality: Shares List at 12% Premium on BSE",
            "Summary": "Ventive Hospitality shares debuted on the BSE at ₹718.15, an 11.7% premium over the issue price of ₹643. The stock opened at ₹716 on NSE, reaching a high of ₹732.80. As of 10:05 AM, it traded at ₹717.85 on BSE and ₹716.45 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1735533058000,
            "Source": "normal_news"
        },
        {
            "Title": "Ventive Hospitality: Shares List at 12% Premium in Successful IPO Debut",
            "Summary": "Ventive Hospitality shares listed at ₹718.15 on BSE, a 12% premium over the IPO price of ₹643. The ₹1,600 crore IPO was entirely a fresh issue. The company plans to use proceeds for debt payment. Ventive is a joint venture between Blackstone Group and Panchshil Realty, owning 11 operational properties with 2,036 keys across luxury segments in India and Maldives.",
            "Sentiment": "positive",
            "PublishDate": 1735532902000,
            "Source": "corporate_action"
        }
    ]
}