{
    "Symbol": "VENUSREM",
    "ISIN": "INE411B01019",
    "News": [
        {
            "Title": "Venus Remedies Q3 Net Profit Rises 30.6% to ₹256M",
            "Summary": "Venus Remedies reports consolidated net profit of ₹256 million in Q3, up from ₹196 million year-on-year. Revenue increased marginally to ₹1.8 billion from ₹1.77 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1769694887345,
            "Source": "co_actions_results"
        },
        {
            "Title": "Venus Remedies Gets ₹11.77 Cr PLI Scheme Funding",
            "Summary": "Venus Remedies receives ₹11.77 crore under the PLI scheme, adding to its previous ₹10 crore disbursement, strengthening its pharmaceutical manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1769069767795,
            "Source": "stocks"
        },
        {
            "Title": "Venus Remedies Board Meet on Jan 29 for Q3FY26 Results",
            "Summary": "Venus Remedies Limited has scheduled a board meeting on January 29, 2026, to consider and approve unaudited standalone and consolidated financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768806048762,
            "Source": "stocks"
        },
        {
            "Title": "Venus Remedies corrects UDIN for Q2FY26 results",
            "Summary": "Venus Remedies Limited updates UDIN for consolidated financial results after clerical duplication error in statutory auditor reports for quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768290124176,
            "Source": "co_actions_results"
        },
        {
            "Title": "Venus Remedies Gets Indonesia Marketing Nod",
            "Summary": "Venus Remedies Limited has received marketing authorisation from Indonesian regulatory authorities for its antibiotic combination Ceftazidime + Avibactam, expanding its international market presence.",
            "Sentiment": "positive",
            "PublishDate": 1767924817749,
            "Source": "stocks"
        },
        {
            "Title": "Venus Remedies gets Indonesia nod for antibiotic combo",
            "Summary": "Venus Remedies Limited receives marketing authorisation in Indonesia for Ceftazidime + Avibactam antibiotic combination, marking its first approval for this product in the Southeast Asian market.",
            "Sentiment": "positive",
            "PublishDate": 1767875216039,
            "Source": "stocks"
        },
        {
            "Title": "Venus Remedies Receives Final ₹11 Crore Milestone Payment from Cipla for AMR Drug",
            "Summary": "Venus Remedies received the final anticipated milestone payment of ₹11 crore from Cipla, completing all commercial milestones under their 2019 licensing agreement for an anti-infective drug targeting multidrug-resistant infections in India. The patented product has delivered therapeutic benefits to over one million patients with no serious drug-related adverse events reported, validating Venus Remedies' AMR-focused research capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765172020626,
            "Source": "stock"
        },
        {
            "Title": "Venus Remedies Resolves All Income Tax Disputes, Eliminates ₹33.44 Crore Contingent Liability",
            "Summary": "Venus Remedies has successfully settled all outstanding income tax matters, resulting in the removal of ₹33.44 crore in contingent liabilities from its books. The company has also obtained refunds for protest deposits previously made during the dispute resolution process.",
            "Sentiment": "positive",
            "PublishDate": 1764565371667,
            "Source": "stock"
        },
        {
            "Title": "Venus Remedies Reports 37% Revenue Growth in Q2 FY26 Despite Subsidiary Challenges",
            "Summary": "Venus Remedies Limited reported consolidated revenue from operations of Rs 192.75 crores for the quarter ended September 30, 2025, compared to Rs 137.18 crores in the previous quarter, marking significant growth. Net profit for the quarter stood at Rs 20.13 crores versus Rs 9.60 crores in the preceding quarter. For the half-year period, consolidated revenue reached Rs 329.93 crores with net profit of Rs 29.73 crores. However, the company's German subsidiary Venus Pharma GmbH faces financial difficulties with negative net worth of Rs 132.10 lakhs. The subsidiary reported revenue of Rs 10.61 crores and net profit of Rs 1.21 crores for the quarter. Management expects the subsidiary's financial position to improve by the end of financial year 2025-26 through proposed financial support and revival strategies. Share application money of Rs 2,859.72 lakhs remains pending for allotment in the German subsidiary as it's not mandatory under German laws. The company operates primarily in the pharmaceuticals segment.",
            "Sentiment": "positive",
            "PublishDate": 1762810729232,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Reports Strong Q2 Performance with Net Profit Surge to 201.3M Rupees",
            "Summary": "Venus Remedies delivered robust quarterly results with net profit jumping to 201.3 million rupees from 35.1 million rupees year-over-year. Revenue increased to 1.93 billion rupees compared to 1.7 billion rupees in the same period last year. EBITDA rose significantly to 309.6 million rupees from 75.6 million rupees, while EBITDA margin expanded to 16.06% from 4.44% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762778957638,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Announces Social Media Communication on Special Window for Physical Share Transfer Re-lodgement",
            "Summary": "Venus Remedies Limited informed stock exchanges NSE and BSE about posts made on its official social media platforms regarding a special window for re-lodgement of transfer requests of physical shares. The company shared links to posts on Instagram, Facebook, LinkedIn, and X (formerly Twitter) that contain a notice to shareholders about the opening of this special window. The initiative follows SEBI Circular No. SEBI/HO/MIRSD/MIRSD-PoD/P/CIR/2025/97 dated July 02, 2025. The communication was signed by Company Secretary Neha.",
            "Sentiment": "neutral",
            "PublishDate": 1761652570586,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Schedules Board Meeting for November 10, 2025 to Approve Quarterly Results",
            "Summary": "Venus Remedies Limited has announced a Board of Directors meeting scheduled for November 10, 2025. The meeting will consider and approve unaudited standalone and consolidated financial results for the period ended September 30, 2025. The company has closed its trading window for designated persons from October 1, 2025, until 48 hours after the declaration of financial results, in compliance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761556748582,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Opens Special Window for Physical Share Transfer Re-lodgement",
            "Summary": "Venus Remedies Limited announced the opening of a special window for re-lodgement of transfer requests for physical shares. The announcement was made through the company's official social media platforms including Instagram, Facebook, LinkedIn, and X. The initiative follows SEBI circular dated July 02, 2023. The company provided social media links for the notice to shareholders regarding this special window for physical share transfer requests.",
            "Sentiment": "neutral",
            "PublishDate": 1756269159228,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Opens Special Window for Physical Share Transfer Re-lodgement",
            "Summary": "Venus Remedies Limited announced the opening of a special window for re-lodgement of transfer requests for physical shares. The company communicated this information through its official social media platforms including Instagram, Facebook, LinkedIn, and X (formerly Twitter). The initiative follows SEBI Circular No. SEBI/HO/MIRSD/MIRSD-PoD/P/CIR/2025/97 dated July 02, 2025. The company has provided links to the social media posts containing the notice to shareholders about this special window facility.",
            "Sentiment": "neutral",
            "PublishDate": 1755166474199,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Reports Strong Q1 Results with Net Profit Surge to 96M Rupees",
            "Summary": "Venus Remedies reported consolidated net profit of 96 million rupees in Q1, significantly higher than 12 million rupees in the same period last year. The company's revenue grew to 1.32 billion rupees compared to 1.09 billion rupees year-over-year, representing growth in both profitability and top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1754048077088,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Reports Q4 Net Profit Increase",
            "Summary": "Venus Remedies announced its Q4 consolidated net profit of 210 million rupees, up from 105 million rupees year-over-year and 196 million rupees quarter-over-quarter. The company's Q4 revenue remained stable at 1.95 billion rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748304284000,
            "Source": "default"
        },
        {
            "Title": "Venus Remedies Reports Q4 Financial Results",
            "Summary": "Venus Remedies announced its Q4 financial results. The company's EBITDA increased to 290 million rupees from 194.9 million rupees year-over-year. EBITDA margin improved to 14.87% from 9.99% year-over-year. Revenue remained stable at 1.95 billion rupees. Consolidated net profit rose to 210 million rupees from 105 million rupees year-over-year and 196 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748278845000,
            "Source": "result"
        },
        {
            "Title": "Venus Remedies: GMP Certification Renewal Boosts Global Presence",
            "Summary": "Venus Remedies renewed its GMP certification from Ukraine's SMDC for its Baddi Unit-II facility. This strengthens its global pharmaceutical presence and access to PIC/S markets. The company's shares gained over 3% following the news.",
            "Sentiment": "positive",
            "PublishDate": 1747895706000,
            "Source": "normal_news"
        },
        {
            "Title": "Venus Remedies Secures Ukrainian GNP Renewal",
            "Summary": "Venus Remedies has obtained a renewal for its Good Manufacturing Practice (GMP) certification from Ukraine, strengthening its global pharmaceutical presence. This renewal allows the company to continue its operations in the Ukrainian market.",
            "Sentiment": "positive",
            "PublishDate": 1747888086000,
            "Source": "default"
        },
        {
            "Title": "Venus Remedies: FDA Grants QIDP Designation for Anti-Microbial Resistance Therapy",
            "Summary": "Venus Remedies' investigational product VRP-034 received Qualified Infectious Disease Product (QIDP) designation from the US FDA for treating bloodstream infections. The stock jumped 14.3% to ₹356.65, an 8-week high, following this announcement.",
            "Sentiment": "positive",
            "PublishDate": 1744879194000,
            "Source": "normal_news"
        },
        {
            "Title": "Venus Remedies Receives QIDP Designation for Novel Antibiotic",
            "Summary": "The U.S. Food and Drug Administration (FDA) has granted Qualified Infectious Disease Product (QIDP) designation to Venus Remedies' VRP-034, a novel formulation of polymyxin B. This designation is given to antibacterial and antifungal drug candidates intended to treat serious or life-threatening infections, potentially expediting the drug's development and review process.",
            "Sentiment": "positive",
            "PublishDate": 1744864365000,
            "Source": "default"
        },
        {
            "Title": "Venus Remedies Secures Exclusive Licensing Rights for MET-X in India",
            "Summary": "Venus Remedies has obtained exclusive in-licensing rights from Infex Therapeutics to develop and commercialize MET-X in India. This agreement allows Venus Remedies to bring a new product to the Indian market, potentially expanding their portfolio and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1740458480000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Receives Market Authorization for Enoxaparin in Indonesia",
            "Summary": "Venus Remedies has obtained market authorization for its anticoagulant drug Enoxaparin in Indonesia. This approval allows the company to market and sell the medication in the Indonesian market, potentially expanding its global presence and revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1739172111000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Reports Strong Q3 Financial Results",
            "Summary": "Venus Remedies announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 196 million rupees from 69 million rupees in the previous year. Revenue rose to 1.77 billion rupees from 1.43 billion rupees. The company also reported an exceptional item of 99.1 million rupees. Profit before tax (PBT) grew to 248.8 million rupees from 77.8 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738714722000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Reports Significant Profit Increase in Q3",
            "Summary": "Venus Remedies has reported a substantial increase in profit before tax (PBT) for the third quarter. The company's PBT rose to 248.8 million rupees, compared to 77.8 million rupees in the same period last year. Additionally, the company reported an exceptional item of 99.1 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738687700000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Reports Improved Q3 EBITDA and Margin",
            "Summary": "Venus Remedies has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 203.9 million rupees, up from 143.9 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 11.53% from 10.03% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738687694000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Reports Q3 Revenue Growth",
            "Summary": "Venus Remedies announced its financial results for the third quarter, reporting revenue of 1.77 billion rupees, compared to 1.43 billion rupees in the same period last year. This represents a year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738687688000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Reports Significant Profit Growth in Q3",
            "Summary": "Venus Remedies has announced a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 196 million rupees, compared to 69 million rupees in the same quarter of the previous year, representing a year-over-year growth. Additionally, the profit showed a quarter-over-quarter increase from 35.1 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738687680000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies to Consider Q3 Results",
            "Summary": "Venus Remedies has announced that it will consider its third quarter (Q3) financial results on February 4. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737723200000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Remedies Renews European GMP Certification",
            "Summary": "Venus Remedies has successfully renewed its European Good Manufacturing Practices (GMP) certification. The certification was granted by Infarmed, the National Authority of Medicines and Health Products in Portugal. This renewal demonstrates the company's continued compliance with European quality standards for pharmaceutical manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1737418861000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Venus Remedies: Successful Renewal of European GMP Certification",
            "Summary": "Venus Remedies Ltd has renewed its European Good Manufacturing Practices (GMP) certification from Infarmed, Portugal's national authority. The certification covers manufacturing facilities for cephalosporin, carbapenem, and lyophilized injectable oncology formulations. The company has maintained EU GMP certification since 2007 and is a leading exporter of meropenem outside India.",
            "Sentiment": "positive",
            "PublishDate": 1737378805000,
            "Source": "normal_news"
        },
        {
            "Title": "Venus Remedies Renews European GMP Certification",
            "Summary": "Venus Remedies has successfully renewed its European Good Manufacturing Practices (GMP) certification. The certification was granted by INFARMED, the National Authority of Medicines and Health Products in Portugal. This renewal validates the company's compliance with European quality standards for pharmaceutical manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1737374177000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Venus Remedies Obtains GMP Certification from Moldova Government",
            "Summary": "Venus Remedies has received Good Manufacturing Practice (GMP) certification from the government of Moldova. This certification is a recognition of the company's adherence to quality standards in pharmaceutical manufacturing and may potentially open up new market opportunities for Venus Remedies in Moldova.",
            "Sentiment": "positive",
            "PublishDate": 1735630505000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Receives Authorization for Southeast Asian Market Expansion",
            "Summary": "Venus Remedies has announced that it has received authorization to strengthen its presence in the Southeast Asian pharmaceutical market. This authorization is described as a significant milestone for the company's growth strategy in the region.",
            "Sentiment": "positive",
            "PublishDate": 1733471408000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Develops Chemotherapeutic Agent for Lung Cancer and Mesothelioma",
            "Summary": "Venus Remedies has developed a chemotherapeutic agent that is widely used in the treatment of lung cancer and mesothelioma. This development represents a significant advancement in cancer treatment options.",
            "Sentiment": "positive",
            "PublishDate": 1733471363000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Obtains Marketing Authorization in Philippines",
            "Summary": "Venus Remedies has secured marketing authorization for its products in the Philippines, expanding its market presence in Southeast Asia. This development allows the company to sell and distribute its pharmaceutical products in the Philippine market, potentially boosting its international sales and market reach.",
            "Sentiment": "positive",
            "PublishDate": 1733471301000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Expands into Eastern Europe with New Hungarian Subsidiary",
            "Summary": "Venus Remedies has announced that its board has approved the establishment of a wholly owned subsidiary in Hungary. This new subsidiary will be created through Venus Pharma GmbH, the company's existing wholly owned subsidiary in Germany. The strategic move is aimed at enhancing Venus Remedies' market presence in Eastern Europe.",
            "Sentiment": "positive",
            "PublishDate": 1732889890000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies: Secures Malaysian PIC/S Certification for Pre-filled Syringe Facility",
            "Summary": "Venus Remedies Limited received GMP approval with PIC/S accreditation from Malaysia's NPRA for its pre-filled syringe facility in Baddi, India. This certification, announced on November 5, 2024, is the company's first PIC/S GMP accreditation for its PFS facility. It allows Venus Remedies to expedite regulatory approvals in other PIC/S member countries. The company's robotic facility can produce over 20 million units of enoxaparin annually.",
            "Sentiment": "positive",
            "PublishDate": 1730783606000,
            "Source": "normal_news"
        },
        {
            "Title": "Venus Remedies Gains Key Accreditation for Global Expansion",
            "Summary": "Venus Remedies has received an important accreditation that will facilitate quicker approvals in PIC/S (Pharmaceutical Inspection Co-operation Scheme) member countries. This accreditation is expected to open doors to expanded global business opportunities for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730779717000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Remedies Expands in ASEAN with Malaysian Approval for Pre-Filled Syringe Facility",
            "Summary": "Venus Remedies has received Malaysian PIC/S GMP approval for its pre-filled syringe facility, allowing the company to expand its reach in the ASEAN region. This approval is likely to enhance the company's market presence and potential for growth in Southeast Asian markets.",
            "Sentiment": "positive",
            "PublishDate": 1730779647000,
            "Source": "corporate_action"
        }
    ]
}