{
    "Symbol": "VENUSPIPES",
    "ISIN": "INE0JA001018",
    "News": [
        {
            "Title": "Venus Pipes Q3 Net Profit Surges 42% to ₹256M",
            "Summary": "Venus Pipes & Tubes reported strong Q3 performance with net profit rising 42% year-on-year to ₹256 million from ₹180 million in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1770275462313,
            "Source": "co_actions_results"
        },
        {
            "Title": "Venus Pipes & Tubes Q3 FY26 earnings call on Feb 5",
            "Summary": "Venus Pipes & Tubes Limited has scheduled its Q3 & 9M FY26 results conference call for February 05, 2026 at 3:00 PM IST, hosted by DAM Capital Advisors with key management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769959175187,
            "Source": "co_actions_results"
        },
        {
            "Title": "Venus Pipes Credit Rating Reaffirmed by Infomerics",
            "Summary": "Venus Pipes & Tubes receives rating reaffirmation from Infomerics with IVR A/Stable for long-term facilities worth ₹134.22 crores and IVR A1 for short-term facilities of ₹22.00 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766065892025,
            "Source": "stocks"
        },
        {
            "Title": "Venus Pipes Reports Record Revenue of INR 291.5 Crores in Q2 FY26",
            "Summary": "Venus Pipes and Tubes Limited achieved all-time high quarterly revenue of INR 291.5 crores, marking 27% year-on-year growth driven by strong export performance which reached INR 115.6 crores with 53% growth. The company maintains healthy order book of INR 490 crores and commissioned additional seamless pipe capacity of 1,800 MTPA, with management maintaining 25% revenue growth guidance for the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1763363521093,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes Sets 25% Revenue Growth Target and Projects EBITDA Margins of 16-18%",
            "Summary": "Venus Pipes has confirmed a 25% revenue growth target for FY'26. The company expects EBITDA margins of 16-18% for FY'27, with potential improvements anticipated from new products and facilities.",
            "Sentiment": "positive",
            "PublishDate": 1762832267255,
            "Source": "stock"
        },
        {
            "Title": "Venus Pipes Reports 10.6% Growth in Q2 Net Profit to 261M Rupees",
            "Summary": "Venus Pipes reported quarterly net profit of 261 million rupees compared to 236 million rupees in the same period last year. Revenue increased to 2.9 billion rupees from 2.3 billion rupees year-over-year. EBITDA rose to 475 million rupees from 409 million rupees, though EBITDA margin declined to 16.3% from 17.87% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762762905862,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes & Tubes Commences Commercial Production at New Seamless Pipes Facility",
            "Summary": "Venus Pipes & Tubes Limited has commenced commercial production of seamless pipes/tubes with a capacity of 1,800 MTPA on November 5, 2025. This expansion brings the company's total seamless pipes tubes capacity to 16,200 MTPA. The company manufactures stainless steel seamless and welded pipes and tubes, and holds multiple certifications including ISO 9001:2015, 14001:2015, and 45001:2018.",
            "Sentiment": "positive",
            "PublishDate": 1762330833798,
            "Source": "stock"
        },
        {
            "Title": "Venus Pipes & Tubes Schedules Q2 FY2025-26 Results Conference Call",
            "Summary": "Venus Pipes & Tubes Limited has announced a conference call with analysts and investors to discuss their Q2 FY2025-26 financial results. The call is scheduled for November 10, 2025, at 3:00 PM IST. The company's management team participating includes Managing Director Arun Kothari, Whole Time Director Dhruv M Patel, and CFO Kunal Bubna. DAM Capital Advisors Limited is hosting the post-results conference call, with Aasim Bharde serving as the analyst call leader. The company manufactures stainless steel seamless and welded pipes, tubes, and U-tubes, and holds multiple certifications including ISO standards.",
            "Sentiment": "neutral",
            "PublishDate": 1762257239190,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes & Tubes Reports Record Revenue of Rs. 276.4 Crores in Q1 FY2026, Driven by 69% Export Growth",
            "Summary": "Venus Pipes & Tubes Limited achieved record quarterly revenue of Rs. 276.4 crores in Q1 FY2026, marking a 15% year-on-year increase from Rs. 240.1 crores. The growth was primarily driven by exports, which surged 69% to Rs. 103.1 crores. However, EBITDA declined to Rs. 44.9 crores from Rs. 47.9 crores in the previous year, with margins at 16.2%. PAT decreased to Rs. 24.8 crores from Rs. 27.5 crores. The company maintains a healthy order book of Rs. 560 crores and secured a significant order worth Rs. 190-200 crores from an Indian power equipment manufacturer. Management upgraded FY2026 revenue growth guidance to 25% from 20%. The company is investing Rs. 175 crores in capacity expansion, with Rs. 120 crores planned for FY2026, including a new fittings plant. Challenges include US tariff increases from 25% to 50% and pressure on welded pipe realizations, though the company is diversifying export markets and focusing on value-added products.",
            "Sentiment": "positive",
            "PublishDate": 1755532195646,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes Raises FY26 Revenue Growth Forecast to 25%",
            "Summary": "Venus Pipes has revised its revenue growth forecast for FY26 upward from 20% to 25%. The company maintained its EBITDA margin guidance at 16-18% for the same period.",
            "Sentiment": "positive",
            "PublishDate": 1755056983762,
            "Source": "stock"
        },
        {
            "Title": "Venus Pipes Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Venus Pipes announced Q1 financial results showing revenue growth to 2.76 billion rupees from 2.4 billion rupees year-over-year. However, net profit declined to 248 million rupees from 275 million rupees compared to the same period last year. EBITDA decreased to 448 million rupees from 479 million rupees year-over-year, with EBITDA margin compressing to 16.21% from 19.96% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754988046203,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes & Tubes: Q4 Profit at Rs 23.7 Crore, Revenue Up 15%",
            "Summary": "Venus Pipes & Tubes reported Q4 FY25 profit of Rs 23.7 crore, down from Rs 25 crore year-over-year. Revenue increased 15% to Rs 258.1 crore. FY25 full-year profit grew 8.1% to Rs 93 crore, with revenue up 19% to Rs 958.5 crore. The company expanded into value-added products and commenced operations of 3,600 MTPA capacity for welded tubes.",
            "Sentiment": "positive",
            "PublishDate": 1748337815000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes Reports Q4 Financial Results",
            "Summary": "Venus Pipes has released its Q4 financial results. The company's EBITDA for Q4 was 416 million rupees, compared to 450 million rupees in the same quarter last year. The EBITDA margin decreased to 16.12% from 20.1% year-over-year. Revenue for Q4 increased to 2.6 billion rupees from 2.24 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748252244000,
            "Source": "result"
        },
        {
            "Title": "Venus Pipes Reports Q4 Net Profit of 237M Rupees",
            "Summary": "Venus Pipes has reported a net profit of 237 million rupees for the fourth quarter, compared to 250 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1748252204000,
            "Source": "result"
        },
        {
            "Title": "Venus Pipes & Tubes Commences Operations of New Value-Added Welded Tubes Facility",
            "Summary": "Venus Pipes & Tubes has announced the commencement of operations for a new facility producing value-added welded tubes. The new facility has a capacity of 3,600 MTPA (Metric Tonnes Per Annum).",
            "Sentiment": "positive",
            "PublishDate": 1747926268000,
            "Source": "default"
        },
        {
            "Title": "Venus Pipes and Tubes Secures Major Projects",
            "Summary": "Venus Pipes and Tubes has received a Letter of Intent (LOI) for projects valued at 1.90 billion rupees. This significant order indicates potential growth and increased business activity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1746717498000,
            "Source": "default"
        },
        {
            "Title": "Venus Pipes and Tubes Ltd: Investec Initiates 'Buy' Rating on Expansion Plans",
            "Summary": "Investec initiated coverage on Venus Pipes and Tubes Ltd with a 'buy' rating and a target price of Rs 1,665. The company's rapid capacity expansion, improved profitability through backward integration, and expansion into titanium and seamless tubes are highlighted as key growth drivers. The stock rose up to 5.29% on the NSE following this news.",
            "Sentiment": "positive",
            "PublishDate": 1739947787000,
            "Source": "normal_news"
        },
        {
            "Title": "Venus Pipes & Tubes Ltd: Q3 Revenue Up 12%, Exports Surge 153%",
            "Summary": "Venus Pipes & Tubes Ltd reported Q3FY25 revenue of ₹231.3 crore, up 12% YoY. Exports increased 153% YoY, now accounting for 38.5% of quarterly revenue. EBITDA was ₹37 crore with 16% margins, and PAT stood at ₹18 crore. The company's Phase 1 capex project is on track for completion by March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1739441777000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes Reports Decline in Q3 Net Profit",
            "Summary": "Venus Pipes has reported a net profit of 180 million rupees for the third quarter, down from 233 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739432457000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes & Tubes Schedules Q3 Results Review",
            "Summary": "Venus Pipes & Tubes has announced that it will consider and review its financial results for the third quarter on February 13.",
            "Sentiment": "neutral",
            "PublishDate": 1738844223000,
            "Source": "earnings"
        },
        {
            "Title": "Venus Pipes Announces Two-Phase Capacity Expansion Plan",
            "Summary": "Venus Pipes has revealed a two-phase capacity expansion plan. Phase 1, with a capex of Rs 115 crore, focuses on setting up value-added fittings and welded tubes, to be completed by March 2025. Phase 2, with a capex of Rs 65 crore, involves expanding capacity for value-added fittings and welded/seamless pipes/tubes, scheduled for completion by December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1731553827000,
            "Source": "corporate_action"
        },
        {
            "Title": "Venus Pipes Reports Q2 EBITDA Growth",
            "Summary": "Venus Pipes has reported its Q2 financial results. The company's EBITDA increased to 409 million rupees from 347 million rupees year-over-year. However, the EBITDA margin slightly decreased to 17.87% from 18.12% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731491751000,
            "Source": "result"
        },
        {
            "Title": "Venus Pipes Reports Q2 Profit and Revenue Growth",
            "Summary": "Venus Pipes has announced its Q2 financial results, showing a year-over-year increase in both net profit and revenue. The company's net profit rose to 236 million rupees from 203 million rupees in the same quarter last year. Revenue also grew to 2.3 billion rupees from 1.9 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731491668000,
            "Source": "result"
        }
    ]
}