{
    "Symbol": "VERANDA",
    "ISIN": "INE0IQ001011",
    "News": [
        {
            "Title": "Veranda Learning Q3 FY26 Monitoring Report Filed",
            "Summary": "Veranda Learning Solutions submitted monitoring agency report for Q3 FY26, confirming full utilization of ₹35.00 crores from equity shares and ₹6.25 crores from convertible warrants with no deviations.",
            "Sentiment": "neutral",
            "PublishDate": 1770373158338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Veranda Learning Board Meet Set for Feb 6, 2026",
            "Summary": "Veranda Learning Solutions has scheduled a board meeting on February 06, 2026, to approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769778955698,
            "Source": "co_actions_results"
        },
        {
            "Title": "Veranda Learning Files Commerce Demerger with NCLT",
            "Summary": "Veranda Learning Solutions has filed its Commerce Vertical demerger scheme with NCLT Chennai after receiving no adverse observations from stock exchanges. The demerger will create J.K. Shah Commerce Education Limited.",
            "Sentiment": "positive",
            "PublishDate": 1769575590434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Veranda Learning Allots 4.38L Shares Under ESOP",
            "Summary": "Veranda Learning Solutions allotted 4,37,956 equity shares under its ESOP Plan 2022 at ₹68.50 per share on January 21, 2026, increasing paid-up capital to ₹96.17 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769001137010,
            "Source": "co_actions_results"
        },
        {
            "Title": "Veranda Learning Gets BSE No-Objection for Scheme",
            "Summary": "Veranda Learning Solutions receives BSE observation letter with 'no adverse observations' for composite scheme of arrangement involving three companies under Companies Act provisions.",
            "Sentiment": "positive",
            "PublishDate": 1768843679543,
            "Source": "co_actions_results"
        },
        {
            "Title": "Veranda Learning Promoters Create Share Pledge",
            "Summary": "Veranda Learning Solutions promoters Kalpathi S. Aghoram, Kalpathi S. Ganesh, and Kalpathi S. Suresh disclosed pledge creation and modification on shares under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766747440681,
            "Source": "stocks"
        },
        {
            "Title": "Veranda Learning's Avinya Innovation Contest Concludes",
            "Summary": "Veranda Learning Solutions' nationwide Avinya innovation initiative for students concluded at IIIT-Bangalore, with winners announced from over 385 entries across 15 cities focusing on UN SDGs.",
            "Sentiment": "positive",
            "PublishDate": 1765858823901,
            "Source": "stocks"
        },
        {
            "Title": "Veranda K-12 Announces 15 Finalists for National Innovation Competition Avinya",
            "Summary": "Veranda Learning Solutions' K-12 division announced 15 shortlisted entries from 14 schools across 8 cities for the national round of Avinya, its flagship student innovation platform focused on sustainable development goals. The grand finale will be held on December 13 at IIIT Bengaluru, with the initiative receiving nearly 400 ideas from over 600 students representing more than 50 schools nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1763524079909,
            "Source": "stock"
        },
        {
            "Title": "Veranda Learning Solutions Completes Full Utilization of Rs 357.42 Crore QIP Proceeds",
            "Summary": "Veranda Learning Solutions Limited has fully utilized the Rs 357.42 crore raised through its Qualified Institutional Placement conducted from July 17-22, 2025. The monitoring agency report by Brickwork Ratings confirms 100% utilization of proceeds for the quarter ended September 30, 2025. The funds were deployed across three main objectives: Rs 310 crore for redemption of senior secured non-convertible debentures issued by subsidiary Veranda XL Learning Solutions Private Limited, Rs 39.94 crore for general corporate purposes, and Rs 7.48 crore for issue expenses. The QIP involved placement of 1,58,71,173 equity shares. No deviations from stated objectives were reported, and all regulatory approvals were obtained.",
            "Sentiment": "positive",
            "PublishDate": 1762567754000,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Students Secure Top 3 Ranks in CA September 2025 Exams",
            "Summary": "Veranda Learning Solutions' Commerce Vertical achieved the top three All India Ranks in the CA Final examinations for the third consecutive time. Students Mukund Agiwal (AIR 1), Tejas Mundada (AIR 2), and Bakul Gupta (AIR 3) topped the September 2025 CA exams announced by the Institute of Chartered Accountants of India. The company produced 154 All-India Rankers across all CA levels - 92 in CA Final, 54 in CA Inter, and 8 in CA Foundation. The results came from highly competitive exams with pass rates of 16.23% for CA Final, 9.43% for CA Inter, and 14.78% for CA Foundation. Veranda Commerce operates through brands including JK Shah Classes, BB Virtuals, Navkar Digital Institute, Logic School of Management, and Tapasya College of Commerce and Management, offering both online and offline CA preparation programs.",
            "Sentiment": "positive",
            "PublishDate": 1762399292919,
            "Source": "stock"
        },
        {
            "Title": "Veranda Learning Solutions Appoints Deloitte as Auditor for Material Subsidiary Following SCVJ Associates' Resignation",
            "Summary": "SCVJ Associates resigned as statutory auditors of BB Virtuals Private Limited, a material subsidiary of Veranda Learning Solutions Limited. The resignation was prompted by Veranda Learning's decision to appoint a common statutory auditor across all material subsidiaries as part of its internal governance framework following the acquisition of BB Publication Private Limited. Deloitte Haskins Sells has been appointed as the new statutory auditor for BB Virtuals Private Limited. SCVJ Associates confirmed they completed their professional obligations, including the limited review for the quarter ended September 30, 2025, and stated no other reasons for resignation beyond the management's auditor alignment policy.",
            "Sentiment": "neutral",
            "PublishDate": 1762297947190,
            "Source": "corporate_governance"
        },
        {
            "Title": "Veranda Learning Reports 19% Revenue Growth, Announces Commerce Division Demerger",
            "Summary": "Veranda Learning Solutions reported revenue of Rs. 127 crores for the quarter, marking 19% year-on-year growth, with EBITDA at Rs. 48 crores and adjusted PAT of Rs. 23.3 crores, up 185% year-on-year. The company achieved record cash collections of Rs. 173 crores compared to Rs. 137 crores in the previous quarter, with enrollments growing from 61,000 to nearly 1 lakh students. The Board approved demerging the Commerce Test Prep vertical into J.K. Shah Commerce Education Limited as a debt-free entity, expected to generate Rs. 350 crores revenue and Rs. 140 crores EBITDA in FY26. Existing shareholders will receive one share of the new entity for every Veranda share held. The company also divested its vocational segment to SNVA EduTech Limited in a share-based arrangement, giving Veranda a 50% stake in the global education enterprise. Under the Veranda 2.0 strategy, the company will focus on government test prep and academic segments. Management provided FY26 guidance of Rs. 650 crores revenue, Rs. 170 crores EBITDA, and Rs. 70 crores PAT for the combined entity.",
            "Sentiment": "positive",
            "PublishDate": 1761851178283,
            "Source": "earnings"
        },
        {
            "Title": "Veranda Learning Solutions Confirms Full Utilization of QIP Proceeds Worth Rs 31,000 Lakhs",
            "Summary": "Veranda Learning Solutions Limited has confirmed complete utilization of proceeds raised through its Qualified Institutional Placement of 1,58,71,173 equity shares conducted on July 22, 2025. The company raised Rs 31,000 lakhs which was fully utilized for the stated purpose of redeeming senior, secured, unlisted, redeemable, non-convertible debentures issued by its subsidiary Veranda XL Learning Solutions Private Limited, including interest payments. The company reported no deviation in the use of issue proceeds compared to the original objects. The Audit Committee reviewed the statement and the Board took it on record during their meetings held on October 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761652530976,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Completes Strategic Divestment, Acquires 50% Stake in SNVA Edutech",
            "Summary": "Veranda Learning Solutions Limited completed its strategic divestment of its vocational segment through equity share allotments by SNVA Edutech Limited on October 27, 2025. SNVA Edutech allotted 15,432 equity shares to Veranda Learning as consideration for the sale of its entire equity shareholding in Brain4dce Education Solutions Private Limited and Veranda Management Learning Solutions Private Limited, causing these entities to cease being subsidiaries. Additionally, 2,902 equity shares were allotted to Veranda Administrative Learning Solutions Private Limited for the sale of Six Phrase Edutech Private Limited. Following these transactions, Veranda Learning and its subsidiary collectively hold 50% of SNVA Edutech's equity share capital, making SNVA Edutech an associate company. Separately, JM Financial Services Limited released encumbrance on Veranda Learning shares, reducing its pledged holdings from 5.7958% to 1.2584% of the company's equity capital through the release of pledge on shares used as collateral for margin trading facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1761650354259,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Receives Regional Director Confirmation for Subsidiary Merger Scheme",
            "Summary": "Veranda Learning Solutions Limited announced that the Regional Director - Southern Region issued a confirmation order dated October 16, 2025, for the Scheme of Arrangement between its subsidiaries Sreedhar CCE Learning Solutions Private Limited and Veranda Race Learning Solutions Private Limited. The confirmation order was received by both subsidiaries on October 27, 2025. This development follows the company's earlier disclosure from March 28, 2025 regarding the merger scheme between the two wholly-owned subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1761648127508,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Reports Strong Q2 Performance with Revenue Growth and Return to Profitability",
            "Summary": "Veranda Learning delivered strong quarterly results with revenue increasing to 1.3 billion rupees from 1 billion rupees year-over-year. The company returned to profitability with consolidated net profit of 960 million rupees compared to a loss of 320 million rupees in the same period last year. EBITDA improved to 462 million rupees from 278 million rupees, while EBITDA margin expanded to 36.44% from 26.30%. The company recorded an exceptional gain of 902 million rupees during the quarter. Profit before tax reached 148 million rupees versus a loss of 236 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761638760462,
            "Source": "earnings"
        },
        {
            "Title": "Veranda Learning Reports Over 1.5 Lakh Student Enrollments in First Half of FY26",
            "Summary": "Veranda Learning has achieved over 1.5 lakh student enrollments during the first half of FY26. This enrollment figure represents the company's student acquisition performance for the six-month period.",
            "Sentiment": "positive",
            "PublishDate": 1759484367428,
            "Source": "stock"
        },
        {
            "Title": "Veranda Learning Divests Vocational Segment to SNVA Edutech for 50% Stake in INR 390.11 Crore Deal",
            "Summary": "Veranda Learning Solutions Limited has approved the divestment of its entire vocational segment to SNVA Edutech Limited for INR 390.11 crores through a share swap arrangement. The transaction involves transferring three subsidiaries - Brain4ce Education Solutions Private Limited, Veranda Management Learning Solutions Private Limited, and Six Phrase Edutech Private Limited - to SNVA. In exchange, Veranda will acquire a 50% equity stake in SNVA Edutech Limited. The deal is expected to complete by October 31, 2025, subject to shareholder approval at the Annual General Meeting. SNVA Edutech, incorporated in 2009, operates in education services and training with FY2025 turnover of INR 3,326.76 lakhs and assets of INR 2,079.27 lakhs. The combined entity will integrate vocational, skilling, and higher education operations across India, USA, UK, France, Italy, Malta, Switzerland, and Singapore. Additionally, the board approved converting outstanding loans into equity shares in Brain4ce Education Solutions, involving 5,99,718 shares with completion expected by September 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758801583134,
            "Source": "order&deals"
        },
        {
            "Title": "Veranda Learning Solutions Announces Demerger of Commerce Business into Separate Listed Entity",
            "Summary": "Veranda Learning Solutions announced plans to demerge its commerce education vertical into a separate listed company called J.K. Shah Commerce Education Limited (JKSC). Existing shareholders will receive one share of JKSC for every Veranda share held. The commerce segment, which includes brands like J.K. Shah Classes, BB Virtuals, Tapasya, Logic and Navkar, serves over 17,000 students across 70 intermediate colleges and operates 200 physical locations. The demerger is expected to take 7-8 months pending regulatory approvals. JKSC will be debt-free, while Veranda will retain INR125 crores of debt at 17.25% interest rate. The commerce vertical projects 22% revenue growth for FY26 with student numbers expected to rise from 1.7 lakh to 2 lakh. Management expects the commerce business to grow at 35-40% annually over the next 5-7 years, driven by domestic demand and global capability centers. The company reported consolidated EBITDA guidance of INR175-180 crores, with commerce contributing INR135 crores and non-commerce INR35-40 crores.",
            "Sentiment": "positive",
            "PublishDate": 1758289445234,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions to Demerge Commerce Test Prep Business into Separate Listed Entity JK Shah Commerce Education",
            "Summary": "Veranda Learning Solutions Limited plans to demerge its Commerce Test Prep segment into a separate listed company called JK Shah Commerce Education Limited (JKSC). The demerger will be executed through a composite scheme requiring National Company Law Tribunal approval. Existing VLS shareholders will receive shares in JKSC at a 1:1 ratio - one JKSC share for every VLS share held. The transaction includes transferring properties, assets, investments, employees, and contracts related to the Commerce Test Prep business to JKSC. The commerce segment operates across multiple entities including JK Shah, BB Virtual, Navkar, Tapasya, and managed colleges, serving over 200,000 students with projected revenues of ₹344 crores for FY26E. The company expects the indicative timeline for JKSC listing to be approximately 12 months. The demerger aims to create a focused commerce education entity as a debt-free structure, enable independent market valuation, and allow dedicated resource allocation for growth in the financial services education market.",
            "Sentiment": "positive",
            "PublishDate": 1757922211951,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Promoters Disclose Encumbrance on Shareholding",
            "Summary": "The promoters of Veranda Learning Solutions Limited - Kalpathi S Aghoram, Kalpathi S Ganesh, and Kalpathi S Suresh - have submitted a disclosure regarding a covenant that constitutes an encumbrance on their shareholding. The disclosure was made under SEBI's Substantial Acquisition of Shares and Takeovers Regulations to BSE Limited, National Stock Exchange of India Limited, and the company. The promoters filed this disclosure in compliance with Regulation 31 of the SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1757653962166,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Schedules Investor Meeting to Discuss Commerce Education Business Demerger",
            "Summary": "Veranda Learning Solutions Limited has scheduled an analyst and institutional investor meeting for September 15, 2025, at 2:00 PM IST via video conferencing. The meeting will focus on discussing the demerger of the company's Commerce Education Business into a resulting company. The session is organized by Go India Advisors and follows the Board of Directors' approval of a proposed Composite Scheme of Arrangement on September 11, 2025. Company participants include Executive Director & Chairman Suresh Kalpathi, Group COO Aditya Malik, and CFO Mohasin Khan. The company confirmed that no unpublished price sensitive information will be discussed during the meeting, and any presentation materials will be disclosed to stock exchanges prior to the session.",
            "Sentiment": "neutral",
            "PublishDate": 1757596707870,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Board Approves Merger and Demerger Plan",
            "Summary": "Veranda Learning Solutions' board has approved a plan to merge with Veranda XL Learning while simultaneously separating its commerce education business into J.K. Shah Commerce Education. The restructuring will not involve issuing new shares. The commerce education division being demerged generated turnover of ₹195.31 crore, representing 41.48% of the company's overall turnover.",
            "Sentiment": "neutral",
            "PublishDate": 1757576345798,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Converts ₹212.22 Crore Loan to Equity in Subsidiary",
            "Summary": "Veranda Learning has converted a loan of ₹212.22 crore into equity in its subsidiary Veranda XL Learning Solutions. This debt-to-equity conversion restructures the financial arrangement between the parent company and its unit.",
            "Sentiment": "neutral",
            "PublishDate": 1757556408169,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Acquires Remaining 24% Stake in Veranda XL Learning",
            "Summary": "Veranda Learning has acquired the remaining 24% stake in Veranda XL Learning, making VXL a wholly owned subsidiary of the company. This acquisition gives Veranda Learning complete ownership and control over Veranda XL Learning's operations.",
            "Sentiment": "positive",
            "PublishDate": 1757515530066,
            "Source": "order&deals"
        },
        {
            "Title": "Veranda Learning Solutions Promoters Agree to Maintain 34.05% Ownership Stake as Encumbrance",
            "Summary": "The promoters of Veranda Learning Solutions Limited - Kalpathi Subramanyam Aghoram, Kalpathi Subramanian Suresh, and Kalpathi Subramaniam Ganesh - have agreed to maintain ownership of at least 34.05% of the company's share capital. This agreement, made on September 3, 2025, follows an amendment to debenture trust deeds and constitutes an encumbrance over 3,18,71,573 shares. The promoters had previously pledged 64,65,516 shares (6.77% on a fully diluted basis) in relation to non-convertible debentures issued by Veranda Learning Solutions Limited and Veranda Race Learning Solutions Private Limited. The encumbrance is part of the terms of debenture trust deeds dated March 25, 2024, with Catalyst Trusteeship Limited acting as debenture trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1757336847535,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Board Approves Sale of Vocational Segment to Streamline Operations",
            "Summary": "Veranda Learning Solutions' board has approved the sale of its vocational segment, which includes Brain4CE Education and Veranda Management. The company aims to streamline operations and focus on four main areas through this divestiture.",
            "Sentiment": "neutral",
            "PublishDate": 1757059700770,
            "Source": "stock"
        },
        {
            "Title": "Veranda Learning Solutions Promoters Release Share Pledges Following Debenture Redemption",
            "Summary": "Three promoters of Veranda Learning Solutions Limited - Kalpathi S Aghoram, Kalpathi S Ganesh, and Kalpathi S Suresh - have released pledged shares totaling 77,04,339 shares (8.22% of total share capital). The pledge release occurred on August 22, 2025, following full redemption of VXL debentures. Catalyst Trusteeship Limited acted as the common security trustee on behalf of BPEA Credit India Fund III-Scheme F and Scheme C, Pico Capital Pvt. Ltd., and Aarti Rahul Chhabria. Post-release, the promoters collectively hold 3,84,69,650 shares (41.11% of total share capital), with 1,41,69,855 shares (15.15%) remaining encumbered. The disclosure was made to stock exchanges BSE and NSE on August 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756383137823,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Reports Full Utilization of Equity Proceeds, 25% Warrant Proceeds Used",
            "Summary": "Veranda Learning Solutions Limited submitted its monitoring agency report for the quarter ended June 30, 2025, covering the utilization of proceeds from a preferential issue. The company issued 11,98,630 equity shares at Rs. 292 per share and 7,78,817 convertible warrants at Rs. 321 per warrant. The company has fully utilized the Rs. 35 crores raised from equity shares during the quarter ended March 31, 2025. Additionally, 25% of the warrant subscription amount (Rs. 6.25 crores) has been utilized, while the remaining 75% is yet to be received. The monitoring agency India Ratings & Research reported no deviation from the stated objects of the issue. The proceeds are being used for growth initiatives including acquisitions, repayment of NCDs and other obligations, and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1755100543951,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Incorporates Wholly Owned Subsidiary J.K. Shah Commerce Education Limited",
            "Summary": "Veranda Learning Solutions Limited has successfully incorporated a wholly owned subsidiary named J.K. Shah Commerce Education Limited. The Ministry of Corporate Affairs approved the incorporation on August 13, 2025. The company had previously provided intimation about this development on July 28, 2025. This corporate action expands Veranda Learning's business structure through the establishment of a new subsidiary focused on commerce education.",
            "Sentiment": "positive",
            "PublishDate": 1755097111273,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Promoters Release Share Encumbrances Worth ₹243 Crore",
            "Summary": "Three promoters of Veranda Learning Solutions Limited - Mr. Kalpathi S Aghoram, Mr. Kalpathi S Ganesh, and Mr. Kalpathi S Suresh - released encumbrances on 2,42,99,795 shares representing 25.96% of the company's total share capital. The release occurred on August 8, 2025, following full redemption of VXL common debentures. The encumbrances were in the form of non-disposal undertakings held by Catalyst Trusteeship Limited as security trustee. Post-release, the promoters collectively hold 3,84,69,650 shares (41.10% of total share capital) with no remaining encumbered shares. The promoters' individual holdings are: Mr. Aghoram - 1,28,20,553 shares (13.71%), Mr. Ganesh - 1,28,26,809 shares (13.70%), and Mr. Suresh - 1,28,12,048 shares (13.69%).",
            "Sentiment": "positive",
            "PublishDate": 1754974930398,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Reports 17% Revenue Growth and Doubled EBITDA in Q1 FY26",
            "Summary": "Veranda Learning Solutions reported consolidated revenue growth of 17% year-on-year to INR139 crores for Q1 FY26. EBITDA nearly doubled to INR55 crores, while net profit increased 123% to INR6 crores. The company successfully completed a INR357 crores QIP and reduced debt from INR510 crores to INR195 crores. Management outlined their Veranda 2.0 strategy focusing on unbundling business verticals, with plans to demerge the commerce vertical as a separate listed entity. The company operates across four segments: academics (K-12 with 6 schools), government test prep, vocational training, and commerce education. For FY26, management provided guidance of INR660 crores revenue with INR242 crores EBITDA and INR80-85 crores PAT. The commerce vertical is expected to contribute INR340 crores revenue and INR170 crores EBITDA. Over 5,400 students were onboarded in the academic segment, while the vocational segment secured 25+ enterprise accounts including Deloitte and PwC, delivering 150+ placements during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754649849524,
            "Source": "earnings"
        },
        {
            "Title": "Veranda XL Learning Solutions Redeems INR 310 Crore NCDs Ahead of Schedule",
            "Summary": "Veranda XL Learning Solutions Private Limited, a subsidiary of Veranda Learning Solutions Limited, completed the full redemption of its senior, secured, redeemable, unlisted Non-Convertible Debentures on August 07, 2025. The premature redemption involved 31,000 NCDs worth INR 310 crores across four ISIN numbers, which were originally scheduled to mature on February 01, 2029. Following the redemption, the outstanding amount stands at nil, with the last interest payment made on May 01, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754633815331,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Uploads Q1 FY2026 Earnings Call Audio Recording",
            "Summary": "Veranda Learning Solutions Limited has made available the audio recording of their earnings call for the quarter ended June 30, 2025, on their company website. The earnings call, held on August 5, 2025, discussed the company's unaudited standalone and consolidated financial results for the quarter. The company notified both BSE and NSE about the availability of the recording through their Company Secretary S Balasundharam.",
            "Sentiment": "neutral",
            "PublishDate": 1754392272572,
            "Source": "earnings"
        },
        {
            "Title": "Veranda Learning Solutions Reports Q1 FY26 Results and Appoints New Secretarial Auditor",
            "Summary": "Veranda Learning Solutions Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs. 13,926.74 lakhs compared to Rs. 11,898.69 lakhs in the same quarter last year. The company posted a consolidated profit after tax of Rs. 596.51 lakhs versus a loss of Rs. 625.28 lakhs in the previous year quarter. On standalone basis, revenue was Rs. 1,227.08 lakhs with profit after tax of Rs. 3.93 lakhs. The Board also appointed M/s. Sandeep & Associates as Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company operates across five business segments: Managed school services, Commerce, Government test preparation, Vocational education, and Others.",
            "Sentiment": "positive",
            "PublishDate": 1754376604063,
            "Source": "earnings"
        },
        {
            "Title": "Veranda Learning Reports Strong Q1 Performance with EBITDA Rising to 372M Rupees",
            "Summary": "Veranda Learning reported Q1 EBITDA of 372 million rupees compared to 202 million rupees in the same period last year. The company's EBITDA margin improved to 26.7% from 16.95% year-over-year, indicating enhanced profitability and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754376177234,
            "Source": "earnings"
        },
        {
            "Title": "Veranda Learning Reports Narrower Q1 Loss at 65 Million Rupees",
            "Summary": "Veranda Learning posted a consolidated net loss of 65 million rupees in Q1, significantly lower than the 278 million rupees loss recorded in the same quarter of the previous year. The company's loss decreased by approximately 77% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754375655545,
            "Source": "earnings"
        },
        {
            "Title": "Veranda Learning Solutions Approves Merger of Two Subsidiaries",
            "Summary": "Veranda Learning Solutions Limited announced the approval of a merger between two of its subsidiaries - Veranda K-12 Learning Solutions Private Limited and Veranda Administrative Learning Solutions Private Limited. The boards of both companies approved the amalgamation scheme on August 4, 2025. Veranda K-12 Learning Solutions, which provides educational infrastructure services, will merge into Veranda Administrative Learning Solutions, which offers education across various fields. The transferor company has a net worth of Rs. 1,525.96 lakhs and turnover of Rs. 2,847.80 lakhs for FY 2024-25, while the transferee company has a net worth of Rs. 7,523.90 lakhs and turnover of Rs. 72.00 lakhs for the same period. The merger aims to consolidate the group structure and involves no cash consideration or share issuance. The shareholding pattern of Veranda Learning Solutions Limited will remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1754369298819,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Schedules EGM for Preferential Share Issue and Related Party Transactions",
            "Summary": "Veranda Learning Solutions Limited has scheduled an Extra-Ordinary General Meeting for August 25, 2025, to seek shareholder approval for three key resolutions. The company proposes to issue 20,16,124 equity shares at Rs. 248 per share to Jitendra Kantilal Shah for consideration other than cash, as part of acquiring 12% equity stake in subsidiary Veranda XL Learning Solutions Private Limited. The share swap arrangement is valued at approximately Rs. 50 crores and represents part completion of the third tranche acquisition of J.K. Shah Education Private Limited. Additionally, shareholders will vote on material related party transactions between the company and its subsidiaries, including loan arrangements and NCD issuances. The EGM will be conducted virtually with remote e-voting facilities available from August 22-24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754139989151,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Completes Acquisition of Remaining 9.60% Stake in Veranda K-12",
            "Summary": "Veranda Learning Solutions Limited has completed the acquisition of the remaining 9.60% equity stake in Veranda K-12 Learning Solutions Private Limited through its wholly owned subsidiary, Veranda Administrative Learning Solutions Private Limited. The acquisition involved 4,924 fully paid-up equity shares of Rs.10 each and was carried out for cash consideration. Following this transaction, Veranda K-12 has become a wholly owned subsidiary of VALSPL. The company had previously made acquisitions in this entity, with earlier intimations dated May 22, 2023 and May 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753769994398,
            "Source": "order&deals"
        },
        {
            "Title": "Veranda Learning Acquires Full Ownership of Veranda XL Learning Solutions",
            "Summary": "Veranda Learning has received approval to acquire complete ownership of Veranda XL Learning Solutions by purchasing the remaining 24% stake in the company. This acquisition will give Veranda Learning 100% control of the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753686598219,
            "Source": "order&deals"
        },
        {
            "Title": "Veranda Learning Completes Acquisition of Remaining Stakes in Neyyar Academy and Neyyar Education",
            "Summary": "Veranda Learning Solutions Limited has completed the acquisition of remaining equity stakes in Neyyar Academy Private Limited and Neyyar Education Private Limited through its wholly owned subsidiary, making them wholly owned subsidiaries. The company acquired 864 equity shares (6.52% stake) in Neyyar Academy and 701 equity shares (6.52% stake) in Neyyar Education, both with face value of Rs.10 each. The acquisitions were completed through cash consideration by Veranda Administrative Learning Solutions Private Limited, a wholly owned subsidiary of Veranda Learning. This follows earlier intimations regarding these acquisitions dated May 22, 2023 and May 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753519304588,
            "Source": "order&deals"
        },
        {
            "Title": "Veranda Learning to Redeem ₹346.14 Crore NCDs Using QIP Proceeds",
            "Summary": "Veranda Learning Solutions Limited announced it will redeem Non-Convertible Debentures worth ₹346.14 crore issued by its subsidiary VXL to Ascertis Credit in March and April 2024. The redemption will be funded through proceeds from the company's ₹357.42 crore Qualified Institutional Placement. The move is part of a strategic initiative to make the commerce vertical debt-free and reduce high-cost debt. The company's restructuring committee has recommended a proposal for demerger and listing of a debt-free commerce vertical under J.K Shah's leadership, with the Board scheduled to meet on July 28, 2025 to discuss this matter.",
            "Sentiment": "positive",
            "PublishDate": 1753431747658,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Plans Commerce Business Demerger and Stake Acquisition",
            "Summary": "Veranda Learning Solutions Limited has scheduled a board meeting for July 28, 2025, to consider issuing securities on a preferential basis and approve a demerger of its Commerce Business. The restructuring committee has recommended three key proposals: making the Commerce vertical debt-free using QIP proceeds to redeem non-convertible debentures issued by subsidiary Veranda XL Learning Solutions Private Limited, initiating a demerger of the Commerce vertical with the resulting entity proposed to be listed through automatic listing route, and acquiring the remaining 24% equity stake held by Mr. J.K. Shah in Veranda XL to make it a wholly owned subsidiary. The board may also consider incorporating a wholly owned subsidiary to facilitate the proposed reorganization. Post-demerger, the commerce vertical will continue under the leadership of Mr. J.K. Shah, who will maintain an economic interest in the business.",
            "Sentiment": "positive",
            "PublishDate": 1753282978086,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Raises Rs 357 Crore Through QIP to Reduce Debt",
            "Summary": "Veranda Learning Solutions raised Rs 357.4 crore through its first Qualified Institutional Placement, allotting 1.58 crore equity shares at Rs 225.20 per share. The QIP received strong participation from domestic and global institutional investors, with Authum Investment securing the largest allocation at 44.77%. The company plans to use Rs 310 crore from the proceeds to deleverage its balance sheet, including repayment of the Ascertis Credit facility, while the remainder will fund strategic growth initiatives. Following the allotment, the company's paid-up equity share capital increased from Rs 77.73 crore to Rs 93.60 crore. Shares closed 0.2% lower at Rs 244.20, with the stock down 14% over the past 12 months but up 2% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1753241287463,
            "Source": "stock"
        },
        {
            "Title": "Veranda Learning Raises ₹357.42 Crore Through QIP at 4.95% Discount",
            "Summary": "Veranda Learning has completed its Qualified Institutional Placement (QIP), issuing 1.58 crore shares at ₹225.20 per share. The company raised ₹357.42 crore through this offering. The shares were issued at a 4.95% discount to the floor price of ₹236.92. This fundraising exercise provides the company with additional capital for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1753235754461,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions: Launches ₹380 Crore QIP at 15% Discount",
            "Summary": "Veranda Learning Solutions has initiated a Qualified Institutions Placement (QIP) to raise up to ₹380 crore, with an issue price of ₹225.20 per share, a 15.31% discount to the previous closing price. Funds will be used to repay debt and for general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1752769049000,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Solutions Opens QIP Offering",
            "Summary": "Veranda Learning Solutions has opened its Qualified Institutional Placement (QIP) offering. The minimum price for the shares has been set at 236.92 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752763060000,
            "Source": "default"
        },
        {
            "Title": "Veranda Learning Solutions: QIP to Raise ₹380 Crore for Debt Reduction",
            "Summary": "Veranda Learning Solutions Ltd. plans to raise up to ₹380 crore through a qualified institutional placement (QIP) this week. The fundraising aims to reduce the company's high-cost debt, with pricing expected at a significant discount to the current market price. As of FY2025, the company had borrowings and financial liabilities of around ₹870 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752647031000,
            "Source": "corporate_action"
        },
        {
            "Title": "Veranda Learning Allocates 11.86 Lakh Equity Shares in ₹26.21 Crore Preferential Issue",
            "Summary": "Veranda Learning has allocated 11,85,984 equity shares at a price of ₹221 per share through a preferential issue. The total value of this allocation amounts to ₹26.21 crore. Notably, this preferential issue was conducted not in cash, suggesting an alternative form of consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1751556910000,
            "Source": "default"
        }
    ]
}