{
    "Symbol": "VESUVIUS",
    "ISIN": "INE386A01023",
    "News": [
        {
            "Title": "Vesuvius India Senior Management Personnel Resigns",
            "Summary": "Vesuvius India Limited announces resignation of Mr. Nilkantha Brahmachari, Director Marketing & Technology, effective February 5, 2026, due to personal commitments under SEBI Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1770303449684,
            "Source": "stocks"
        },
        {
            "Title": "Vesuvius India Appoints Three New Directors Through Postal Ballot Process",
            "Summary": "Vesuvius India Limited shareholders approved the appointment of Ms. Rashmi Joshi and Mr. Sridhar Gorthi as Independent Directors for five-year terms, and Mr. Biswadip Gupta as Non-executive Non-Independent Director through postal ballot voting concluded on November 7, 2025. The resolutions were passed with requisite majority, with all three appointments taking effect from September 24, 2025, strengthening the company's board composition.",
            "Sentiment": "positive",
            "PublishDate": 1764765931249,
            "Source": "corporate_action"
        },
        {
            "Title": "Vesuvius India Reports Third Quarter Results and Appoints Interim CFO",
            "Summary": "Vesuvius India Limited's Board approved unaudited financial results for the third quarter ended September 30, 2025. The company appointed Mr. Subhabrata Nandi as Chief Financial Officer in interim capacity effective November 11, 2025. Nandi is a Chartered Accountant with over 27 years of experience and has been with the company since November 2004, currently serving as Associate Director-Finance. The company closed its Visakhapatnam plant on October 13, 2025, and sold the land and structures for Rs. 30.51 crores on October 24, 2025, after commencing operations at its new AES Monolithic Plant. The closure and sale are not expected to have material adverse impact on business operations or revenue. The statutory auditors issued an unmodified opinion on the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762911477202,
            "Source": "corporate_action"
        },
        {
            "Title": "Vesuvius India Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Vesuvius India reported Q2 net profit of 615 million rupees, down from 685 million rupees in the same period last year. Revenue increased to 5.5 billion rupees from 4.4 billion rupees year-over-year. EBITDA rose to 924 million rupees from 789 million rupees, while EBITDA margin declined to 16.89% from 17.76% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762872054138,
            "Source": "earnings"
        },
        {
            "Title": "Vesuvius India Appoints Three Directors Through Postal Ballot Voting",
            "Summary": "Vesuvius India Limited successfully passed three special resolutions through postal ballot voting conducted from October 9 to November 7, 2025. The company appointed Ms. Rashmi Joshi as an Independent Director for five consecutive years effective September 24, 2025, with 99.9984% votes in favor. Mr. Sridhar Gorthi was appointed as an Independent Director for the same period with 84.86% approval. Additionally, Mr. Biswadip Gupta was appointed as a Non-Executive Non-Independent Director liable to retire by rotation, receiving 99.4460% votes in favor. The voting process was conducted through remote e-voting with scrutinizer Amber Ahmad overseeing the proceedings. All three resolutions were passed with the requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1762815574156,
            "Source": "corporate_action"
        },
        {
            "Title": "Vesuvius India Closes Visakhapatnam Plant After Launching New Al-Si Monolithic Facility",
            "Summary": "Vesuvius India Limited closed its plant at Plot Nos. 13-15, Block E, IDA, Visakhapatnam on October 13, 2025, following the commencement of commercial operations at its new Al-Si Monolithic Plant in Parawada Industrial Area, Anakapalli. The closed Visakhapatnam plant contributed INR 337.92 crores in turnover, representing 18.08% of the company's total revenue, with an estimated net worth of INR 258.72 lakhs. The company stated that the closure is not expected to have any adverse material impact on business operations or revenue due to the new facility becoming operational.",
            "Sentiment": "neutral",
            "PublishDate": 1760111139170,
            "Source": "stock"
        },
        {
            "Title": "Vesuvius India Appoints Two New Independent Directors, Accepts One Resignation",
            "Summary": "Vesuvius India's Board approved the appointment of Ms. Rashmi Joshi and Mr. Sridhar Gorthi as Additional Directors under the Independent Category for 5-year terms effective September 24, 2025, subject to shareholder approval. The company noted the completion of second terms for Independent Directors Mr. Biswadip Gupta and Ms. Nayantara Palchoudhuri on September 24, 2025. Additionally, the Board accepted the resignation of Non-Executive Non-Independent Director Mr. Sudipto Sarkar effective September 23, 2025, due to personal reasons. Mr. Biswadip Gupta was appointed as Additional Director under Non-Executive Non-Independent Category effective September 25, 2025. The Board approved a Postal Ballot Notice seeking shareholder approval for these appointments through Special Resolutions.",
            "Sentiment": "neutral",
            "PublishDate": 1758634667598,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vesuvius India Reports Q2 2025 Results with Net Profit of Rs 6.30 Crore",
            "Summary": "Vesuvius India Limited reported net profit of Rs 6.30 crore for the quarter ended June 30, 2025, compared to Rs 6.35 crore in the same quarter last year. Total income from operations decreased to Rs 52.43 crore from Rs 46.24 crore in the previous quarter. For the half-year period, net profit reached Rs 12.23 crore versus Rs 13.61 crore in the corresponding period last year. The company's Basic Monolithic Plant at Parawada Mandal, Visakhapatnam, commenced commercial operations from June 27, 2025. During the quarter, the company subdivided its equity shares from face value of Rs 10 each to Rs 1 each in a 1:10 ratio. The company operates in manufacturing, trading and sale of refractories with facilities located in India.",
            "Sentiment": "neutral",
            "PublishDate": 1755101159782,
            "Source": "earnings"
        },
        {
            "Title": "Vesuvius India Commences Commercial Operations at Visakhapatnam Facility",
            "Summary": "Vesuvius India has begun commercial activities at its new facility in Visakhapatnam. The company has successfully started operations at this location, marking an expansion of its industrial presence.",
            "Sentiment": "positive",
            "PublishDate": 1751030652000,
            "Source": "default"
        }
    ]
}