{
    "Symbol": "VETO",
    "ISIN": "INE918N01018",
    "News": [
        {
            "Title": "Veto Switchgears Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Veto Switchgears and Cables Limited posted quarterly net profit of Rs. 569.07 lakhs versus Rs. 542.42 lakhs year-over-year, while total income increased to Rs. 5,813.30 lakhs from Rs. 5,298.18 lakhs for the quarter ended September 30, 2025. The company's half-year performance showed declining net profit at Rs. 941.21 lakhs compared to Rs. 973.89 lakhs in the previous year, despite revenue growth to Rs. 10,137.46 lakhs from Rs. 9,472.53 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1763139688747,
            "Source": "earnings"
        },
        {
            "Title": "Veto Switchgears Sets Record Date for Final Dividend of Rs. 1 Per Share",
            "Summary": "Veto Switchgears and Cables Limited has set September 22, 2025, as the record date for determining shareholder eligibility for a final dividend of Rs. 1 per share for FY 2024-25. The dividend represents 10% of the face value of Rs. 10 per share and is subject to approval at the company's 18th Annual General Meeting. The company informed stock exchanges NSE and BSE about this dividend proposal.",
            "Sentiment": "positive",
            "PublishDate": 1757679090745,
            "Source": "corporate_action"
        },
        {
            "Title": "Veto Switchgears and Cables Announces Book Closure for Dividend Payment and AGM",
            "Summary": "Veto Switchgears and Cables Ltd has announced a book closure period from September 23, 2025, to September 29, 2025, to determine eligible shareholders for dividend payment and the upcoming Annual General Meeting. The company's equity share capital stands at Rs. 1911.49 Lakhs, comprising 1,91,14,955 equity shares of Rs. 10 each. The Annual General Meeting is scheduled for September 29, 2025, at 3:00 PM through video conferencing. Dividend payment for Financial Year 2024-25 will be subject to approval at the AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1756993291058,
            "Source": "corporate_action"
        },
        {
            "Title": "Veto Switchgears Reports Revenue Growth But Profit Decline in Q1 Results",
            "Summary": "Veto Switchgears and Cables Limited reported mixed quarterly results with revenue growth but declining profitability. On a standalone basis, total income increased to Rs. 434.15 lakhs from Rs. 417.43 lakhs year-over-year, while net profit after tax dropped to Rs. 372.12 lakhs from Rs. 431.48 lakhs. Consolidated total income rose to Rs. 648.04 lakhs from Rs. 612.01 lakhs, but net profit after tax fell to Rs. 343.21 lakhs from Rs. 488.01 lakhs. The company maintained healthy profit margins despite the profitability pressure, with consolidated performance outpacing standalone results. Equity share capital remained unchanged at Rs. 1,911.50 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1755246081272,
            "Source": "earnings"
        },
        {
            "Title": "Veto Switchgears Reports Mixed Q1 Results with Revenue Growth but Lower Profits",
            "Summary": "Veto Switchgears and Cables Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported total income of Rs. 4,324.15 lacs, up from Rs. 4,174.35 lacs in the same quarter last year. However, net profit declined to Rs. 372.12 lacs compared to Rs. 431.48 lacs in the previous year quarter. On a consolidated basis, total income increased to Rs. 6,487.04 lacs from Rs. 6,121.01 lacs year-over-year, while net profit after taxes dropped to Rs. 343.21 lacs from Rs. 488.01 lacs. The company operates across three segments: Wire & Cables, Lighting & Fittings, and Accessories & Others. Basic earnings per share on standalone basis was Rs. 1.95 compared to Rs. 2.26 in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1755097639274,
            "Source": "earnings"
        }
    ]
}