{
    "Symbol": "VGL",
    "ISIN": "INE273D01019",
    "News": [
        {
            "Title": "Varvee Global Approves 1:2 Share Split & Key Appointments",
            "Summary": "Varvee Global's board approved equity share split from ₹10 to ₹5 face value, appointed new internal auditor M/s Jagetiya & Co, and revised remuneration for managing director and whole time director.",
            "Sentiment": "positive",
            "PublishDate": 1768569885700,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varvee Global Approves 1:2 Equity Share Split",
            "Summary": "Varvee Global Limited's board approved a 1:2 equity share split, reducing face value from ₹10 to ₹5 per share, along with internal auditor changes and remuneration revisions for key managerial personnel.",
            "Sentiment": "positive",
            "PublishDate": 1768568870147,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varvee Global Board Meet on Jan 16 for Share Split",
            "Summary": "Varvee Global Limited has scheduled a board meeting on January 16, 2026, to consider equity share sub-division from ₹10 to ₹5 per share and review Q3FY26 results under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768225714311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Varvee Global Boosts Non-Denim Capacity to 18 Lakh Meters",
            "Summary": "Varvee Global Limited increases monthly production capacity by 6 lakh meters to 18 lakh meters in non-denim shirtings and suitings, targeting 50 lakh meters capacity as part of strategic diversification beyond denim.",
            "Sentiment": "positive",
            "PublishDate": 1767597472267,
            "Source": "stocks"
        },
        {
            "Title": "Varvee Global Gets Rating Withdrawal from Infomerics",
            "Summary": "Infomerics Valuation and Rating has withdrawn its IVR D issuer rating for Varvee Global Limited following the company's request with necessary documentation including no-due certificates from multiple banks.",
            "Sentiment": "neutral",
            "PublishDate": 1767182109024,
            "Source": "stocks"
        },
        {
            "Title": "Varvee Global Reports Strong Q2 Results with Rs 1,880 Crore Profit Before Tax",
            "Summary": "Varvee Global Limited reported unaudited financial results for the quarter and half year ended September 30, 2025. The company posted a profit before tax of Rs 1,880.61 crores for the quarter, compared to Rs 2,464.22 crores in the previous quarter. Revenue from operations stood at Rs 2,783.13 crores for the quarter. The company's total income for the quarter was Rs 3,432.30 crores. Basic and diluted earnings per share was Rs 3.96 for the quarter. The company completed the allotment of 2,304,539 equity shares on a preferential basis in May 2025, with trading approval received in September 2025. The results were approved by the Board of Directors at their meeting held on November 12, 2025, based on the recommendation of the Audit Committee.",
            "Sentiment": "positive",
            "PublishDate": 1762972457946,
            "Source": "earnings"
        },
        {
            "Title": "Aarvee Denims and Exports Launches New Consultation and Advisory Division",
            "Summary": "Aarvee Denims and Exports has launched a consultation and advisory division as part of its strategy to expand service offerings.",
            "Sentiment": "positive",
            "PublishDate": 1756912473736,
            "Source": "stock"
        },
        {
            "Title": "AARVEE Denims Rebrands to Varvee Global with New Leadership and Debt-Free Growth Strategy",
            "Summary": "AARVEE Denims has changed its name to Varvee Global and appointed new leadership. The company has outlined a growth plan that aims to expand without taking on debt.",
            "Sentiment": "positive",
            "PublishDate": 1755705140164,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aarvee Denims Reports Mixed Q1 Results Amid Management Change and Debt-Free Status",
            "Summary": "Aarvee Denims and Exports Limited reported total revenue of Rs. 627.29 lakhs for Q1 FY26, down from Rs. 4,544.15 lakhs in Q4 F25 and Rs. 5,862.62 lakhs in Q1 FY25. The company achieved a profit after tax of Rs. 2,548.08 lakhs, primarily driven by a positive tax adjustment, compared to a loss of Rs. 887.09 lakhs in the previous quarter. Earnings per share improved to Rs. 9.89 from negative Rs. 3.78 in Q4 FY25. The company became completely debt-free as of June 3, 2025, after repaying all outstanding bank loans. New management took control effective July 5, 2025, with Jaimin Kailash Gupta appointed as Chairman & Managing Director following a Share Purchase Agreement where the new promoter group acquired 65.63% shareholding. The company continues operations from its Narol unit with facilities for yarn warping, sizing, dyeing, weaving, and finishing denim and non-denim fabrics.",
            "Sentiment": "positive",
            "PublishDate": 1755513360650,
            "Source": "earnings"
        },
        {
            "Title": "Aarvee Denims and Exports Reports Quarterly Results Amid Management Change and Debt-Free Status",
            "Summary": "Aarvee Denims and Exports Limited's Board approved unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 1,353.12 lakhs and a profit of Rs. 2,548.08 lakhs for the quarter. Key developments include a management change effective July 5, 2025, following a share purchase agreement executed in September 2024 where Mr. Jaimin Kailash Gupta and associates acquired 60.81% shareholding from promoters at Rs. 25.11 per share. The company became bank debt-free as of June 3, 2025, after repaying all outstanding loans. However, the company had no production of finished goods during the quarter and wrote off assets worth Rs. 80.43 lakhs. The company maintains MAT credit of Rs. 6.0 crores and has received approvals for preferential allotment of 37.13 lakh equity shares. Earnings per share stood at Rs. 9.89 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755177247052,
            "Source": "earnings"
        },
        {
            "Title": "Aarvee Denims Promoters Release Share Pledges Worth 0.121% of Total Capital",
            "Summary": "Three promoters of Aarvee Denims & Exports Limited have released pledged shares from BOB Capital Markets Limited. Vinod P. Arora released 24,861 shares (0.105% of share capital), while Shikha P. Arora and Preeti N. Arora each released 1,896 shares (0.008% each). All releases occurred on July 5, 2025, and were attributed to loan repayment. The combined release represents 28,653 shares or 0.121% of the company's total share capital. The disclosures were submitted to BSE and NSE on August 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754545783269,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarvee Denims Promoters Release Share Pledges Worth Over 3.3 Million Shares",
            "Summary": "Multiple promoters and promoter group entities of Aarvee Denims & Exports Limited have released share encumbrances totaling over 3.3 million shares that were pledged with BOB Capital Markets Limited. The releases occurred on July 5, 2025, and were reported on August 4, 2025. Key entities involved include Twenty First Century Marketing Ltd (1,154,250 shares, 4.92%), Shipa Fabrics Pvt Ltd (685,900 shares, 2.92%), Ennbee Textiles Pvt Ltd (579,600 shares, 2.47%), Rentex Weavers Ltd (569,850 shares, 2.43%), Bhansali Tradelink Private Limited (62,500 shares, 0.27%), Nipun Arora (54,975 shares, 0.23%), Pankaj Arora (44,925 shares, 0.19%), TP Vinod Kumar HUF (6,636 shares, 0.028%), Pee Vee Synthetics Pvt Ltd (52,778 shares, 0.22%), and Renu V Arora (4,419 shares, 0.019%). All pledges were released due to loan repayment. The company is listed on BSE (514274) and NSE (AARVEEDEN).",
            "Sentiment": "positive",
            "PublishDate": 1754544869348,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarvee Denims Schedules EGM for Leadership Changes and Name Change to Varvee Global Limited",
            "Summary": "Aarvee Denims and Exports Limited has scheduled an Extraordinary General Meeting for August 19, 2025, via video conference to consider several key resolutions. The company will seek shareholder approval for appointing Jaimin Kailash Gupta as Chairman and Managing Director for three years at Rs. 24 lakh annual remuneration, and Tarachand Gangasahay Agrawal as Whole-time Director at Rs. 12 lakh annually. The meeting will also consider re-designating Nipun Vinodkumar Arora from Whole-time Director to Non-Executive Director, appointing Ravi Jitendra Modi as Independent Director for five years, and changing the company name to Varvee Global Limited. Jaimin Gupta currently holds 52.01% stake with 1.34 crore shares, while Tarachand Agrawal holds 4.55% with 11.73 lakh shares. The leadership changes follow a Share Purchase Agreement dated September 5, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1753447323959,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarvee Denims Promoters Sell 9.1 Million Shares in Major Stake Disposal",
            "Summary": "Aarvee Denims and Exports Limited's promoters and promoter group entities sold equity shares on July 9-10, 2025. The disposal involved 29 entities including individual promoters and companies. Major transactions included V.B. Investment Pvt. Ltd. selling 2,320,900 shares, Kashvi Investments Pvt. Ltd. disposing 1,388,200 shares, and Twenty First Century Marketing Ltd. selling 1,154,250 shares. Individual promoters also participated, with Parmanand Arora selling 360,140 shares and Rajesh Arora disposing 248,816 shares. The transactions were conducted through off-market sales. The company's total equity share capital remains at 2,34,59,800 shares of Rs. 10 each, aggregating to Rs. 23,45,98,000.",
            "Sentiment": "neutral",
            "PublishDate": 1753161138910,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarvee Denims and Exports to Consider Capital Raising of Up to 500 Million Rupees",
            "Summary": "Aarvee Denims and Exports Limited has announced a board meeting scheduled for January 13 to consider raising capital up to 500 million rupees. This decision indicates the company's potential plans for expansion, debt reduction, or other strategic initiatives that require additional funding.",
            "Sentiment": "neutral",
            "PublishDate": 1736166927000,
            "Source": "corporate_action"
        }
    ]
}