{
    "Symbol": "VGUARD",
    "ISIN": "INE951I01027",
    "News": [
        {
            "Title": "V-Guard Industries announces postal ballot for director appointments",
            "Summary": "V-Guard Industries Limited has issued a postal ballot notice seeking shareholder approval for re-appointing Prof. Biju Varkkey as Independent Director and appointing Dr. Reena Philip as Non-Executive Director through e-voting from February 7 to March 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770364128532,
            "Source": "stocks"
        },
        {
            "Title": "V-Guard Gets GST Audit Objection Worth ₹17.76 Cr",
            "Summary": "V-Guard Industries receives GST audit objection from CGST authorities for excess ITC availment of ₹17.76 crore covering FY2021-24, company to challenge the objection.",
            "Sentiment": "negative",
            "PublishDate": 1769938689345,
            "Source": "stocks"
        },
        {
            "Title": "V-Guard Industries Q3 Net Profit Drops 5.3% YoY",
            "Summary": "V-Guard Industries reported consolidated net profit of ₹570 million in Q3, down from ₹602 million in the same quarter last year, marking a year-on-year decline of 5.3%.",
            "Sentiment": "negative",
            "PublishDate": 1769591497524,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential MF Raises V-Guard Stake to 7.04%",
            "Summary": "ICICI Prudential Mutual Fund acquired 88.85 lakh shares of V-Guard Industries, increasing its shareholding from 5.01% to 7.04% through secondary market purchases between October 2025 and January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768970113891,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Guard Industries Q3FY26 Results Call on Jan 29",
            "Summary": "V-Guard Industries has scheduled its Q3FY26 earnings conference call for January 29, 2026, at 3:30 PM to discuss financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768285663999,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Guard Industries Block Trade Worth ₹50.98 Crores",
            "Summary": "V-Guard Industries executed a significant NSE block trade involving 1,501,080 shares at ₹339.65 per share, totaling ₹50.98 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1765376644394,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Guard Industries Block Trade Worth Rs. 50.98 Crores Executed on NSE",
            "Summary": "V-Guard Industries executed a block trade on NSE involving 1,501,080 shares at Rs. 339.65 per share, totaling Rs. 50.98 crores. The transaction represents a significant institutional trading activity that could impact the company's shareholding pattern and stock liquidity.",
            "Sentiment": "neutral",
            "PublishDate": 1765350192584,
            "Source": "order&deals"
        },
        {
            "Title": "V-Guard Industries Gets CRISIL A1+ Rating Reaffirmation for Rs 150 Crore Commercial Paper",
            "Summary": "CRISIL Ratings has reaffirmed its top-notch CRISIL A1+ rating on V-Guard Industries' Rs 150 crore Commercial Paper programme, indicating very strong degree of safety for timely payment obligations. The rating carries the lowest credit risk and remains valid for 60 calendar days for issuance purposes, with maximum maturity of one year once issued.",
            "Sentiment": "positive",
            "PublishDate": 1764405944703,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Guard Targets Mid-Teen Growth Through Sunflame Synergy and North India Expansion",
            "Summary": "V-Guard aims to achieve mid-teen growth through synergies with Sunflame, expansion in North India, and optimizing its premium product mix. The company expects margin expansion through cost control and manufacturing efficiency improvements in FY26-27.",
            "Sentiment": "positive",
            "PublishDate": 1761754386711,
            "Source": "stock"
        },
        {
            "Title": "V-Guard Industries Announces Withdrawal of 207 Million Rupees Tax Demand",
            "Summary": "V-Guard Industries announced that a total tax demand of 207 million rupees has been withdrawn. The company made this statement regarding the resolution of the tax matter.",
            "Sentiment": "positive",
            "PublishDate": 1761739557683,
            "Source": "stock"
        },
        {
            "Title": "V-Guard Industries Reports 4% Profit Growth Despite Margin Pressure in Q2",
            "Summary": "V-Guard Industries reported net profit of ₹65 crore for the July-September quarter, marking a 4% year-on-year increase, while revenue grew 3.6% to ₹1,341 crore. EBITDA declined 1% to ₹109 crore with margins compressing to 8.2% from 8.5%. For the first half, consolidated revenue reached ₹2,807 crore (up 1.3%) but profit after tax fell 14.3% to ₹139.1 crore. Managing Director Mithun K Chittilappilly attributed modest growth to challenges including higher rainfall, weak consumer sentiment, and GST transition disruptions. He noted improved gross margins and expects demand recovery following GST 2.0 reforms. Shares traded 1% higher at ₹381.50 after touching an intraday high of ₹384.",
            "Sentiment": "neutral",
            "PublishDate": 1761729608820,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "V-Guard Industries reported quarterly revenue of 13.4 billion rupees, up from 12.3 billion rupees year-over-year. Consolidated net profit increased to 653 million rupees from 634 million rupees in the same period last year. However, EBITDA declined to 1.09 billion rupees from 1.1 billion rupees year-over-year, with EBITDA margin compressing to 8.15% from 8.52% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761728002746,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries Grants 78,079 Stock Options to Employees Under ESOS 2013",
            "Summary": "V-Guard Industries' Nomination and Remuneration Committee approved the grant of 78,079 stock options to eligible employees under the Employee Stock Option Scheme (ESOS 2013). The options carry the right to apply for equivalent equity shares with a face value of ₹1 each, at an exercise price of ₹1 per option. The vesting period extends up to four years based on time and performance criteria, with time-based options vesting equally over four years and performance options vesting in the final year subject to achievement of performance criteria. Employees can exercise the options within six years from the vesting date. The scheme complies with SEBI regulations for share-based employee benefits.",
            "Sentiment": "positive",
            "PublishDate": 1761657479176,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Prudential Mutual Fund Crosses 5% Shareholding Threshold in V-Guard Industries",
            "Summary": "ICICI Prudential Mutual Fund acquired 53,077 shares of V-Guard Industries on October 20, 2025, increasing its total shareholding from 4.998% to 5.010% of the company's paid-up capital. The acquisition was made through secondary market purchases across various schemes of the fund. The fund's total holding now stands at 2,18,43,603 shares out of V-Guard's total equity capital of 43,59,98,786 shares with face value of ₹1 each. ICICI Prudential clarified that the holdings are from an investment perspective and not aimed at seeking controlling interest in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761280235864,
            "Source": "stock"
        },
        {
            "Title": "V-Guard Industries Schedules Board Meeting for October 29, 2025 to Approve Quarterly Results",
            "Summary": "V-Guard Industries Limited has scheduled a Board of Directors meeting on October 29, 2025, to review and approve the unaudited financial results for the quarter and half-year ended September 30, 2025. The meeting will be held at the company's registered office to consider standalone and consolidated financial results along with a limited review report. The trading window for company securities will remain closed until 48 hours after the results are communicated to stock exchanges. The company trades on BSE with scrip code 532953 and on NSE with symbol VGUARD.",
            "Sentiment": "neutral",
            "PublishDate": 1760542241455,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Guard Industries Shares Worth Rs. 59.86 Crores Traded in NSE Block Deal",
            "Summary": "V-Guard Industries Ltd. witnessed a block trade on NSE involving approximately 1,613,538 shares at Rs. 371.00 per share, totaling Rs. 59.86 crores. The transaction represents a significant bulk deal in the company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758006023764,
            "Source": "order&deals"
        },
        {
            "Title": "V-Guard and HCG Promoters Sell 1% Stakes in ₹245 Crore Bulk Deals",
            "Summary": "Chittilappilly Thomas Kochuouseph, promoter of V-Guard Industries, sold 41.5 lakh shares at ₹370 per share for ₹154 crore on NSE. B.S. Ajai Kumar, promoter of HealthCare Global Enterprises (HCG), offloaded 14 lakh shares for ₹92 crore on BSE. Axis Mutual Fund purchased the HCG shares. Following the transactions, Kochuouseph's stake reduced from 9.4% while total V-Guard promoter holding stands at 54.3%. HCG's promoter holding is 62.5% with Ajai Kumar controlling 10.4%. HCG shares gained 2.1% to close at ₹682.10 after hitting a record high of ₹700.65, while V-Guard declined 1% to ₹370.45. V-Guard reported quarterly revenue decline of 0.7% to ₹1,466 crore and profit drop of 25% to ₹74 crore. Seven of eight analysts rate HCG as 'Buy' while 14 of 22 analysts recommend V-Guard as 'Buy'. HCG stock has rallied 40% this year while V-Guard has fallen 12.3%.",
            "Sentiment": "neutral",
            "PublishDate": 1755707756044,
            "Source": "order&deals"
        },
        {
            "Title": "V-Guard Industries Reports Flat Revenue Growth in Q1 FY26, Plans Lighting Segment Entry",
            "Summary": "V-Guard Industries reported consolidated net revenue of INR 1,466 crores for the quarter ended June 30, 2025, marking a marginal decline of 0.7% year-on-year. The company attributed subdued performance to weak summer season and high base effect from previous year. Electronics segment grew 4.5% while Electrical segment registered 7.6% growth, but Consumer Durables segment declined 16.3% due to early monsoon affecting cooling products demand. Gross margin improved to 36.7% from 36.6% in the same quarter last year. EBITDA excluding other income stood at INR 124 crores, declining 20.7% year-on-year, with EBITDA margin at 8.4% compared to 10.5% in Q1 FY25. Profit after tax decreased to INR 74 crores from INR 99 crores in the previous year. The company announced plans to enter the lighting segment and merge Sunflame operations with V-Guard to realize synergy benefits. Management revised growth guidance to 11-13% for the current financial year and expects EBITDA margins between 8.5-9.5%.",
            "Sentiment": "negative",
            "PublishDate": 1754474292221,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Focuses on In-House Production and Sunflame Merger to Boost Profits After Weak Q1 Performance",
            "Summary": "V-Guard reported poor quarterly results and expects demand to stabilize going forward. The company is implementing several strategic initiatives including focusing on in-house production, pursuing a merger with Sunflame, and expanding operations beyond its traditional South Indian market base to improve profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1753798368188,
            "Source": "stock"
        },
        {
            "Title": "V-Guard Industries Reports 0.7% Revenue Decline in Q1 FY26, Approves Sunflame Merger and Lighting Business Entry",
            "Summary": "V-Guard Industries reported consolidated net revenue of Rs. 1,466.08 crores for the quarter ended June 30, 2025, declining 0.7% year-on-year from Rs. 1,477.10 crores. Profit after tax dropped 25.4% to Rs. 73.85 crores compared to Rs. 98.97 crores in the same period last year. Managing Director Mithun K. Chittilappilly attributed the subdued topline growth to a weak summer season and high base from the previous year. The Electronics and Electricals segments registered moderate growth of 4.5% and 7.6% respectively, while Consumer Durables declined 16.3% due to lower demand for summer categories. The Board approved in-principle merger of wholly-owned subsidiary Sunflame Enterprises Private Limited, which recorded turnover of Rs. 254.39 crores and profit after tax of Rs. 3.29 crores in FY 2024-25. The company also received approval to enter the Lighting Business to expand and diversify operations. Additionally, 4,500 equity shares were allotted under the Employee Stock Option Scheme.",
            "Sentiment": "negative",
            "PublishDate": 1753778905969,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries Reports Decline in Q1 Profit and Margins",
            "Summary": "V-Guard Industries reported Q1 consolidated net profit of 739 million rupees, down from 989 million rupees in the same period last year. Revenue decreased slightly to 14.66 billion rupees from 14.8 billion rupees year-over-year. EBITDA fell to 1.23 billion rupees from 1.55 billion rupees, while EBITDA margin compressed to 8.43% from 10.55% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753777370690,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries: Q4 Profit Rises 20%, Declares Dividend",
            "Summary": "V-Guard Industries reported a 19.7% YoY increase in Q4 net profit to ₹91 crore. Revenue grew 14.5% to ₹1,538 crore. Full-year revenue rose 14.8% to ₹5,577.82 crore with a 21.8% profit increase. The company declared a final dividend of ₹1.50 per share for FY25. V-Guard has become debt-free after pre-closing the Sunflame acquisition loan. Management is optimistic about FY26 with planned new product launches.",
            "Sentiment": "positive",
            "PublishDate": 1747217024000,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries Reports Q4 Financial Results",
            "Summary": "V-Guard Industries announced its Q4 financial results. The company's revenue increased to 15.4 billion rupees from 13.4 billion rupees year-over-year. EBITDA rose to 1.43 billion rupees from 1.28 billion rupees. However, the EBITDA margin slightly decreased to 9.3% from 9.53% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747213670000,
            "Source": "result"
        },
        {
            "Title": "V-Guard Industries Reports 15% Increase in Q4 Net Profit",
            "Summary": "V-Guard Industries has announced its fourth quarter financial results, reporting a consolidated net profit of 911 million rupees, up from 792 million rupees in the same period last year. This represents a year-over-year increase of approximately 15%.",
            "Sentiment": "positive",
            "PublishDate": 1747213045000,
            "Source": "result"
        },
        {
            "Title": "V-Guard Industries: Q3 Profit Rises 3.4% YoY Despite Revenue Decline",
            "Summary": "V-Guard Industries reported Q3 FY25 results with profit up 3.4% YoY to ₹60.22 crore, despite a 1.96% QoQ revenue decline to ₹1268.65 crore. EPS increased to ₹1.37, up 3.01% YoY. Operating income decreased 10.27% QoQ and 4.1% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1738130712000,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries Reports Q3 Revenue Growth",
            "Summary": "V-Guard Industries has announced its third quarter revenue results. The company reported revenue of 12.6 billion rupees, compared to 11.65 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738054308000,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries Reports Q3 EBITDA and Margin",
            "Summary": "V-Guard Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 1.05 billion rupees, compared to 1.01 billion rupees in the same quarter of the previous year. This represents a year-over-year increase. However, the EBITDA margin decreased to 8.27% from 8.67% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738054296000,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard Industries Reports Slight Increase in Q3 Consolidated Net Profit",
            "Summary": "V-Guard Industries has announced its financial results for the third quarter. The company's consolidated net profit rose to 602 million rupees, compared to 580 million rupees in the same period last year, representing a modest year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1738054261000,
            "Source": "earnings"
        },
        {
            "Title": "V-Guard: Q2 Results Show Weak Operating Performance",
            "Summary": "V-Guard's Q2 results indicate weak operating performance. Dolat Capital maintains a 'Reduce' rating on the stock.",
            "Sentiment": "negative",
            "PublishDate": 1730344690000,
            "Source": "result"
        },
        {
            "Title": "V-Guard Industries Reports Improved Q2 Financial Performance",
            "Summary": "V-Guard Industries has announced its Q2 financial results, showing significant year-over-year improvements. The company's consolidated EBITDA increased to 1.1 billion rupees from 930 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 8.58% from 8.20% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730189857000,
            "Source": "result"
        },
        {
            "Title": "V-Guard Industries Reports 15% Revenue Growth in Q2",
            "Summary": "V-Guard Industries has announced its Q2 financial results, reporting revenue of 12.3 billion rupees, compared to 10.7 billion rupees in the same quarter last year. This represents a year-over-year growth of approximately 15%.",
            "Sentiment": "positive",
            "PublishDate": 1730189668000,
            "Source": "result"
        },
        {
            "Title": "V-Guard Industries Reports Slight Increase in Q2 Net Profit",
            "Summary": "V-Guard Industries has announced its financial results for the second quarter. The company reported a net profit of 522 million rupees, compared to 520 million rupees in the same quarter of the previous year, showing a marginal year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1730189642000,
            "Source": "result"
        }
    ]
}