{
    "Symbol": "VHL",
    "ISIN": "INE701A01023",
    "News": [
        {
            "Title": "Vardhman Holdings Board Meet on Feb 10, 2026",
            "Summary": "Vardhman Holdings Limited has scheduled a board meeting for February 10, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770292679853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vardhman Holdings Company Secretary Ankit Singla Resigns Due to Personal Reasons",
            "Summary": "Ankit Singla, Company Secretary and Compliance Officer of Vardhman Holdings Limited, has resigned from his position citing personal reasons, with his resignation effective from the close of business hours on November 17, 2025. The resignation affects the company's secretarial and compliance functions, requiring the appointment of a new Company Secretary to fulfill regulatory obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1763384282584,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Holdings Reports 33.21 Crore Quarterly Profit with Strong Investment Income",
            "Summary": "Vardhman Holdings Limited reported a profit of Rs 33.21 crores for the quarter ended September 30, 2025, compared to Rs 25.95 crores in the same period last year. The company's revenue from operations reached Rs 44.47 crores, driven by dividend income of Rs 45.13 crores, though this was partially offset by a net loss of Rs 0.77 crores on fair value changes. For the half-year period, profit stood at Rs 55.87 crores versus Rs 50.28 crores in the previous year. The company's earnings per share for the quarter was Rs 104.03. Total comprehensive income for the quarter was Rs 63.12 crores, benefiting from gains on fair valuation of equity instruments. The Board of Directors approved these unaudited financial results in their meeting held on November 10, 2025. Vardhman Holdings operates as an investment company focusing on earning income through dividends, interest and gains on investments held.",
            "Sentiment": "positive",
            "PublishDate": 1762762331034,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Holdings Appoints Two Independent Directors for Three-Year Terms",
            "Summary": "Vardhman Holdings Limited's Board of Directors appointed Dr. Parampal Singh and Mrs. Anila Nair as Independent Directors for three-year terms effective August 5, 2025. The appointments are subject to shareholder approval. Dr. Singh holds M.Sc. in Microbiology, MBA in Marketing, and Ph.D. in Marketing, with over 25 years of teaching experience and 14 years in research. He serves as Head of Department and Professor at Guru Nanak Dev Engineering College Ludhiana. Mrs. Nair has a Master's in Economics, UGC-NET qualification, and over 28 years of teaching experience. She was recognized as one of the \"Top 10 Most Influential Educational Leaders 2025\" and received the Best Principal Award in 2022. Both directors have no pecuniary relationships with other company directors and are not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1754377920143,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Holdings Reports Quarterly Results with Mixed Performance",
            "Summary": "Vardhman Holdings Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported total income of Rs. 3.86 crores compared to Rs. 7.04 crores in the same quarter last year. Net profit decreased to Rs. 2.66 crores from Rs. 4.49 crores year-over-year. However, total comprehensive income was positive at Rs. 58.66 crores versus Rs. 97.37 crores in the previous year quarter. On a consolidated basis, the company showed stronger performance with total comprehensive income of Rs. 118.57 crores compared to Rs. 166.02 crores in the same quarter last year. Consolidated profit for the period was Rs. 62.58 crores versus Rs. 73.13 crores year-over-year. The company's earnings per share on consolidated basis was Rs. 196.08 compared to Rs. 229.14 in the corresponding quarter. Vardhman Holdings operates as an investment company focusing on earning income through dividends, interest and gains on investments. The results were approved by the Board of Directors and reviewed by statutory auditors who expressed an unmodified conclusion.",
            "Sentiment": "neutral",
            "PublishDate": 1754377445006,
            "Source": "earnings"
        }
    ]
}