{
    "Symbol": "VHLTD",
    "ISIN": "INE048C01025",
    "News": [
        {
            "Title": "Viceroy Hotels Q3 FY26 Results Call on Feb 11",
            "Summary": "Viceroy Hotels Limited has scheduled a conference call for February 11, 2026 at 3:30 PM IST to discuss Q3 and nine months FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770360986306,
            "Source": "co_actions_results"
        },
        {
            "Title": "Viceroy Hotels completes property acquisition deal",
            "Summary": "Viceroy Hotels executes sale deed for Gachibowli property acquisition, completing part of the ₹206 crore SLN Terminus deal with 1.57 lakh sq ft built-up area and 2,327 sq yards undivided land share.",
            "Sentiment": "positive",
            "PublishDate": 1766915922398,
            "Source": "co_actions_results"
        },
        {
            "Title": "Viceroy Hotels Completes SLN Terminus Acquisition",
            "Summary": "Viceroy Hotels Limited successfully acquired SLN Terminus Hotels and Resorts Private Limited following shareholder approval at EGM on December 27, 2025, expanding its hospitality portfolio with a Marriott-associated property.",
            "Sentiment": "positive",
            "PublishDate": 1766824142988,
            "Source": "stocks"
        },
        {
            "Title": "Viceroy Hotels Calls EGM to Approve Rs 206 Crore Related Party Transactions and Board Changes",
            "Summary": "Viceroy Hotels Limited has scheduled an Extraordinary General Meeting on December 27, 2025, to seek shareholder approval for material related party transactions worth Rs 206 crores with SLN Terminus Hotels and Resorts Private Limited, including property acquisition, share purchase, and inter-corporate loans. The company also proposes to appoint two new directors, reclassify its authorized share capital from Rs 90 crores consisting of equity and preference shares to Rs 90 crores of only equity shares, and authorize loans up to Rs 41 crores to the related entity.",
            "Sentiment": "neutral",
            "PublishDate": 1764850794914,
            "Source": "corporate_action"
        },
        {
            "Title": "Viceroy Hotels Appoints Independent Director and Approves Rs 206 Crore Acquisition of SLN Terminus Hotels",
            "Summary": "Viceroy Hotels Limited's Board approved the appointment of Ms. Vaishnavi Nalabala as Additional Independent Director and the acquisition of SLN Terminus Hotels and Resorts Private Limited for Rs 206 crores. The acquisition involves a Marriott-associated hotel in Hyderabad with 75 rooms and will make SLN Terminus a wholly-owned subsidiary, strengthening Viceroy's hospitality portfolio and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1764582722023,
            "Source": "corporate_action"
        },
        {
            "Title": "Viceroy Hotels Reports Q2 FY26 Results with 27.7% EBITDA Margin Despite Courtyard Renovation Impact",
            "Summary": "Viceroy Hotels Limited reported total income of INR 31.86 crores and EBITDA of INR 8.82 crores for Q2 FY26, with occupancy at Courtyard property impacted by ongoing renovation work that added 56 new rooms. The company is executing a phased INR 120 crore investment plan across its Marriott and Courtyard properties in Hyderabad, with phase one nearing completion and expects improved ADRs and occupancy levels once renovations are finished.",
            "Sentiment": "neutral",
            "PublishDate": 1763727885232,
            "Source": "earnings"
        },
        {
            "Title": "Viceroy Hotels Reports Strong Q2 FY26 Performance Despite Ongoing Renovation Impact",
            "Summary": "Viceroy Hotels Limited shared its quarterly results presentation with stock exchanges, highlighting operational metrics where combined ADR increased 12% YoY to Rs. 6,795 while occupancy declined to 56% due to partial renovation at Courtyard by Marriott. The company outlined Rs. 100 crore investment plans for property upgrades and expansion, with management targeting completion by Q3 FY26 to enhance guest experience and operational efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1763175444634,
            "Source": "earnings"
        },
        {
            "Title": "Viceroy Hotels Plans Turnaround Strategy With Global Partnerships and Revenue Doubling Target",
            "Summary": "Viceroy Hotels is implementing a turnaround strategy involving new brand alliances, refurbishment of its Hyderabad property, and exploring joint ventures with global hospitality groups for asset-light growth. The company targets doubling revenue by FY28 through high-occupancy boutique hotels and banquet vertical expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763135404318,
            "Source": "stock"
        },
        {
            "Title": "Viceroy Hotels Limited Announces Board Changes with One Appointment and Two Resignations",
            "Summary": "Viceroy Hotels Limited appointed Mrs. Kondareddy Sukanya as Additional Non-Executive Non-Independent Director while accepting resignations from Mrs. Konda Reddy Pooja Reddy and Mrs. Shruti Gupta from their director positions. The changes affect the company's board composition, with the new appointee being the spouse of the Managing Director and mother of an existing Non-Executive Director.",
            "Sentiment": "positive",
            "PublishDate": 1763114582136,
            "Source": "corporate_governance"
        },
        {
            "Title": "Viceroy Hotels Independent Director Ms. Shruti Gupta Resigns Due to Personal Reasons",
            "Summary": "Ms. Shruti Gupta (DIN: 10707428) resigned from her position as Independent Director of Viceroy Hotels Limited on November 13, 2025, citing personal reasons. The resignation affects the company's board composition and will become effective from the date of board approval, with Gupta confirming no material reasons beyond professional commitments for her departure.",
            "Sentiment": "neutral",
            "PublishDate": 1763066354759,
            "Source": "corporate_governance"
        },
        {
            "Title": "Viceroy Hotels Schedules Q2 FY2026 Earnings Conference Call",
            "Summary": "Viceroy Hotels Limited will host a conference call on November 19, 2025, at 11:00 AM IST to discuss their quarterly and half-year financial results ended September 30, 2025. The call will feature key management including Non-Executive Director Anirudh Reddy, CFO Venkata Krishna Reddy Puli, and COO Pradyumna Kodali for analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1763049576481,
            "Source": "earnings"
        },
        {
            "Title": "Viceroy Hotels Plans ₹100+ Crore Renovation and New 200-Room Courtyard Project",
            "Summary": "Viceroy Hotels has announced plans for a renovation project worth over ₹100 crore along with a new 200-room Courtyard project. The company aims to boost premium Average Daily Rate (ADR) and Revenue Per Available Room (REVPAR) growth while improving long-term margins. The expansion comes as the company faces current occupancy challenges.",
            "Sentiment": "positive",
            "PublishDate": 1754669502640,
            "Source": "stock"
        },
        {
            "Title": "Viceroy Hotels Limited Changes Statutory Auditors, Appoints MSKC & Associates LLP for Five-Year Term",
            "Summary": "Viceroy Hotels Limited's Board of Directors approved the resignation of M/s. Deva & Co. as Statutory Auditors and appointed M/s. MSKC & Associates LLP as the new Statutory Auditors for a five-year period from the 60th Annual General Meeting in FY 2025-26 to the 64th AGM in FY 2029-30, subject to shareholder approval. Deva & Co. resigned due to internal reallocation of audit resources and strategic priorities within their firm, with their resignation effective after issuing the limited review report for the quarter ended June 30, 2025. The outgoing auditors confirmed no material concerns or circumstances that should be brought to shareholders' attention. MSKC & Associates LLP is a Limited Liability Partnership registered with ICAI and Ministry of Corporate Affairs, operating across five cities in India and specializing in audit and assurance services.",
            "Sentiment": "neutral",
            "PublishDate": 1754646722800,
            "Source": "corporate_governance"
        },
        {
            "Title": "Viceroy Hotels Reports Loss, Changes Auditors, and Schedules AGM",
            "Summary": "Viceroy Hotels Limited approved quarterly results for the quarter ended June 30, 2025, showing a net loss of ₹302.32 lakhs compared to a profit of ₹171.75 lakhs in the same quarter last year. Revenue from operations declined to ₹2,536.95 lakhs from ₹2,709.59 lakhs year-over-year. The company appointed M/s. MSKC & Associates LLP as new statutory auditors for five years, replacing M/s. Deva & Co., who resigned due to internal reallocation of audit resources. The 60th Annual General Meeting is scheduled for September 8, 2025, via video conference. The company also reconstituted its Corporate Social Responsibility Committee and Risk Management Committee. Rights issue proceeds of ₹4,951.58 lakhs are being utilized for property renovation and general corporate purposes, with ₹471.61 lakhs remaining unutilized.",
            "Sentiment": "negative",
            "PublishDate": 1754642770614,
            "Source": "earnings"
        },
        {
            "Title": "Viceroy Hotels Reports Q4 Financial Results",
            "Summary": "Viceroy Hotels has released its Q4 financial results. The company's EBITDA decreased to 95.5 million rupees from 120.4 million rupees year-over-year. The EBITDA margin declined to 27.04% from 29.22% in the same period. Revenue fell to 353.3 million rupees from 411.9 million rupees year-over-year. However, consolidated net profit increased significantly to 99.6 million rupees, up from 24.2 million rupees year-over-year and 72.9 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747654216000,
            "Source": "result"
        },
        {
            "Title": "Viceroy Hotels Signs Operating Agreement with Marriott Hotels India",
            "Summary": "Viceroy Hotels has entered into an operating agreement with Marriott Hotels India, along with other ancillary agreements. This partnership suggests a strategic move for Viceroy Hotels to potentially leverage Marriott's global brand recognition and operational expertise.",
            "Sentiment": "positive",
            "PublishDate": 1746710014000,
            "Source": "default"
        }
    ]
}