{
    "Symbol": "VIJAYA",
    "ISIN": "INE043W01024",
    "News": [
        {
            "Title": "Vijaya Diagnostic Board Meet Set for Feb 13, 2026",
            "Summary": "Vijaya Diagnostic Centre Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770376482797,
            "Source": "co_actions_results"
        },
        {
            "Title": "Centre Proposes Social Security Rules for Gig Workers",
            "Summary": "Government issues draft rules requiring gig workers to work minimum 90-120 days annually with aggregators to qualify for health, life insurance and accident coverage under Social Security Code.",
            "Sentiment": "positive",
            "PublishDate": 1767338365556,
            "Source": "stocks"
        },
        {
            "Title": "Centre May Relax Chinese Investment Rules to 26%",
            "Summary": "Government considers easing Press Note 3 restrictions, potentially allowing Chinese investments up to 26% without control or board rights in Indian companies.",
            "Sentiment": "neutral",
            "PublishDate": 1767238005022,
            "Source": "stocks"
        },
        {
            "Title": "Centre Reviews Coal Sales Limit Policy",
            "Summary": "Government considers removing 50% sales restriction on coal from captive mines, potentially impacting mining sector operations and coal availability in domestic markets.",
            "Sentiment": "neutral",
            "PublishDate": 1765941817056,
            "Source": "stocks"
        },
        {
            "Title": "Vijaya Diagnostic Centre Completes Amalgamation with Medinova Diagnostic Services",
            "Summary": "Vijaya Diagnostic Centre Limited announced the completion of its amalgamation with Medinova Diagnostic Services Limited following NCLT approval on October 13, 2025. The scheme became effective on November 4, 2025, resulting in the automatic dissolution of Medinova Diagnostic Services without winding-up. Under the share exchange ratio, Medinova shareholders will receive 1 equity share of face value INR 1 in Vijaya Diagnostic for every 22 equity shares of face value INR 10 held in Medinova. The company's authorized share capital increased to INR 230.5 crores divided into 230.5 crore equity shares of INR 1 each. Vijaya Diagnostic cancelled its investment of 62.02 lakh equity shares (62.14% stake) in Medinova. Through this amalgamation, Medinova Millennium MRI Services LLP, previously a wholly-owned subsidiary of Medinova, became a wholly-owned subsidiary of Vijaya Diagnostic. The MRI services entity operates in Kolkata with a turnover of approximately INR 2.36 crores in FY2024-25. The record date for determining eligible shareholders is November 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762248149905,
            "Source": "corporate_action"
        },
        {
            "Title": "Vijaya Diagnostic Centre Sets Record Date for Share Allotment to Medinova Shareholders",
            "Summary": "Vijaya Diagnostic Centre has established November 25, 2025, as the record date for share allotment. Under this arrangement, shareholders will receive 1 share in Vijaya Diagnostic Centre for every 22 shares held in Medinova. This share allotment affects existing Medinova shareholders who will become eligible for Vijaya Diagnostic Centre shares based on their holdings as of the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1762247348580,
            "Source": "corporate_action"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Q2 Revenue Growth to 2.02B Rupees",
            "Summary": "Vijaya Diagnostic Centre reported Q2 revenue of 2.02 billion rupees, up from 1.83 billion rupees in the same period last year. The company's Q2 EBITDA increased to 818 million rupees from 760 million rupees year-over-year. However, the EBITDA margin declined to 40.6% compared to 41.54% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762246959557,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Q2 Consolidated Net Profit of 433 Million Rupees",
            "Summary": "Vijaya Diagnostic Centre reported a consolidated net profit of 433 million rupees for Q2, compared to 419 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1762246489441,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic Centre CTO Resigns, Receives NCLT Approval for Medinova Merger",
            "Summary": "Vijaya Diagnostic Centre Limited announced that Mr. Srinivas Lanka, Chief Technology Officer, has resigned due to personal reasons with his last working day being November 15, 2025. Separately, the company received the certified true copy of the NCLT order dated October 13, 2025, approving the scheme of amalgamation with Medinova Diagnostic Services Limited. The merger will become effective when the order is filed with the Registrar of Companies in Hyderabad. The record date for share allotment to Medinova shareholders will be announced later.",
            "Sentiment": "neutral",
            "PublishDate": 1760789183715,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Approves Amalgamation of Medinova Diagnostic Services with Vijaya Diagnostic Centre",
            "Summary": "The National Company Law Tribunal, Hyderabad Bench has approved the Scheme of Amalgamation between Medinova Diagnostic Services Limited and Vijaya Diagnostic Centre Limited. The final order was pronounced on October 13, 2025, with an appointed date of April 1, 2024. Under the scheme, shareholders of Medinova will receive 1 equity share of Vijaya for every 22 shares held. Vijaya Diagnostic Centre, which holds 62.14% stake in Medinova, will see its shares in the transferor company cancelled. The amalgamation aims to consolidate business operations, create synergies, reduce costs, and improve operational efficiency in the diagnostic services sector. Both companies are listed entities engaged in providing comprehensive diagnostic services including pathological investigations, radiology, and nuclear medicine. The scheme becomes effective upon filing with the Registrar of Companies.",
            "Sentiment": "positive",
            "PublishDate": 1760614543445,
            "Source": "corporate_action"
        },
        {
            "Title": "Vijaya Diagnostic Centre Operations VP Resigns for Personal Reasons",
            "Summary": "V. Siva Rama Raju Vegesna, Operations Vice President at Vijaya Diagnostic Centre, has resigned for personal reasons with effect from November 8, 2025. The company acknowledged his six-year service period with the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1759297659581,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Hyderabad Postpones Ruling on Vijaya Diagnostic-Medinova Merger",
            "Summary": "The National Company Law Tribunal (NCLT) in Hyderabad has delayed its decision regarding the proposed merger between Vijaya Diagnostic Centre and Medinova Diagnostic Services. The tribunal has not yet approved the merger plan between the two diagnostic companies.",
            "Sentiment": "neutral",
            "PublishDate": 1759146716868,
            "Source": "corporate_action"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Strong Q1 FY26 Results with 20.4% Revenue Growth",
            "Summary": "Vijaya Diagnostic Centre Limited delivered consolidated revenue of Rs. 188 crores for the quarter ended June 30, 2025, representing a 20.4% year-on-year growth. The company achieved an EBITDA margin of 39.1% and PAT margin of 20.4%. Revenue growth was driven by 17% test volume growth and 14% patient footfall increase, along with changes in test mix. The Hyderabad market returned to double-digit growth this quarter. The company commissioned five new hubs and one spoke during the quarter across Pune, Bangalore, and West Bengal. Radiology contributed 39% of revenue mix while pathology accounted for 61%. The Nizamabad hub center achieved breakeven within two quarters of operations. One Bangalore hub center is on track to reach breakeven earlier than the estimated 12-month timeline. The company maintains its plan to open 10 hubs in the current financial year. Cash position stood at Rs. 270 crores as of June 30, 2025, with net cash of Rs. 220 crores after capital creditors. Wellness segment contributed 14.2% to revenue compared to 13.5% in the previous year. The company guided for CAPEX of Rs. 150-155 crores for new centers in FY26, with replacement CAPEX at 2-3% of topline.",
            "Sentiment": "positive",
            "PublishDate": 1754120171649,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic Plans to Launch 5 New Hubs Across Key Regions and West Bengal",
            "Summary": "Vijaya Diagnostic's Co-MD announced the company's expansion plans to launch 3 new hubs in Q2 FY26 across key regions and West Bengal. Additionally, 2 more hubs are planned to commence operations in West Bengal by H2 FY26, bringing the total planned expansion to 5 new hubs.",
            "Sentiment": "positive",
            "PublishDate": 1753692112583,
            "Source": "stock"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Strong Q1 Growth with Revenue Up 20.5%",
            "Summary": "Vijaya Diagnostic Centre reported quarterly revenue of 1.88 billion rupees, representing growth from 1.56 billion rupees in the same period last year. The company's EBITDA increased to 735 million rupees from 612 million rupees year-over-year, while EBITDA margin remained relatively stable at 39.10% compared to 39.2% previously. Consolidated net profit rose to 383 million rupees from 313 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753690015336,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic Centre Ltd. Reports Rs. 23.13 Crores Block Trade on NSE",
            "Summary": "A block trade of approximately 230,405 shares of Vijaya Diagnostic Centre Ltd. was reported on the National Stock Exchange (NSE). The trade was valued at Rs. 23.13 Crores, with shares priced at Rs. 1004.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751949329000,
            "Source": "block_details"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Q4 Results and Declares Dividend",
            "Summary": "Vijaya Diagnostic Centre announced its Q4 financial results. The company's EBITDA increased to 689 million rupees from 631.1 million rupees year-over-year. However, the EBITDA margin decreased slightly to 39.75% from 40.66%. The consolidated net profit rose to 346 million rupees from 334.5 million rupees in the same period last year. Additionally, the company declared a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747040350000,
            "Source": "result"
        },
        {
            "Title": "Vijaya Diagnostic to Consider Q4 Results on May 12",
            "Summary": "Vijaya Diagnostic Centre Limited has announced that it will consider its fourth quarter (Q4) financial results on May 12. This announcement indicates the company's compliance with regular financial reporting practices.",
            "Sentiment": "neutral",
            "PublishDate": 1746537359000,
            "Source": "default"
        },
        {
            "Title": "Vijaya Diagnostic Centre: Q3 Profit Surges 36%, Margins Improve Significantly",
            "Summary": "Vijaya Diagnostic Centre reported a 36.4% YoY increase in Q3 FY25 net profit to ₹35.2 crore. Revenue grew 27.4% to ₹169 crore, while EBITDA margin improved to 39.7%. Total tests increased by 27.6%, and footfall rose 19.3%. The wellness segment contributed 14.1% of total revenue, up from 12.2% last year.",
            "Sentiment": "positive",
            "PublishDate": 1739355127000,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic to Expand with 6 New Hubs Across India",
            "Summary": "Vijaya Diagnostic's Managing Director announced plans to commission 6 new hubs across Pune, West Bengal, and Bengaluru within the next 3 months. This expansion will bring the total number of new hubs added to 9 within a 12-month period, marking a significant milestone in the company's history.",
            "Sentiment": "positive",
            "PublishDate": 1739349433000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Improved Q3 EBITDA and Margin",
            "Summary": "Vijaya Diagnostic Centre has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 671 million rupees, up from 525 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved slightly to 39.72% from 39.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739349095000,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Q3 Revenue Growth",
            "Summary": "Vijaya Diagnostic Centre has announced its financial results for the third quarter. The company reported revenue of 1.7 billion rupees, compared to 1.33 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739348704000,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports 34.6% Increase in Q3 Net Profit",
            "Summary": "Vijaya Diagnostic Centre has announced its financial results for the third quarter. The company reported a consolidated net profit of 350 million rupees, compared to 260 million rupees in the same period last year, representing a year-over-year increase of 34.6%.",
            "Sentiment": "positive",
            "PublishDate": 1739348628000,
            "Source": "earnings"
        },
        {
            "Title": "Vijaya Diagnostic Centre Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Vijaya Diagnostic Centre Ltd shares occurred on the National Stock Exchange (NSE). The transaction involved approximately 204,962 shares, valued at Rs. 24.27 crores. The shares were traded at a price of Rs. 1184.05 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1736231245000,
            "Source": "block_deals"
        },
        {
            "Title": "Vijaya Diagnostic Aims to Maintain 40% EBITDA Margins for FY",
            "Summary": "Vijaya Diagnostic Centre has stated in a conference call that it expects to maintain 40% EBITDA margins for the full financial year. The company acknowledges that there may be quarterly fluctuations in these margins due to the opening of new diagnostic centers.",
            "Sentiment": "positive",
            "PublishDate": 1731035911000,
            "Source": "normal_news"
        },
        {
            "Title": "Vijaya Diagnostic Targets 15-16% Growth, Plans Rs 200 Cr CAPEX",
            "Summary": "Vijaya Diagnostic has expressed confidence in achieving double-digit growth of 15% to 16%. The company has also announced a capital expenditure (CAPEX) guidance of approximately Rs 200 crore for both FY25 and FY26, which will be used for establishing new centers.",
            "Sentiment": "positive",
            "PublishDate": 1731035848000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Q2 EBITDA Growth",
            "Summary": "Vijaya Diagnostic Centre has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 760 million rupees, up from 573 million rupees in the same quarter last year. However, the EBITDA margin decreased to 41.54% from 44.52% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730967329000,
            "Source": "result"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Q2 Revenue Growth",
            "Summary": "Vijaya Diagnostic Centre has announced its Q2 revenue, which stands at 1.83 billion rupees. This represents a significant increase from the 1.4 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1730967149000,
            "Source": "result"
        },
        {
            "Title": "Vijaya Diagnostic Centre Reports Q2 Profit Increase",
            "Summary": "Vijaya Diagnostic Centre has reported a consolidated net profit of 419 million rupees for the second quarter, compared to 333 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730967127000,
            "Source": "result"
        }
    ]
}