{
    "Symbol": "VIJIFIN",
    "ISIN": "INE159N01027",
    "News": [
        {
            "Title": "Viji Finance Q3FY26 Net Profit Jumps to ₹94.22 Lakhs",
            "Summary": "Viji Finance Limited reported strong Q3FY26 results with net profit of ₹94.22 lakhs versus loss of ₹9.56 lakhs in Q3FY25. Revenue from operations surged 168.55% to ₹159.26 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1768567096948,
            "Source": "co_actions_results"
        },
        {
            "Title": "Viji Finance AGM Approves Key Corporate Changes",
            "Summary": "Viji Finance Limited's 31st AGM on December 31, 2025 approved secretarial auditor appointment, authorized capital increase from ₹18 crores to ₹30 crores, and new director appointment.",
            "Sentiment": "positive",
            "PublishDate": 1767182360737,
            "Source": "stocks"
        },
        {
            "Title": "Viji Finance Limited Announces 31st Annual General Meeting via Video Conferencing",
            "Summary": "Viji Finance Limited has issued a public notice announcing its 31st Annual General Meeting to be held on December 31, 2025, through video conferencing and other audio-visual means. The company has informed stock exchanges BSE, NSE, and Calcutta Stock Exchange about the AGM arrangements and remote e-voting facilities for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1765366388090,
            "Source": "corporate_action"
        },
        {
            "Title": "Viji Finance Limited Clarifies Director Cessations Due to Regulatory Compliance Issues",
            "Summary": "Viji Finance Limited clarified that CA Anchit Garg (Independent Director) and Mr. Nikhilkumar Ramaniklal Sanghvi (Non-Executive Director) ceased their positions effective December 8, 2025, due to non-receipt of shareholders approval within stipulated timeline under SEBI Regulation 17(1C). The company filed revised disclosures with BSE after exchange raised discrepancies regarding the board meeting outcome and emphasized that the directors did not resign but their offices ceased due to regulatory compliance requirements.",
            "Sentiment": "negative",
            "PublishDate": 1765279739828,
            "Source": "corporate_governance"
        },
        {
            "Title": "Viji Finance Limited Proposes to Increase Authorized Share Capital from Rs 18 Crores to Rs 30 Crores",
            "Summary": "Viji Finance Limited's Board of Directors approved an increase in authorized share capital from Rs 18 crores (18 crore equity shares) to Rs 30 crores (30 crore equity shares) of Re 1 each, along with corresponding amendments to the Memorandum of Association. The proposal requires shareholder approval at the upcoming Annual General Meeting and affects the company's capital structure and future fundraising capacity.",
            "Sentiment": "positive",
            "PublishDate": 1765201892042,
            "Source": "corporate_action"
        },
        {
            "Title": "Viji Finance Limited Whole-Time Director Nitesh Gupta Resigns to Focus on Personal Business",
            "Summary": "Nitesh Gupta (DIN: 09248507) resigned from his position as Whole-Time Director and Key Managerial Personnel of Viji Finance Limited effective December 8, 2025, citing his desire to focus on personal business endeavors and inability to devote time to company affairs. The resignation affects the company's key management structure, with the board meeting held from 3:00 p.m. to 5:30 p.m. to address this material event under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765200219160,
            "Source": "corporate_governance"
        },
        {
            "Title": "Viji Finance Limited Appoints Ashish Verma as Additional Non-Executive Director",
            "Summary": "Viji Finance Limited appointed Mr. Ashish Verma as Additional Director under Professional Non-Executive Non-Independent Director category effective December 8, 2025, based on Nomination and Remuneration Committee recommendations. The appointment is subject to shareholder approval at the upcoming 31st Annual General Meeting, with Verma bringing 38 years of experience in Education and Administration.",
            "Sentiment": "neutral",
            "PublishDate": 1765199942168,
            "Source": "corporate_governance"
        },
        {
            "Title": "Viji Finance Reports Net Loss and Director Resignation in Q2 Results",
            "Summary": "Viji Finance Limited reported a net loss of ₹9.69 lakhs for the quarter ended September 30, 2025, compared to a loss of ₹33.00 lakhs in the previous quarter. For the half-year period, the company recorded a net loss of ₹42.69 lakhs versus ₹30.66 lakhs in the corresponding period last year. Revenue from operations decreased to ₹57.85 lakhs from ₹56.52 lakhs in the previous quarter. The company's total assets stood at ₹3,444.14 lakhs as of September 30, 2025. Additionally, Mr. Aryaman Kothari resigned as Non-Executive Non-Independent Director effective November 3, 2025. The Board also reconstituted its Finance Committee with Mr. Nitesh Gupta as the Whole Time Director member.",
            "Sentiment": "negative",
            "PublishDate": 1762175667824,
            "Source": "earnings"
        },
        {
            "Title": "Viji Finance Reports Loss of Rs 33 Lacs in Q1 FY2026, Appoints New Secretarial Auditors",
            "Summary": "Viji Finance Limited reported a net loss of Rs 33 lacs for the quarter ended June 30, 2025, compared to a loss of Rs 10.31 lacs in the same quarter last year. Total income decreased to Rs 65.85 lacs from Rs 103.60 lacs in the previous quarter, while total expenses increased significantly to Rs 99.23 lacs from Rs 30.20 lacs. Interest income remained relatively stable at Rs 56.52 lacs. The company's earnings per share stood at -Rs 0.02. The board also approved the appointment of Ramesh Chandra Bagdi & Associates as Secretarial Auditors for a five-year term from FY 2025-2026 to FY 2029-2030, subject to shareholder approval. Additionally, the board approved draft documents for listing equity shares of promoters and promoter group on SDAX Exchange Singapore.",
            "Sentiment": "negative",
            "PublishDate": 1754401632140,
            "Source": "earnings"
        },
        {
            "Title": "Viji Finance: Q3 FY25 Reports Loss Despite Revenue Growth",
            "Summary": "Viji Finance reported Q3 FY25 results on 15 Jan, 2025, showing a 45.1% YoY revenue increase to ₹0.74 Cr. However, the company posted a loss of ₹0.1 Cr, compared to a profit of ₹0.03 Cr in Q3 FY24. Operating income decreased by 350% YoY, while expenses rose significantly. EPS stood at ₹-0.01.",
            "Sentiment": "negative",
            "PublishDate": 1737007004000,
            "Source": "earnings"
        }
    ]
}