{
    "Symbol": "VIKASECO",
    "ISIN": "INE806A01020",
    "News": [
        {
            "Title": "Vikas Ecotech Takes Website Offline After Cyber Attack",
            "Summary": "Vikas Ecotech Limited temporarily took its official website offline following a cyber attack that resulted in unauthorized content display and web server hacking. The company has engaged security experts for remediation.",
            "Sentiment": "negative",
            "PublishDate": 1770467368368,
            "Source": "stocks"
        },
        {
            "Title": "Vikas Ecotech Q3FY26 Results Show Mixed Performance",
            "Summary": "Vikas Ecotech reported Q3FY26 standalone net loss of ₹124.04 lakhs vs ₹19.06 lakhs loss in Q3FY25, despite revenue decline to ₹5,006.00 lakhs from ₹6,097.30 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770307254627,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikas Ecotech Takes Website Offline for Security Review",
            "Summary": "Vikas Ecotech Limited temporarily took its official website offline on January 20, 2026, following detection of unauthorized content. The company has initiated comprehensive technical and security reviews.",
            "Sentiment": "neutral",
            "PublishDate": 1768972420444,
            "Source": "stocks"
        },
        {
            "Title": "Vikas Ecotech denies ED inquiry links, takes legal action",
            "Summary": "Vikas Ecotech Limited clarifies no connection to alleged ED export-import inquiry involving third parties, presents verified records proving non-involvement, and initiates legal proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1767009082571,
            "Source": "stocks"
        },
        {
            "Title": "Vikas EcoTech Gets Clean Chit from SEBI Adjudication",
            "Summary": "SEBI adjudication order dated December 19, 2025 confirms no adverse findings, directions, or penalties imposed on Vikas EcoTech's promoter and associated entities in trading matter.",
            "Sentiment": "positive",
            "PublishDate": 1766229886420,
            "Source": "stocks"
        },
        {
            "Title": "Vikas Ecotech Reports Mixed Quarterly Performance with Revenue Decline",
            "Summary": "Vikas Ecotech Limited reported quarterly revenue of Rs 4,023.8 lakhs compared to Rs 8,733.92 lakhs in the previous year quarter, while posting a net profit of Rs 79.79 lakhs versus Rs 319.15 lakhs year-over-year. The company's board approved unaudited financial results for the quarter and half-year ended September 30, 2025, showing declining performance in both revenue and profitability metrics.",
            "Sentiment": "negative",
            "PublishDate": 1763141218075,
            "Source": "earnings"
        },
        {
            "Title": "Vikas Ecotech Reports Enforcement Directorate Visit Over Decade-Old Export-Import Inquiry",
            "Summary": "Vikas Ecotech Limited disclosed that Enforcement Directorate officials visited the company's office and a promoter's residence on November 12, 2025. The visit relates to an ongoing investigation concerning decade-old export-import transactions involving unrelated third parties with whom the company claims to have had no dealings or underlying interests. The company's name appears to have been included in a wider inquiry reportedly based on questionable inputs. A stay was granted in the matter in 2023 by the High Court of Gujarat, and the company plans to approach the relevant adjudicating authority in compliance with court directions. The company extended full cooperation to the authorities, and the proceedings concluded amicably without adverse developments. Vikas Ecotech stated there is no material impact on the company's financials, operations, or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1763035875427,
            "Source": "stock"
        },
        {
            "Title": "Vikas Ecotech Secures INR 34.22 Million Order from Olectra Greentech for Fire Retardant Materials",
            "Summary": "Vikas Ecotech Limited has received a bulk order worth INR 34.22 million from Olectra Greentech Limited for fire retardant materials, specifically Aluminium Trihydrate (ATH). The order will be executed in the upcoming quarter, with an estimated completion time of approximately 3 months. This order highlights growing confidence in Vikas Ecotech's product performance and technical consistency in the fire-retardant materials segment. The demand for ATH continues to rise due to strengthening safety regulations and increasing applications across sectors including electric mobility, construction, automotive, EHV composite insulators and wire & cable. Vikas Ecotech is a New Delhi-based specialty polymers and chemicals manufacturer, while Olectra Greentech is India's leading electric bus manufacturer and part of the MEIL Group.",
            "Sentiment": "positive",
            "PublishDate": 1755604982251,
            "Source": "order&deals"
        },
        {
            "Title": "Vikas Ecotech Reports ₹169.70 Lakh Quarterly Profit, Revenue Rises to ₹8,360.58 Lakh",
            "Summary": "Vikas Ecotech Limited's Board approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹8,360.58 lakh, up from ₹7,754.16 lakh in the previous quarter and ₹7,996.50 lakh in the same quarter last year. Standalone profit for the period was ₹169.70 lakh compared to ₹197.59 lakh in the previous quarter and ₹1,007.16 lakh in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations reached ₹10,355.56 lakh with profit of ₹237.00 lakh. The company operates in two main segments: Infra & Energy (₹4,649.82 lakh revenue) and Chemical, Polymers & Special Additives (₹3,710.76 lakh revenue on standalone basis). Basic earnings per share stood at ₹0.02 for both standalone and consolidated results. The company has a paid-up equity share capital of ₹13,883.56 lakh with face value of ₹1 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755076401026,
            "Source": "earnings"
        },
        {
            "Title": "Vikas Ecotech Reports Q4 Financial Results",
            "Summary": "Vikas Ecotech has reported its Q4 financial results. The company's EBITDA increased to 36 million rupees from 27 million rupees year-over-year. However, the EBITDA margin decreased slightly to 3.55% from 3.69% year-over-year. The consolidated net profit rose to 43 million rupees from 23 million rupees year-over-year, but showed a loss of 6 million rupees quarter-on-quarter. Revenue for Q4 increased to 1.03 billion rupees from 717 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748535077000,
            "Source": "result"
        },
        {
            "Title": "Vikas Ecotech to Consider Capital Reduction Scheme",
            "Summary": "Vikas Ecotech has announced a board meeting scheduled for March 7 to consider a scheme of capital reduction. This corporate action could potentially impact the company's share structure and value for existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1741091344000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Ecotech: Plans ₹200 Crore Fundraising and Leadership Change",
            "Summary": "Vikas Ecotech Ltd announced plans to raise ₹200 crore through QIP, FCCB, or rights issue. The company will increase its Authorized Share Capital from ₹200 crore to ₹235 crore. Managing Director Vikas Garg will step down on December 31, 2024. Q2FY25 results show 47% increase in net sales and 61% rise in net profit.",
            "Sentiment": "positive",
            "PublishDate": 1735737289000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Ecotech Board Meeting to Consider Issuance of Securities and Strategic Restructuring",
            "Summary": "Vikas Ecotech has announced a board meeting scheduled for January 1. The meeting agenda includes considering the issuance of securities to augment resources, as well as discussing strategic guidance and restructuring for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1735306826000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vikas Ecotech: Growth and Diversification Boost Q2 Performance",
            "Summary": "Vikas Ecotech reported a 47% increase in Q2FY25 net sales to Rs 89.23 crores and a 61% rise in net profit to Rs 10.38 crores. The company acquired Shamli Steels and Vikas Organics, expanding into infrastructure and new sectors. A subsidiary secured a Rs 165 million export deal for Vinyl Plasticisers.",
            "Sentiment": "positive",
            "PublishDate": 1731652466000,
            "Source": "result"
        }
    ]
}