{
    "Symbol": "VIKASLIFE",
    "ISIN": "INE161L01027",
    "News": [
        {
            "Title": "Vikas Lifecare Takes Website Offline After Cyber Attack",
            "Summary": "Vikas Lifecare Limited temporarily shut down its official website following a cyber attack that resulted in unauthorized content display and web server hacking. The company has engaged security experts.",
            "Sentiment": "negative",
            "PublishDate": 1770466992067,
            "Source": "stocks"
        },
        {
            "Title": "Vikas Lifecare Takes Website Offline for Security Review",
            "Summary": "Vikas Lifecare Limited temporarily took its official website offline on January 20, 2026, following detection of unauthorized content. The company has engaged security experts for comprehensive review.",
            "Sentiment": "neutral",
            "PublishDate": 1768917374045,
            "Source": "stocks"
        },
        {
            "Title": "Vikas Lifecare Cleared in SEBI Adjudication Order",
            "Summary": "SEBI's adjudication order dated December 19, 2025, confirms no adverse findings, directions, or penalties imposed on Vikas Lifecare Limited, its promoter, or associated persons regarding trading transactions.",
            "Sentiment": "positive",
            "PublishDate": 1766230673366,
            "Source": "stocks"
        },
        {
            "Title": "Vikas Lifecare Delays Quarterly Results, Approves Rs 100 Crore Rights Issue",
            "Summary": "Vikas Lifecare's board deferred approval of quarterly results for the quarter ended September 30, 2025, citing need to verify certain transactions and valuations within subsidiaries. The company approved a rights issue of up to Rs 100 crores through fully paid-up equity shares of Re. 1 face value each to raise funds from eligible shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1763127258010,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Lifecare Board Recommends Shri Pal Goel for Independent Director Position",
            "Summary": "Vikas Lifecare Limited's Board of Directors has recommended the appointment of Mr. Shri Pal Goel as an Independent Director for a five-year term starting September 29, 2025. The recommendation follows a proposal from a company member and approval by the Nomination and Remuneration Committee. Goel, who holds DIN 07352580, is an MA in Economics from Kurukshetra University with over 35 years of banking experience, having retired as General Manager of North Zone at Union Bank of India. He has worked across retail banking, treasury, and risk management departments and received business performance awards in 2003, 2006, and 2009. Goel currently serves as an Independent Director at Delphi World Money Limited and holds positions with various charitable organizations. The appointment requires shareholder approval at the Annual General Meeting scheduled for September 29, 2025. An addendum to the AGM notice will be circulated to shareholders. Goel is not debarred by SEBI or other authorities and has no relationships with existing directors.",
            "Sentiment": "neutral",
            "PublishDate": 1758025662953,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vikas Lifecare Reports Net Loss of Rs 280 Crores in Q1 FY26, Appoints New Independent Director",
            "Summary": "Vikas Lifecare Limited reported a standalone net loss of Rs 280.03 crores for the quarter ended June 30, 2025, compared to a loss of Rs 207.13 crores in the same period last year. Revenue from operations declined to Rs 8,869.19 crores from Rs 9,156.18 crores year-on-year. On a consolidated basis, the company posted a net loss of Rs 395.27 crores versus Rs 291.57 crores in the previous year quarter. The company's board approved the appointment of CA Vijay Kumar Goel as Independent Director, replacing Ms. Samanta Yadav who resigned due to personal reasons. The company operates across trading and manufacturing divisions in agro, polymers, and infrastructure segments, with the agro division contributing the largest revenue share of Rs 7,546.54 crores during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755184553096,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Lifecare Contributes to Ebix Acquisition and Initiates Arbitration Against Eraaya",
            "Summary": "Vikas Lifecare has made a significant financial contribution of USD 34.827 million towards the acquisition of Ebix. Additionally, the company has invoked arbitration proceedings against Eraaya, indicating a potential dispute or disagreement between the two entities.",
            "Sentiment": "neutral",
            "PublishDate": 1740355751000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Lifecare Contributes $34.827M for Ebix Acquisition and Initiates Arbitration Against Eraaya",
            "Summary": "Vikas Lifecare has made a significant financial contribution of $34.827 million towards the acquisition of Ebix. Additionally, the company has invoked arbitration proceedings against Eraaya, indicating a potential dispute or disagreement between the two entities.",
            "Sentiment": "neutral",
            "PublishDate": 1740143742000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Lifecare: Board Approves Rs 200 Crore Fundraising Plan",
            "Summary": "Vikas Lifecare's board has approved raising Rs 200 crore through various means including equity issuance, QIP, FCCB, public offering, or rights issue. The funds will be used for organic and inorganic growth opportunities in the company's operations and adjacent areas.",
            "Sentiment": "positive",
            "PublishDate": 1734694821000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Lifecare: Penny Stock Rises on Fundraising Approval",
            "Summary": "Vikas Lifecare's stock price increased up to 1.8% to ₹4.51 intraday after the Board of Directors approved a plan to raise funds and issue securities on December 20, 2024. The stock has risen over 6% in the past month, rebounding from its 52-week low of ₹4.05 in November 2024.",
            "Sentiment": "positive",
            "PublishDate": 1734688364000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Lifecare Enters Agreement for Bio-Degradable Plastics",
            "Summary": "Vikas Lifecare has entered into an agreement related to bio-degradable plastics. This move suggests the company is expanding its product offerings or capabilities in environmentally friendly materials.",
            "Sentiment": "positive",
            "PublishDate": 1734331453000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikas Lifecare: Penny Stock Surges 10% on CAPEX Update",
            "Summary": "Vikas Lifecare stock jumped nearly 10% in intraday trading on BSE on December 6, despite overall market weakness. The surge followed a CAPEX update from the company.",
            "Sentiment": "positive",
            "PublishDate": 1733466468000,
            "Source": "normal_news"
        },
        {
            "Title": "Vikas Lifecare: Q2 Revenue Up, Expands into EMI Shielding",
            "Summary": "Vikas Lifecare reported Q2 FY2024 sales of Rs 134.88 crore, up from Rs 116.03 crore in Q2 FY2023. The company entered a joint venture for EMI shielding nanocomposites development. Promoters increased their stake to 14.21% in June 2024. The company has diversified into FMCG, Agro products, and entertainment sectors.",
            "Sentiment": "positive",
            "PublishDate": 1729669014000,
            "Source": "result"
        }
    ]
}