{
    "Symbol": "VIKRAN",
    "ISIN": "INE01R501028",
    "News": [
        {
            "Title": "Vikran Engineering Launches SPV for ₹459.20 Crore Solar",
            "Summary": "Vikran Engineering establishes fully owned subsidiary Vikran MP Solar Private Limited to execute NTPC's 400 MW solar project worth ₹459.20 crore in Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1770130227965,
            "Source": "stocks"
        },
        {
            "Title": "Vikran Engineering Signs ₹491.5M Loan Deal",
            "Summary": "Vikran Engineering has entered into a significant loan agreement worth ₹491.5 million with Onix Renewable, marking a major financial transaction for the company.",
            "Sentiment": "positive",
            "PublishDate": 1770122946597,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikran Engineering Withdraws Credit Rating Voluntarily",
            "Summary": "Vikran Engineering Limited voluntarily requested CARE Ratings to withdraw its credit ratings for bank facilities. The withdrawal was completed on January 28, 2026, following company request and lender approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769706082210,
            "Source": "stocks"
        },
        {
            "Title": "Vikran Engineering Shares Surge 9.5% On Solar Project Win",
            "Summary": "Vikran Engineering shares jumped 9.5% to ₹110.35 after winning 45.75 MW solar projects in Madhya Pradesh under PM KUSUM-C scheme with 25-year power purchase agreements.",
            "Sentiment": "positive",
            "PublishDate": 1766969538323,
            "Source": "stocks"
        },
        {
            "Title": "Vikran Engineering eyes ₹2000 cr additional orders",
            "Summary": "Vikran Engineering sees possibility of securing extra ₹2000 crore orders soon, adding to its existing 45.75 MW solar project portfolio in Madhya Pradesh under PM-KUSUM programme.",
            "Sentiment": "positive",
            "PublishDate": 1766759163283,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikran Engineering Wins 45.75 MW Solar Project Awards",
            "Summary": "Vikran Engineering Limited accepted Letter of Awards from M.P. Urja Vikas Nigam Limited for 45.75 MW AC solar power plants in Vidisha District under PM KUSUM-C scheme with 25-year execution period.",
            "Sentiment": "positive",
            "PublishDate": 1766755569435,
            "Source": "stocks"
        },
        {
            "Title": "Vikran Engineering Shares Rise 4% On NTPC Solar Order",
            "Summary": "Vikran Engineering shares gained 3.98% to ₹100.23 after securing ₹459.20 crore NTPC Renewable Energy order for 400 MW solar project at Chitrakoot-1, Uttar Pradesh with 12-month timeline.",
            "Sentiment": "positive",
            "PublishDate": 1766586982890,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikran Engineering Gets Credit Rating Upgrade",
            "Summary": "Infomerics upgrades Vikran Engineering's credit rating to IVR A-/Stable from IVR BBB+/Stable, citing improved operations scale and substantial order book increase across facilities worth ₹460.40 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766496217761,
            "Source": "stocks"
        },
        {
            "Title": "Vikran Engineering Wins ₹2,035 Cr Solar EPC Order",
            "Summary": "Vikran Engineering Limited secured a major work order worth ₹2,035.26 crores from Onix Renewables Limited for developing a 600 MW solar plant across multiple locations in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1766491426056,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikran Engineering Receives GST Demand Order Worth Rs. 1.22 Crores from Tax Authorities",
            "Summary": "Vikran Engineering Limited received a demand order from the Joint Commissioner for excess Input Tax Credit claims totaling Rs. 1.22 crores (including tax of Rs. 0.65 crore, interest of Rs. 0.51 crore, and penalty of Rs. 0.06 crore) for Financial Year 2021-22. The company plans to file an appeal against the order based on tax consultant advice and expects no financial implications.",
            "Sentiment": "negative",
            "PublishDate": 1764074198620,
            "Source": "stock"
        },
        {
            "Title": "Vikran Engineering Receives Rs 13.92 Crore GST Demand Order from Ayodhya Tax Authority",
            "Summary": "Vikran Engineering Limited received a demand order from the Deputy Commissioner Sultanpur Sector-1, Ayodhya under CGST Act Section 74A for Rs 10.72 crore in tax shortfall and excess ITC claims, plus Rs 3.20 crore in penalty and interest for the period April 2023 to March 2025. The company plans to file an appeal against the order based on tax consultant advice and expects no financial implications.",
            "Sentiment": "negative",
            "PublishDate": 1763567626839,
            "Source": "stock"
        },
        {
            "Title": "Vikran Engineering Reports 13.6% Revenue Growth in H1 FY26, Secures Major Solar EPC Orders Worth INR 1,997 Crores",
            "Summary": "Vikran Engineering Limited posted INR 176 crores revenue in Q2 FY26 with improved EBITDA margins and PAT rising to INR 14.8 crores from INR 6.3 crores in H1 FY25. The company secured two significant solar EPC contracts totaling INR 1,997 crores and maintains an order book exceeding INR 4,000 crores, providing strong revenue visibility across Power, Water, and Railway infrastructure segments.",
            "Sentiment": "positive",
            "PublishDate": 1763204395433,
            "Source": "earnings"
        },
        {
            "Title": "Vikran Engineering Reports No Deviation in Rs 721 Crore IPO Fund Utilization for Q2 FY26",
            "Summary": "Vikran Engineering Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing utilization of Rs 205.77 crore from its Rs 721 crore IPO proceeds with no deviations from stated objectives. The company deployed Rs 158.47 crore for working capital requirements and Rs 47.30 crore for issue-related expenses, while Rs 515.23 crore remains unutilized and deployed in fixed deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1763108444091,
            "Source": "stock"
        },
        {
            "Title": "Vikran Engineering Secures Rs 1,641.91 Crore Solar Power Contract, Reports Quarterly Results",
            "Summary": "Vikran Engineering Limited announced acceptance of a Letter of Award worth Rs 1,641.91 crores from Carbonminus Maharashtra One Private Limited for developing 505 MW AC capacity crystalline ground mounted solar PV power plants across various districts in Maharashtra under MSEDCL LIS scheme. The Engineering, Procurement and Commissioning (EPC) contract is to be executed within 11 months. The company also approved its unaudited financial results for the quarter and half year ended September 30, 2025. During the quarter, the company completed its Initial Public Offering of 79,587,627 equity shares at Rs 97 per share, receiving net proceeds of Rs 67,097 lakhs from fresh issue. The company's equity shares got listed on NSE and BSE on September 3, 2025. The auditor's review report highlighted an ongoing litigation with a customer regarding recovery of Rs 2,929 lakhs, which is pending in Commercial Court, Jaipur with next hearing scheduled for November 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762811530068,
            "Source": "earnings"
        },
        {
            "Title": "Vikran Engineering Plans Multi-Segment Growth Strategy with Renewable Energy Focus",
            "Summary": "Vikran Engineering has outlined a comprehensive growth strategy spanning multiple business segments. The company plans to scale its renewable energy EPC and fabrication capabilities while maintaining order book visibility across heavy engineering and infrastructure segments. The strategy includes strengthening presence in public-sector and export markets. The company is targeting margin improvement through process automation, cost efficiency measures, and backward integration into structural components. A multi-year expansion capital expenditure program is planned for capacity and technology upgrades.",
            "Sentiment": "positive",
            "PublishDate": 1762790039959,
            "Source": "stock"
        },
        {
            "Title": "Vikran Engineering Reports Strong Q2 Results with 333% Net Profit Growth and Secures Major Contract Worth 16.42B Rupees",
            "Summary": "Vikran Engineering delivered robust quarterly performance with net profit surging to 91 million rupees from 21 million rupees year-over-year. Revenue increased to 1.76 billion rupees compared to 1.59 billion rupees in the same period last year. The company's EBITDA nearly doubled to 254 million rupees from 128 million rupees, while EBITDA margin expanded significantly to 14.43% from 8.03%. Additionally, Vikran Engineering received a Letter of Award worth 16.42 billion rupees, marking a substantial business win for the company.",
            "Sentiment": "positive",
            "PublishDate": 1762779850243,
            "Source": "earnings"
        },
        {
            "Title": "Vikran Engineering Schedules Earnings Conference Call for Q2 H1 FY26 Results",
            "Summary": "Vikran Engineering Limited has announced an earnings conference call scheduled for Tuesday, November 11, 2025, at 12:30 PM IST to discuss operational and financial performance for Q2 H1 FY26. The call will feature key participants including Promoter CMD Rakesh Markhedkar, Whole Time Director Nakul Markhedkar, and Chief Financial Officer Ashish Bahety. The company has provided multiple dial-in numbers for different regions and a Diamond Pass Link for joining the conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1762342377674,
            "Source": "earnings"
        },
        {
            "Title": "Vikran Engineering Contests BSE Fine Over Annual Report Submission",
            "Summary": "Vikran Engineering Limited received a fine of Rs 1,22,720 from BSE for non-compliance with Regulation 34 of SEBI LODR Regulations regarding non-submission of Annual Report within prescribed period. The company disputes the penalty, stating that Regulation 34 was not applicable as the company was not listed when its 17th Annual General Meeting was held on August 25, 2025. The company got listed on NSE and BSE on September 3, 2025, after the AGM date. Vikran Engineering has uploaded its Annual Report for Financial Year 2024-25 on its website and requested BSE to waive the penalty. The company is awaiting BSE's response on the matter.",
            "Sentiment": "neutral",
            "PublishDate": 1761920436579,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vikran Engineering Secures 3.54 Billion Rupee Project",
            "Summary": "Vikran Engineering has secured a project worth 3.54 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1761524401905,
            "Source": "stock"
        },
        {
            "Title": "Vikran Engineering Secures ₹3.54 Billion Project Contract",
            "Summary": "Vikran Engineering has secured a project worth ₹3.54 billion. The announcement represents a significant contract win for the engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1761320525372,
            "Source": "stock"
        },
        {
            "Title": "Vikran Engineering Reports 17% Revenue Growth in Q1 FY26 Results",
            "Summary": "Vikran Engineering Limited announced its unaudited financial results for the first quarter ended June 30, 2025. The company reported consolidated revenue of Rs. 159.16 crore, representing a 16.98% increase from Rs. 136.06 crore in Q1 FY25. EBITDA grew significantly by 60.91% to Rs. 22.64 crore with margins improving to 14.22% from 10.34% in the previous year. Profit after tax increased by 31.70% to Rs. 5.65 crore. The revenue growth was driven by new orders from the Power Infrastructure vertical. As of June 30, 2025, the company maintains a total order book of Rs. 5,120.21 crore with Rs. 2,442.44 crore remaining for execution. Chairman & Managing Director Rakesh Markhedkar highlighted this as their first quarterly results as a listed company, emphasizing disciplined execution and cost efficiency. The diversified EPC company operates across Power Transmission & Distribution, Water Infrastructure, and Railway Electrification segments.",
            "Sentiment": "positive",
            "PublishDate": 1758796775117,
            "Source": "earnings"
        },
        {
            "Title": "Vikran Engineering Approves Key Management Changes and ₹175 Crore Solar Power Investment",
            "Summary": "Vikran Engineering Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and announced significant management changes. The company appointed Mr. Vipul Markhedkar, Head-Business Operation, as Key Management Personnel, and designated Mrs. Kanchan Rakesh Markhedkar as Chief Human Resource Officer and Key Management Personnel. Mr. Vinod Mohandass, General Manager (Business Development & Execution), resigned due to personal reasons and will cease duties on September 30, 2025. The Board also approved exploring an investment of up to ₹175 Crore in a Special Purpose Vehicle engaged in a Solar Power Project to secure EPC contracts for solar projects. The investment will be funded through external funding or internal accruals. Both new appointees are family members of Chairman and Managing Director Mr. Rakesh Ashok Markhedkar.",
            "Sentiment": "positive",
            "PublishDate": 1758548065055,
            "Source": "corporate_action"
        }
    ]
}