{
    "Symbol": "VIKRAMSOLR",
    "ISIN": "INE078V01014",
    "News": [
        {
            "Title": "VSL Ventures refinances loan, releases & recreates pledge",
            "Summary": "VSL Ventures Private Limited refinanced existing loans and replaced pledge on 15,099,750 Vikram Solar shares (4.17%) from multiple lenders to Aditya Birla Capital Limited on commercially favourable terms.",
            "Sentiment": "neutral",
            "PublishDate": 1770455169988,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikram Solar seeks shareholder approval for director appointments",
            "Summary": "Vikram Solar Limited has issued a postal ballot notice for three director appointments, including two new appointments and one re-appointment, with e-voting scheduled from January 22 to February 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769001698876,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar Gets Buy Rating with ₹326 Target",
            "Summary": "Prabhudas Lilladher maintains buy rating on Vikram Solar with ₹326 target price, citing strong module sales growth and capacity expansion plans including new 5GW facility commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1768982090649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikram Solar Plans ₹10,700 Cr Investment Expansion",
            "Summary": "Vikram Solar announces major expansion with ₹6,400 cr for modules and cells, ₹4,300 cr for batteries over 24-30 months, requiring ₹2,400 cr internal funding.",
            "Sentiment": "positive",
            "PublishDate": 1768964784856,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar Eyes 18-20% EBITDA Margin Growth",
            "Summary": "Vikram Solar targets steady 18-20% EBITDA margins for non-DCR business while advancing Gangakondan facility with 6 GW module capacity by Q1 FY27 and 12 GW cell plant by December 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768964729196,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar Submits Q3 FY26 IPO Monitoring Report",
            "Summary": "Vikram Solar submitted its quarterly monitoring agency report for Q3 FY26, showing ₹2,952.15 crores utilized from IPO proceeds with ₹12,047.85 crores remaining unutilized across manufacturing expansion projects.",
            "Sentiment": "neutral",
            "PublishDate": 1768918576905,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikram Solar Q3FY26 Net Profit Surges 361% to ₹964.35 cr",
            "Summary": "Vikram Solar Limited reported exceptional Q3FY26 results with net profit jumping 361% to ₹964.35 crores and revenue growing 7.7% to ₹11,057.70 crores, driven by strong solar module manufacturing performance.",
            "Sentiment": "positive",
            "PublishDate": 1768907136049,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikram Solar Transitions to G12R High-Efficiency Modules",
            "Summary": "Vikram Solar announces complete portfolio shift to G12R-based modules with up to 640 Wp power output and 23.69% efficiency, leveraging 9.5 GW manufacturing capacity across three facilities.",
            "Sentiment": "positive",
            "PublishDate": 1768541232578,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar Upgrades to G12R Modules, Expands to 9.5 GW",
            "Summary": "Vikram Solar transitions to high-efficiency G12R solar modules while significantly expanding manufacturing capacity to 9.5 GW, positioning itself as a leader in solar manufacturing innovation.",
            "Sentiment": "positive",
            "PublishDate": 1768540771846,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar schedules Q3FY26 earnings call for Jan 20",
            "Summary": "Vikram Solar Limited announces earnings conference call on January 20, 2026, at 5:00 PM IST to discuss Q3FY26 financial results ended December 31, 2025, with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768406871315,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar announces senior management changes",
            "Summary": "Vikram Solar's Senior VP & Head of Global HR Arindam Chakraborty resigns effective March 31, 2026. Biresh Ranjan Das appointed as new Senior VP - Human Resources with over two decades of experience.",
            "Sentiment": "neutral",
            "PublishDate": 1768288298367,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar Gets Credit Rating Upgrade from India Ratings",
            "Summary": "India Ratings upgrades Vikram Solar's long-term bank facilities rating to IND A Stable and maintains IND A1 for short-term facilities on ₹2,700 crore credit facilities.",
            "Sentiment": "positive",
            "PublishDate": 1766141657822,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar Grants 17.22 Lakh Stock Options to Employees",
            "Summary": "Vikram Solar's NRC approves grant of 17,22,000 employee stock options under ESOP 2021 plan at exercise price of ₹210.69 per share with minimum 1-year vesting period.",
            "Sentiment": "positive",
            "PublishDate": 1765900337284,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikram Solar Approves ₹4,371 Cr BESS Investment",
            "Summary": "Vikram Solar has approved a substantial ₹4,371 crore investment for the first phase of its Battery Energy Storage System plan through its subsidiary VSL Powerhive, marking a significant expansion into energy storage solutions.",
            "Sentiment": "positive",
            "PublishDate": 1765900283178,
            "Source": "stocks"
        },
        {
            "Title": "Vikram Solar Appoints Arun Mittal as CEO of Energy Storage Subsidiary VSL Powerhive",
            "Summary": "Vikram Solar appointed Arun Mittal as Chief Executive Officer of VSL Powerhive, its wholly owned subsidiary focused on energy storage systems and solutions. The appointment supports the company's expansion into integrated energy transition solutions as it scales manufacturing capacity from 9.5GW to 15.5GW modules and develops 12GW solar cell capacity for commissioning in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1764737262158,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vikram Solar Commissions 5GW Manufacturing Facility in Tamil Nadu",
            "Summary": "Vikram Solar commissioned its new 5GW Vallam manufacturing facility in Tamil Nadu, bringing the company's total manufacturing capacity to 9.5GW with advanced automation technology including intelligent robotics and automated packaging systems. The facility spans 27,000 sq.m and is designed to support multiple module formats while targeting 40-50% gender diversity in its workforce, strengthening Tamil Nadu's renewable energy manufacturing ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1764134308701,
            "Source": "stock"
        },
        {
            "Title": "Vikram Solar Allots 6.13 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Vikram Solar Limited allotted 6,13,150 equity shares of Rs. 10 each to eligible employees under its Employee Stock Option Plan 2021 at exercise prices of Rs. 91.50 and Rs. 81.50 per share. The allotment increased the company's paid-up equity share capital from Rs. 361.72 crore to Rs. 362.33 crore, with total issued shares rising to 36.23 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763175002185,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikram Solar Launches 'Hypersol Pro' Solar Panel with 23.69% Efficiency at Renewable Energy India Expo 2025",
            "Summary": "Vikram Solar launched its new 'Hypersol Pro' solar panel at the Renewable Energy India Expo 2025. The product features up to 23.69% efficiency and offers no reverse power loss for different installations.",
            "Sentiment": "positive",
            "PublishDate": 1761804329894,
            "Source": "stock"
        },
        {
            "Title": "Vikram Solar Secures 148.9 MW Solar Module Order from Sunsure Energy",
            "Summary": "Vikram Solar announced a major order win of 148.9 MW high-efficiency solar modules from Sunsure Energy Private Limited. The modules, rated at 595 Wp, will be deployed across Maharashtra and Uttar Pradesh. Under the contract, Vikram Solar will supply its advanced M10R N-Type TOPCon modules, with delivery expected within 60 days from Notice to Proceed by January 2026. This order adds to Vikram Solar's significant wins this year, including 200 MW from AB Energia, 336 MW from L&T Construction, and 326 MW from Gujarat Industries Power Company Limited. The project supports India's target of achieving 500 GW of non-fossil fuel capacity by 2030. Vikram Solar is one of India's leading solar PV module manufacturers with cumulative production capacity of 4.5 GW and international presence across 39 countries. Sunsure Energy, founded in 2014, is backed by Partners Group AG with $400 million equity commitment and has 600 MW of operational assets with 7.10 GW under development.",
            "Sentiment": "positive",
            "PublishDate": 1761191842167,
            "Source": "order&deals"
        },
        {
            "Title": "Vikram Solar Sets Production Targets of 17.5 GW Modules and 12 GW Cells by FY27",
            "Summary": "Vikram Solar has announced production targets of 17.5 GW in module manufacturing and 12 GW in cell production by FY27. The announcement was made as part of an investor update.",
            "Sentiment": "positive",
            "PublishDate": 1760672619205,
            "Source": "stock"
        },
        {
            "Title": "Vikram Solar Reports Strong Quarterly Results and Appoints Two New Directors",
            "Summary": "Vikram Solar Limited approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue of ₹11,090.06 million for the quarter and ₹22,450.66 million for the half year, with profit after tax of ₹1,282.35 million and ₹2,626.50 million respectively. The board appointed Mr. Suresh Gopinathan Menon as Additional Non-executive Non-Independent Director and Mr. Joginder Pal Dua as Additional Independent Director, effective December 1, 2025, subject to shareholder approval. The company also reconstituted its Nomination & Remuneration and Stakeholders Relationship committees. Vikram Solar completed its IPO during the quarter, raising ₹15,000 million through fresh equity shares, with listing on NSE and BSE on August 26, 2025. The company faces ongoing legal matters including ₹1,485.20 million in safeguard duty payments and ₹843.88 million in disputed trade receivables.",
            "Sentiment": "positive",
            "PublishDate": 1760626461912,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Imposes Anti-Dumping Duties on Solar Cell Imports from China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on solar cell imports from China. This trade measure affects Vikram Solar and the broader solar industry by providing protection against below-cost imports from Chinese manufacturers.",
            "Sentiment": "neutral",
            "PublishDate": 1759202091581,
            "Source": "stock"
        },
        {
            "Title": "Vikram Solar Promoters Pledge 30.43% of Shareholding as Collateral for Working Capital Loans",
            "Summary": "Vikram Solar Limited's promoters have pledged shares representing 30.43% of their total shareholding as collateral for the company's working capital requirements. Three separate encumbrances were created: Gyanesh Chaudhary Family Trust pledged 7,30,86,090 shares (20.21% of total share capital), Vikram Capital Management Private Limited pledged 2,18,74,803 shares (6.05%), and VSL Ventures Private Limited pledged 15,099,750 shares (4.17%). The pledges were made in favor of IndBank Merchant Banking Services Limited on behalf of Indian Bank, which leads a working capital consortium of 14 banks including Punjab National Bank, State Bank of India, HDFC Bank, ICICI Bank, and Axis Bank. The total amount involved against the encumbered shares is INR 2,600 crores for working capital financing. The promoters collectively hold 22,83,18,938 shares representing 63.12% of Vikram Solar's total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1758115274578,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikram Solar Reports 5x Jump in Q1 PAT to ₹133 Crores, Plans ₹6,000 Crore Capacity Expansion",
            "Summary": "Vikram Solar delivered strong quarterly results with revenue rising 79.7% year-on-year to ₹1,134 crores and PAT increasing approximately 5x from ₹22.8 crores to ₹133 crores. Operating EBITDA more than doubled to ₹242 crores. The company produced over 750 megawatt of modules during the quarter at 67% capacity utilization. Order book stands at 10.96 gigawatt with recent contract wins including 250 megawatt from Bondada Group, 336 megawatt from L&T, and 326 megawatt from GIPCL. The company plans massive expansion from current 4.5 gigawatt module capacity to 17.5 gigawatt by FY27, along with 12 gigawatt solar cell manufacturing capacity requiring total capex of over ₹6,000 crores. A new 5 gigawatt facility in Tamil Nadu is expected to be commissioned in Q3 FY26. The company also announced plans for 1 gigawatt hour battery energy storage system manufacturing, expandable to 5 gigawatt hour by FY27. Current order book has 14% export mix with no DCR orders, though the company is open to DCR opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1758114847587,
            "Source": "earnings"
        },
        {
            "Title": "Vikram Solar Seeks Shareholder Approval for Employee Stock Option Plan Ratification",
            "Summary": "Vikram Solar Limited has issued a postal ballot notice seeking shareholder approval through e-voting for three resolutions. The company is requesting ratification of its 'VIKRAM SOLAR EMPLOYEE STOCK OPTION PLAN – 2021' (ESOP 2021) and extension of benefits under the plan to employees of holding companies, subsidiary companies and group companies. The ESOP 2021 allows for up to 1,30,00,000 equity shares with vesting periods not before one year and maximum vesting period of 5 years. The company is also seeking approval to determine fees for document delivery to members through particular modes of service. The e-voting period runs from September 16, 2025 to October 15, 2025, with September 10, 2025 as the cut-off date. The ratification is required under SEBI regulations as the company's shares were listed on NSE and BSE on August 26, 2025, and fresh grants under pre-IPO schemes require shareholder ratification post-listing.",
            "Sentiment": "neutral",
            "PublishDate": 1757948490808,
            "Source": "corporate_action"
        },
        {
            "Title": "Vikram Solar Secures 200 MW Solar Module Supply Order Worth Rs. 273 Crores",
            "Summary": "Vikram Solar Limited has secured a 200 MW solar module supply order from AB Energia Solutions Private Limited, valued at approximately Rs. 273 crores. The order involves supplying high-efficiency M10R N-Type TOPCon modules rated at 590 Wp and above, with deliveries scheduled between September 2025 and March 2026. The modules will be deployed across Maharashtra, Madhya Pradesh, and Gujarat for commercial and industrial solar projects. This represents a continuation of the partnership between Vikram Solar and AB Energia, with both companies emphasizing their commitment to India's renewable energy transition. The contract is a one-time domestic order with no related party transactions involved.",
            "Sentiment": "positive",
            "PublishDate": 1757905624410,
            "Source": "order&deals"
        },
        {
            "Title": "Vikram Solar Targets 16-18% EBITDA Margins for FY26 Amid Strong Order Book Growth",
            "Summary": "Vikram Solar expects to maintain EBITDA margins between 16-18% for FY26 and subsequent years, according to Chairman and Managing Director Gyanesh Chaudhary. The company reported high margins in Q1 due to carry-forward demand from the previous year, with expectations of margins stabilizing in the 16-18% range for the rest of the year due to pricing and supply chain dynamics. The company's order book stands at over 10 gigawatts, expected to be fulfilled over six to eight quarters, with a market pipeline of 30-35 gigawatts. Vikram Solar plans significant expansion in module manufacturing capacity and aims to integrate up to 12 gigawatts of solar cell manufacturing. The company will fund expansion through IPO proceeds, debt, and internal accruals. Shares closed at Rs 371.1, down 2.03% on Thursday.",
            "Sentiment": "positive",
            "PublishDate": 1757757048722,
            "Source": "stock"
        },
        {
            "Title": "Vikram Solar Shares Jump 13% as Net Profit Surges 484% in Q1",
            "Summary": "Vikram Solar shares rallied 13% to Rs 408 after reporting strong quarterly results. The renewable energy company's net profit jumped 484% to Rs 133 crore compared to Rs 23 crore in the same quarter last year. Revenue from operations grew 80% to Rs 1,134 crore, while EBITDA margin increased 370 basis points to 21.4%. The company cited benefits from rising energy demand driven by AI, solar and storage growth, and policy support. Vikram Solar, one of India's largest solar PV module manufacturers, expanded capacity from 4.5 GW to 17.5 GW over two years and maintains an order book of 10.96 GW. The company also announced a 336 MW solar module order win from Larsen & Toubro for deployment in Khavda, Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1757481814125,
            "Source": "earnings"
        },
        {
            "Title": "Vikram Solar Plans 4x Capacity Expansion and Backward Integration with 10.96 GW Order Pipeline",
            "Summary": "Vikram Solar has outlined growth plans for FY26 that include a four-fold capacity expansion and solar cell backward integration. The company has a robust order pipeline of 10.96 GW to support its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1757435712524,
            "Source": "stock"
        },
        {
            "Title": "Vikram Solar Reports Strong Q1 Results, Appoints Ernst & Young as Internal Auditor",
            "Summary": "Vikram Solar Limited approved its unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of ₹11,351.60 million and profit of ₹1,344.15 million. The board appointed Ernst & Young LLP as internal auditor for FY 2025-26 and approved a postal ballot notice for ratification of the Employee Stock Option Plan 2021 and document delivery fees. The company completed its IPO of 62.63 million equity shares at ₹332 per share, raising ₹20,793.69 million, with shares listed on NSE and BSE on August 26, 2025. The results include pending legal matters regarding ₹1,485.20 million in safeguard duty payments and ₹843.88 million in disputed trade receivables under arbitration.",
            "Sentiment": "positive",
            "PublishDate": 1757434593432,
            "Source": "earnings"
        },
        {
            "Title": "Vikram Solar Wins 336 MW Solar Module Order from L&T Construction for Khavda Project",
            "Summary": "Vikram Solar announced securing a 336 MW high-efficiency solar module supply order from L&T Construction for deployment in Khavda, Gujarat. The company will supply its advanced Hypersol G12R modules based on N-type technology, featuring up to 80% bifaciality, better high-temperature performance, and minimal year-on-year degradation of ≤0.4%. The modules are designed to enhance Balance-of-System efficiency and reduce Levelized Cost of Energy. Delivery is scheduled from November 2025 to March 2026. This follows Vikram Solar's previous 326 MW module supply order from Gujarat Industries Power Company Limited for the same Khavda Renewable Energy Park secured in May 2025. Vikram Solar is one of India's leading solar PV module manufacturers with 4.5 GW cumulative production capacity and presence across 39 countries.",
            "Sentiment": "positive",
            "PublishDate": 1757298671523,
            "Source": "order&deals"
        },
        {
            "Title": "VSL Ventures Pledges 15.1 Million Vikram Solar Shares as Loan Collateral",
            "Summary": "VSL Ventures Private Limited pledged 15,099,750 equity shares of Vikram Solar Limited, representing 4.17% of the total share capital, in favor of VISTRA ITCL (INDIA) LIMITED on August 29, 2025. The pledge was created as collateral for a loan and was disclosed under SEBI regulations on September 5, 2025. VSL Ventures is identified as a promoter group entity of Vikram Solar Limited, which is listed on both BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1757069811624,
            "Source": "corporate_action"
        }
    ]
}