{
    "Symbol": "VIMTALABS",
    "ISIN": "INE579C01029",
    "News": [
        {
            "Title": "VIMTA Labs Q3 Net Profit Rises to ₹176M",
            "Summary": "VIMTA Labs reported a net profit of ₹176 million for Q3, marking a marginal increase from ₹175 million in the corresponding quarter of the previous year, representing steady performance.",
            "Sentiment": "positive",
            "PublishDate": 1769591521822,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vimta Labs Q3FY26 Earnings Call Set for January 28",
            "Summary": "Vimta Labs Limited announces investor conference call scheduled for January 28, 2026 at 4:30 PM IST to discuss Q3FY26 financial results, with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768994243279,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vimta Labs: APIDC Shares Transferred to TSIDC Following Andhra Pradesh Bifurcation",
            "Summary": "Vimta Labs announced that shares held by Andhra Pradesh Industrial Development Corporation Limited (APIDC) have been transferred to Telangana State Industrial Development Corporation Limited (TSIDC) effective November 18, 2025, pursuant to the bifurcation of Andhra Pradesh state. TSIDC will be categorized as Promoter-Body Corporate while APIDC will be re-classified under the Public shareholder category, with the matter remaining subject to judicial proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1763730441008,
            "Source": "corporate_action"
        },
        {
            "Title": "Vimta Labs Allots 94,369 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Vimta Labs Limited allotted 94,369 equity shares of face value ₹2 each to eligible employees under its Employee Stock Option Plan 2021 on 17 November 2025. The company's paid-up share capital increased from ₹8,90,81,640 to ₹8,92,70,378, with the allotted shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763382373857,
            "Source": "corporate_action"
        },
        {
            "Title": "Vimta Labs Reports Record Quarterly Revenue of INR 104.5 Crores in Q2 FY26",
            "Summary": "Vimta Labs Limited achieved its highest-ever quarterly sales revenue of INR 104.5 crores in Q2 FY26, marking a 22.3% year-on-year growth. The company's EBITDA increased 20.6% to INR 369 million with margins at 35.3%, while profit after tax grew 17.1% to INR 199 million. For the half-year period, total income reached INR 2,038 million, up 26.6% year-on-year. Pharmaceutical research and testing services contributed approximately 65% of total revenue, followed by food testing at around 20%. The company maintains a debt-free balance sheet with cash and equivalents of INR 545 million. Vimta's clinical research division successfully completed a WHO audit, and the company is expanding its biologics contract research capabilities with commercial operations expected by Q1 FY27. The company has incurred INR 47 crores in capex during the first half and expects to spend around INR 25 crores on biologics expansion this year.",
            "Sentiment": "positive",
            "PublishDate": 1762793336557,
            "Source": "earnings"
        },
        {
            "Title": "VIMTA Labs Reports 18% Revenue Growth in Q2 Results",
            "Summary": "VIMTA Labs reported Q2 revenue of 1 billion rupees, up from 847 million rupees in the same period last year. Net profit increased to 199 million rupees from 170 million rupees year-over-year. EBITDA rose to 342 million rupees compared to 299 million rupees previously, though EBITDA margin declined to 33.61% from 35.28% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762159621673,
            "Source": "earnings"
        },
        {
            "Title": "Vimta Labs Reports Record Q1 Revenue of INR 993 Million, Up 31.4% Year-on-Year",
            "Summary": "Vimta Labs Limited achieved its highest ever quarterly revenue of INR 993 million in Q1 FY2026, representing a 31.4% year-on-year growth from INR 756 million in the previous year. EBITDA increased 33.1% to INR 354 million with margins at 35.7%, while profit after tax grew 35.9% to INR 189 million with 19% margins. The company successfully completed an unannounced US FDA GCP inspection with no Form 483 observations and received cGMP compliance letter from ANSM EMA. Pharmaceutical testing and research services contribute 65-70% of revenue, food testing accounts for 20%, and electronics/electrical testing represents 10%. The Board approved a 1:1 bonus issue. Equipment procurement is progressing for biologics contract research services, expected to commercialize from Q1 FY2027. The company maintains a debt-free balance sheet with cash equivalents of INR 379.3 million and has completed facility expansion of 200,000 square feet to support future growth.",
            "Sentiment": "positive",
            "PublishDate": 1753459687190,
            "Source": "earnings"
        },
        {
            "Title": "Vimta Labs Makes Q1 FY 2025-26 Earnings Call Recording Available Online",
            "Summary": "Vimta Labs Limited has published the audio recording of its Q1 FY 2025-26 earnings and investor call on the company's website. The call was held on July 21, 2025, and the recording is accessible through a provided web link. The company disclosed this information to stock exchanges BSE and NSE as part of regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753156622428,
            "Source": "earnings"
        },
        {
            "Title": "Vimta Labs Reports Q1 EBITDA Growth",
            "Summary": "Vimta Labs has reported its Q1 EBITDA at 337 million rupees, compared to 259 million rupees in the same quarter last year, showing a year-over-year increase. The company's Q1 EBITDA margin was 34.53%, slightly lower than the 34.63% reported in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752743809000,
            "Source": "result"
        },
        {
            "Title": "Vimta Labs Reports Increased Q1 Profit and Revenue",
            "Summary": "Vimta Labs has reported its quarterly results. The company's net profit for Q1 increased to 189 million rupees, up from 140 million rupees in the same quarter last year. Revenue for Q1 also saw growth, rising to 976 million rupees from 747 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752743755000,
            "Source": "result"
        },
        {
            "Title": "Vimta Labs Reports Strong Q4 Results, Announces Dividend and Bonus Issue",
            "Summary": "Vimta Labs reported a Q4 net profit of 183.2 million rupees, up from 124 million rupees year-over-year. Revenue increased to 944.4 million rupees from 727 million rupees in the same period last year. The company recommended a dividend of 2 rupees per share and a 1:1 bonus share issue. Additionally, Vimta Labs approved plans to expand into biologics contract research.",
            "Sentiment": "positive",
            "PublishDate": 1745885452000,
            "Source": "default"
        },
        {
            "Title": "Vimta Labs Targets Revenue of Over Rs. 500 Crore by FY 2025-26",
            "Summary": "Vimta Labs, in its investor presentation, has announced an ambitious revenue target of exceeding Rs. 500 crore by the financial year 2025-26. This goal indicates the company's growth aspirations and strategic plans for the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1745846614000,
            "Source": "default"
        },
        {
            "Title": "Vimta Labs Announces 1:1 Bonus Share Issue",
            "Summary": "The board of directors of Vimta Labs has recommended a bonus share issue in the ratio of 1:1, meaning shareholders will receive one new share for each share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1745845039000,
            "Source": "default"
        },
        {
            "Title": "Vimta Labs Reports Strong Q4 Results and Approves Expansion",
            "Summary": "Vimta Labs announced positive Q4 results with revenue of 944.4M rupees, up from 727M YoY. Net profit increased to 183.2M rupees from 124M YoY. The company approved entry into biologics contract research and recommended a dividend of 2 rupees per share. EBITDA rose to 330.4M rupees, though EBITDA margin slightly decreased to 34.98%.",
            "Sentiment": "positive",
            "PublishDate": 1745841296000,
            "Source": "default"
        },
        {
            "Title": "Vimta Labs to Consider Q4 Results and Bonus Share Issue",
            "Summary": "Vimta Labs has announced that it will consider its Q4 results and a proposal for issuing bonus shares on April 28. This decision indicates potential positive financial performance and a move to reward shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1745409732000,
            "Source": "default"
        },
        {
            "Title": "Vimta Labs Reports Q3 Revenue Increase",
            "Summary": "Vimta Labs has announced its third quarter revenue, which stands at 899 million rupees. This represents a significant increase from the previous year's Q3 revenue of 746 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737710190000,
            "Source": "earnings"
        },
        {
            "Title": "Vimta Labs Reports Strong Q3 EBITDA Growth",
            "Summary": "Vimta Labs has announced its Q3 financial results, showing significant improvement in EBITDA performance. The company's EBITDA increased to 331 million rupees, up from 218 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 36.82% from 31.90% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737710034000,
            "Source": "earnings"
        },
        {
            "Title": "Vimta Labs Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Vimta Labs has announced its financial results for the third quarter, reporting a consolidated net profit of 215 million rupees. This represents a substantial increase from the 101 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737709939000,
            "Source": "earnings"
        },
        {
            "Title": "Vimta Labs to Consider Q3 Results on January 24",
            "Summary": "Vimta Labs has announced that it will consider its third quarter financial results on January 24. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737384870000,
            "Source": "earnings"
        },
        {
            "Title": "Vimta Labs Reports Q2 Revenue Growth",
            "Summary": "Vimta Labs has reported a revenue of 847 million rupees for the second quarter, compared to 655 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731052032000,
            "Source": "result"
        },
        {
            "Title": "Vimta Labs Reports Significant Profit Growth in Q2",
            "Summary": "Vimta Labs, a company in the laboratory services sector, has reported a substantial increase in consolidated net profit for the second quarter. The profit rose to 152 million rupees, up from 63 million rupees in the same period last year, marking a 141% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731051969000,
            "Source": "result"
        }
    ]
}