{
    "Symbol": "VINATIORGA",
    "ISIN": "INE410B01037",
    "News": [
        {
            "Title": "Vinati Organics Q3FY26 Results Show Strong Growth",
            "Summary": "Vinati Organics reported robust Q3FY26 performance with standalone revenue of ₹529.14 crore and net profit of ₹108.47 crore, marking significant year-over-year improvements in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1769848285151,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vinati Organics Shows Steady Growth in Q2 FY26",
            "Summary": "Vinati Organics reported flat revenue at ₹550.20 crore in Q2 FY26 but achieved 10.10% YoY profit growth to ₹114.90 crore, driven by improved cost efficiency and operating leverage.",
            "Sentiment": "positive",
            "PublishDate": 1767949223322,
            "Source": "stocks"
        },
        {
            "Title": "Suchir Chemicals Pledges 175,000 Vinati Organics Shares to ICICI Bank",
            "Summary": "Suchir Chemicals Private Limited has pledged 175,000 equity shares (0.17% stake) of Vinati Organics Limited to ICICI Bank Limited as security for loans/advances availed by Alphagrep Securities Private Limited. The pledge was created on November 25, 2025, and disclosed under SEBI takeover regulations, with total promoter holding remaining at 74.28%.",
            "Sentiment": "neutral",
            "PublishDate": 1764305122554,
            "Source": "corporate_action"
        },
        {
            "Title": "Vinati Organics Invests ₹38.45 Crore in Wholly-Owned Subsidiary Veeral Organics",
            "Summary": "Vinati Organics Limited has invested ₹38.45 crore in its wholly-owned subsidiary Veeral Organics Private Limited through subscription of 3.84 crore additional equity shares at face value of ₹10 each. The investment was made through a rights issue and maintains Vinati Organics' 100% ownership in Veeral Organics. Veeral Organics, incorporated in October 2020, is engaged in manufacturing organic fine specialty chemicals, which aligns with Vinati Organics' core business. Veeral Organics reported a turnover of ₹10.55 crore in FY2024-25. The transaction is classified as a related party transaction conducted at arm's length but is exempt under SEBI regulations as it involves a wholly-owned subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1762759462417,
            "Source": "corporate_action"
        },
        {
            "Title": "Vinati Organics Reports Strong Q2 Performance with 10.6% Net Profit Growth",
            "Summary": "Vinati Organics delivered solid quarterly results with consolidated net profit rising to 1.15 billion rupees from 1.04 billion rupees year-over-year. Revenue increased to 5.5 billion rupees compared to 5.42 billion rupees in the same period last year. EBITDA grew significantly to 1.67 billion rupees from 1.34 billion rupees, while EBITDA margin expanded to 30.42% from 24.17% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762342426132,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Appoints New CFO as N.K. Goyal Retires",
            "Summary": "Vinati Organics announced a change in its Chief Financial Officer position. N.K. Goyal superannuated on November 5, 2025, ceasing to be the CFO at the close of business hours. The Board of Directors approved the appointment of Gulshan Kumar Sakhuja as the new Chief Financial Officer, effective November 6, 2025. Sakhuja will also serve as Key Managerial Personnel and be part of the Senior Management team. The company updated its Key Managerial Personnel details, which now includes Milind A Wagh as Company Secretary and Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1762337574347,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vinati Organics Completes First Phase of ATBS Capacity Expansion",
            "Summary": "Vinati Organics has completed the first phase of its ATBS capacity expansion project. The expansion increases the company's ATBS production capacity by 10,000 metric tonnes per annum.",
            "Sentiment": "positive",
            "PublishDate": 1762328457590,
            "Source": "stock"
        },
        {
            "Title": "Vinati Organics Reports Strong Q1 Performance with EBITDA Growth",
            "Summary": "Vinati Organics reported Q1 EBITDA of 1.6 billion rupees compared to 1.24 billion rupees in the same period last year. The company's EBITDA margin improved to 29.46% from 23.76% year-over-year, indicating enhanced profitability and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1755161330845,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Reports 24% Jump in Quarterly Net Profit to Rs 1.04 Billion",
            "Summary": "Vinati Organics reported consolidated net profit of Rs 1.04 billion for the quarter, compared to Rs 841.5 million in the same period last year, representing a year-on-year increase of approximately 24%.",
            "Sentiment": "positive",
            "PublishDate": 1755160629845,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Invests ₹33.84 Crore in Veeral Organics",
            "Summary": "Vinati Organics has invested ₹33.84 crore in Veeral Organics through a rights issue. The investment was made to support Veeral Organics' operations, though specific details about the rights issue or its purpose were not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752734622000,
            "Source": "default"
        },
        {
            "Title": "DGTR Initiates Anti-Dumping Investigation on Para-Tertiary Butyl Phenol Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has launched an investigation into potential anti-dumping practices regarding Para-Tertiary Butyl Phenol imports from China and Taiwan. This investigation directly affects Vinati Organics, a company involved in the production or trade of this chemical compound.",
            "Sentiment": "neutral",
            "PublishDate": 1751253982000,
            "Source": "default"
        },
        {
            "Title": "Vinati Organics Reports Growth in ATBS and Antioxidant Segments",
            "Summary": "Vinati Organics has announced significant growth in its business segments. The company reported a notable expansion in its ATBS (Acrylamido Tertiary Butyl Sulfonic Acid) segment and a 70% growth in its antioxidant business. The company also expressed optimism about its future, citing upcoming product launches and capacity expansion strategies as promising developments.",
            "Sentiment": "positive",
            "PublishDate": 1747718546000,
            "Source": "default"
        },
        {
            "Title": "Vinati Organics: Forecasts 15-20% Annual Revenue Growth Over Three Years",
            "Summary": "Vinati Organics expects 15-20% annual revenue growth over the next three years, driven by ATBS segment expansion and new product launches. The company anticipates EBITDA margins to remain at 26-27%. Two new ATBS production lines will increase capacity by 60%, with the first line operational in Q1. New products in development have a combined revenue potential of ₹500 crore at full capacity.",
            "Sentiment": "positive",
            "PublishDate": 1747641038000,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Announces Q4 Results and Dividend",
            "Summary": "Vinati Organics has declared a dividend of 7.5 rupees per share. The company's Q4 EBITDA increased to 1.8 billion rupees from 1.5 billion rupees year-over-year, with EBITDA margin improving to 27.82% from 27.24%. Q4 revenue also grew to 6.5 billion rupees from 5.5 billion rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747298631000,
            "Source": "result"
        },
        {
            "Title": "Vinati Organics Reports 18% Increase in Q4 Net Profit",
            "Summary": "Vinati Organics, a chemical manufacturing company, has reported a consolidated net profit of 1.23 billion rupees for the fourth quarter, up from 1.04 billion rupees in the same period last year. This represents an 18% year-over-year increase in net profit.",
            "Sentiment": "positive",
            "PublishDate": 1747298501000,
            "Source": "result"
        },
        {
            "Title": "Vinati Organics Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Vinati Organics Ltd. on the National Stock Exchange (NSE). Approximately 443,443 shares were traded at a price of Rs. 1591.70 per share, totaling Rs. 70.58 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1742800240000,
            "Source": "block_deals"
        },
        {
            "Title": "Vinati Organics Limited: Establishes US Subsidiary for Chemical Business Expansion",
            "Summary": "Vinati Organics Limited has incorporated a wholly owned subsidiary, Vinati Organics USA INC, in Delaware, USA on February 13, 2025. The subsidiary will focus on processing, distribution, and sale of chemical solutions in the US market. Initial subscription is 10 shares at $100 each, maintaining 100% ownership.",
            "Sentiment": "positive",
            "PublishDate": 1739866174000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vinati Organics Reports Strong Q3 Financial Results",
            "Summary": "Vinati Organics has announced its Q3 consolidated financial results. The company's net profit increased to 937 million rupees from 769 million rupees year-over-year. EBITDA rose to 1.42 billion rupees from 1.14 billion rupees, with the EBITDA margin improving to 27.22% from 25.59% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738542326000,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Reports Improved Q3 EBITDA and Margin",
            "Summary": "Vinati Organics has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.42 billion rupees from 1.14 billion rupees in the previous year. Additionally, the EBITDA margin expanded to 27.22% from 25.59% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738402618000,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Reports Q3 Revenue Growth",
            "Summary": "Vinati Organics, a chemical manufacturing company, has reported a revenue of 5.22 billion rupees for the third quarter, compared to 4.48 billion rupees in the same period last year. This represents a year-over-year increase in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1738402607000,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Reports 22% Increase in Q3 Consolidated Net Profit",
            "Summary": "Vinati Organics Limited has announced its financial results for the third quarter, reporting a consolidated net profit of 937 million rupees. This represents a significant increase from the 769 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 22%.",
            "Sentiment": "positive",
            "PublishDate": 1738402572000,
            "Source": "earnings"
        },
        {
            "Title": "Vinati Organics Invests in Subsidiary for Specialty Chemicals Expansion",
            "Summary": "Vinati Organics has invested Rs 39.65 crore in its unit, Veeral Organics, by subscribing to 3.965 crore equity shares through a rights issue. This investment is aimed at expanding the company's business in the specialty chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1733788688000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vinati Organics Invests in Subsidiary for Specialty Chemicals Expansion",
            "Summary": "Vinati Organics has invested Rs 39.65 crore in its subsidiary, Veeral Organics, by subscribing to 3.965 crore equity shares through a rights issue. The investment is aimed at business expansion in the specialty chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1733741301000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vinati Organics Reports Q2 EBITDA Growth",
            "Summary": "Vinati Organics announced its Q2 financial results. The company's EBITDA increased to 1.34 billion rupees from 1.11 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 24.24% from 24.73% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731399959000,
            "Source": "result"
        },
        {
            "Title": "Vinati Organics Reports 23.5% Increase in Q2 Net Profit",
            "Summary": "Vinati Organics, a chemical manufacturing company, has reported a consolidated net profit of 1.04 billion rupees for the second quarter, up from 842 million rupees in the same period last year. This represents a year-over-year increase of approximately 23.5%.",
            "Sentiment": "positive",
            "PublishDate": 1731399908000,
            "Source": "result"
        },
        {
            "Title": "Vinati Organics: Operational Synergies to Strengthen Market Position",
            "Summary": "Motilal Oswal reports that Vinati Organics is expected to solidify its leadership position through operational synergies. The full report is available to NDTV Profit subscribers.",
            "Sentiment": "positive",
            "PublishDate": 1729138982000,
            "Source": "normal_news"
        },
        {
            "Title": "Vinati Organics: Invests ₹42.64 Crore in Subsidiary's Rights Issue",
            "Summary": "<p>Vinati Organics has <span class='neutral'>subscribed</span> to <b>4,26,48,200</b> equity shares at ₹10 each in the <span class='neutral'>rights issue</span> of its <span class='positive'>wholly owned subsidiary</span>, Veeral Organics, for a total <span class='neutral'>investment</span> of <b>₹42.64 crore</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728903360000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vinati Organics: CARE Ratings Reaffirms 'AA+' Rating with Stable Outlook",
            "Summary": "<p><span class='positive'>CARE Ratings</span> has <span class='positive'>reaffirmed</span> Vinati Organics' long-term rating at '<b>CARE AA+</b>' with a '<span class='neutral'>stable</span>' outlook and short-term rating at '<b>CARE A1+</b>'. The ratings are based on the company's <span class='positive'>market leadership</span> in ATBS and IBB, <span class='positive'>competitive advantages</span>, <span class='positive'>strong financials</span>, and <span class='positive'>established clientele</span>. However, <span class='negative'>concentration in key products</span> and <span class='negative'>susceptibility to raw material prices and forex fluctuations</span> are noted concerns.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728545160000,
            "Source": "normal_news"
        },
        {
            "Title": "Vinati Organics: Innovation-Driven Strategy Highlighted",
            "Summary": "<p><span class='positive'>HDFC Securities</span> report emphasizes <span class='neutral'>Vinati Organics'</span> commitment to <span class='positive'>innovation</span>. The article is behind a <span class='negative'>paywall</span>, limiting access to specific details about the company's current initiatives or financial performance.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728373816000,
            "Source": "normal_news"
        }
    ]
}