{
    "Symbol": "VINCOFE",
    "ISIN": "INE498Q01014",
    "News": [
        {
            "Title": "Vintage Coffee Schedules Q3FY26 Results Call",
            "Summary": "Vintage Coffee and Beverages Limited announces conference call on February 5, 2026 at 1:15 p.m. to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769774500976,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vintage Coffee Plans Major Capacity Expansion",
            "Summary": "Vintage Coffee & Beverages announces ambitious expansion plan to increase production capacity by 4,500 MTPA by end of FY26, taking total capacity from current 6,500 MTPA to 11,000 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1769752637478,
            "Source": "stocks"
        },
        {
            "Title": "Vintage Coffee Q3 Net Profit Jumps 52.8% YoY",
            "Summary": "Vintage Coffee & Beverages reported consolidated net profit of 191 million rupees in Q3, marking a significant 52.8% increase from 125 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769591942843,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vintage Coffee Board Meet Set for Jan 28, 2026",
            "Summary": "Vintage Coffee and Beverages Limited has scheduled a board meeting on January 28, 2026, to review Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768911936192,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vintage Coffee Appoints New Company Secretary",
            "Summary": "Vintage Coffee and Beverages Limited has appointed Ms. Prachi Karwa as Company Secretary and Compliance Officer effective January 3, 2026, following board approval at their meeting.",
            "Sentiment": "positive",
            "PublishDate": 1767434464280,
            "Source": "stocks"
        },
        {
            "Title": "Vintage Coffee Releases ₹50 Cr Share Pledge",
            "Summary": "Vintage Coffee and Beverages Limited announced the unpledging of 50 lakh equity shares worth ₹50 crores by promoter Balakrishna Tati, reducing his encumbered shareholding from 6.86% to 3.40%.",
            "Sentiment": "positive",
            "PublishDate": 1767330606436,
            "Source": "stocks"
        },
        {
            "Title": "Vintage Coffee Signs Deal for New Freeze-Dried Plant",
            "Summary": "Vintage Coffee & Beverages has entered into an agreement with the Telangana government to establish a premium freeze-dried coffee manufacturing facility on 20 acres of land.",
            "Sentiment": "positive",
            "PublishDate": 1765375354861,
            "Source": "stocks"
        },
        {
            "Title": "Vintage Coffee Signs Agreement with Telangana Government for Premium Freeze-Dried Coffee Plant",
            "Summary": "Vintage Coffee has entered into an agreement with the Telangana Government to establish a premium freeze-dried coffee manufacturing plant on 20 acres of land. The development represents a significant expansion move for the company in the coffee processing sector.",
            "Sentiment": "positive",
            "PublishDate": 1765331730621,
            "Source": "order&deals"
        },
        {
            "Title": "Vintage Coffee Launches 100% Pure Instant Coffee in India",
            "Summary": "Vintage Coffee and Beverages Limited launched VINCOFE INSTANT COFFEE-PURE in India at its Vintage Coffee Cafe in Navi Mumbai, expanding its product portfolio beyond roast ground coffee. The instant coffee made from Karnataka-sourced beans will be available on e-commerce platforms including Amazon and Blinkit, targeting the growing Indian coffee market.",
            "Sentiment": "positive",
            "PublishDate": 1764778440314,
            "Source": "stock"
        },
        {
            "Title": "Vintage Coffee and Beverages Reports No Deviation in Rs 201.56 Crore Preferential Issue Fund Utilization",
            "Summary": "Vintage Coffee and Beverages Limited submitted a monitoring agency report for the quarter ended September 30, 2025, showing proper utilization of Rs 201.56 crore raised through preferential issue of equity shares and warrants. The funds are being deployed as planned across subsidiary investments, working capital requirements, issue expenses, and general corporate purposes with Rs 43.30 crore remaining in bank accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1763175369819,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee & Beverages Allots 12.5 Lakh Equity Shares Upon Warrant Conversion",
            "Summary": "Vintage Coffee & Beverages Limited has allotted 12,50,000 equity shares of face value Rs. 10 each to promoters following the exercise of convertible warrants. The Board approved the allotment at its meeting held on November 4, 2025. The warrants were initially allotted in April 2024 at an issue price of Rs. 46 per warrant on a preferential basis. The conversion was done at a 1:1 ratio, with each warrant converting to one equity share at a premium of Rs. 36 per share. The total consideration for the conversion amounts to Rs. 5,75,00,000, with the company receiving Rs. 4,31,25,000 representing 75% of the total amount. The allottee is Tati Sai Teja, who converted all 12,50,000 warrants into fully paid-up equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762239084711,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee and Beverages Reports Strong Q2 FY26 Results with 90% Revenue Growth",
            "Summary": "Vintage Coffee and Beverages Limited reported consolidated revenue of ₹135.61 crores for Q2 FY26, representing 90% growth compared to ₹71.56 crores in Q2 FY25. Operating profit increased 120% to ₹21.38 crores from ₹9.73 crores, while profit after tax grew 137% to ₹17.83 crores from ₹7.51 crores. For the first half of FY26, revenue reached ₹237.22 crores (106% growth), operating profit was ₹38.61 crores (138% growth), and PAT stood at ₹32.07 crores (166% growth). The company plans to add 4,500 MTPA spray dried and agglomerated capacity by end of FY26, increasing total capacity to 11,000 MTPA from current 6,500 MTPA. A greenfield freeze-dried coffee project with 5,000 MTPA capacity is planned, funded through recent preferential equity issue. Purchase orders for freeze-dried coffee plant equipment from a European manufacturer have been issued, representing approximately 70% of the total greenfield project cost.",
            "Sentiment": "positive",
            "PublishDate": 1762198762381,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee and Beverages Limited Submits Investor Presentation for November 2025",
            "Summary": "Vintage Coffee and Beverages Limited submitted an investor presentation to BSE and NSE exchanges. The company, incorporated in 1980 and headquartered in Hyderabad, manufactures and exports instant coffee, instant chicory, and other beverages. The presentation highlights the company's operations across manufacturing facilities, including subsidiaries Vintage Coffee Pvt Ltd and Delecto Foods Pvt Ltd. Key developments include the commencement of commercial production at their packaging line starting October 31, 2024, ahead of the planned January 2025 timeline. The company achieved 85% capacity utilization during Q2FY26 and is setting up an additional production line with 4500 MTPA capacity expected to commence by end of FY25-26. Revenue reached 135.61 crore in Q2FY26, showing 154% year-over-year growth. The company operates with installed production capacity of 6500 MT/year for instant coffee and 1700 MT/year for instant chicory. The presentation was signed by Chairman and Managing Director Balakrishna Tati.",
            "Sentiment": "positive",
            "PublishDate": 1762161250277,
            "Source": "stock"
        },
        {
            "Title": "Vintage Coffee Reports 137% Jump in Quarterly Net Profit to 178 Million Rupees",
            "Summary": "Vintage Coffee announced consolidated net profit of 178 million rupees for the second quarter, representing a significant increase from 75 million rupees in the same period last year. The year-over-year growth reflects a 137% rise in quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1762142670070,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee Promoters' Stake Dilutes to 34.08% After Preferential Share Issue",
            "Summary": "Vishal Jethalia and other promoters of Vintage Coffee and Beverages Limited saw their collective shareholding decrease from 37.84% to 34.08% following a preferential allotment of shares. The promoter group includes nine entities: Tati Balakrishna, Mohit Rathi, Padma Tati, Tati Sruti, Tati Sai Teja, Venkateshwarlu Tati, Tati Thulasi Dalaxi, Valbe Foods (India) Limited, and Chin Corp Holding PTE Limited. The company's equity share capital increased from Rs. 1,30,08,34,090 to Rs. 1,44,43,84,090, divided into 14,44,38,409 equity shares of Rs. 10 each. Vishal Jethalia received 2,00,000 warrants/convertible securities through the preferential allotment dated September 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757941851878,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee and Beverages Allots 1.44 Crore Equity Shares and 19 Lakh Warrants on Preferential Basis",
            "Summary": "Vintage Coffee and Beverages Limited's Board approved the allotment of 1,43,55,000 equity shares to Non-Institutional Investors and Qualified Institutional Buyers at ₹124 per share. The company also allotted 19,00,000 Fully Convertible Warrants to Promoter/Promoter Group and Non-Institutional Buyers at ₹124 per warrant on a preferential basis. The equity shares have a face value of ₹10 each with a share premium of ₹114 per share. The warrants can be converted into equal number of equity shares within 18 months from allotment date, failing which they will be forfeited. Major allottees include Bandhan Small Cap Fund (43,55,000 shares), Astorne Capital VCC (25,88,000 shares), and several other institutional and individual investors. The total consideration received for equity shares was ₹178 crore. Among warrant allottees, Tati Sai Teja received 15,00,000 warrants, Vishal Jethalia received 2,00,000 warrants, and Mohit Rathi received 1,00,000 warrants.",
            "Sentiment": "positive",
            "PublishDate": 1757599451390,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee and Beverages Sets Record Date for Final Dividend Approval",
            "Summary": "Vintage Coffee and Beverages Limited has set September 22, 2025 as the record date for determining shareholder eligibility for the final dividend for financial year 2024-25. The Board of Directors has recommended the final dividend, which requires shareholder approval at the Annual General Meeting scheduled for September 29, 2025. If approved, the dividend will be paid within the statutory time limit following shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1757167608531,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee Promoter Balakrishna Tati Pledges 50 Lakh Shares to Neuzen Finance",
            "Summary": "Balakrishna Tati, a promoter of Vintage Coffee and Beverages Limited, has pledged 50,00,000 equity shares (3.84% of total share capital) to Neuzen Finance Private Limited on July 9, 2025. The pledge was created for a secured loan with Punjab National Bank, with the borrowed amount intended for the benefit of the listed company. Tati holds 1,97,69,586 shares (15.20% of total share capital) in Vintage Coffee. Following this pledge, his total encumbered shares increased to 99,10,548 shares (7.62% of total share capital). The encumbered shares represent 20% or more of the total share capital but less than 50% of promoter shareholding. The disclosure was made to BSE and NSE on July 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757138860261,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee and Beverages Limited Submits July 2025 Investor Presentation to Stock Exchanges",
            "Summary": "Vintage Coffee and Beverages Limited has submitted its investor presentation for July 2025 to BSE and NSE stock exchanges. The company, incorporated in 1980 and headquartered in Hyderabad, manufactures and exports instant coffee, instant chicory and other beverages with a focus on private labeling. The company operates with full capacity utilization of 6,500 tons per annum and plans to add an additional production line with 4,500 MTPA capacity by the end of FY26. The company has expanded into new markets including Russia, CIS countries, Africa, Europe and Central America. Recent developments include the commencement of commercial production at its automated packaging line in October 2024, ahead of the planned January 2025 timeline, and the opening of a Premium Café Lounge in Navi Mumbai. The company was listed on stock exchanges on October 18, 2024. Financial performance shows revenue growth with consolidated quarterly results displaying year-over-year increases of 142% in revenue, 183% in operating profit, and 190% in net profit.",
            "Sentiment": "positive",
            "PublishDate": 1753449768496,
            "Source": "stock"
        },
        {
            "Title": "Vintage Coffee and Beverages Issues Corrigendum for EGM, Reallocates Equity Shares Among Proposed Allottees",
            "Summary": "Vintage Coffee and Beverages Limited has issued a corrigendum to its 2nd Extra-Ordinary General Meeting notice scheduled for July 30, 2025. The company reallocated equity shares previously proposed for Mr. Sanjeev Agarwal (2,00,000 shares) and Mr. Pawan Agrawal (50,000 shares) among other proposed allottees following recommendations from BSE and NSE. The revised allocation increases shares for seven existing allottees, with Anmol Rashesh Bhansali receiving the largest allocation of 3,75,000 shares (up from 2,50,000). The company plans to raise up to Rs. 186 crore through preferential issue of 1.5 crore equity shares at Rs. 124 per share to 43 non-promoter allottees including mutual funds and individual investors. Additionally, the company proposes issuing 24 lakh convertible warrants at Rs. 124 each, raising Rs. 29.76 crore, with some warrants allocated to promoters and directors. Funds will be used for subsidiary investments, working capital, and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1753261331870,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee Plans Major Capacity Expansion to 11,000 Mtpa by March 2026",
            "Summary": "Vintage Coffee is expanding its production capacity by 4,500 Mtpa, targeting completion by March 2026. This expansion will increase the company's total capacity to 11,000 Mtpa from its current 6,500 Mtpa, representing a 69% increase in manufacturing capability.",
            "Sentiment": "positive",
            "PublishDate": 1753069322515,
            "Source": "stock"
        },
        {
            "Title": "Vintage Coffee & Beverages Reports Strong Q1 Growth with Net Profit Rising to 142 Million Rupees",
            "Summary": "Vintage Coffee & Beverages delivered robust quarterly performance with net profit surging to 142 million rupees from 45 million rupees year-over-year. Revenue more than doubled to 1 billion rupees compared to 437 million rupees in the same period last year. EBITDA increased significantly to 180 million rupees from 77 million rupees, while EBITDA margin improved marginally to 17.75% from 17.63%.",
            "Sentiment": "positive",
            "PublishDate": 1753057212113,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee & Beverages Reports Strong EBITDA Growth in Q1 Results",
            "Summary": "Vintage Coffee & Beverages reported Q1 EBITDA of 180 million rupees compared to 77 million rupees in the same period last year, representing significant year-over-year growth. The company's EBITDA margin improved slightly to 17.75% from 17.63% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752923249431,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee & Beverages Reports Strong Q1 Growth with Net Profit Surging to 142M Rupees",
            "Summary": "Vintage Coffee & Beverages delivered strong quarterly performance with consolidated net profit reaching 142 million rupees compared to 45 million rupees in the same period last year, representing significant year-over-year growth. The company's revenue also showed substantial expansion, climbing to 1 billion rupees from 437 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752922949048,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee's Unit Launches New Liquid Coffee Product",
            "Summary": "A subsidiary of Vintage Coffee has introduced a new product segment, liquid coffee. This expansion into a new product category represents a diversification of the company's offerings.",
            "Sentiment": "positive",
            "PublishDate": 1748838128000,
            "Source": "default"
        },
        {
            "Title": "Vintage Coffee Reports Significant Q4 EBITDA Growth",
            "Summary": "Vintage Coffee has announced its Q4 financial results, showing substantial year-over-year improvement. The company's EBITDA increased from 72.3 million rupees to 193.5 million rupees. Additionally, the EBITDA margin expanded from 16.72% to 18.41%.",
            "Sentiment": "positive",
            "PublishDate": 1746611763000,
            "Source": "result"
        },
        {
            "Title": "Vintage Coffee Reports Strong Q4 Financial Results",
            "Summary": "Vintage Coffee has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 1 billion rupees from 424 million rupees in the same quarter last year. Additionally, consolidated net profit rose to 156 million rupees from 43 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746611583000,
            "Source": "result"
        },
        {
            "Title": "Vintage Coffee Reports Significant EBITDA Growth in Q3",
            "Summary": "Vintage Coffee has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 67 million rupees to 161 million rupees. Additionally, the EBITDA margin improved from 17.73% to 18.23% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738219342000,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee Reports Significant Revenue Growth in Q3",
            "Summary": "Vintage Coffee has announced its Q3 revenue figures, showing a substantial increase from 376 million rupees to 882 million rupees year-over-year. This represents a significant growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738219317000,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Vintage Coffee has announced its Q3 consolidated net profit, which stands at 125 million rupees. This represents a substantial increase from the 36 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738219269000,
            "Source": "earnings"
        },
        {
            "Title": "Vintage Coffee Anticipates 40% Turnover Increase",
            "Summary": "Vintage Coffee has announced that it expects to increase its turnover by 40% above its current level. This significant growth projection suggests a positive outlook for the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1737956252000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee Expands Instant Coffee Production",
            "Summary": "Vintage Coffee has announced the commencement of commercial production of instant coffee at its subsidiary unit, increasing capacity by 2000 metric tons per annum (MTPA). This expansion signifies a notable growth in the company's production capabilities for instant coffee.",
            "Sentiment": "positive",
            "PublishDate": 1737956218000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee Plans 25% Increase in Consumer Pack Exports",
            "Summary": "Vintage Coffee has announced plans to increase its consumer pack exports by 25%. The company notes that these consumer packs have higher realization compared to bulk instant coffee exports, suggesting a strategic move to improve profitability.",
            "Sentiment": "positive",
            "PublishDate": 1730356470000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vintage Coffee Launches Automated Packing Line",
            "Summary": "Vintage Coffee has announced the commencement of commercial production using its new fully automated packing line. This development suggests an upgrade in the company's production capabilities and efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730356441000,
            "Source": "corporate_action"
        }
    ]
}