{
    "Symbol": "VINDHYATEL",
    "ISIN": "INE707A01012",
    "News": [
        {
            "Title": "Vindhya Telelinks Q3FY26 Results: Loss Widens",
            "Summary": "Vindhya Telelinks reported standalone net loss of ₹1,966.49 lakhs for Q3FY26 vs profit of ₹2,691.76 lakhs in Q3FY25. Revenue declined 31.46% YoY to ₹71,055.21 lakhs amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1770385121265,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vindhya Telelinks Publishes Demat Transfer Notice",
            "Summary": "Vindhya Telelinks Limited published newspaper notice regarding special window for transfer and dematerialisation of physical securities in compliance with SEBI circular dated 30th January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770286332199,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vindhya Telelinks Opens Special Transfer Window",
            "Summary": "Vindhya Telelinks Limited announces opening of special window for transfer and dematerialisation of physical securities from February 5, 2026 to February 4, 2027 under SEBI circular.",
            "Sentiment": "neutral",
            "PublishDate": 1770208376551,
            "Source": "stocks"
        },
        {
            "Title": "Vindhya Telelinks Board Meet Set for Feb 6, 2026",
            "Summary": "Vindhya Telelinks Limited has scheduled a board meeting on February 6, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769161646228,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vindhya Telelinks Gets ESG Rating of 69 from CFC Finlease",
            "Summary": "Vindhya Telelinks Limited receives 'Good' ESG rating of 69 from SEBI-licensed CFC Finlease Private Limited based on publicly available FY25 information. Rating assigned independently without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1766745609889,
            "Source": "stocks"
        },
        {
            "Title": "Vindhya Telelinks Faces ₹14.86 Lakh GST Demand",
            "Summary": "Vindhya Telelinks receives GST order demanding ₹14.86 lakh for alleged ineligible ITC claims from FY2018-19 to FY2022-23. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1766496251967,
            "Source": "stocks"
        },
        {
            "Title": "Vindhya Telelinks Reports Strong Q2 Performance and Secures Approval for 367 Million Rupee Capacity Expansion",
            "Summary": "Vindhya Telelinks delivered robust quarterly results with EBITDA rising to 722 million rupees from 565 million rupees year-over-year, while EBITDA margin improved to 7.53% from 5.93%. The company's consolidated net profit surged to 591 million rupees compared to 243 million rupees in the previous year. Revenue grew marginally to 9.6 billion rupees from 9.5 billion rupees year-over-year. Additionally, the company received approval for a production capacity expansion plan requiring a total investment of 367 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762953427266,
            "Source": "stock"
        },
        {
            "Title": "Vindhya Telelinks Completes Postal Ballot Process for Director Appointments",
            "Summary": "Vindhya Telelinks Limited concluded its postal ballot process that ran from July 14, 2025 to August 12, 2025. The company sought shareholder approval on two resolutions: the appointment of Smt. Srishti Lodha as a Non-Executive Non-Independent Director, and the re-appointment of Shri Y.S. Lodha as Managing Director & Chief Executive Officer for five years from November 4, 2025 to November 3, 2030. The voting process included remote e-voting through Central Depository Services (India) Limited. Postal ballot notices were sent electronically to members with registered email addresses, while physical copies were sent to others. Shri Rajesh Kumar Mishra was appointed as scrutinizer for the process. Results will be declared by August 14, 2025 at the company's registered office and communicated to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1755004977811,
            "Source": "corporate_action"
        },
        {
            "Title": "Vindhya Telelinks Reports Strong Q1 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "Vindhya Telelinks delivered robust quarterly results with consolidated net profit reaching 586 million rupees, nearly doubling from 294 million rupees in the same period last year. Revenue grew to 9.1 billion rupees from 8.3 billion rupees year-on-year. EBITDA increased to 606 million rupees compared to 491 million rupees previously, while EBITDA margin improved to 6.68% from 5.89% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1754872058329,
            "Source": "earnings"
        },
        {
            "Title": "Vindhya Telelinks Reports 6.46% Growth in Net Profit for June Quarter",
            "Summary": "Vindhya Telelinks Limited announced its quarterly results for the quarter ended June 30, 2025, with the Board of Directors approving both standalone and consolidated financial results on August 8, 2025. The company reported standalone net profit of ₹2,089.91 lakhs, representing a 6.46% increase compared to the corresponding previous quarter. Revenue from operations reached ₹90,161 lakhs on standalone basis and ₹90,752 lakhs on consolidated basis. The Cable segment showed strong performance with EBITDA increasing to ₹1,592.45 lakhs compared to ₹880.07 lakhs in the same quarter last year, driven by rising demand for Solar and Specialty Cables. The EPC segment reported revenue of ₹70,409.26 lakhs with EBITDA of ₹4,844.67 lakhs, maintaining a resilient EBITDA margin of 6.88% despite payment delays from the UP-SWSM Project. The company's order book stood at approximately ₹6,593 crores as of June-end. On consolidated basis, the company reported net profit of ₹5,862.10 lakhs with profit before tax of ₹7,852.60 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754662582461,
            "Source": "earnings"
        },
        {
            "Title": "EU Imposes Countervailing Duty on Indian Optical Fibre Cables",
            "Summary": "The European Union has imposed a combined countervailing duty (CVD) and anti-dumping duty of 8.30% on optical fibre cables imported from India. This decision affects Indian manufacturers of optical fibre cables, including Vindhya Telelinks.",
            "Sentiment": "negative",
            "PublishDate": 1749774479000,
            "Source": "default"
        },
        {
            "Title": "EU Imposes Countervailing Duty on Indian Optical Fibre Cables",
            "Summary": "Vindhya Telelinks faces a combined countervailing duty (CVD) and anti-dumping duty of 8.30% imposed by the European Union on Indian optical fibre cables.",
            "Sentiment": "negative",
            "PublishDate": 1749732788000,
            "Source": "default"
        },
        {
            "Title": "Vindhya Telelinks Reports Q4 Results and Recommends Dividend",
            "Summary": "Vindhya Telelinks has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit was 1.1 billion rupees, compared to 1.08 billion rupees year-over-year and 391 million rupees quarter-over-quarter. Q4 revenue stood at 12.3 billion rupees, down from 12.9 billion rupees in the same quarter last year. The company's EBITDA for Q4 was 881 million rupees, up from 822.3 million rupees year-over-year, with an EBITDA margin of 7.15% compared to 6.84% in the previous year. Additionally, Vindhya Telelinks has recommended a dividend of 16 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747924401000,
            "Source": "result"
        },
        {
            "Title": "Vindhya Telelinks Reports Q3 Financial Results and Approves Capacity Expansion",
            "Summary": "Vindhya Telelinks announced its Q3 consolidated net profit of 391 million rupees, down from 688 million rupees year-over-year and up from 244 million rupees quarter-over-quarter. Q3 revenue was 10.37 billion rupees, compared to 10.84 billion rupees in the previous year. The company also approved a capacity expansion plan with a capital outlay of 551 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739233310000,
            "Source": "earnings"
        },
        {
            "Title": "Vindhya Telelinks Approves Capacity Expansion Plan",
            "Summary": "Vindhya Telelinks has approved a capacity expansion plan with a capital outlay of 551 million rupees. This investment indicates the company's intent to grow its operations and potentially increase its market presence.",
            "Sentiment": "positive",
            "PublishDate": 1739198369000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vindhya Telelinks Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Vindhya Telelinks has reported a decrease in its third-quarter EBITDA, which fell to 650 million rupees from 753 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 6.27% from 6.95% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739195700000,
            "Source": "earnings"
        },
        {
            "Title": "Vindhya Telelinks Reports Decline in Q3 Consolidated Net Profit and Revenue",
            "Summary": "Vindhya Telelinks has reported a decrease in its third-quarter consolidated net profit, which fell to 391 million rupees from 688 million rupees year-over-year. The company's revenue also declined to 10.37 billion rupees from 10.84 billion rupees in the same period last year. Compared to the previous quarter, net profit increased from 244 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739195638000,
            "Source": "earnings"
        },
        {
            "Title": "Vindhya Telelinks Approves Stake Acquisition in Birla Visabeira",
            "Summary": "Vindhya Telelinks has approved the acquisition of a stake in Birla Visabeira Private Limited at a price of 3.10 rupees per share. This move represents a strategic investment decision by Vindhya Telelinks, potentially aiming to expand its business interests or strengthen its market position.",
            "Sentiment": "neutral",
            "PublishDate": 1729863644000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vindhya Telelinks Reports Q2 Financial Results",
            "Summary": "Vindhya Telelinks has reported its Q2 financial results. The company's EBITDA for the quarter was 565 million rupees, compared to 602 million rupees in the same quarter last year. The EBITDA margin decreased to 5.93% from 6.98% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729863417000,
            "Source": "result"
        },
        {
            "Title": "Vindhya Telelinks Reports Q2 Revenue Growth",
            "Summary": "Vindhya Telelinks has reported a revenue of 9.5 billion rupees for the second quarter, compared to 8.62 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729863407000,
            "Source": "result"
        },
        {
            "Title": "Vindhya Telelinks Reports Q2 Profit Decline",
            "Summary": "Vindhya Telelinks announced its Q2 consolidated net profit of 243 million rupees, showing a decrease from 467 million rupees year-over-year. However, it represents a slight increase from 294 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729863396000,
            "Source": "result"
        }
    ]
}