{
    "Symbol": "VINEETLAB",
    "ISIN": "INE505Y01010",
    "News": [
        {
            "Title": "Vineet Labs EGM Approves Independent Director Appointment",
            "Summary": "Vineet Laboratories Limited shareholders approved the appointment of Ms. Jasmin Kunal Tailor as Independent Director with 99.99% votes in favor during EGM held on February 07, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770485471272,
            "Source": "stocks"
        },
        {
            "Title": "Vineet Labs Completes Rights Issue Allotment",
            "Summary": "Vineet Laboratories Limited successfully allotted 99,87,258 equity shares through rights issue at Rs.30 per share, increasing paid-up capital from Rs.9.21 crore to Rs.19.21 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770036621189,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vineet Labs Extends Rights Issue Dates Till Jan 30",
            "Summary": "Vineet Laboratories Limited extends its rights issue closing date to January 30, 2026, and on-market renunciation deadline to January 27, 2026, for investor benefit.",
            "Sentiment": "neutral",
            "PublishDate": 1768290916500,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vineet Laboratories Adjourns Rights Issue Committee Meeting to December 6",
            "Summary": "Vineet Laboratories Limited adjourned its Rights Issue Committee meeting from December 3 to December 6, 2025, to finalize key parameters including issue price, entitlement ratio, record date, and opening/closing dates. The adjournment allows the committee to await in-principle approval from BSE Limited before determining the complete modalities of the proposed rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1764765324233,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Promoters Dispose 5.8 Lakh Equity Shares Through Market Sales",
            "Summary": "Promoters of Vineet Laboratories Limited disposed 5,80,496 equity shares through open market sales on NSE across two separate transactions. The collective promoter holding decreased from 16.08% to 5.41%, with transactions executed between June and August 2025.",
            "Sentiment": "negative",
            "PublishDate": 1764307968834,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Announces Rs 3000 Lakh Rights Issue for Equity Shareholders",
            "Summary": "Vineet Laboratories' Board approved a rights issue of fully paid-up equity shares with face value of Rs 10 each up to Rs 3000 lakhs for eligible equity shareholders. The Rights Issue Committee will meet on December 3, 2025 to determine issue price, entitlement ratio, record date, and other modalities subject to regulatory approvals from BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1764249349556,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Board Meeting Scheduled to Consider Rights Issue for Fund Raising",
            "Summary": "Vineet Laboratories Limited has scheduled a Board of Directors meeting for November 27, 2025, to consider and approve a proposal for fund raising through a Rights Issue of equity shares. The company has closed its trading window from November 21, 2025, until 48 hours after the Board Meeting concludes, affecting trading activities for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1763987898832,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Promoters Sell Shares Worth Over ₹1 Crore",
            "Summary": "Multiple promoters of Vineet Laboratories Limited sold equity shares totaling several lakhs of shares through market transactions between November 12-14, 2025. The share sales by eight promoters including Satyanarayana Raju Bhupathiraju and Alluri family members were disclosed under insider trading regulations to BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763469988913,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Reports Board Changes and Financial Results for Q2 FY2026",
            "Summary": "Vineet Laboratories Limited announced multiple board changes and quarterly financial results. The company appointed Ms. Jasmin Kunal Tailor as Additional Non-Executive Independent Director for a three-year term from November 9, 2025 to November 8, 2028, subject to shareholder approval. Ms. Hari Priya Yerukalapudi resigned from her Independent Director position effective November 8, 2025, citing changes in professional priorities and family necessities. The board also revised remuneration for Managing Director Mr. Gaddam Venkata Ramana and Whole Time Director & CFO Mr. Satyanarayana Raju Bhupathiraju, pending shareholder approval. For the quarter ended September 30, 2025, the company reported revenue from operations of Rs. 741.38 lakhs compared to Rs. 1,895.78 lakhs in the previous quarter. The company recorded a net loss of Rs. 40 lakhs for the quarter and Rs. 46.53 lakhs for the half-year period. Total income for the half-year was Rs. 2,488.78 lakhs against total expenses of Rs. 2,541.77 lakhs, resulting in a loss before tax of Rs. 53 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1762601608653,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Appoints Premananda Reddy Vennapusa as Non-Executive Director",
            "Summary": "Vineet Laboratories Limited shareholders approved the appointment of Mr. Premananda Reddy Vennapusa as a Non-Executive Director under the Professional category through a postal ballot process concluded on September 15, 2025. The remote e-voting process ended at 5:00 p.m. IST on the same date, and the resolution was passed with the requisite majority based on the scrutinizer's report. Mr. Vennapusa brings over 15 years of experience in manufacturing pharmaceutical chemicals, processing, plastic production, and operations management. He is not related to other directors and holds no securities in the company as of his appointment date. He has not been debarred from holding director positions by SEBI or any other authority.",
            "Sentiment": "positive",
            "PublishDate": 1758031728271,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vineet Laboratories Promoters Sell Shares Worth ₹53.2 Lakh",
            "Summary": "Four promoters of Vineet Laboratories Limited sold equity shares on September 1, 2025. Satyanarayana Raju Bhupathiraju sold 24,213 shares worth ₹8.32 lakh, reducing his stake from 2.60% to 2.34%. Alluri Prabhakar Raju disposed of 25,000 shares valued at ₹8.60 lakh, lowering his holding from 2.05% to 1.78%. Gaddam Venkata Ramana sold 80,000 shares for ₹27.51 lakh, decreasing his stake from 9.01% to 8.14%. Alluri Srinivasa Raju sold 25,000 shares worth ₹8.60 lakh, reducing his holding from 1.68% to 1.41%. All transactions were conducted on the NSE through on-market sales.",
            "Sentiment": "neutral",
            "PublishDate": 1756994664677,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Promoter Sells 56,164 Equity Shares",
            "Summary": "Vineet Laboratories Limited disclosed that promoter Mr. Satyanarayana Raju Bhupathiraju sold 56,164 equity shares on August 11, 2025. Following the sale, his shareholding decreased from 406,452 shares (3.50%) to 350,288 shares (3.02%). The transaction was executed through market sale and the company received intimation from the promoter on August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755521897293,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Promoter Sells 1.5 Lakh Shares Worth ₹50.1 Lakh",
            "Summary": "Vineet Laboratories Limited disclosed that promoter Mrs. Gaddam Venkata Rama sold 1,50,000 equity shares on August 11, 2025, for ₹50.1 lakh through the NSE. The transaction reduced her shareholding from 2,60,011 shares (2.82%) to 1,10,011 shares (1.19%). The sale was conducted on the open market and disclosed under SEBI's Insider Trading Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755521208376,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Board Approves Postal Ballot for Share Capital Increase and Director Appointment",
            "Summary": "Vineet Laboratories Limited's Board of Directors approved a postal ballot notice seeking shareholder approval for multiple corporate actions. The proposals include increasing the company's authorized share capital with consequent changes to the Memorandum of Association, raising thresholds for loans, guarantees, securities, and investments, and appointing Mr. Premananda Reddy Vennapusa as Non-Executive Director. The board set August 8, 2025 as the cut-off date for determining voting eligibility and identifying members who will receive the postal ballot notice. The board meeting was held on August 12, 2025, lasting from 10:00 AM to 11:30 AM.",
            "Sentiment": "neutral",
            "PublishDate": 1754979517447,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Promoters Sell Equity Shares Worth Over ₹3 Crore",
            "Summary": "Vineet Laboratories Limited disclosed share sales by two company promoters. Mr. Satyanarayana Raju Bhupathiraju sold 18,728 equity shares, reducing his holding from 425,176 shares to 406,452 shares. Mrs. Gaddam Venkata Rama sold 9,725 equity shares, decreasing her stake from 269,736 shares (2.93%) to 260,011 shares (2.82%). Both transactions occurred on August 5, 2025, through market sales on BSE and NSE respectively. The company informed both stock exchanges about these promoter share disposals under insider trading disclosure regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754751885061,
            "Source": "stock"
        },
        {
            "Title": "Vineet Laboratories Promoter Mrs. Alluri Maithili Sells 27,000 Equity Shares",
            "Summary": "Vineet Laboratories Limited disclosed that promoter Mrs. Alluri Maithili sold 27,000 equity shares through market sale on NSE on July 31, 2025. The transaction reduced her shareholding from 1,54,521 shares (1.68%) to 1,27,521 shares (1.38%). The sale was valued at ₹8,59,950 and was disclosed under SEBI Insider Trading Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754660242878,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Promoters Sell Shares Worth Over ₹1.4 Crore",
            "Summary": "Vineet Laboratories Limited disclosed share sales by two promoters. Mrs. Gaddam Venkata Rama sold 1,10,000 equity shares across two transactions on July 28 and July 31, 2025, reducing her shareholding from 4.12% to 2.97%. The sales were valued at ₹1.25 crore. Mr. Alluri Prabhakar Raju sold 49,165 equity shares on July 31, 2025, for ₹15.66 lakh, reducing his stake from 2.58% to 2.05%. Both transactions were executed on the National Stock Exchange through on-market sales.",
            "Sentiment": "neutral",
            "PublishDate": 1754658340773,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Limited Publishes Q1 FY2025 Financial Results in Newspapers",
            "Summary": "Vineet Laboratories Limited published its unaudited standalone financial results for the first quarter ended June 30, 2025 in Financial Express (English) and Nava Telangana (Telugu) newspapers on July 24, 2025. The company informed BSE Limited and National Stock Exchange of India Limited about the newspaper publication as required under SEBI regulations. The financial results can be accessed on the websites of BSE, NSE, and the company's official website. The company is registered in Hyderabad, Telangana with CIN L24304TG2016PLC112888.",
            "Sentiment": "neutral",
            "PublishDate": 1753435116843,
            "Source": "earnings"
        },
        {
            "Title": "Vineet Laboratories Promoter Valluru Vara Prasad Rao Sells Equity Shares",
            "Summary": "Vineet Laboratories Limited disclosed that promoter Valluru Vara Prasad Rao sold equity shares in two separate transactions on NSE. The first transaction involved sale of 607 equity shares on May 19, 2025, valued at Rs 20,237.38, reducing his holding from 17.97% to 17.37%. The second transaction involved sale of 14,000 equity shares on June 30, 2025, valued at Rs 10,50,044, further reducing his stake from 17.37% to 14.15%. Both transactions were executed through on-market sales on the National Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1753361736424,
            "Source": "corporate_action"
        },
        {
            "Title": "Vineet Laboratories Reports Net Loss of INR 86.61 Lakhs in Latest Quarter",
            "Summary": "Vineet Laboratories Limited reported a net loss of INR 86.61 lakhs for the quarter ended June 30, 2025, compared to a net loss of INR 213.07 lakhs in the same quarter last year. The company's total income from operations was INR 744.18 lakhs, significantly lower than INR 2,386.16 lakhs in the corresponding quarter of the previous year. Total expenses for the quarter were INR 836.14 lakhs. The company's basic and diluted earnings per share stood at negative INR 0.94. The Board of Directors approved these unaudited standalone financial results in their meeting held on July 22, 2025. Vineet Laboratories operates in the active pharmaceutical ingredients and intermediates segment.",
            "Sentiment": "negative",
            "PublishDate": 1753184384543,
            "Source": "earnings"
        }
    ]
}