{
    "Symbol": "VINNY",
    "ISIN": "INE01KI01027",
    "News": [
        {
            "Title": "Vinny Overseas Reports Theft at Wind Mill Facility",
            "Summary": "Vinny Overseas Limited disclosed a theft incident at its wind mill facility in Kutch, Gujarat, involving copper cables and equipment worth ₹18.52 lakhs, with potential restoration costs of ₹1.50 crores.",
            "Sentiment": "negative",
            "PublishDate": 1766058777710,
            "Source": "stocks"
        },
        {
            "Title": "Vinny Overseas Limited Approves Q2 2025 Financial Results and Sets AGM Date",
            "Summary": "Vinny Overseas Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 754.24 lakhs and a profit of Rs. 28.65 lakhs for the quarter. The board also approved the internal audit report, annual report, and set September 30, 2025 as the date for the 33rd Annual General Meeting to be held via video conferencing. Additionally, the board recommended the reappointment of Mrs. Vandani Sumanth Chowdhary as director and noted various compliance matters for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755169479351,
            "Source": "earnings"
        },
        {
            "Title": "Vinny Overseas Limited Appoints Bhavesh Kantibhai Vaghasiya as Company Secretary & Compliance Officer",
            "Summary": "Vinny Overseas Limited's Board of Directors approved the appointment of Mr. Bhavesh Kantibhai Vaghasiya as Company Secretary & Compliance Officer effective July 30, 2021. Vaghasiya is a qualified Company Secretary with membership number A49340 from the Institute of Company Secretaries of India. He brings over six years of experience in the secretarial domain with expertise in corporate secretarial operations, statutory compliance, and governance matters. He holds an MBA in Finance and is recognized for his methodical approach to secretarial and compliance responsibilities. The appointment was made in compliance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753875522504,
            "Source": "corporate_governance"
        }
    ]
}