{
    "Symbol": "VINYLINDIA",
    "ISIN": "INE250B01029",
    "News": [
        {
            "Title": "Vinyl Chemicals postal ballot for director appointments",
            "Summary": "Vinyl Chemicals (India) Ltd announces postal ballot for appointing Shri Kavinder Singh as Non-Executive Director and Ms. Gira Sardesai as Independent Director. E-voting from February 4-March 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770099258091,
            "Source": "stocks"
        },
        {
            "Title": "Vinyl Chemicals Appoints Two Additional Directors",
            "Summary": "Vinyl Chemicals (India) Ltd. board approves appointment of Kavinder Singh as Non-Executive Non-Independent Director and Gira Sardesai as Independent Director, both effective February 2, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768897263751,
            "Source": "stocks"
        },
        {
            "Title": "Vinyl Chemicals Q3FY26 Profit Jumps 58% YoY",
            "Summary": "Vinyl Chemicals (India) Ltd reported strong Q3FY26 results with net profit rising 58% YoY to ₹452 lakhs. Revenue from operations grew 15.8% to ₹16,948 lakhs despite higher expenses.",
            "Sentiment": "positive",
            "PublishDate": 1768897205724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vinyl Chemicals (India) Reports Q2 Results with 44% Decline in Quarterly Profit",
            "Summary": "Vinyl Chemicals (India) Limited reported unaudited financial results for the second quarter and half year ended September 30, 2025. The company's quarterly profit declined to Rs 288 lakhs compared to Rs 513 lakhs in the same quarter last year, representing a 44% decrease. Revenue from operations remained relatively stable at Rs 15,189 lakhs versus Rs 15,034 lakhs in the previous year quarter. For the six-month period, profit dropped to Rs 733 lakhs from Rs 1,005 lakhs in the corresponding period last year, a 27% decline. Half-yearly revenue decreased slightly to Rs 30,312 lakhs from Rs 30,597 lakhs. The company's primary business activity involves trading in chemicals. Earnings per share for the quarter stood at Rs 1.58 compared to Rs 2.80 in the same quarter last year. The Board of Directors approved these results at their meeting held on October 27, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761546103723,
            "Source": "earnings"
        },
        {
            "Title": "Vinyl Chemicals Reports Decline in Quarterly Net Profit and Revenue",
            "Summary": "Vinyl Chemicals reported a net profit of 44 million rupees compared to 49.2 million rupees in the same quarter last year, representing a year-over-year decline. The company's revenue also decreased to 1.5 billion rupees from 1.56 billion rupees in the corresponding period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753862471126,
            "Source": "earnings"
        },
        {
            "Title": "Vinyl Chemicals Reports Q4 Financial Results",
            "Summary": "Vinyl Chemicals has released its Q4 financial results. The company's EBITDA increased to 100 million rupees from 86 million rupees year-over-year, with the EBITDA margin improving to 5.76% from 5.13%. Revenue slightly increased to 1.73 billion rupees from 1.7 billion rupees. However, net profit marginally decreased to 73 million rupees from 75 million rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746438170000,
            "Source": "result"
        },
        {
            "Title": "Vinyl Chemicals Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Vinyl Chemicals has reported a significant decrease in its Q3 EBITDA, which fell to 36.6 million rupees from 87 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 2.50% from 5.05% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737099674000,
            "Source": "earnings"
        },
        {
            "Title": "Vinyl Chemicals Reports Q3 Revenue Decline",
            "Summary": "Vinyl Chemicals has reported a decrease in its third-quarter revenue. The company's Q3 revenue stood at 1.46 billion rupees, down from 1.59 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737099670000,
            "Source": "earnings"
        },
        {
            "Title": "Vinyl Chemicals Reports Decrease in Q3 Net Profit",
            "Summary": "Vinyl Chemicals has reported a net profit of 50 million rupees for the third quarter, compared to 69 million rupees in the same period last year, indicating a year-over-year decline in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1737099620000,
            "Source": "earnings"
        },
        {
            "Title": "Vinyl Chemicals Reports Improved Q2 EBITDA and Margin",
            "Summary": "Vinyl Chemicals has announced its Q2 financial results. The company's EBITDA increased to 59.5 million rupees, up from 45 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 3.96% from 2.93% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729499368000,
            "Source": "result"
        }
    ]
}