{
    "Symbol": "VINYAS",
    "ISIN": "INE0OLS01010",
    "News": [
        {
            "Title": "Vinyas Gets ₹49.42 Crore PCBA Order",
            "Summary": "Vinyas Innovative Technologies secures significant ₹49.42 crore order for PCBA production and supply, with delivery timeline spanning 6-12 months, strengthening company's order book.",
            "Sentiment": "positive",
            "PublishDate": 1769511835163,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vinyas Innovative Technologies Secures Orders Worth 160 Crores",
            "Summary": "Vinyas Innovative Technologies has received orders valued at 160 crores. The company, which appears to be in the SME (Small and Medium Enterprises) sector, has successfully secured these significant orders. No further details about the nature of the orders or the timeframe for their execution were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751872881000,
            "Source": "default"
        },
        {
            "Title": "Vinyas Innovative Technologies Approves Convertible Warrants Issuance",
            "Summary": "The board of Vinyas Innovative Technologies has approved the issuance of convertible warrants worth up to 150 crores. The company's valuation is stated to be 1600 crores. This news is reported in the context of Small and Medium Enterprises (SME).",
            "Sentiment": "positive",
            "PublishDate": 1751274054000,
            "Source": "default"
        },
        {
            "Title": "Vinyas Innovative Tech Achieves Nadcap Accreditation for Aerospace and Defense",
            "Summary": "Vinyas Innovative Tech has obtained Nadcap accreditation for the aerospace and defense sectors. This certification is significant for companies operating in these industries, as it demonstrates compliance with high-quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1751011240000,
            "Source": "default"
        },
        {
            "Title": "Vinyas Innovative Technologies Secures ₹97 Crore Order",
            "Summary": "Vinyas Innovative Technologies has received an order worth ₹97 crore. The company's current market capitalization stands at ₹988 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746435011000,
            "Source": "default"
        },
        {
            "Title": "Vinyas Innovative Technologies Secures 53.8 Crore Rupee Order",
            "Summary": "Vinyas Innovative Technologies, a company with a market capitalization of 966 crore rupees, has won a new order worth 53.8 crore rupees. This development is significant for the small and medium enterprise (SME) sector company.",
            "Sentiment": "positive",
            "PublishDate": 1741589599000,
            "Source": "order&deals"
        },
        {
            "Title": "Vinyas Innovative Technologies Secures 54 Crore Rupee Order",
            "Summary": "Vinyas Innovative Technologies, a company with a market capitalization of 824 crore rupees, has won a new order worth 54 crore rupees. This development is significant for the small and medium enterprise (SME) sector company.",
            "Sentiment": "positive",
            "PublishDate": 1740120305000,
            "Source": "order&deals"
        },
        {
            "Title": "Vinyas Innovative Tech Secures 89 Crore Rupee Order",
            "Summary": "Vinyas Innovative Tech, a small and medium enterprise (SME) company, has won an order worth 89 crore rupees. The company's current market capitalization stands at 910 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738826416000,
            "Source": "order&deals"
        },
        {
            "Title": "Vinyas Innovative Technologies Secures ₹390 Crore Order",
            "Summary": "Vinyas Innovative Technologies, an SME with a market capitalization of ₹1,131 crore, has won a significant order worth ₹390 crore. This order represents a major business development for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1734927880000,
            "Source": "order&deals"
        },
        {
            "Title": "Vinyas Innovative Technologies Secures ₹48 Crore Order",
            "Summary": "Vinyas Innovative Technologies, a company with a market capitalization of ₹900 crore, has won a new order worth ₹48 crore. This development is significant for the small and medium enterprise (SME) sector.",
            "Sentiment": "positive",
            "PublishDate": 1733218522000,
            "Source": "order&deals"
        }
    ]
}