{
    "Symbol": "VIPCLOTHNG",
    "ISIN": "INE450G01024",
    "News": [
        {
            "Title": "VIP Clothing Issues Revised Credit Rating Letter",
            "Summary": "VIP Clothing Limited issues revised credit rating letter correcting facility classification from Working Capital Term Loan to Working Capital Demand Loan, with no change to ratings or amounts.",
            "Sentiment": "neutral",
            "PublishDate": 1766742321892,
            "Source": "stocks"
        },
        {
            "Title": "VIP Clothing Shares Q2 FY26 Investor Presentation Highlighting Transformation Strategy",
            "Summary": "VIP Clothing Limited released its investor presentation for Q2 FY26 and H1 FY26, outlining a comprehensive transformation strategy focused on expanding women's innerwear segment, youth-centric brands, and geographic expansion. The company targets ₹420 crore revenue by FY27 at 35% CAGR with net margins rising from 3.08% to 7.3%, driven by premium product mix and operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1764753143045,
            "Source": "stock"
        },
        {
            "Title": "VIP Clothing Unveils 5-Year Retail Transformation Plan with New Premium Lines and Export Focus",
            "Summary": "VIP Clothing announced a comprehensive 5-year retail transformation strategy involving expansion of exclusive brand outlets and e-commerce channels, along with launching premium innerwear lines under 'Feelings' and 'Frenchie X' brands. The company is targeting youth demographics and expanding exports to GCC and Africa markets while aiming to restore profit margins to pre-COVID levels.",
            "Sentiment": "positive",
            "PublishDate": 1763051760601,
            "Source": "stock"
        },
        {
            "Title": "VIP Clothing Reports Quarterly Financial Results for September 2025",
            "Summary": "VIP Clothing Limited announced its unaudited financial results for the quarter ended September 30, 2025. The company reported revenue from operations of ₹6,606.76 lakhs for the quarter, compared to ₹6,544.87 lakhs in the previous quarter. For the six months ended September 30, 2025, revenue stood at ₹13,151.63 lakhs versus ₹13,093.80 lakhs in the corresponding period last year. The company posted a profit after tax of ₹225.45 lakhs for the quarter, compared to ₹222.16 lakhs in the previous quarter. Basic earnings per share for the quarter was ₹0.25. Total assets decreased to ₹32,436.87 lakhs as of September 30, 2025, from ₹32,938.20 lakhs as of March 31, 2025. The Board of Directors approved these results at their meeting held on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762940728869,
            "Source": "earnings"
        },
        {
            "Title": "VIP Clothing Limited Expands Retail Presence Across Lulu Mall Chain",
            "Summary": "VIP Clothing Limited announced its retail expansion across Lulu Malls in India. The company will showcase its complete portfolio including VIP, Frenchie, Frenchie X and Yuva Series brands targeting men across varied style and comfort needs. Chairman & Managing Director Sunil Pathare described the partnership with Lulu Mall as a significant step in strengthening the company's reach and accessibility. The Lulu Mall outlets will feature exclusive product displays, engaging brand experiences, and visual merchandising to enhance consumer touchpoints in modern retail spaces. VIP Clothing Limited operates as a leading innerwear manufacturer in India with a diverse portfolio including brands like VIP, Frenchie, Frenchie X, Leader, Yuva Series, and VIP Juniors.",
            "Sentiment": "positive",
            "PublishDate": 1758522426334,
            "Source": "stock"
        },
        {
            "Title": "VIP Clothing Reports 846% Jump in Quarterly Profit, Appoints New Auditors and Sets AGM Date",
            "Summary": "VIP Clothing Limited's Board approved quarterly results showing profit after tax of ₹222.16 lakhs for the quarter ended June 30, 2025, compared to ₹23.48 lakhs in the same quarter last year. Revenue from operations increased to ₹6,544.87 lakhs from ₹5,011.95 lakhs year-over-year. Basic earnings per share stood at ₹0.25 versus ₹0.03 in the previous year quarter. The company appointed M/s. KRS AND CO. as Secretarial Auditors for five consecutive years from 2025-26 to 2029-30, subject to shareholder approval. The 35th Annual General Meeting has been scheduled for September 18, 2025, at 11:30 AM via video conferencing. Total comprehensive income for the quarter was ₹217.24 lakhs compared to ₹27.98 lakhs in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754476682066,
            "Source": "earnings"
        },
        {
            "Title": "VIP Clothing Partners with Blinkit to Launch VIP and Frenchie Brands on Quick-Commerce Platform",
            "Summary": "VIP Clothing has entered into a collaboration with Eternal's Blinkit to introduce its main sub-brands, VIP and Frenchie, on the quick-commerce platform. This partnership will make the company's products available through Blinkit's delivery service.",
            "Sentiment": "positive",
            "PublishDate": 1753172213902,
            "Source": "order&deals"
        },
        {
            "Title": "VIP Clothing Launches New Yuwa Series for Youth in Southern Market",
            "Summary": "VIP Clothing has introduced a new product line called the Yuwa Series, specifically targeting young consumers in the southern market. The launch appears to be a strategic move to expand the company's presence in this demographic and region.",
            "Sentiment": "positive",
            "PublishDate": 1751874605000,
            "Source": "default"
        },
        {
            "Title": "VIP Clothing Expands with Frenchie X Launch in Major Cities",
            "Summary": "VIP Clothing has expanded its market presence by launching its Frenchie X product line in Mumbai, Delhi, and Pune. This strategic move indicates the company's efforts to grow its retail footprint in key metropolitan areas of India.",
            "Sentiment": "positive",
            "PublishDate": 1745382207000,
            "Source": "default"
        },
        {
            "Title": "VIP Clothing Expands Digital Presence with Zepto Partnership",
            "Summary": "VIP Clothing has launched its products on Zepto, a quick commerce platform, expanding its digital footprint. This move aims to enhance the company's online presence and accessibility to customers.",
            "Sentiment": "positive",
            "PublishDate": 1744346303000,
            "Source": "corporate_action"
        },
        {
            "Title": "VIP Clothing Reports Q3 Revenue Increase",
            "Summary": "VIP Clothing has announced its Q3 financial results, reporting a revenue of 61.18 crore rupees, compared to 44.89 crore rupees in the same quarter of the previous year. This represents a significant year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1735882071000,
            "Source": "earnings"
        },
        {
            "Title": "VIP Clothing Ltd: Expands into Branded Handkerchiefs, Strengthens Footwear Line",
            "Summary": "VIP Clothing Ltd enters the branded handkerchiefs market and reinforces its footwear segment, focusing on semi-premium socks. This expansion is part of the company's strategy to convert unbranded product categories into branded essentials. The company's accessories division will now include both handkerchiefs and socks.",
            "Sentiment": "positive",
            "PublishDate": 1735197428000,
            "Source": "normal_news"
        },
        {
            "Title": "VIP Clothing Expands Product Line with Branded Handkerchiefs and Footwear Accessories",
            "Summary": "VIP Clothing has announced the launch of branded handkerchiefs and a strengthened focus on its accessories division, particularly in footwear products such as socks. This move represents a diversification of the company's product offerings and an expansion into new market segments.",
            "Sentiment": "positive",
            "PublishDate": 1735191871000,
            "Source": "corporate_action"
        },
        {
            "Title": "VIP Clothing Reports Significant Q2 EBITDA Growth",
            "Summary": "VIP Clothing has announced its Q2 financial results, showing a substantial improvement in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA increased from 7 million rupees in the previous year to 34 million rupees in the current quarter. Additionally, the EBITDA margin expanded from 1.30% to 5.77% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731066944000,
            "Source": "result"
        },
        {
            "Title": "VIP Clothing Reports Profit in Q2 FY2024",
            "Summary": "VIP Clothing Limited has announced its financial results for the second quarter of fiscal year 2024. The company reported a net profit of 8 million rupees, compared to a loss of 25 million rupees in the same quarter last year. This represents a significant turnaround in profitability. Sequentially, the profit increased from 2.3 million rupees in the previous quarter. Revenue for Q2 stood at 592 million rupees, up from 523 million rupees in the corresponding period last year, indicating a growth in sales.",
            "Sentiment": "positive",
            "PublishDate": 1731066830000,
            "Source": "result"
        }
    ]
}