{
    "Symbol": "VIPIND",
    "ISIN": "INE054A01027",
    "News": [
        {
            "Title": "VIP Industries Board Meet Set for Feb 12 to Review Q3 Results",
            "Summary": "VIP Industries has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770648438583,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries VP Sales Sumit Gupta Resigns",
            "Summary": "VIP Industries announces resignation of Vice President Sales Sumit Gupta effective January 31, 2026, citing personal reasons. He will serve full 3-month notice period.",
            "Sentiment": "neutral",
            "PublishDate": 1769777746674,
            "Source": "stocks"
        },
        {
            "Title": "Tips Music Declares 500% Interim Dividend",
            "Summary": "Tips Music announces third interim dividend of ₹5 per share (500%) for FY26 with record date January 23, 2026. Q3 results show 33% PAT growth to ₹58.70 crore and 21% revenue increase to ₹94.30 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768882402715,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries Sells Nashik Land for ₹24.28 Crores",
            "Summary": "VIP Industries Limited has entered into a binding agreement to sell its non-core Nashik land asset for ₹24.28 crores to DGP Realty Nashik Private Limited, a promoter group entity.",
            "Sentiment": "neutral",
            "PublishDate": 1767190741454,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries Assigns Nagpur Property Lease for ₹51.18 Cr",
            "Summary": "VIP Industries has entered into binding agreements to assign lease of its non-core Nagpur property to DGP Realty Nagpur Private Limited for ₹51.18 crores, subject to regulatory approval.",
            "Sentiment": "neutral",
            "PublishDate": 1767190434824,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries Promoters Plan Final 4% Stake Sale",
            "Summary": "VIP Industries promoters initiate book-building for additional 4% stake sale through block deal, retaining 16% post-transaction. Final leg of promoter selling after 26% transfer to Multiples PE.",
            "Sentiment": "neutral",
            "PublishDate": 1767165084815,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries sees major stake acquisition by PE funds",
            "Summary": "Multiples Private Equity funds acquired 26.07% stake in VIP Industries through open market purchase, increasing combined holding to 32.06% following share purchase agreement.",
            "Sentiment": "positive",
            "PublishDate": 1766574340366,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries Block Trade Worth ₹1,381.29 Crores",
            "Summary": "VIP Industries witnessed a significant block trade on BSE involving 3.70 crore shares worth ₹1,381.29 crores at ₹372.95 per share during market opening.",
            "Sentiment": "neutral",
            "PublishDate": 1766548759919,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries Grants 1.2 Lakh Employee Stock Rights",
            "Summary": "VIP Industries' board committee approved granting 1,20,000 Employee Stock Appreciation Rights to eligible employees at ₹388 per share under its ESARP 2018 plan, with 15.74 lakh ESARs now vested.",
            "Sentiment": "positive",
            "PublishDate": 1766417825039,
            "Source": "co_actions_results"
        },
        {
            "Title": "VIP Industries Appoints New Chief Marketing Officer",
            "Summary": "VIP Industries Limited has appointed Mr. Sameer Wanchoo as Chief Marketing Officer and part of Senior Management Team effective December 22, 2025, following Board approval.",
            "Sentiment": "positive",
            "PublishDate": 1766415708620,
            "Source": "stocks"
        },
        {
            "Title": "VIP Industries' Credit Rating Downgraded by Crisil on Rs 424 Crore Bank Facilities",
            "Summary": "Crisil Ratings downgraded VIP Industries' long-term rating to Crisil A-/Negative from Crisil AA-/Negative and short-term rating to Crisil A1 from Crisil A1+ on Rs 424 crore total bank loan facilities. The rating revision follows Crisil's review of the company's financial results, affecting multiple banking relationships including Kotak Mahindra Bank, YES Bank, HSBC, Qatar National Bank, Federal Bank, and Axis Bank.",
            "Sentiment": "negative",
            "PublishDate": 1764237030753,
            "Source": "stock"
        },
        {
            "Title": "Multiples Private Equity Funds Complete Open Offer for V.I.P. Industries Limited",
            "Summary": "Multiples Private Equity Fund LV and Multiples Private Equity Gift Fund IV, along with persons acting in concert, completed their open offer to acquire up to 3,70,56,229 equity shares representing 26.03% of V.I.P. Industries Limited from public shareholders. The offer closed on November 17, 2025, with JM Financial Limited serving as the manager to the offer and KFin Technologies Limited as the registrar.",
            "Sentiment": "neutral",
            "PublishDate": 1764148051745,
            "Source": "order&deals"
        },
        {
            "Title": "VIP Industries Sells Mumbai Property to Promoter Group for ₹40.71 Crore",
            "Summary": "VIP Industries has signed a binding agreement to sell its 'VIP House' property in Mumbai to promoter-group entity Kemp & Company for ₹40.71 crore. The transaction involves the sale of the company's Mumbai-based property to an entity within its promoter group structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763679212530,
            "Source": "corporate_action"
        },
        {
            "Title": "VIP Industries Seeks Shareholder Approval for Board Appointments and Increased Borrowing Limits",
            "Summary": "VIP Industries has issued a postal ballot notice seeking member approval for appointing five new directors including Renuka Ramnath as Chairperson and Atul Jain as Managing Director, along with setting remuneration terms. The company also proposes to increase borrowing limits to ₹625 crore to support working capital requirements and growth plans, with voting scheduled from November 19 to December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763461769190,
            "Source": "corporate_action"
        },
        {
            "Title": "VIP Industries Reports Quarterly Loss of Rs 139 Crores Amid Inventory Provisions and Fire Damage",
            "Summary": "VIP Industries posted a standalone net loss of Rs 139.03 crores for the quarter ended September 30, 2025, compared to Rs 23.33 crores loss in the previous quarter, with consolidated loss at Rs 143.14 crores. The company faced significant inventory provisions of Rs 45.51 crores during the quarter and exceptional losses from fire damage at its Guwahati warehouse, while also completing a major shareholding change with Multiples Private Equity Fund acquiring 32% stake.",
            "Sentiment": "negative",
            "PublishDate": 1763121569011,
            "Source": "earnings"
        },
        {
            "Title": "VIP Industries Promoters Sell 6.2% Stake for ₹343 Crore in Block Deal",
            "Summary": "Promoters of VIP Industries sold a 6.2% stake through a block deal worth ₹343 crore. Piramal Vibhuti Investments and Kiddy Plast offloaded 88.4 lakh shares at ₹388.2 per share. Multiples Private Equity Fund acquired 60 lakh shares for ₹233 crore, while Samvibhag Securities bought 22 lakh shares for ₹86 crore. This follows a major July transaction where a consortium including Multiples Private Equity Fund IV, Samvibhag Securities, and Mithun and Siddhartha Sacheti acquired a 32% stake from promoters. The consortium announced a mandatory open offer for an additional 26% stake, spending ₹1,437 crore to buy up to 3.7 crore shares at ₹388 each, bringing the total transaction value for a 58% stake to ₹3,200 crore. The company also announced leadership changes with managing director Neetu Kashiramka's resignation effective from September 23, though she will continue until October 31, 2025. Atul Jain has been appointed as the new managing director for a five-year term starting September 23. VIP Industries shares closed 3.7% lower at ₹410.35.",
            "Sentiment": "neutral",
            "PublishDate": 1758902053434,
            "Source": "order&deals"
        },
        {
            "Title": "VIP Industries Appoints Atul Jain as Managing Director, Neetu Kashiramka Resigns",
            "Summary": "VIP Industries' Board of Directors appointed Atul Jain as Managing Director for a five-year term starting September 23, 2025, subject to shareholder approval. Neetu Kashiramka resigned from her Managing Director position effective from the close of the board meeting, though she will remain employed with the company until October 31, 2025. Her resignation is linked to an acquisition by Multiples Group. Jain, an alumnus of IIT-Delhi and IIM-Calcutta, previously served as Senior Director at Samsung Electronics global headquarters in South Korea and held roles at companies including Aptech Ltd., Coca-Cola, Godfrey Phillips India Ltd., and Bharti Airtel. He is not related to any current directors of the company and has been authorized to determine materiality of events for stock exchange disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1758625749903,
            "Source": "corporate_governance"
        },
        {
            "Title": "VIP Industries Appoints New Board Members Following Multiples Group Acquisition",
            "Summary": "VIP Industries announced major board changes following the acquisition of management control by Multiples Group. The company appointed Ms. Renuka Ramnath as Additional Director and Chairperson, along with three other directors: Mr. Sridhar Sankararaman, Ms. Shalini D. Piramal, and Mr. Rajendra Agarwal as Additional Directors. Simultaneously, four directors resigned including Chairman Mr. Dilip Piramal, Vice-Chairperson Ms. Radhika Piramal, Executive Director Mr. Ashish Saha, and Independent Director Mr. Ramesh Damani. Mr. Dilip Piramal was appointed as Chairman Emeritus on an honorary basis for life. The changes took effect on September 23, 2025, as Multiples Private Equity Fund IV and Multiples Private Equity Gift Fund IV gained the right to nominate majority directors and acquired control of the company. The board restructuring follows a Share Purchase Agreement and Shareholders' Agreement that received Competition Commission of India approval on August 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758621313087,
            "Source": "corporate_governance"
        },
        {
            "Title": "CCI Approves PE Funds' Stake Purchase in V.I.P. Industries Through Samvibhag Securities",
            "Summary": "The Competition Commission of India has approved multiple private equity funds to purchase stakes in V.I.P. Industries through Samvibhag Securities and other entities. The approval enables the transaction to proceed under regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1756214959323,
            "Source": "order&deals"
        },
        {
            "Title": "VIP Industries Reports 12% Revenue Decline in Q1 FY26 Due to E-commerce Channel Challenges",
            "Summary": "VIP Industries Limited reported a 12% revenue decline in Q1 FY26, marking the first time in five quarters that volume growth became a concern. The company's e-commerce channel, which previously delivered higher double-digit growth, de-grew by 17% due to competitive intensity from new market entrants selling cabin luggage at prices below Rs. 1,100. Modern trade also declined as one large retail chain consolidated and reduced store count. Despite revenue challenges, the company maintained an adjusted EBITDA margin of 10% (excluding one-time costs of Rs. 10-11 crore and Rs. 15 crore inventory provision). Carlton brand showed double-digit growth, continuing the premiumization strategy, while Bangladesh operations achieved 80% capacity utilization and generated Rs. 8 crore operating profit versus Rs. 11 crore loss in the previous year. The company received Rs. 7 crore in insurance claims with Rs. 30 crore still pending. Management noted they are in a transition phase with upcoming shareholder changes and refrained from discussing future strategic plans.",
            "Sentiment": "negative",
            "PublishDate": 1755009033469,
            "Source": "earnings"
        },
        {
            "Title": "V.I.P. Industries Reports 12% Revenue Decline and Volume Drop in Q1 FY26",
            "Summary": "V.I.P. Industries reported revenues of Rs. 561 crores for Q1 FY26, marking a 12% decline from Rs. 639 crores in Q1 FY25. The company experienced its first volume de-growth in 5 quarters at -8%, with 4,554,000 units sold. The company posted a loss before tax of Rs. 17 crores compared to a profit of Rs. 4 crores in the previous year. EBITDA margin dropped to 5.2% from 8% in Q1 FY25. However, when adjusted for one-time inventory provisions and other expenses totaling 5%, the normalized EBITDA margin would be 10.2%. Gross margin stood at 45%, but normalized gross margin without inventory provision was 48%. The company attributed the decline to a sudden drop in secondary sales, particularly in e-commerce. Bangladesh operations showed improvement, reporting a profit of Rs. 8 crores versus a loss of Rs. 11 crores in the previous year. Hard luggage category increased its share to 63% from 56%, while the company maintained its market position across various channels including general trade (26%), modern trade (26%), and e-commerce (19%).",
            "Sentiment": "negative",
            "PublishDate": 1754557064859,
            "Source": "stock"
        },
        {
            "Title": "V.I.P. Industries Reports Q1 Loss of 131M Rupees, Revenue Drops to 5.61B",
            "Summary": "V.I.P. Industries reported quarterly results showing a net loss of 131 million rupees compared to a profit of 40.4 million rupees in the same period last year. Revenue declined to 5.61 billion rupees from 6.39 billion rupees year-over-year. EBITDA fell to 246.5 million rupees from 493 million rupees, while EBITDA margin compressed to 4.39% from 7.72% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754485756792,
            "Source": "earnings"
        },
        {
            "Title": "V.I.P. Industries Receives Supreme Court Relief in Carlton Trademark Dispute",
            "Summary": "V.I.P. Industries received a Supreme Court order that allows the company to deal with inventory of products under the Carlton trademark, subject to specific terms. The Supreme Court disposed of V.I.P.'s Special Leave Petition and directed the company to submit an undertaking. The court also instructed the Delhi High Court to expedite the resolution of civil suits between V.I.P. Industries and Carlton Shoes Ltd. This development follows the Delhi High Court's earlier dismissal of V.I.P.'s appeal against an interim order that had restricted the company from conducting travel luggage business under the Carlton trademark. The company stated there are presently no expected financial implications beyond what was mentioned.",
            "Sentiment": "positive",
            "PublishDate": 1754371011446,
            "Source": "stock"
        },
        {
            "Title": "Multiples Equity-Led Consortium Seeks Regulatory Approval to Acquire 32% Stake in VIP Industries",
            "Summary": "A consortium led by Multiples Equity has sought approval from the Competition Commission of India (CCI) to acquire a 32% stake in luggage maker VIP Industries. The consortium includes Multiples Private Equity Fund IV, Multiples Private Equity Gift Fund IV, Samvibhag Securities, Caratlane founder Mithun Padam Sacheti, his brother Siddhartha Sacheti, and Profitex Shares and Securities. Dilip Piramal and Family, the promoters of VIP Industries, announced they will sell up to 32% of their stake to the consortium. The transaction will trigger an open offer to acquire an additional 26% from the open market, with total consideration of Rs 1,437.78 crore assuming full acceptance. After completion, control will transfer to Multiples Private Equity while Dilip Piramal will become Chairman Emeritus. VIP Industries, with a market capitalization of Rs 6,389.47 crore, owns brands including Aristocrat, VIP, Carlton, Skybags, and Caprese, and held over 50% market share in the branded luggage market in FY24. The company reported revenue of Rs 2,169.66 crore for the financial year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753619241774,
            "Source": "order&deals"
        },
        {
            "Title": "Multiples Private Equity Funds Launch ₹1,438 Crore Open Offer for V.I.P. Industries at ₹388 Per Share",
            "Summary": "Multiples Private Equity Fund IV and Multiples Private Equity Gift Fund IV have announced an open offer to acquire up to 26% of V.I.P. Industries Limited's expanded share capital at ₹388 per share, totaling approximately ₹1,437.78 crores. The offer follows a share purchase agreement where the acquirers will purchase equity shares from existing promoters including DGP Securities Limited and other seller entities. The mandatory open offer is triggered by the substantial acquisition of shares and control over the luggage manufacturer. The offer price represents the highest of parameters under SEBI regulations, including the negotiated price under the share purchase agreement. The tendering period is expected to commence on September 4, 2025, and close on September 18, 2025. Post-transaction, the acquirers will hold up to 31.89% of the expanded share capital and gain control of V.I.P. Industries, which manufactures luggage under brands like VIP, Skybags, and Aristocrat.",
            "Sentiment": "neutral",
            "PublishDate": 1753446274525,
            "Source": "order&deals"
        },
        {
            "Title": "Amit Jatia to Step Down as Independent Director of V.I.P. Industries After Completing Second Term",
            "Summary": "Amit Jatia will cease to be a Non-Executive, Independent Director of V.I.P. Industries Limited on July 23, 2025, upon completion of his second five-year term. Jatia was re-appointed for his second consecutive term from July 24, 2020 to July 23, 2025, which was approved by company members at the 53rd Annual General Meeting held on August 05, 2020. His membership and chairmanship in various board committees will also end on the same date. The Board of Directors and Management acknowledged Jatia's contributions, guidance and services during his tenure as Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1753268244674,
            "Source": "corporate_governance"
        },
        {
            "Title": "V.I.P. Industries Appoints Sumit Gupta as Vice President - Sales Head",
            "Summary": "V.I.P. Industries Limited appointed Sumit Gupta as Vice President - Sales Head and part of the Senior Management Team, effective July 22, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. This follows an interim arrangement where Akash Shukla, Vice President – Human Resources, had taken additional responsibilities in Sales & Customer Relationship Management from April 1, 2025, while the company searched for a full-time replacement. Gupta holds a Bachelor's degree in Science with specialization in Electronics from the University of Jammu and Post Graduate Diploma in Business Management from NIILM, New Delhi. His previous role was Chief Sales Officer at Welspun Global Brands Limited, and he has worked with organizations including Pepsico India Holdings Private Limited, Samsonite South Asia Private Limited, Hindalco Industries Limited and Apollo Tyres Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753190105374,
            "Source": "corporate_governance"
        },
        {
            "Title": "VIP Industries: Analyst Projects 11% EBITDA Margin by FY26",
            "Summary": "Jinesh Joshi of Prabhudas Lilladher Capital expects VIP Industries to achieve an 11% EBITDA margin in FY26 due to cost-resetting after inventory liquidation. The company plans to divest up to 32% promoter stake to a consortium. Joshi anticipates a potential turnaround with new management, projecting 14-15% EBITDA margins by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1752712895000,
            "Source": "normal_news"
        },
        {
            "Title": "VIP Industries: Promoter Group to Sell 32% Stake to Private Equity Investors",
            "Summary": "VIP Industries' promoter group plans to sell a 32% stake to multiple private equity investors, reducing their shareholding from 51.73% to 19.73%. The sale will be followed by an open offer for an additional 26% stake. The stock fell over 5% on the news.",
            "Sentiment": "negative",
            "PublishDate": 1752465522000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vip Industries Announces Leadership Changes and Open Offer",
            "Summary": "Vip Industries has announced two significant developments. Firstly, Dilip Piramal has been appointed as Chairman Emeritus. Secondly, the company has launched an open offer to acquire a 26% stake at a price of ₹388 per share.",
            "Sentiment": "positive",
            "PublishDate": 1752462727000,
            "Source": "default"
        },
        {
            "Title": "VIP Industries: Piramal Family to Sell Up to 32% Stake to Multiples Consortium",
            "Summary": "Dilip Piramal and his family have agreed to sell up to 32% of their stake in VIP Industries to a consortium led by Multiples. This represents a significant change in ownership for the luggage manufacturer. The news indicates a major corporate action involving a substantial portion of the company's shares changing hands.",
            "Sentiment": "neutral",
            "PublishDate": 1752456905000,
            "Source": "default"
        },
        {
            "Title": "VIP Industries: Promoters to Sell 32% Stake to Private Equity Investors",
            "Summary": "Promoter group entities of VIP Industries plan to sell 32% stake to private equity investors, reducing their shareholding from 51.73% to 19.73%. The sale will trigger an open offer for an additional 26% stake. Multiples Private Equity Fund IV and others are identified as purchasers, potentially acquiring management control.",
            "Sentiment": "neutral",
            "PublishDate": 1752425076000,
            "Source": "corporate_action"
        },
        {
            "Title": "V I P Industries Clarifies Report on Promoters' Stake Sale Discussions",
            "Summary": "V I P Industries has issued a clarification regarding reports about promoters discussing a potential stake sale. The company stated that there are no significant developments requiring disclosure at this time. This suggests that while discussions may have occurred, no concrete decisions or actions have been taken that would necessitate a formal announcement to shareholders or the market.",
            "Sentiment": "neutral",
            "PublishDate": 1752238455000,
            "Source": "default"
        },
        {
            "Title": "Private Equity Investors Eyeing VIP Industries",
            "Summary": "Private equity investors, including Multiples PE, are expected to compete for VIP Industries. No further details about the competition or potential deal are provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752217660000,
            "Source": "default"
        },
        {
            "Title": "VIP Industries Promoters Consider Selling Stake",
            "Summary": "The promoters of VIP Industries are reportedly considering selling their stake in the company. No further details about the potential sale or the reasons behind it were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752217581000,
            "Source": "default"
        },
        {
            "Title": "Private Equity Firms Show Interest in VIP Industries Stake",
            "Summary": "According to a report by Mint, multiple private equity firms have expressed interest in acquiring a stake in VIP Industries, a leading luggage manufacturer. This interest suggests strong investor confidence in the company's growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1750736593000,
            "Source": "default"
        },
        {
            "Title": "VIP Industries: CRISIL Revises Bank Loan Outlook to Negative, Stock Surges",
            "Summary": "CRISIL Ratings revised VIP Industries' long-term bank loan outlook to negative from stable, citing lower growth and falling average selling prices. The company's Q4 FY2025 net loss widened to ₹27.4 crore. Despite this, VIP Industries' stock surged 12.2% on June 11.",
            "Sentiment": "neutral",
            "PublishDate": 1749631723000,
            "Source": "corporate_governance"
        },
        {
            "Title": "VIP Industries: Q4 Loss Widens Amid Revenue Decline and Margin Pressure",
            "Summary": "VIP Industries reported a net loss of ₹27.4 crore for Q4 FY2025, wider than the ₹23.9 crore loss a year ago. Revenue fell 4.3% to ₹494 crore, while EBITDA decreased 18.2% to ₹6.3 crore. Margins contracted to 1.3% from 1.5% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747144493000,
            "Source": "earnings"
        },
        {
            "Title": "V.I.P. Industries Reports Increased Q4 Net Loss",
            "Summary": "V.I.P. Industries has reported a consolidated net loss of 274 million rupees for Q4, compared to a loss of 239 million rupees in the same quarter last year. The loss has widened from 124 million rupees in the previous quarter. The company's Q4 revenue decreased to 4.9 billion rupees from 5.16 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747142065000,
            "Source": "result"
        },
        {
            "Title": "VIP Industries to Consider Q4 Results on May 13",
            "Summary": "VIP Industries has announced that it will consider its fourth quarter (Q4) financial results on May 13. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746619304000,
            "Source": "default"
        },
        {
            "Title": "V.I.P. Industries Reports Increased Net Loss in Q3",
            "Summary": "V.I.P. Industries experienced a significant increase in net loss for the third quarter. The company reported a consolidated net loss of 124 million rupees, compared to a loss of 71 million rupees in the same quarter of the previous year. This represents a year-over-year increase in losses. Additionally, the loss widened from 331 million rupees in the previous quarter. Revenue for Q3 stood at 5 billion rupees, down from 5.46 billion rupees in the same period last year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1738109877000,
            "Source": "earnings"
        },
        {
            "Title": "V.I.P. Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "V.I.P. Industries has reported a significant decrease in its third-quarter EBITDA, which fell to 285 million rupees from 520 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 5.69% from 9.52% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738064569000,
            "Source": "earnings"
        },
        {
            "Title": "V.I.P. Industries Reports Q3 Financial Results",
            "Summary": "V.I.P. Industries has reported its Q3 financial results. The company experienced a consolidated net loss of 124 million rupees, compared to a loss of 71 million rupees in the same quarter last year. This represents a year-over-year increase in losses. Sequentially, the loss has widened from 331 million rupees in the previous quarter. Revenue for Q3 stood at 5 billion rupees, down from 5.46 billion rupees in the same period last year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1738064507000,
            "Source": "earnings"
        },
        {
            "Title": "VIP Industries Ltd: Block Trade of 588,797 Shares",
            "Summary": "A block trade of approximately 588,797 shares of VIP Industries Ltd took place on the National Stock Exchange (NSE) for a total value of Rs. 28.48 crores. The trade was executed at a price of Rs. 483.75 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1735888402000,
            "Source": "block_deals"
        },
        {
            "Title": "VIP Industries: Maharashtra Tribunal Grants Rs 358-Crore Tax Refund",
            "Summary": "VIP Industries received a favorable ruling from the Maharashtra Sales Tax Tribunal, resulting in a Rs 357.56 crore refund. The tribunal set aside previous orders disallowing branch transfer claims and allowed the company's stock transfer claims for FY 2009-10 to 2017-18.",
            "Sentiment": "positive",
            "PublishDate": 1734521271000,
            "Source": "corporate_action"
        },
        {
            "Title": "VIP Industries Wins Tax Case Worth 360 Crore Rupees",
            "Summary": "VIP Industries has received a favorable order from the Maharashtra Sales Tax Tribunal regarding a tax litigation case. The order is in the company's favor and involves a disputed amount of 360 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734515751000,
            "Source": "order&deals"
        },
        {
            "Title": "VIP Industries Receives Favorable Order from Maharashtra Sales Tax Tribunal",
            "Summary": "VIP Industries has received a favorable order from the Maharashtra Sales Tax Tribunal. This decision likely resolves a tax-related dispute in the company's favor, potentially impacting its financial obligations or tax liabilities in the state of Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1734515660000,
            "Source": "order&deals"
        },
        {
            "Title": "VIP Industries Considers Private Equity Infusion",
            "Summary": "According to Investec's management meeting takeaways, VIP Industries' management has indicated that discussions for a potential private equity infusion are still ongoing. This suggests that the company is exploring options for additional capital investment.",
            "Sentiment": "neutral",
            "PublishDate": 1733804280000,
            "Source": "corporate_action"
        },
        {
            "Title": "Advent International Considering Controlling Stake in VIP Industries",
            "Summary": "According to a report by Mint, private equity firm Advent International is exploring the possibility of acquiring a controlling stake in VIP Industries, a leading luggage manufacturer in India.",
            "Sentiment": "neutral",
            "PublishDate": 1732154705000,
            "Source": "corporate_action"
        },
        {
            "Title": "V.I.P. Industries Reports Q2 EBITDA Loss",
            "Summary": "V.I.P. Industries has reported an EBITDA loss of 21.8 million rupees in the second quarter, compared to a profit of 529 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1729687764000,
            "Source": "result"
        }
    ]
}