{
    "Symbol": "VIPULLTD",
    "ISIN": "INE946H01037",
    "News": [
        {
            "Title": "Vipul Limited Board Meeting Set for February 14, 2026",
            "Summary": "Vipul Limited announces board meeting on February 14, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 01 to February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770479229670,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vipul Limited EGM Approves Warrant Issuance",
            "Summary": "Vipul Limited shareholders approved the issuance of up to 10.85 crore fully convertible warrants on preferential basis with 99.98% votes in favour at the EGM held on January 08, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767962220021,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vipul Limited Approves ₹99.82 Cr Warrant Issue",
            "Summary": "Vipul Limited's board approved issuance of up to 10.85 crore fully convertible warrants worth ₹99.82 crores at ₹9.20 per warrant to promoter and public categories, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1765543485870,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vipul Limited Gets NCLT Interim Relief in Dispute",
            "Summary": "NCLT New Delhi grants interim order restraining Tanamera Developments from asset disposal and directing status quo maintenance in Company Petition filed by Vipul Limited under oppression and mismanagement provisions.",
            "Sentiment": "positive",
            "PublishDate": 1765458656548,
            "Source": "stocks"
        },
        {
            "Title": "Vipul Limited Reports Mixed Quarterly Results and Board Changes",
            "Summary": "Vipul Limited approved unaudited financial results for the quarter and half year ended September 30, 2025, showing revenue from operations of Rs. 794.50 lakhs for the quarter with a profit of Rs. 181 lakhs. The company also accepted the resignation of Ms. Vishaka Beriwala as Non-Executive Non-Independent Director effective September 23, 2025, due to professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1763459071533,
            "Source": "earnings"
        },
        {
            "Title": "Vipul Limited Reports Q2 Profit of Rs 217.18 Lakhs, Director Vishaka Beriwala Resigns",
            "Summary": "Vipul Limited posted unaudited standalone profit of Rs 217.18 lakhs for Q2 ended September 30, 2025, compared to loss of Rs 67.87 lakhs in previous quarter, with revenue from operations at Rs 794.50 lakhs. Non-Executive Director Vishaka Beriwala resigned effective September 23, 2025, citing pre-occupations and professional commitments restricting adequate time devotion to company affairs.",
            "Sentiment": "positive",
            "PublishDate": 1763201559031,
            "Source": "earnings"
        },
        {
            "Title": "Vipul Limited Announces Board Appointments and Re-appointments Including Managing Director Extension",
            "Summary": "Vipul Limited announced several key board changes during a members' meeting held on September 23, 2025. The company re-appointed Mr. Punit Beriwala as Managing Director and CEO for a three-year term from April 1, 2026 to March 31, 2029. Beriwala, aged 61, is a commerce graduate with 37 years of experience including 23 years in real estate, and has served as Executive Director since 2002. The company also appointed two new Non-Executive Independent Directors: Mr. Rajeev Gupta and Mrs. Dolly Singhal, both for five-year terms from September 23, 2025 to September 22, 2030. Gupta brings nearly 20 years of real estate leadership experience with major companies including ALC Group, Emaar MGF, and Parsvnath Developers. Singhal holds qualifications in education and commerce with experience in accounting and marketing. Additionally, M/s AVA Associates was appointed as Secretarial Auditor for a five-year period from FY2025-26 to FY2029-30. The firm, established in 2003, specializes in corporate legal and taxation matters.",
            "Sentiment": "positive",
            "PublishDate": 1758628765177,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vipul Limited Approves Draft Letter of Offer for Rights Issue Worth Up to INR 49.75 Crores",
            "Summary": "Vipul Limited's Right Issue Committee approved the Draft Letter of Offer for a rights issue of fully paid-up equity shares with face value of INR 1 each to existing shareholders. The rights issue aims to raise funds aggregating up to INR 49.75 crores. The company will submit the draft to BSE Limited and National Stock Exchange of India Limited for in-principle approval. The specific price and right entitlement ratio will be decided by the Board of Directors at a later date. The committee meeting was held on February 28, 2025, lasting from 4:00 p.m. to 4:30 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1757083389406,
            "Source": "corporate_action"
        },
        {
            "Title": "Vipul Limited Reports Q1 FY2026 Loss, Appoints New Company Secretary, Schedules AGM",
            "Summary": "Vipul Limited approved its unaudited financial results for the first quarter ended June 30, 2025. The company reported a standalone net loss of Rs. 103.68 lakhs compared to a profit of Rs. 232.16 lakhs in the same quarter last year. Revenue from operations declined to Rs. 169.32 lakhs from Rs. 1,492.98 lakhs year-over-year. On a consolidated basis, the company posted a net loss of Rs. 142.18 lakhs versus a profit of Rs. 180.92 lakhs in the previous year. The Board appointed Mr. Piyush Bairagi as Company Secretary and Compliance Officer. The company scheduled its 34th Annual General Meeting for September 23, 2025, with e-voting from September 19-22, 2025. The Board deferred its proposed fund raising through preferential issue until deemed appropriate. The company is pursuing a scheme of amalgamation with five wholly owned subsidiaries before NCLT Delhi, with the matter listed for August 26, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1755177174581,
            "Source": "earnings"
        },
        {
            "Title": "Vipul Ltd Sells Partial Stake in High-Class Projects",
            "Summary": "Vipul Ltd has sold half of its stake in High-Class Projects for ₹4.38 crores. As a result of this transaction, High-Class Projects will now be classified as an associate company of Vipul Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1750650116000,
            "Source": "default"
        },
        {
            "Title": "Vipul Ltd: Small-Cap Stock Announces ₹49.75 Crore Rights Issue",
            "Summary": "Vipul Ltd, trading under ₹50, plans to raise up to ₹49.75 Crores through a rights issue. The company's Right Issue Committee approved the Draft Letter of Offer on February 28, 2025, subject to stock exchange approvals. The issue will offer fully paid-up equity shares of ₹1 each to eligible existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1740981424000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vipul Ltd Approves Fundraising via Share Issue",
            "Summary": "Vipul Ltd has approved raising funds through the issuance of shares for up to 497.5 million rupees. This decision indicates the company's intent to increase its capital, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1733824970000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vipul Reports Profitable Q2 with Revenue Growth",
            "Summary": "Vipul, a company, has reported a significant turnaround in its financial performance for the second quarter. The company posted a net profit of 11.4 million rupees, compared to a loss of 171 million rupees in the same quarter last year. This also represents an improvement from the previous quarter's profit of 18.1 million rupees. Additionally, Vipul's revenue for Q2 increased to 157 million rupees, up from 75 million rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731026828000,
            "Source": "result"
        }
    ]
}