{
    "Symbol": "VIRINCHI",
    "ISIN": "INE539B01017",
    "News": [
        {
            "Title": "Virinchi Limited Q3FY26 Results Show Strong Growth",
            "Summary": "Virinchi Limited reported robust Q3FY26 performance with standalone net profit surging 152.67% YoY to ₹838.42 lacs. Revenue from operations grew 19.22% to ₹4,283.70 lacs, driven by strong SAAS business performance.",
            "Sentiment": "positive",
            "PublishDate": 1770219243708,
            "Source": "co_actions_results"
        },
        {
            "Title": "Virinchi Allots 10.50 Lakh Equity Shares on Warrant Conversion",
            "Summary": "Virinchi Limited allotted 10,50,000 equity shares at Rs.25 per share on conversion of warrants issued on preferential basis to Manumon Chettiar, raising Rs.1,96,87,500 and increasing share capital to Rs.103,69,68,960.",
            "Sentiment": "positive",
            "PublishDate": 1769883214726,
            "Source": "co_actions_results"
        },
        {
            "Title": "Virinchi Board Meet Set for Feb 4 to Review Q3 Results",
            "Summary": "Virinchi Limited has scheduled a board meeting on February 04, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769755885264,
            "Source": "co_actions_results"
        },
        {
            "Title": "Virinchi Board Approves Postal Ballot for Promoter Investment",
            "Summary": "Virinchi Limited's board approved seeking shareholder consent via postal ballot for promoter Mr. Viswanath Kompella's investment of ₹7.83 crores through convertible equity warrants in subsidiary Virinchi Health Care Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1768921587485,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vivo Bio Tech acquires 15.59% stake in Virinchi",
            "Summary": "Vivo Bio Tech Limited acquired 1.60 crore convertible equity warrants in Virinchi Limited through preferential allotment, representing 15.59% of total share capital and 12.69% of diluted capital.",
            "Sentiment": "positive",
            "PublishDate": 1768209581257,
            "Source": "co_actions_results"
        },
        {
            "Title": "Virinchi Allots ₹20.72 Cr Convertible Warrants",
            "Summary": "Virinchi Limited allotted 74 lakh convertible equity warrants worth ₹20.72 crores to promoter group entity Vivo Bio Tech Limited at ₹28 per warrant on preferential basis.",
            "Sentiment": "positive",
            "PublishDate": 1767940778248,
            "Source": "co_actions_results"
        },
        {
            "Title": "Virinchi Limited Promoter Releases Pledge on 39.07 Lakh Equity Shares",
            "Summary": "Viswanath Kompella, promoter of Virinchi Limited, released pledge on 39,06,679 equity shares through CSB Bank Limited on November 26, 2025. The promoter's total shareholding remains unchanged at 15.93% of total share capital, with encumbered shares reducing from 7.77% to 3.96%.",
            "Sentiment": "positive",
            "PublishDate": 1764327128867,
            "Source": "corporate_action"
        },
        {
            "Title": "Virinchi Limited Conducts EGM to Approve Convertible Equity Warrants and Revise Promoter Remuneration",
            "Summary": "Virinchi Limited held an Extra-Ordinary General Meeting on November 15, 2025, via video conferencing with 59 public members present to vote on issuing convertible equity warrants to identified promoter and non-promoter entities on preferential basis. The meeting also addressed revision in remuneration of promoter Chairman Emeritus Mr. Viswanath Kompella as an advisor, with voting results to be announced by November 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763208464050,
            "Source": "corporate_action"
        },
        {
            "Title": "Virinchi Limited Reports Mixed Performance with Standalone Profit but Consolidated Loss for September Quarter",
            "Summary": "Virinchi Limited's Board approved quarterly results showing standalone net profit of Rs 756.71 lakhs but consolidated net loss of Rs 1,366.64 lakhs for the quarter ended September 30, 2025. The technology company operates across SaaS Business, IDC IT Services, Healthcare Services and Payment Credit Services through 13 subsidiaries including Virinchi Healthcare and KSoft Systems.",
            "Sentiment": "neutral",
            "PublishDate": 1763054872065,
            "Source": "earnings"
        },
        {
            "Title": "Virinchi Ltd Board Approves Rs 56 Crore Fundraising Through Convertible Warrants",
            "Summary": "Virinchi Ltd's Board approved raising up to Rs 56 crore through preferential issue of 2 crore convertible equity warrants at Rs 28 per warrant. The allocation includes 1.6 crore warrants to promoter group entity Vivo Bio Tech Limited and 40 lakh warrants to IT Peer Technologies LLC. The warrants are convertible into equity shares within 18 months from allotment date. Post-conversion, promoter shareholding would increase from 37.51% to 44.44%, while public shareholding would decrease from 62.49% to 55.56%. The Board also approved revision in remuneration for Chairman Emeritus Mr. Viswanath Kompella and scheduled an Extraordinary General Meeting for November 15, 2025, to seek shareholder approval for these proposals.",
            "Sentiment": "positive",
            "PublishDate": 1760536182119,
            "Source": "corporate_action"
        },
        {
            "Title": "Virinchi Limited Schedules Board Meeting to Discuss SaaS Business Restructuring and Debt Reduction Strategy",
            "Summary": "Virinchi Limited has scheduled a Board of Directors meeting for August 22, 2025, to discuss strategic business restructuring plans. The agenda includes restructuring the SaaS business into a 100% subsidiary through a slump sale to create a focused SaaS entity and unlock long-term shareholder value. The company also plans to divest a portion of the SaaS business through private investment, strategic partnerships, or IPO. The proceeds from the divestment will be used to reduce debt at the consolidated level and invest in the oncology healthcare vertical to expand the Virinchi hospital chain.",
            "Sentiment": "positive",
            "PublishDate": 1755517794618,
            "Source": "corporate_action"
        },
        {
            "Title": "Virinchi Limited Approves Q1 FY26 Results, Considers Strategic Options for Fin-Tech SaaS Vertical",
            "Summary": "Virinchi Limited's Board approved audited standalone and consolidated financial results for the quarter ended June 30, 2025. The Board discussed strategic evaluation of its high EBITDA Fin-Tech SaaS vertical 'QFund', which serves US-based alternative lenders. Two key options are under consideration: restructuring the SaaS business into a 100% subsidiary via slump sale to unlock shareholder value, or divesting a portion through private investment, strategic partnerships, or IPO. Proceeds from any divestment would be used to reduce consolidated debt and invest in the oncology healthcare vertical to expand the Virinchi hospital chain. A follow-up Board meeting is scheduled for August 22, 2025, to deliberate further on these strategic options.",
            "Sentiment": "positive",
            "PublishDate": 1755187196302,
            "Source": "earnings"
        },
        {
            "Title": "Virinchi Limited Reports Partial Release of 2.5 Crore Pledged Shares by Badjate Stock Broking",
            "Summary": "Virinchi Limited disclosed the partial release of 25,00,000 pledged equity shares by Badjate Stock Broking Pvt Ltd on August 13, 2025. The release was reported by promoter Viswanath Kompella under SEBI regulations for substantial acquisition of shares and takeovers. Following this release, the promoter's shares carrying voting rights increased to 83,78,209 shares (8.16% of total capital), while encumbered shares decreased to 79,72,679 shares (7.77% of total capital). The total holding remained at 1,63,50,888 shares representing 15.93% of the company's total voting capital. The transaction was executed off-market through release of pledge in depository mode. Virinchi Limited's equity share capital stands at 10,26,46,896 shares of Rs. 10 each, with a diluted share capital of 10,86,01,536 shares including outstanding ESOPs.",
            "Sentiment": "neutral",
            "PublishDate": 1755152536086,
            "Source": "corporate_action"
        },
        {
            "Title": "Virinchi Limited Allots 34 Lakh Convertible Equity Warrants to 12 Public Investors at Rs 25 Per Warrant",
            "Summary": "Virinchi Limited has allotted 34,00,000 convertible equity warrants at Rs 25 per warrant on a preferential basis to 12 public investors. The allotment was approved by the Stakeholders Relationship Committee following shareholder approval at an Extra-Ordinary General Meeting and stock exchange clearances from BSE and NSE. The warrants have a face value of Rs 10 and premium of Rs 15, with investors paying 25% of the issue price upfront (Rs 6.25 per warrant). The company received Rs 2.12 crore as subscription amount. The warrants are convertible into equal number of equity shares within 18 months upon payment of the remaining 75% (Rs 18.75 per warrant). Manumon Chettiar received the largest allocation of 10.5 lakh warrants, while Dwight Technologies Private Limited received 5 lakh warrants. The remaining 10 individual investors received allocations ranging from 1.5 lakh to 2.5 lakh warrants each. Post-conversion, the public shareholding would increase from 62.49% to 63.69%, while promoter shareholding would decrease from 37.51% to 36.31%.",
            "Sentiment": "positive",
            "PublishDate": 1754415362115,
            "Source": "corporate_action"
        },
        {
            "Title": "Virinchi Limited Reports Partial Release of 800,000 Pledged Shares by Badjate Stock Broking",
            "Summary": "Virinchi Limited disclosed the partial release of 800,000 pledged equity shares by Badjate Stock Broking Pvt Ltd on July 31, 2025. The release was made under SEBI regulations for substantial acquisition of shares and takeovers. Following this transaction, promoter Viswanath Kompella's shareholding structure changed, with shares carrying voting rights increasing to 58,78,209 (5.73% of total capital) while encumbered shares decreased to 1,04,72,679 (10.20% of total capital). The company's total equity share capital remains at 10,26,46,896 shares valued at Rs. 102,64,68,960. The transaction was executed off-market through release of pledge in depository.",
            "Sentiment": "neutral",
            "PublishDate": 1754283855260,
            "Source": "corporate_action"
        }
    ]
}