{
    "Symbol": "VISASTEEL",
    "ISIN": "INE286H01012",
    "News": [
        {
            "Title": "VISA Steel Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "VISA Steel Limited has scheduled its board meeting for February 4, 2026, to consider and approve Q3FY26 financial results. Trading window will remain closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1769684973400,
            "Source": "co_actions_results"
        },
        {
            "Title": "VISA Steel Allots Rs. 200 Crore Convertible Warrants to Promoter Group Entity",
            "Summary": "VISA Steel Limited allotted 5,00,00,000 fully convertible warrants to VISA Industries Limited, a promoter group member, at Rs. 40/- per warrant for total consideration of Rs. 2,00,00,00,000/-. The warrants can be converted to equity shares within 18 months upon payment of remaining 75% consideration, with no immediate change to the company's paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764158529092,
            "Source": "corporate_action"
        },
        {
            "Title": "VISA Steel Reports Rs 202.22 Million Loss for Q2 FY2025 Amid Debt Resolution Process",
            "Summary": "VISA Steel Limited posted a net loss of Rs 202.22 million for the quarter ended September 30, 2025, with revenue from operations at Rs 758.52 million, while the company's accumulated unprovided interest on borrowings reached Rs 14,044.87 million. The National Company Law Tribunal allowed withdrawal of the Corporate Insolvency Resolution Process application on September 26, 2025, and the company approved raising up to Rs 2,000 million through preferential warrant issue to VISA Industries Limited for debt repayment and corporate purposes.",
            "Sentiment": "negative",
            "PublishDate": 1763136223648,
            "Source": "earnings"
        },
        {
            "Title": "VISA Steel Limited Passes Resolution for Warrant Issuance to Promoter Group Company",
            "Summary": "VISA Steel Limited held an Extra-Ordinary General Meeting on November 2, 2025, where shareholders approved the issuance of up to 5 crore warrants convertible into equity shares to VISA Industries Limited, a member of the promoter group, on a preferential basis. The resolution was passed with requisite majority through remote e-voting and electronic voting during the meeting. The e-voting period was from October 30 to November 1, 2025, with the cut-off date set as October 24, 2025. CS Sachin Pilania served as the scrutinizer for the voting process. The voting results and scrutinizer's report have been submitted to stock exchanges and will be made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762236899485,
            "Source": "corporate_action"
        },
        {
            "Title": "VISA Steel Ltd Receives Consent to Operate from Odisha State Pollution Control Board",
            "Summary": "VISA Steel Ltd has received grant of Consent to Operate from the State Pollution Control Board, Odisha, through an order dated September 6, 2025. The company disclosed this development in compliance with regulatory requirements, referencing a previous disclosure made on July 11, 2025. The consent relates to the company's operational permissions from the environmental regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1757164935792,
            "Source": "stock"
        },
        {
            "Title": "VISA Steel Reports Strong Turnaround with 27.3% Revenue Growth and Return to Profitability",
            "Summary": "VISA Steel Limited reported total income from operations of ₹1,718.51 crore in Q1 FY2026, representing a 27.3% year-on-year increase from ₹1,349.65 crore in Q1 FY2025. The company achieved a significant turnaround in profitability, posting a net profit of ₹43.22 crore compared to a loss of ₹69.14 crore in the same quarter last year. Profit before tax also swung to ₹5.22 crore from a loss of ₹69.14 crore year-on-year. The company operates in steel products, ferro alloys, and coke derivatives segments. Despite the operational improvement, the balance sheet shows accumulated losses with other equity at negative ₹14,766.18 crore as of March 31, 2025, while equity share capital remained unchanged at ₹1,157.90 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755331544475,
            "Source": "earnings"
        },
        {
            "Title": "VISA Steel Reports Quarterly Profit Despite Ongoing Debt Resolution Challenges",
            "Summary": "VISA Steel Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing a net profit of Rs. 43.22 million compared to a loss of Rs. 69.14 million in the same quarter last year. Revenue from operations increased to Rs. 1,709.78 million from Rs. 1,347.32 million year-over-year. However, the company faces significant challenges with accumulated unprovided interest of Rs. 13,645.52 million on borrowings, which auditors noted would turn the reported profit into a loss of Rs. 356.07 million if recognized. The company's debt has been classified as non-performing assets since July 2012, and 95% of debt has been assigned to Assets Care & Reconstruction Enterprise Limited (ACRE) for restructuring discussions. The company received a notice from Odisha's pollution control board refusing to renew its Consent to Operate, to which it has responded seeking renewal. The 29th Annual General Meeting is scheduled for September 24, 2025, via video conferencing.",
            "Sentiment": "negative",
            "PublishDate": 1755172399684,
            "Source": "earnings"
        },
        {
            "Title": "Visa Steel Receives Notice from Odisha Pollution Control Board",
            "Summary": "Visa Steel has received a notice from the Odisha Pollution Control Board regarding the non-renewal of their operating consent. This indicates potential environmental compliance issues for the company's operations in Odisha.",
            "Sentiment": "negative",
            "PublishDate": 1752224248000,
            "Source": "default"
        }
    ]
}