{
    "Symbol": "VISAKAIND",
    "ISIN": "INE392A01021",
    "News": [
        {
            "Title": "Visaka Industries Q3FY26 Results Show Strong Recovery",
            "Summary": "Visaka Industries reported consolidated net profit of ₹192.41 lakhs in Q3FY26 versus loss of ₹1,098.34 lakhs in Q3FY25. Nine-month consolidated profit reached ₹4,534.50 lakhs including exceptional gain of ₹3,674.30 lakhs from land sale.",
            "Sentiment": "positive",
            "PublishDate": 1770635493816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Visaka Industries Board Meet on Feb 9 for Q3FY26 Results",
            "Summary": "Visaka Industries has scheduled a board meeting on February 09, 2026, to consider and approve audited financial results for Q3 and nine months ended December 31, 2025. Trading window remains closed.",
            "Sentiment": "neutral",
            "PublishDate": 1769694114921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Visaka Industries Senior Executive Retires Dec 30",
            "Summary": "Visaka Industries announces retirement of Shri Rajnavneeth Rao Linga Rao Thurpu, President - Technical (AC Division), effective December 30, 2025, as part of senior management transition.",
            "Sentiment": "neutral",
            "PublishDate": 1767076448446,
            "Source": "stocks"
        },
        {
            "Title": "Visaka Industries Sells Land Rights for ₹32.86 Cr",
            "Summary": "Visaka Industries Limited has entered into an MoU to transfer leasehold rights of 7-acre land in Chennai to Caresoft Global Mobility Technologies for ₹32.86 crores, expected to complete within 60-90 days.",
            "Sentiment": "neutral",
            "PublishDate": 1765452366536,
            "Source": "co_actions_results"
        },
        {
            "Title": "Visaka Industries Wins Court Order for ₹68.73 Crore Recovery from Hyderabad Cricket Association",
            "Summary": "The Commercial Court, Hyderabad allowed Visaka Industries' execution petition against Hyderabad Cricket Association for realizing ₹68.73 crores awarded by an Arbitral Tribunal. The court directed HCA to deposit the amount within three weeks from November 24, 2025, failing which Canara Bank must transfer the attached funds to the court's account.",
            "Sentiment": "positive",
            "PublishDate": 1764062226524,
            "Source": "stock"
        },
        {
            "Title": "Visaka Industries Reports Strong Q2 Recovery with ₹5,436 Crore Profit After Land Sale",
            "Summary": "Visaka Industries Limited reported a standalone net profit of ₹5,436.47 crores for the quarter ended September 30, 2025, compared to a loss of ₹558.73 crores in the same period last year. The company's revenue increased to ₹32,399.07 crores from ₹30,734.58 crores year-on-year. The significant profit boost was driven by an exceptional gain of ₹3,674.30 crores from the sale of land in Ahmedabad, Gujarat. For the half-year period, the company posted a profit of ₹4,542.23 crores versus a loss of ₹625.91 crores in the previous year. The company operates in two main segments: building products contributing ₹26,543.78 crores and synthetic yarn generating ₹5,855.29 crores in quarterly revenue. The Board of Directors approved the audited financial results at their meeting held on November 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763030392874,
            "Source": "earnings"
        },
        {
            "Title": "Visaka Industries Reports Reduced Quarterly Loss and Revenue Growth",
            "Summary": "Visaka Industries posted a consolidated net loss of 87 million rupees in Q2, an improvement from the previous year's loss of 166 million rupees. The company's quarterly revenue increased to 3.25 billion rupees compared to 3.08 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763027314877,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Court Dismisses HCA's Appeal, Visaka Industries to Receive ₹25.92 Crores Plus Interest",
            "Summary": "The Supreme Court dismissed HCA's Special Leave Petition against Visaka Industries' arbitration award. Visaka Industries will receive ₹25.92 crores plus interest from this arbitration award. The company expects positive financial gains from this outcome.",
            "Sentiment": "positive",
            "PublishDate": 1759828009288,
            "Source": "stock"
        },
        {
            "Title": "Visaka Industries Appoints Dr. Gaddam Vritika as Chief Business Strategist",
            "Summary": "Visaka Industries Limited appointed Dr. Gaddam Vritika as Chief Business Strategist and Advisor to the Chairman, effective April 1, 2025. The Board of Directors approved the appointment on March 26, 2025, based on the Nomination and Remuneration Committee's recommendation. Dr. Vritika, aged 37, is a dermatologist and entrepreneur who co-founded NAVA Skin and Body Clinic. She holds an MBBS from Deccan Medical College (2011) and MD from Sri Ramachandra University, Chennai (2017). She is the daughter of Chairman Dr. G. Vivek Venkatswamy and Managing Director Smt. G. Saroja Vivekanand, and sister of Joint Managing Director Shri G. Vamsi Krishna.",
            "Sentiment": "positive",
            "PublishDate": 1757082360362,
            "Source": "corporate_governance"
        },
        {
            "Title": "Visaka Industries Adds Two Companies to Promoter Group Following Court-Ordered Share Transfer",
            "Summary": "Visaka Industries Limited announced changes to its promoter group structure following a court order. The NCLT Hyderabad directed the transfer of 11,54,612 equity shares (93.75%) of Yeshwanth Realtors Pvt. Ltd. to Dr. G. Vritika, who is a promoter group member of Visaka Industries. This transfer was completed on September 28, 2025. Due to this ownership change, both Yeshwanth Realtors Pvt. Ltd. and Vigilance Security Services Pvt. Ltd. are now included in Visaka Industries' promoter group. Yeshwanth Realtors holds 93.55% of Vigilance Security Services, which in turn owns 41,69,120 equity shares (4.83%) of Visaka Industries. The company will reflect these changes in its shareholding pattern from the September 2025 quarter onwards.",
            "Sentiment": "neutral",
            "PublishDate": 1756971138497,
            "Source": "corporate_action"
        },
        {
            "Title": "Visaka Industries Reports 30% Jump in Q1 EBITDA to 511 Million Rupees",
            "Summary": "Visaka Industries reported Q1 EBITDA of 511 million rupees compared to 394 million rupees in the same period last year, marking a year-on-year increase. The company's EBITDA margin improved to 10.11% from 8.60% in the previous year's corresponding quarter, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754575256327,
            "Source": "earnings"
        },
        {
            "Title": "Visaka Industries Reports Strong Q1 Results with Net Profit Surging to 521.4M Rupees",
            "Summary": "Visaka Industries reported consolidated net profit of 521.4 million rupees in Q1, significantly higher than 99.5 million rupees in the same period last year. The company's revenue also grew to 5.05 billion rupees compared to 4.57 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754573459347,
            "Source": "earnings"
        },
        {
            "Title": "Visaka Industries Independent Director Srikar Palem Reddy Completes Second Term",
            "Summary": "Shri Srikar Palem Reddy has completed his second term as an Independent Director of Visaka Industries Limited, with his tenure ending on July 24, 2025. Following the completion of his term, he ceased to be a member of both the Audit Committee and Nomination & Remuneration Committee of the Board of Directors. The cessation was due to the natural completion of his second five-year term as an Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1753360701456,
            "Source": "corporate_governance"
        },
        {
            "Title": "Visaka Industries Schedules Board Meeting on August 7, 2025 to Approve Quarterly Financial Results",
            "Summary": "Visaka Industries Limited has scheduled a Board of Directors meeting for August 7, 2025 to consider and approve audited financial results for the first quarter ended June 30, 2025. The results will cover both standalone and consolidated financials. The company's trading window, which has been closed since July 1, 2025, will remain closed until 48 hours after the financial results are submitted to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753263429008,
            "Source": "corporate_action"
        },
        {
            "Title": "Visaka Industries Reports Q4 Financial Results",
            "Summary": "Visaka Industries announced its Q4 consolidated net profit of 146 million rupees, compared to 11.5 million rupees in the same quarter last year. This represents a year-over-year increase. However, the company reported a loss of 110 million rupees compared to the previous quarter. Q4 revenue increased to 4.3 billion rupees from 3.96 billion rupees in the same period last year.",
            "Sentiment": "mixed",
            "PublishDate": 1747873039000,
            "Source": "default"
        },
        {
            "Title": "Visaka Industries Reports Q4 Financial Results",
            "Summary": "Visaka Industries has reported its Q4 financial results. The company's EBITDA increased to 445 million rupees from 244.3 million rupees year-over-year. The EBITDA margin improved to 10.45% from 6.17% year-over-year. The consolidated net profit rose to 146 million rupees from 11.5 million rupees year-over-year, but showed a loss of 110 million rupees quarter-on-quarter. Q4 revenue increased to 4.3 billion rupees from 3.96 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747830027000,
            "Source": "result"
        },
        {
            "Title": "Visaka Industries Reports Increased Q3 Net Loss",
            "Summary": "Visaka Industries has reported a consolidated net loss of 110 million rupees for the third quarter, compared to a loss of 72 million rupees in the same period last year. The company's revenue figures for Q3 were not fully provided in the given data, with only the previous year's revenue of 3.4 billion rupees mentioned.",
            "Sentiment": "negative",
            "PublishDate": 1739531186000,
            "Source": "earnings"
        },
        {
            "Title": "Visaka Industries' ATUM Solar Roofs Achieves Significant Milestone",
            "Summary": "Visaka Industries has announced that its ATUM Solar Roofs product line has reached a significant milestone. While specific details about the milestone are not provided in the given news snippet, this achievement likely represents progress in the company's solar roofing technology or market penetration.",
            "Sentiment": "positive",
            "PublishDate": 1736321302000,
            "Source": "corporate_action"
        },
        {
            "Title": "Visaka Industries Receives MNRE Certification for Integrated Solar Roof Solution",
            "Summary": "Visaka Industries has obtained certification from the Ministry of New and Renewable Energy (MNRE) for its integrated solar roof solution. The product has been included in the Approved List of Models and Manufacturers, which is a significant achievement for the company in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1736321286000,
            "Source": "corporate_action"
        },
        {
            "Title": "Visa: Tips to Protect Consumers from Holiday Shopping Scams",
            "Summary": "Visa's 2024 Holiday Threats Report warns of increased scams during the holiday shopping season. Key tips include watching for phishing scams, using trusted websites, opting for credit cards, monitoring transactions, and safeguarding personal information.",
            "Sentiment": "neutral",
            "PublishDate": 1734434605000,
            "Source": "normal_news"
        },
        {
            "Title": "Visa: EU Regulator Launches Probe into Retailer Fees",
            "Summary": "The European Commission has opened a preliminary investigation into fees Visa charges retailers. Visa was informed on August 30 and is cooperating with regulators. A separate investigation into Visa's incentive agreements with clients was closed on October 1.",
            "Sentiment": "neutral",
            "PublishDate": 1731578283000,
            "Source": "normal_news"
        },
        {
            "Title": "Visa: Unveils Suite of Digital Payment Innovations for Asia Pacific",
            "Summary": "Visa announced new digital payment products at Singapore Fintech Festival, including Flexible Credential Card, cross-border QR payments, biometric authentication, Click to Pay service, Data Tokens for personalized shopping, and AI-driven fraud detection for real-time payments. These innovations aim to enhance security, convenience, and personalization in digital payments across Asia Pacific markets.",
            "Sentiment": "positive",
            "PublishDate": 1730888876000,
            "Source": "normal_news"
        },
        {
            "Title": "Visa: Plans to Cut 1,400 Jobs in International Streamlining",
            "Summary": "Visa is preparing to lay off 1,400 employees by the end of the year to streamline its international business. About 1,000 cuts will be in technology positions, with others in merchant sales and global digital partnerships. Some layoffs have already occurred. Visa expects overall employee growth to continue.",
            "Sentiment": "negative",
            "PublishDate": 1730299317000,
            "Source": "corporate_action"
        }
    ]
}