{
    "Symbol": "VISHNU",
    "ISIN": "INE270I01022",
    "News": [
        {
            "Title": "Vishnu Chemicals Re-appoints Ch. Siddartha as JMD",
            "Summary": "Vishnu Chemicals Limited's Board approved the re-appointment of Mr. Ch. Siddartha as Joint Managing Director for five years from May 02, 2026 to May 01, 2031, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769882307338,
            "Source": "stocks"
        },
        {
            "Title": "Vishnu Chemicals Q3FY26 Results: Revenue Up 10.58%",
            "Summary": "Vishnu Chemicals reported consolidated revenue of ₹41,132.80 lakhs in Q3FY26, up 10.58% YoY. Net profit declined 1.85% to ₹3,376.07 lakhs despite strong revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1769861337041,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vishnu Chemicals Board Meet Set for Jan 31, 2026",
            "Summary": "Vishnu Chemicals Limited has scheduled its Board of Directors meeting for January 31, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769151916841,
            "Source": "co_actions_results"
        },
        {
            "Title": "EU Imposes Anti-Dumping Duty on Barium Carbonate Imports",
            "Summary": "The European Union has imposed definitive anti-dumping duties on barium carbonate imports from China and India, potentially impacting trade dynamics for chemical manufacturers including Vishnu Chemicals.",
            "Sentiment": "negative",
            "PublishDate": 1768362080643,
            "Source": "stocks"
        },
        {
            "Title": "Vishnu Chemicals postal ballot for director appointment",
            "Summary": "Vishnu Chemicals Limited announces postal ballot notice for special resolution to appoint Mr. Srivari Chandrasekhar as Independent Director, with e-voting from January 13-February 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768212644987,
            "Source": "stocks"
        },
        {
            "Title": "US Probes Anti-Dumping Duties on Indian Chromium Trioxide",
            "Summary": "The US Trade Administration has initiated an investigation into anti-dumping and countervailing duties on chromium trioxide imports from India, potentially affecting Vishnu Chemicals and other Indian exporters.",
            "Sentiment": "negative",
            "PublishDate": 1767153234563,
            "Source": "stocks"
        },
        {
            "Title": "Vishnu Chemicals' Subsidiary Completes Acquisition of Chrome Mining Complex",
            "Summary": "Vishnu Chemicals Limited's wholly owned subsidiary Vishnu South Africa (Pty) Limited has successfully completed the acquisition of 100% shareholding of Bonmerci Investments 103 (Pty) Limited along with associated plant, mining and infrastructure assets. The acquisition represents a share and asset deal that expands the company's operations into chrome mining through its South African subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1763730451332,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnu Chemicals Appoints Srivari Chandrasekhar as Independent Director",
            "Summary": "Vishnu Chemicals Limited appointed Mr. Srivari Chandrasekhar (DIN: 00481481) as Additional Director in Non-executive Independent category for a two-year term effective November 18, 2025. The appointment, approved by the Board based on Nomination and Remuneration Committee's recommendation, is subject to shareholder approval and enhances the company's board with Chandrasekhar's 26 years of experience in chemistry and leadership roles including Secretary to Government of India.",
            "Sentiment": "positive",
            "PublishDate": 1763463618699,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vishnu Chemicals Gets Credit Rating Reaffirmed by CARE Ratings with Enhanced Bank Facilities",
            "Summary": "CARE Ratings reaffirmed Vishnu Chemicals Limited's long-term bank facilities rating at CARE A- (Stable) while enhancing the facility amount from Rs. 166.28 crore to Rs. 478.28 crore, and maintained short-term bank facilities rating at CARE A2+. The rating decision was based on the company's operational and financial performance for FY25 and H1FY26, affecting total facilities worth Rs. 561.38 crore across multiple banking partners including SBI, ICICI Bank, and Union Bank of India.",
            "Sentiment": "positive",
            "PublishDate": 1763115688524,
            "Source": "stock"
        },
        {
            "Title": "Vishnu Chemicals Reports Record Quarterly Revenue of ₹401.1 Cr in Q2FY26",
            "Summary": "Vishnu Chemicals Limited achieved record quarterly revenues of ₹401.1 crores in Q2FY26, marking a 16.7% year-on-year growth. The company reported strong financial performance with EBITDA of ₹58.2 crores (28.8% YoY growth) and PAT of ₹32.8 crores (44.0% YoY growth). Gross margin improved to 43.1% from 42.8% in the previous year, while EBITDA margin increased to 14.5% from 13.1%. The company maintained a balanced domestic to export sales mix at 49:51, with export revenues growing 30% quarter-on-quarter from ₹157 crores to ₹205 crores. Operating cash flow increased 44% year-on-year to ₹91 crores in H1FY26. The company commenced commercial production of a new specialty chemical plant for Strontium Carbonate at its Vizag facility. Debt-to-equity ratio stands at 0.41. Chairman Managing Director Krishna Murthy Cherukuri noted that achieving quarterly revenue of ₹400 crores plus represents a milestone for the company.",
            "Sentiment": "positive",
            "PublishDate": 1762753297494,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Reports Record Quarterly Revenue of ₹401 Cr in Q2FY26",
            "Summary": "Vishnu Chemicals Limited reported record quarterly operating revenues of ₹401.1 crores for Q2FY26, marking a 16.7% year-on-year increase. The specialty chemicals manufacturer achieved EBITDA of ₹58.2 crores (up 28.8% YoY) and PAT of ₹32.8 crores (up 44.0% YoY). The company successfully commissioned a new specialty chemical plant for Strontium Carbonate production with 17,000 TPA capacity at Visakhapatnam, beginning commercial operations on August 20, 2025. Export revenues grew 30% quarter-on-quarter from ₹157 crores to ₹205 crores, maintaining a balanced domestic-to-export sales mix of 49:51. The company maintained a debt-to-equity ratio of 0.41 and delivered 15% ROCE during H1FY26. Management highlighted the milestone of achieving ₹400+ crores quarterly revenue and noted progress on a South Africa acquisition for raw material security.",
            "Sentiment": "positive",
            "PublishDate": 1762567937252,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Independent Director Veeramachaneni Vimalanand's Second Term to End December 30, 2025",
            "Summary": "Vishnu Chemicals Limited announced that Independent Director Veeramachaneni Vimalanand's second term will conclude on December 30, 2025. The Board of Directors noted the completion of his tenure at their meeting held on November 6, 2025, and placed on record their appreciation for his valuable contribution and guidance during his time with the company. Vimalanand holds DIN: 02693721.",
            "Sentiment": "neutral",
            "PublishDate": 1762433534256,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vishnu Chemicals Reports 44% Jump in Q2 Net Profit to 329 Million Rupees",
            "Summary": "Vishnu Chemicals reported consolidated net profit of 329 million rupees in Q2, up from 228 million rupees in the same quarter last year. Revenue increased to 4.01 billion rupees from 3.48 billion rupees year-on-year. EBITDA rose to 582 million rupees compared to 452 million rupees in the previous year's corresponding quarter. The company's EBITDA margin improved to 14.51% from 13.14% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762428605675,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Extends Chrome Mining Complex Acquisition Timeline to January 2026",
            "Summary": "Vishnu Chemicals Limited has updated the timeline for its subsidiary Vishnu South Africa (Pty) Limited's acquisition of a chrome mining complex in South Africa. The completion, originally expected within one year from the November 9, 2024 definitive agreement signing, is now scheduled for January 2026. The extension is due to pending condition precedents that require fulfillment before the transaction can be completed. The acquisition involves both share and asset components, with all other terms and conditions remaining unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1762196327299,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnu Chemicals Updates on UAE Subsidiary Closure Process",
            "Summary": "Vishnu Chemicals Limited provided an update on the closure of its wholly owned subsidiary, Vishnu International Trading FZE in UAE. The entity is undergoing a voluntary winding-up process, which is expected to be completed within approximately six months. This follows the company's earlier communication from July 23, 2025, regarding the subsidiary's closure.",
            "Sentiment": "neutral",
            "PublishDate": 1761562287265,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnu Chemicals Commences Strontium Carbonate Production at Visakhapatnam Facility",
            "Summary": "Vishnu Chemicals has started production of Strontium Carbonate at its Atchutapuram unit located in Visakhapatnam. The company has begun manufacturing operations for this chemical product at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1755668555891,
            "Source": "stock"
        },
        {
            "Title": "Vishnu Chemicals Q1 FY26 Revenue Grows 2.4% to Rs 347 Crores Despite Tariff Uncertainties",
            "Summary": "Vishnu Chemicals Limited reported consolidated revenue of Rs 346.9 crores in Q1 FY26, up 2.4% year-on-year from Rs 338.9 crores. The company maintained gross margins at 45.6% compared to 44.8% in the previous year, while EBITDA remained stable at Rs 55.7 crores with margins at 16.1%. PAT increased 5.8% to Rs 32.2 crores. The company faced headwinds from tariff uncertainties affecting export markets, with customers taking a cautious approach to inventory stocking. Domestic-export sales mix stood at 55:45 during the quarter. Ocean freight costs increased by 88 basis points sequentially due to tariff-related developments. Manufacturing expenses as percentage of revenue declined by 100 basis points to 6.2%. The company has 7% consolidated exposure to the US market, with Barium chemicals exempt from tariffs while Chromium faces 25% plus 3.5% duties. Strontium carbonate production is expected to begin in Q2 or early Q3. The board recommended a 15% dividend on face value of Rs 2 per share. The South Africa mine acquisition awaits statutory approvals, expected by November 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754909924012,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Reports 5.8% PAT Growth Despite Global Tariff Uncertainties",
            "Summary": "Vishnu Chemicals Limited reported quarterly results with operating revenues of ₹346.9 crore, representing a 2.4% year-over-year increase. The company achieved a profit after tax of ₹32.2 crore, marking a 5.8% year-over-year growth. Gross margins improved to 45.6% from 44.8% in the previous year, while EBITDA margins remained stable at 16.1%. The domestic to exports sales mix stood at 55:45, driven by stronger domestic demand. Sequential revenues declined 11.6% due to demand deferment amid ongoing tariff uncertainties. Ocean freight rates surged from May-June 2025, causing shipping costs to increase to 5.8% of sales from 4.9% in the previous quarter. Customer sentiment remained cautious in export markets with lower raw material inventory levels. The company maintains optimism that stability will return once tariff discussions settle, potentially releasing pent-up demand.",
            "Sentiment": "neutral",
            "PublishDate": 1754376613835,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Reports Flat Q1 EBITDA Growth with Slight Margin Decline",
            "Summary": "Vishnu Chemicals reported Q1 EBITDA of Rs 557.1 million compared to Rs 556.2 million in the same period last year, representing minimal growth. The company's EBITDA margin decreased to 16.06% from 16.41% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754132967522,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Reports 5.8% Growth in Quarterly Consolidated Net Profit",
            "Summary": "Vishnu Chemicals reported consolidated net profit of ₹322.2 million for the quarter, representing an increase from ₹304.6 million in the same period last year. The company achieved year-over-year growth of ₹17.6 million in its quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1754132605156,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Issues Notice for Transfer of Unclaimed Shares and Dividends to IEPF",
            "Summary": "Vishnu Chemicals Limited has notified shareholders about the mandatory transfer of unclaimed shares and dividends to the Investor Education and Protection Fund (IEPF). The company sent letters to shareholders whose dividends have remained unpaid for seven consecutive years from FY 2017-18, as required under Section 124(6) of the Companies Act, 2013. Shareholders have until October 29, 2025, to claim their outstanding dividends by providing proper bank details and required documentation to the Registrar and Share Transfer Agent, Bigshare Services Pvt. Ltd. If dividends remain unclaimed by the deadline, the corresponding shares will be transferred to IEPF without further notice. The company published newspaper advertisements and made the information available on its website to inform affected shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1753508873370,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnu Chemicals Reports Q4 Financial Results",
            "Summary": "Vishnu Chemicals announced its Q4 financial results. The company's EBITDA was 641 million rupees, slightly up from 635 million rupees year-over-year. However, the EBITDA margin decreased to 16.31% from 21.15% in the same period last year. The consolidated net profit increased to 389 million rupees from 277 million rupees year-over-year and 344 million rupees quarter-over-quarter. Revenue for Q4 grew to 3.9 billion rupees from 3 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747310954000,
            "Source": "result"
        },
        {
            "Title": "Vishnu Chemicals Promoters Convert Liabilities to Equity",
            "Summary": "Vishnu Chemicals' promoters have converted their liabilities into equity, resulting in a reduction of the company's borrowings by 76 crore Indian Rupees. This move is likely aimed at improving the company's financial structure and reducing its debt burden.",
            "Sentiment": "positive",
            "PublishDate": 1737964529000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnu Chemicals Reports Q3 Revenue Growth",
            "Summary": "Vishnu Chemicals has announced its third-quarter revenue results. The company reported revenue of 3.7 billion rupees, compared to 3 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737706806000,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Vishnu Chemicals has announced its financial results for the third quarter, reporting a consolidated net profit of 344 million rupees. This represents a substantial increase from the 207 million rupees reported in the same period last year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737706684000,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Chemicals Reports Q2 EBITDA Decline",
            "Summary": "Vishnu Chemicals announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 452 million rupees from 481 million rupees year-over-year. The EBITDA margin also declined to 13.14% from 15.70% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731329548000,
            "Source": "result"
        },
        {
            "Title": "Vishnu Chemicals Reports Q2 Financial Results",
            "Summary": "Vishnu Chemicals announced its Q2 consolidated net profit of 228 million rupees, compared to 240 million rupees year-over-year and 305 million rupees quarter-over-quarter. The company's Q2 revenue increased to 3.4 billion rupees from 3 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731329483000,
            "Source": "result"
        },
        {
            "Title": "Vishnu Chemicals Acquires Chrome Mining Complex in South Africa",
            "Summary": "Vishnu Chemicals has signed an agreement to acquire a chrome mining complex in South Africa. The deal includes a 74% stake in the mining entity and a 100% stake in the processing plant for USD 10 million (approximately 84 crore rupees). This acquisition is aimed at ensuring a stable supply of chrome ore for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731143046000,
            "Source": "corporate_action"
        }
    ]
}