{
    "Symbol": "VISHNUINFR",
    "ISIN": "INE0PQ001012",
    "News": [
        {
            "Title": "Vishnusurya Projects Secures ₹103 Crore Contract",
            "Summary": "Vishnusurya Projects has secured a contract valued at ₹103 crore. The company currently has a market capitalization of ₹400 crore. The news is related to a small and medium enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1752824219000,
            "Source": "default"
        },
        {
            "Title": "Vishnusurya Projects and Infra Launches Mining Operations with Two Crusher Plants",
            "Summary": "Vishnusurya Projects and Infra has announced the commencement of operations for its mining unit. The company has started operating two crusher plants in Kariasandhiram, marking a significant expansion into the mining sector.",
            "Sentiment": "positive",
            "PublishDate": 1737729626000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnusurya Projects and Infra Signs MoU with NTPC GE Power Services",
            "Summary": "Vishnusurya Projects and Infra has announced that it has entered into a Memorandum of Understanding (MoU) with NTPC GE Power Services. The details of the agreement and its potential impact on the company's operations or financials were not provided in the brief news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1732234359000,
            "Source": "corporate_action"
        },
        {
            "Title": "VISHNUSURYA PROJECTS AND INFRA Signs MOU with NTPC GE Power Services",
            "Summary": "VISHNUSURYA PROJECTS AND INFRA has announced that it has entered into a Memorandum of Understanding (MOU) with NTPC GE Power Services. This partnership likely aims to collaborate on infrastructure or power-related projects, though specific details are not provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1732186852000,
            "Source": "corporate_action"
        }
    ]
}