{
    "Symbol": "VIVIDHA",
    "ISIN": "INE370E01029",
    "News": [
        {
            "Title": "Visagar Polytex Reports Q3 FY26 Loss of ₹21.75 Lakh",
            "Summary": "Visagar Polytex Limited posted a net loss of ₹21.75 lakh for Q3 FY26, with revenue from operations at ₹0.67 lakh. Nine-month loss widened to ₹111.35 lakh despite revenue of ₹11.52 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1770659595978,
            "Source": "co_actions_results"
        },
        {
            "Title": "Visagar Polytex Reports Net Loss of Rs 29.99 Lakh in Q2 FY2026",
            "Summary": "Visagar Polytex Limited reported a net loss of Rs 29.99 lakh for the quarter ended September 30, 2025, compared to a loss of Rs 41.81 lakh in the previous quarter. For the half-year period, the company recorded a net loss of Rs 89.61 lakh versus Rs 86.48 lakh in the corresponding period last year. The Board of Directors approved the unaudited financial results at a meeting held on November 11, 2025. The company's statutory auditors, M/s. Bhatter and Associates, issued a limited review report with an unmodified opinion on the quarterly results.",
            "Sentiment": "negative",
            "PublishDate": 1762910465682,
            "Source": "earnings"
        },
        {
            "Title": "Visagar Polytex Reports Rs 59.62 Lakh Loss in Q1, Appoints New Director",
            "Summary": "Visagar Polytex Limited reported a net loss of Rs 59.62 lakh for the first quarter ended June 30, 2025, compared to a loss of Rs 44.67 lakh in the same period last year. The company's revenue from operations increased to Rs 10.85 lakh from zero in the previous year quarter. Total expenses rose to Rs 70.47 lakh, with other expenses being the largest component at Rs 37.49 lakh, followed by depreciation at Rs 13.68 lakh and finance costs at Rs 8.48 lakh. The company appointed Mr. Vikasjeet Singh as Additional Director (Non-Executive, Non-Independent) with over 2 years of experience in VFX compositing. The board also adopted updated codes of conduct for trading and fair disclosures. Earnings per share remained at negative Rs 0.02 for both basic and diluted calculations.",
            "Sentiment": "negative",
            "PublishDate": 1755076331297,
            "Source": "earnings"
        }
    ]
}