{
    "Symbol": "VIVIANA",
    "ISIN": "INE0MEG01014",
    "News": [
        {
            "Title": "Viviana Power Tech Wins ₹209 Cr GUVNL Order",
            "Summary": "Viviana Power Tech Ltd secured a significant ₹2.09 billion order from Gujarat Urja Vikas Nigam Limited, marking a major business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1767348824164,
            "Source": "co_actions_results"
        },
        {
            "Title": "Viviana Power Tech Allots 3.8 Million Bonus Shares and Acquires Viviana Engineering",
            "Summary": "Viviana Power Tech approved the allotment of 3,796,800 bonus shares to its shareholders. The company also completed 100% acquisition of Viviana Engineering Pvt. Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1763613682147,
            "Source": "corporate_action"
        },
        {
            "Title": "Viviana Power Tech Secures Rs 372 Crore Order, Market Cap Hits Rs 1000 Crore",
            "Summary": "Viviana Power Tech has secured a new order worth Rs 372 crore. The company's market capitalization has reached Rs 1000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761302819369,
            "Source": "stock"
        },
        {
            "Title": "Viviana Power Tech Secures ₹2,448 Crore Order",
            "Summary": "Viviana Power Tech has secured a new order worth ₹2,448 crore. The company announced this significant contract win, though specific details about the nature of the order, client, or timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1760333421498,
            "Source": "order&deals"
        },
        {
            "Title": "Viviana Power Tech Wins 66 KV Transmission Line Project Bid Under GETCO's Kisan Suryoday Yojana",
            "Summary": "Viviana Power Tech has successfully won a bid for a 66 KV transmission line project under GETCO's Kisan Suryoday Yojana. The project involves transmission line infrastructure development as part of the government scheme.",
            "Sentiment": "positive",
            "PublishDate": 1759480024397,
            "Source": "stock"
        },
        {
            "Title": "Viviana Power Tech Board Proposes 3:5 Bonus Share Issue",
            "Summary": "Viviana Power Tech's board has recommended issuing bonus shares at a 3:5 ratio from free reserves. Following the bonus issue, the company's capitalization is expected to increase to ₹10.12 crore.",
            "Sentiment": "positive",
            "PublishDate": 1758784631371,
            "Source": "corporate_action"
        },
        {
            "Title": "Viviana Power Secures 265 Crore Rupee Contract",
            "Summary": "Viviana Power has secured a contract worth 265 crore rupees. The company has a market capitalization of 900 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1758268024938,
            "Source": "stock"
        },
        {
            "Title": "Viviana Power Tech Reports Strong Order Book of ₹1,003 Crore, Sets Ambitious Revenue Targets",
            "Summary": "Viviana Power Tech has secured orders worth over ₹1,003 crore in the power transmission and distribution segment. The company has set revenue targets of ₹550 crore for FY26 and ₹850 crore for FY27, representing significant growth from ₹220 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1756973560937,
            "Source": "stock"
        },
        {
            "Title": "Vivana Power Tech Secures Rs 59 Crore Order",
            "Summary": "Vivana Power Tech has received an order worth Rs 59 crore. The company operates in the power technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1755150316657,
            "Source": "order&deals"
        },
        {
            "Title": "Viviana Power Secures Lowest Bid for 220kV Transmission Line Project",
            "Summary": "Viviana Power has won the lowest bid for a 220kV transmission line project at Avaniya. The company secured this contract, demonstrating its competitiveness in the power transmission sector. No further details about the project's scope, value, or timeline were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750230052000,
            "Source": "default"
        },
        {
            "Title": "Viviana Power Tech Surpasses ₹200 Crore Revenue Milestone in FY 2024-25",
            "Summary": "Viviana Power Tech has announced that its consolidated revenue for the fiscal year 2024-25 has exceeded ₹200 crore as of March 28, 2025. This achievement marks a significant milestone for the company since its establishment.",
            "Sentiment": "positive",
            "PublishDate": 1743150861000,
            "Source": "earnings"
        }
    ]
}