{
    "Symbol": "VIYASH",
    "ISIN": "INE807F01027",
    "News": [
        {
            "Title": "Viyash Scientific Q3 FY26 Results Show Strong Growth",
            "Summary": "Viyash Scientific reported Q3 FY26 revenue of INR 858 crores with 11% YoY growth and adjusted EBITDA of INR 185 crores, up 64% YoY with 21% margins.",
            "Sentiment": "positive",
            "PublishDate": 1770790559414,
            "Source": "co_actions_results"
        },
        {
            "Title": "Viyash Scientific reschedules Q3FY26 earnings call",
            "Summary": "Viyash Scientific Limited has rescheduled its Q3FY26 earnings conference call to February 06, 2026 at 5:30 PM IST, with senior management including MD & Group CEO Dr. Hari Babu Bodepudi participating.",
            "Sentiment": "neutral",
            "PublishDate": 1770137271522,
            "Source": "co_actions_results"
        },
        {
            "Title": "Viyash Scientific allots 4.83 lakh ESOP shares",
            "Summary": "Viyash Scientific Limited allots 4,83,333 equity shares under ESOP 2020 scheme at Rs. 86 per share, increasing paid-up capital to Rs. 87,32,35,618 comprising 43,66,17,809 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1769679262487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Viyash Scientific partners with Boehringer Ingelheim",
            "Summary": "Viyash Scientific's subsidiary Alivira Animal Health enters partnership with Boehringer Ingelheim India for distribution of companion animal products, targeting India's growing pet healthcare market.",
            "Sentiment": "positive",
            "PublishDate": 1769077309535,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sequent Scientific Q3FY26 Earnings Call on Feb 6",
            "Summary": "Sequent Scientific Limited has scheduled a conference call with analysts and investors on February 6, 2026, at 9:00 AM IST to discuss Q3FY26 financial results under Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769001758261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sequent Scientific Officially Becomes Viyash Scientific",
            "Summary": "Sequent Scientific Limited has officially changed its name to Viyash Scientific Limited with effect from January 8, 2026, following ROC approval and shareholder consent through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1767954061324,
            "Source": "stocks"
        },
        {
            "Title": "Sequent Scientific allots 1 lakh ESOP shares",
            "Summary": "Sequent Scientific Limited allotted 1,00,000 equity shares at ₹86 per share under ESOP 2020 scheme, increasing paid-up capital to ₹87.23 crores with 43.61 crore total shares.",
            "Sentiment": "neutral",
            "PublishDate": 1767088641222,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sequent Scientific VP Ashish Kakabalia Resigns",
            "Summary": "Sequent Scientific announces the immediate resignation of VP Ashish Kakabalia from his senior management position at the pharmaceutical company on December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766495734586,
            "Source": "stocks"
        },
        {
            "Title": "CA Hull Acquires 31.20% Stake in Sequent Scientific",
            "Summary": "CA Hull Investments acquired 31.20% stake in Sequent Scientific through amalgamation scheme, receiving 13.61 crore equity shares and becoming part of promoter group on December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765891887274,
            "Source": "stocks"
        },
        {
            "Title": "Sequent Scientific Seeks Shareholder Approval for Name Change to Viyash Scientific Limited",
            "Summary": "Sequent Scientific Limited has issued a postal ballot notice seeking shareholder approval to change its name to Viyash Scientific Limited and alter its business objects clause, following the sanctioning of its composite amalgamation scheme by NCLT on November 18, 2025. The remote e-voting period runs from November 29 to December 28, 2025, with the name change aimed at creating a unified identity reflecting the combined strengths of merged entities and leveraging the Viyash brand equity.",
            "Sentiment": "neutral",
            "PublishDate": 1764330777634,
            "Source": "corporate_action"
        },
        {
            "Title": "Sequent Scientific Announces Effective Date for Multi-Company Amalgamation Scheme",
            "Summary": "Sequent Scientific's composite scheme of amalgamation involving nine companies including Symed Labs, Vandana Life Sciences, and others became effective from November 27, 2025, following National Company Law Tribunal approval dated November 18, 2025. The scheme consolidates multiple pharmaceutical and life sciences entities under Sequent Scientific, with required regulatory approvals and conditions satisfied.",
            "Sentiment": "positive",
            "PublishDate": 1764306651351,
            "Source": "corporate_action"
        },
        {
            "Title": "Sequent Scientific Sets Record Date for Merger Share Allotment",
            "Summary": "Sequent Scientific has fixed December 08, 2025 as the record date to determine shareholders of Viyash Life Sciences for allotment of merger consideration shares following NCLT approval of the composite amalgamation scheme. Under the share exchange ratio, Viyash shareholders will receive 56 equity shares of Sequent (Rs. 2 each) for every 100 shares of Viyash (Rs. 10 each) they hold.",
            "Sentiment": "neutral",
            "PublishDate": 1764162874542,
            "Source": "corporate_action"
        },
        {
            "Title": "Sequent Scientific Announces Share Exchange Ratio for Viyash-Geninn Merger",
            "Summary": "Sequent Scientific informed exchanges that Viyash Life Sciences has set November 1, 2025 as the record date for determining Geninn Life Sciences shareholders eligible for share allotment under their merger scheme. The share exchange ratio is fixed at 47 equity shares of Viyash for every 1 equity share of Geninn, both valued at Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763827861478,
            "Source": "corporate_action"
        },
        {
            "Title": "SeQuent Scientific Q2FY26 Earnings Call: Strong Performance and NCLT Merger Approval",
            "Summary": "SeQuent Scientific reported strong quarterly results with revenue of INR 4,240 million (15% YoY growth) and EBITDA of INR 657 million (15.5% margin), while receiving NCLT approval for merger with Viyash Group. The combined entity expects significant synergies in R&D and manufacturing, with management confident of sustaining 20%+ EBITDA margins and targeting growth in companion animal health segment.",
            "Sentiment": "positive",
            "PublishDate": 1763708152808,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific and Viyash Lifesciences Receive NCLT Approval for Merger",
            "Summary": "Sequent Scientific and Viyash Lifesciences have obtained NCLT approval for their merger to create a leading global animal health company. The merger combines the two companies' operations in the animal health sector to strengthen their market position.",
            "Sentiment": "positive",
            "PublishDate": 1763523748363,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Reports Mixed Q2 FY26 Results with Revenue Growth but Lower Profitability",
            "Summary": "Sequent Scientific Limited announced quarterly results with consolidated revenue rising to ₹4,261.40 million from ₹3,731.80 million year-over-year, while profit after tax declined to ₹196.00 million from ₹251.00 million in the same period. The pharmaceutical company's board approved the unaudited financial results for the quarter and half-year ended September 30, 2025, with the company continuing to await NCLT approval for its composite scheme of amalgamation involving multiple subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1763174631330,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Allots 11.87 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Sequent Scientific's Nomination and Remuneration Committee approved the allotment of 11,86,700 equity shares of Rs. 2 each to 4 employees at an exercise price of Rs. 86 per share under the SeQuent ESOP 2020 plan. The allotment increases the company's paid-up equity share capital from Rs. 50.35 crores (comprising 2.52 crore shares) to Rs. 50.59 crores (comprising 2.53 crore shares). The newly allotted shares will rank equally with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762900127508,
            "Source": "corporate_action"
        },
        {
            "Title": "Sequent Scientific Schedules Q2FY26 Earnings Conference Call",
            "Summary": "Sequent Scientific has scheduled a conference call with analysts and investors on November 17, 2025, at 9:00 a.m. IST to discuss its Q2FY26 financial results. The call will feature key executives including MD & CEO Rajaram Narayanan, WTD & CEO of Viyash Lifesciences Dr. Hari Babu Bodepudi, and CFOs Saurav Bhala and Ramakant Singani. Conference call details and registration information have been made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762839629302,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Board Approves Name Change to Include 'Viyash' Brand Following Merger Scheme",
            "Summary": "Sequent Scientific Limited's board of directors has approved a proposal to change the company's name to include the word 'Viyash' as part of a composite scheme of amalgamation. The proposed new names under consideration are Viyash Scientific Limited, Viyash Pharma Limited, or Niyash Healthcare Limited. The name change aims to create a unified identity reflecting the combined strengths of merged entities and leverage the brand equity of the Viyash group. The merger scheme involves Sequent Scientific Limited with nine other companies including Viyash Life Sciences Private Limited, Symed Labs Limited, and seven other entities. The name change is subject to the effectiveness of the merger scheme and receipt of necessary statutory and regulatory approvals, including shareholder approval under the Companies Act, 2013, and approval from the Central Registration Centre, Ministry of Corporate Affairs.",
            "Sentiment": "positive",
            "PublishDate": 1762618821344,
            "Source": "corporate_action"
        },
        {
            "Title": "SeQuent Scientific Seeks Shareholder Approval for Anuj Poddar's Appointment as Non-Executive Director",
            "Summary": "SeQuent Scientific Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Anuj Poddar as a Non-Executive Director. The remote e-voting will be conducted from October 4 to November 2, 2025, with results to be announced by November 4, 2025. Mr. Poddar was initially appointed as an Additional Non-Executive Director on September 5, 2025, and requires shareholder approval within three months. He is currently Managing Director and Asia Co-Head of Global Portfolio Solutions at Carlyle, managing USD 465 billion in assets. Previously, he served as Managing Director and CEO of Bajaj Electricals and was part of the leadership team at Viacom18 Media. Mr. Poddar will be a nominee of The Carlyle Group and will not receive sitting fees or commission, only expense reimbursements. The cut-off date for voting eligibility is September 26, 2025, and the postal ballot notice will be sent electronically to registered shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1759495766221,
            "Source": "corporate_action"
        },
        {
            "Title": "Sequent Scientific-Viyash Life Sciences Merger Gets Shareholder Approval",
            "Summary": "The proposed merger between Carlyle portfolio companies Sequent Scientific and Viyash Life Sciences received approval from 99.98% of Sequent's public shareholders on August 30. The ₹8,000-crore merger will combine Sequent, a listed animal health company, with privately-held Viyash Life Sciences, which operates in human health. Hari Babu Bodepudi, founder of Viyash Life Sciences and former global COO of Mylan, will serve as group CEO-designate of the combined entity and become the second-largest shareholder with under 10% stake after Carlyle. The merged company will operate 15-16 manufacturing sites, with Viyash contributing 9 sites to provide backward integration capabilities for Sequent. The combination aims to create synergies by allowing Sequent to tap into generics opportunities in animal health products while Viyash can leverage Sequent's relationships with innovator companies in the companion animal segment.",
            "Sentiment": "positive",
            "PublishDate": 1756952258419,
            "Source": "order&deals"
        },
        {
            "Title": "Sequent Scientific Reports 13.1% Revenue Growth and 25% EBITDA Jump in Q1 FY26",
            "Summary": "Sequent Scientific delivered strong quarterly results with revenues of INR 4,414 million, reflecting 13.1% year-on-year growth. The company achieved nearly 25% growth in pre-ESOP EBITDA, reaching INR 602 million at a margin of 13.6%. Profit after tax surged 93.7% year-on-year to INR 176 million. The formulation business, accounting for 75% of operations, sustained 13% growth driven by strong performance across key geographies including 4% growth in Europe and 25% growth in emerging markets. The API business reached INR 100 crores for the quarter with 14% year-on-year growth. The company expanded its field force in India from less than 100 to nearly 200 people and established front-end presence in Mexico. The proposed merger with Viyash Life Sciences is progressing on track, with Competition Commission of India and Stock Exchange approvals received. NCLT shareholders' and creditors' meeting is scheduled for August 30, 2025. Viyash recorded 4% revenue growth to INR 353 crores with EBITDA margins of 19.5%. Combined entities showed 8.7% revenue growth and 21% EBITDA growth year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1755071166362,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Makes Earnings Call Audio Recording Available for Quarter Ended June 30, 2025",
            "Summary": "Sequent Scientific Limited has made the audio recording of its earnings call available on the company's website. The earnings call discussed the unaudited financial results for the quarter ended June 30, 2025. The company filed this information with BSE Limited and National Stock Exchange of India Limited on August 11, 2025. The filing covers consolidated and standalone results but does not provide specific financial figures. The audio recording can be accessed through a link provided on the company's website for investors seeking detailed information about the company's quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754893379131,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Announces Leadership Changes Contingent on Viyash Lifesciences Merger",
            "Summary": "Sequent Scientific announced proposed changes to its management structure following the planned merger with Viyash Lifesciences. Dr. Hari Babu Bodepudi, Founder and CEO of Viyash and Non-Executive Director of Sequent, will be appointed as Managing Director and Group CEO of the combined entity upon merger completion. Mr. Rajaram Narayanan, Sequent's Managing Director and CEO, will transition to CEO - Animal Health while continuing as a Whole time Director. The NCLT Hyderabad has directed shareholder and creditor meetings for August 30, 2025, as part of the merger approval process. Dr. Bodepudi holds a PhD in Organic Chemistry with over 30 years of industry experience, including leadership roles at Mylan Laboratories where he served as Global COO managing over 50 facilities globally. The leadership changes are contingent upon merger effectiveness and obtaining necessary statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754658222447,
            "Source": "corporate_governance"
        },
        {
            "Title": "SeQuent Scientific Reports Strong Q1 FY26 Results with 13% Revenue Growth and 94% PAT Surge",
            "Summary": "SeQuent Scientific Limited reported quarterly results with revenue of ₹4,414 million, marking a 13.1% year-on-year increase. The company's adjusted EBITDA grew 24.7% to ₹602 million, while profit after tax surged 93.7% to ₹176 million. EBITDA margins improved by 120 basis points to 13.6%. The formulations business showed broad-based growth with Europe revenues up 4% and emerging markets up 25%. The API segment grew 14% year-on-year. Managing Director Rajaram Narayanan attributed the performance to superior product mix, new launches, and improved operational efficiency. The proposed merger with Viyash Life Sciences is progressing as planned, with regulatory requirements expected to be completed in the coming months. On a combined proforma basis, SeQuent and Viyash together generated revenues of ₹7,941 million with an EBITDA margin of 16.2%. The merger process has received CCI approval and stock exchange clearance, with NCLT directing shareholder meetings for August 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754639682850,
            "Source": "earnings"
        },
        {
            "Title": "SeQuent Scientific Reports Quarterly Results with Revenue of Rs 4,033.60 Million",
            "Summary": "SeQuent Scientific Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 4,033.60 million and other income of Rs 38.70 million, totaling Rs 4,072.30 million. The company recorded a consolidated profit after tax of Rs 322.60 million for the quarter. On a standalone basis, revenue from operations was Rs 410.70 million with profit after tax of Rs 33.70 million. The results include 13 subsidiaries with total revenues of Rs 314.60 million and net profit of Rs 402.90 million. Exceptional items included Rs 12.50 million in expenses related to the proposed scheme of amalgamation. The consolidated earnings per share stood at Rs 0.26 (basic) and Rs 0.26 (diluted). The Board meeting was held on August 8, 2025, and the results were reviewed by the Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1754637950027,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Reports Strong Q1 Performance with Net Profit More Than Doubling",
            "Summary": "Sequent Scientific reported consolidated net profit of 143 million rupees in Q1, significantly higher than 65 million rupees in the same period last year. The company's EBITDA increased to 522 million rupees from 420 million rupees year-over-year. EBITDA margin improved to 11.8% compared to 10.76% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754637325545,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Schedules Shareholder and Creditor Meetings for Composite Amalgamation Scheme",
            "Summary": "Sequent Scientific Limited has scheduled separate meetings for equity shareholders and unsecured trade creditors on August 30, 2025, to consider and approve a Composite Scheme of Amalgamation. The scheme involves Sequent Scientific Limited and nine other companies including Symed Labs Limited, Vandana Life Sciences Private Limited, and Appcure Labs Private Limited. The equity shareholders meeting is set for 10:00 a.m. IST while the unsecured trade creditors meeting will be held at 11:00 a.m. IST on the same day. Both meetings will be conducted through video conferencing. Remote e-voting will be available from August 26 to August 29, 2025. The meetings are being held pursuant to an order from the National Company Law Tribunal, Hyderabad Bench - II. National Securities Depository Limited will provide the e-voting facility for both meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1753717974228,
            "Source": "corporate_action"
        },
        {
            "Title": "Sequent Scientific's Merger with Viyash Receives Stock Exchange Approvals",
            "Summary": "Sequent Scientific has received stock exchange approvals for its merger with Viyash. The company has now filed for clearance with the National Company Law Tribunal (NCLT), which is described as a crucial milestone in the merger process.",
            "Sentiment": "positive",
            "PublishDate": 1748493744000,
            "Source": "default"
        },
        {
            "Title": "SeQuent Scientific: Strong Turnaround with ₹44.3 Crore Net Profit in FY25",
            "Summary": "SeQuent Scientific reported a net profit of ₹44.3 crore for FY25, recovering from a ₹54.6 crore loss in FY24. Revenue grew 13.3% to ₹15,51.4 crore. Q4 FY25 saw a net profit of ₹16.3 crore. No dividend declared for FY25. Recovery aided by strategic restructuring and improved subsidiary performance.",
            "Sentiment": "positive",
            "PublishDate": 1747733157000,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Reports Improved Q4 Financial Results",
            "Summary": "Sequent Scientific announced its Q4 financial results. The company's revenue increased to 4 billion rupees from 3.6 billion rupees year-over-year. EBITDA rose to 462 million rupees from 323 million rupees, with the EBITDA margin improving to 11.51% from 8.93%. The company reported a consolidated net profit of 93 million rupees, compared to a loss of 9 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747727054000,
            "Source": "result"
        },
        {
            "Title": "Sequent Scientific Reports Q3 Revenue Growth",
            "Summary": "Sequent Scientific, a pharmaceutical company, has reported a revenue of 3.9 billion rupees for the third quarter, compared to 3.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739259697000,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sequent Scientific has reported significant year-over-year improvements in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 346 million rupees, up from 221 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 8.85% from 6.72% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739259662000,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Sequent Scientific, a pharmaceutical company, has reported a consolidated net profit of 34 million rupees for the third quarter, down from 83 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1739259617000,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific to Consider Q3 Results",
            "Summary": "Sequent Scientific has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738673048000,
            "Source": "earnings"
        },
        {
            "Title": "Sequent Scientific Reports Improved Q2 EBITDA and Margin",
            "Summary": "Sequent Scientific has reported significant year-over-year improvements in its Q2 financial performance. The company's EBITDA increased from 232 million rupees to 391 million rupees. Additionally, the EBITDA margin expanded from 6.71% to 10.60%.",
            "Sentiment": "positive",
            "PublishDate": 1731510923000,
            "Source": "result"
        },
        {
            "Title": "Sequent Scientific Reports Q2 Profit, Revenue Growth",
            "Summary": "Sequent Scientific has reported a consolidated net profit of 26 million rupees in Q2, compared to a loss of 83.8 million rupees in the same quarter last year. The company's revenue increased to 3.7 billion rupees from 3.46 billion rupees year-over-year. Sequentially, the net profit improved from 65 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731510880000,
            "Source": "result"
        }
    ]
}