{
    "Symbol": "VLEGOV",
    "ISIN": "INE03HW01020",
    "News": [
        {
            "Title": "VL E-Governance Files Q3 FY26 Monitoring Report",
            "Summary": "VL E-Governance & IT Solutions submitted monitoring agency report for Q3 FY26, showing minimal fund utilization of Rs.0.52 crore during quarter with Rs.2.70 crore remaining unutilized from preferential issue proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1770901608882,
            "Source": "stocks"
        },
        {
            "Title": "VL E-Governance Reports Q3 FY26 Loss of ₹71.38 Lakhs",
            "Summary": "VL E-Governance & IT Solutions posted a net loss of ₹71.38 lakhs for Q3 FY26 compared to profit of ₹94.30 lakhs in Q3 FY25. Revenue declined to ₹448.00 lakhs from ₹1,521.31 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770486441842,
            "Source": "co_actions_results"
        },
        {
            "Title": "VLE-Governance IT Solutions Reports No Deviation in Fund Utilization for Preferential Issue",
            "Summary": "VLE-Governance IT Solutions Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from stated objectives in its preferential issue fund utilization. Care Ratings Limited, serving as the monitoring agency, reported that the company raised Rs. 400.99 crore through share warrants to non-promoter investors, down from the originally planned Rs. 630 crore due to undersubscription. The funds are allocated across five objectives: large-scale e-governance projects (Rs. 30 crore), business expansion (Rs. 50 crore), strategic investment (Rs. 75 crore), existing/new projects (Rs. 75.99 crore), loan repayment (Rs. 70 crore), and general corporate purposes (Rs. 100 crore). As of September 30, 2025, Rs. 111.08 crore had been utilized, with Rs. 3.23 crore remaining unutilized and deployed in fixed deposits. The company's share price stood at Rs. 27.07, below the warrant exercise price of Rs. 75, potentially impacting future warrant conversions. Promoter shareholding decreased from 33.16% to 23.24%.",
            "Sentiment": "neutral",
            "PublishDate": 1762492184606,
            "Source": "corporate_action"
        },
        {
            "Title": "VLE-Governance Reports Revenue Growth in H1 FY2026, Expands into Defense and Smart City Projects",
            "Summary": "VLE-Governance IT Solutions Limited reported increased revenue on a half-yearly basis for Q2 FY2025-26, though quarterly results showed a temporary decline. The company signed an MoU with Ekansh Concepts to act as EPC Partner for the Sankalp Industrial Smart City Project, valued at approximately ₹800 crores across 494 acres in Phase I. VLE-Governance also signed a binding term sheet to acquire 40% equity stake in HAL-Edgewood Technologies Private Limited (HETL), a joint venture of Hindustan Aeronautics Limited, for expansion into aviation, aerospace, defense, and satellite technology sectors. The company maintains debt-free status and is exploring opportunities in government e-governance initiatives including land record digitization projects, PM e-Drive EV charging stations, and solar power implementations. VLE-Governance has established credentials in large-scale government projects, having previously executed land record digitization for the Philippines government and various e-governance projects across Indian states.",
            "Sentiment": "positive",
            "PublishDate": 1761898004432,
            "Source": "earnings"
        },
        {
            "Title": "VLe-Governance IT Solutions Reports Q2 Results and Appoints New Company Secretary",
            "Summary": "VLe-Governance IT Solutions Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of ₹1,148.89 lakhs for the half-year compared to ₹1,050.35 lakhs in the previous period. The company posted a profit of ₹17.04 lakhs for the half-year versus ₹142.49 lakhs previously. Basic earnings per share stood at ₹0.02 for the half-year. The Board also appointed Mr. Parth Solanki as Company Secretary and Compliance Officer effective October 31, 2025. Solanki is a qualified Company Secretary with over two years of experience in corporate secretarial and compliance functions. The financial results were reviewed by the Audit Committee and received an unmodified opinion from statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1761896135662,
            "Source": "corporate_action"
        },
        {
            "Title": "VL E-Governance & IT Solutions Company Secretary Nilesh Wadode Resigns Due to Personal Reasons",
            "Summary": "VL E-Governance & IT Solutions Limited announced that Mr. Nilesh Champalal Wadode has resigned from his position as Company Secretary and Compliance Officer, effective August 04, 2025. Wadode cited personal reasons for his resignation and confirmed there are no other material reasons for his departure. The company has accepted his resignation and will complete the necessary formalities. Wadode held the designation of Key Managerial Personnel at the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754314573617,
            "Source": "corporate_governance"
        },
        {
            "Title": "VL E-Governance Reports 13% Revenue Growth and Appoints New Secretarial Auditor",
            "Summary": "VL E-Governance & IT Solutions Limited reported revenue from operations of ₹823.70 lakhs for the quarter ended June 30, 2025, compared to ₹251.32 lakhs in the same period last year. Total income reached ₹861.42 lakhs versus ₹254.19 lakhs in the previous year quarter. The company posted a profit of ₹69.42 lakhs for the quarter, slightly higher than ₹61.30 lakhs in the corresponding quarter last year. Earnings per share remained stable at ₹0.06 for both basic and diluted calculations. The Board approved the appointment of Ms. Kalpana Srinivasan as Secretarial Auditor for a five-year term from financial year 2025-26 to 2029-30, subject to shareholder approval. Ms. Srinivasan brings over five years of independent practice experience and three decades of professional experience in legal and secretarial services.",
            "Sentiment": "positive",
            "PublishDate": 1754125929963,
            "Source": "earnings"
        },
        {
            "Title": "VLEGOV Reports Strong Q1 Results and Appoints New Secretarial Auditor for Five Years",
            "Summary": "VL E-Governance & IT Solutions Limited's Board approved unaudited standalone financial results for Q1 FY2025-26, showing revenue from operations of ₹823.70 lakhs compared to ₹251.32 lakhs in the same quarter last year. The company reported a profit of ₹69.42 lakhs for the quarter versus ₹61.30 lakhs in the previous year. Total income increased to ₹861.42 lakhs from ₹254.19 lakhs year-over-year. The Board also appointed Ms. Kalpana Srinivasan as Secretarial Auditor for a five-year term from FY2025-26 to FY2029-30, subject to shareholder approval. Ms. Srinivasan is a practicing Company Secretary with over five years of independent practice and more than three decades of experience in legal and secretarial domains. The company operates in the E-Governance & IT/ITES Business segment.",
            "Sentiment": "positive",
            "PublishDate": 1754124907111,
            "Source": "corporate_action"
        },
        {
            "Title": "VL E-Governance & IT Solutions Signs MoU for Smart City Project",
            "Summary": "VL E-Governance & IT Solutions has signed a Memorandum of Understanding (MoU) with Ekansh Concepts Limited to act as an EPC (Engineering, Procurement, and Construction) partner for the Sankalp Industrial Smart City Project. The EPC contract value is approximately ₹800 crores.",
            "Sentiment": "positive",
            "PublishDate": 1747760826000,
            "Source": "default"
        },
        {
            "Title": "VL E-Governance & IT Solutions: Approves 5.34 Crore Warrants for ₹400 Crore Fundraise",
            "Summary": "VL E-Governance & IT Solutions approved the issue of 5.34 crore warrants on a preferential basis, raising ₹400.99 crore. The company also approved the allotment of 25 lakh equity shares upon conversion of warrants. Funds will be used for investing in technologies and expanding into aviation, aerospace, defense, satellite, and e-Governance sectors.",
            "Sentiment": "positive",
            "PublishDate": 1737090982000,
            "Source": "corporate_action"
        },
        {
            "Title": "VL E-Governance & IT Solutions: Raises ₹401 Crore via Warrant Allotment",
            "Summary": "VL E-Governance & IT Solutions approved allotment of 5.34 crore warrants to raise ₹401 crore. Funds will support e-Governance projects and developments in aviation, aerospace, defense, and satellite sectors. 25 lakh equity shares to be issued on warrant conversion.",
            "Sentiment": "positive",
            "PublishDate": 1737033283000,
            "Source": "corporate_action"
        },
        {
            "Title": "VL E-Governance & IT Solutions Acquires Stake in HAL-Edgewood Technologies",
            "Summary": "<p><span class=\"neutral\">VL E-Governance & IT Solutions</span> has entered into a <b>binding term sheet</b> with <span class=\"neutral\">Edgewood Technologies</span> to <span class=\"positive\">acquire</span> a <b>14% stake</b> in <span class=\"neutral\">HAL-Edgewood Technologies</span> for <b>2.2 million rupees</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728475399000,
            "Source": "corporate_action"
        },
        {
            "Title": "VL E-Governance & IT Solutions Reports Improved Q2 EBITDA",
            "Summary": "<p>VL E-Governance & IT Solutions has reported a <span class='positive'>significant turnaround</span> in its Q2 EBITDA performance. The company posted an EBITDA <span class='positive'>profit</span> of <b>6.9 million rupees</b>, compared to a <span class='negative'>loss</span> of <b>13 million rupees</b> in the same quarter last year. Additionally, the EBITDA margin <span class='positive'>improved</span> to <b>8.63%</b> from <span class='negative'>-6%</span> year-over-year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728388127000,
            "Source": "result"
        },
        {
            "Title": "VL E-Governance & IT Solutions Reports Q2 Financial Results",
            "Summary": "<p>VL E-Governance & IT Solutions has reported its Q2 financial results. The company posted a <span class='positive'>net profit</span> of <b>8.1 million rupees</b>, compared to a <span class='negative'>loss</span> of <b>10 million rupees</b> in the same quarter last year. Sequentially, the profit <span class='positive'>increased</span> from <b>6.1 million rupees</b> in the previous quarter. However, <span class='negative'>revenue decreased</span> to <b>79.9 million rupees</b> from <b>220 million rupees</b> year-over-year, and <span class='positive'>increased</span> from <b>25.1 million rupees</b> quarter-over-quarter.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728388089000,
            "Source": "result"
        }
    ]
}