{
    "Symbol": "VLSFINANCE",
    "ISIN": "INE709A01018",
    "News": [
        {
            "Title": "VLS Finance Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "VLS Finance Limited has scheduled a board meeting for February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770041699801,
            "Source": "co_actions_results"
        },
        {
            "Title": "VLS Finance Declares Postal Ballot Results",
            "Summary": "VLS Finance Limited announces voting results for postal ballot dated November 22, 2025, with three resolutions passed through remote e-voting. One resolution withdrawn due to director resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1769955935560,
            "Source": "stocks"
        },
        {
            "Title": "VLS Finance Director Gaurav Goel Resigns",
            "Summary": "VLS Finance Limited announces resignation of Independent Director Shri Gaurav Goel effective January 19, 2026, citing personal commitments and pre-occupation as reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768831960204,
            "Source": "stocks"
        },
        {
            "Title": "VLS Finance Approves ₹100 Crore Share Buyback at ₹380 Per Share",
            "Summary": "VLS Finance Limited's board approved buyback of up to 26.31 lakh equity shares at ₹380 per share through tender offer route, representing 7.74% of total equity shares. The buyback size of ₹100 crore represents 5.84% and 5.52% of aggregate paid-up capital and free reserves on standalone and consolidated basis respectively, with VLS Capital Limited indicating intent to tender up to 1 lakh shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764080812807,
            "Source": "corporate_action"
        },
        {
            "Title": "VLS Finance Approves Rs 100 Crore Share Buyback and Appoints New Independent Director",
            "Summary": "VLS Finance Limited's board approved a share buyback of up to 26,31,578 equity shares at Rs 380 per share for a maximum amount of Rs 100 crores, representing 7.71% of paid-up capital, with record date set for December 12, 2025. The company also appointed Shri Gaurav Goel as Non-Executive Independent Director for a five-year term, subject to shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1763835354870,
            "Source": "corporate_action"
        },
        {
            "Title": "VLS Finance Director Gaurav Goel Resigns to Transition from Non-Independent to Independent Director Role",
            "Summary": "Gaurav Goel resigned from his position as Non-Executive, Non-Independent Director of VLS Finance Limited effective November 21, 2025. The resignation facilitates his proposed reappointment as Non-Executive, Independent Director, subject to board and shareholder approval under applicable regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763728263769,
            "Source": "corporate_governance"
        },
        {
            "Title": "VLS Finance Reports Strong Q2 Performance with 543% Jump in Net Profit",
            "Summary": "VLS Finance Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a standalone net profit of Rs 543.12 lakhs for the quarter, compared to Rs 4,079.20 lakhs in the previous year quarter. For the half year, standalone net profit reached Rs 6,602.50 lakhs versus Rs 14,013.73 lakhs in the previous year. Total income for the quarter stood at Rs 1,140.70 lakhs, while half-year total income was Rs 9,727.41 lakhs. On a consolidated basis, the company posted a net profit of Rs 710.08 lakhs for the quarter and Rs 7,824.58 lakhs for the half year. The company operates in a single segment of investments and dealing in shares/securities derivatives. The results were approved by the Board of Directors at their meeting held on November 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762707443200,
            "Source": "earnings"
        },
        {
            "Title": "VLS Finance Reports 35% Decline in Net Profit and Revenue",
            "Summary": "VLS Finance reported net profit of 606 million rupees compared to 933 million rupees in the same period last year. The company's revenue also declined to 841 million rupees from 1.3 billion rupees year-over-year. Both key financial metrics showed significant decreases in the quarterly results.",
            "Sentiment": "negative",
            "PublishDate": 1754582148084,
            "Source": "earnings"
        },
        {
            "Title": "VLS Finance Reports Strong Q1 Results with 17.82 EPS, Schedules AGM for September 27",
            "Summary": "VLS Finance Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs. 6,059.38 lakhs with earnings per share of Rs. 17.82. Total income reached Rs. 8,586.71 lakhs, driven primarily by net gain on fair value changes of Rs. 8,092.56 lakhs. On consolidated basis, the company posted net profit of Rs. 7,114.50 lakhs with EPS of Rs. 20.92. The company announced its 38th Annual General Meeting will be held on September 27, 2025 at 3:30 PM through video conferencing from its registered office in New Delhi. The auditors provided an unmodified opinion on the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1754582092145,
            "Source": "earnings"
        },
        {
            "Title": "VLS Finance Reports Q2 Financial Results",
            "Summary": "VLS Finance has announced its Q2 consolidated financial results. The company reported a net profit of 511 million rupees, which is lower compared to both the previous year (703 million rupees) and the previous quarter (932 million rupees). The Q2 revenue stood at 828 million rupees, down from 898 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731513465000,
            "Source": "result"
        }
    ]
}