{
    "Symbol": "VMART",
    "ISIN": "INE665J01013",
    "News": [
        {
            "Title": "V-Mart cuts FY26 revenue growth forecast to 15-18%",
            "Summary": "V-Mart Retail lowered its FY26 revenue growth outlook to 15-18% from 17-20% after weak festive sales. The company plans 13-15% annual store expansion despite competitive pressures in tier-II towns.",
            "Sentiment": "negative",
            "PublishDate": 1769222735596,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Mart Retail Management Expects Stable Margins",
            "Summary": "V-Mart Retail management indicates expectation of stable, healthy margins ahead supported by good inventory management, according to conference call updates.",
            "Sentiment": "positive",
            "PublishDate": 1769144881510,
            "Source": "stocks"
        },
        {
            "Title": "V-Mart Retail Appoints Sanjay Sarkar as SMP",
            "Summary": "V-Mart Retail Limited has appointed Mr. Sanjay Sarkar, currently Assistant Vice President Supply Chain Management, as Senior Management Personnel effective January 22, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769082438391,
            "Source": "stocks"
        },
        {
            "Title": "V-Mart Grants 66,260 ESOPs, Allots 19,264 Shares",
            "Summary": "V-Mart Retail grants 66,260 performance-linked stock options under ESOP Scheme 2020 and allots 19,264 equity shares to employees, increasing total share count to 7,94,58,289.",
            "Sentiment": "positive",
            "PublishDate": 1769081896754,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Mart Retail Q3 Net Profit Rises 22.9% to ₹88 Cr",
            "Summary": "V-Mart Retail reported a strong 22.9% year-on-year growth in Q3 standalone net profit, reaching ₹88.00 crores compared to ₹71.60 crores in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769071857985,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Mart Faces ₹10 Lakh Penalty for Unauthorized Banners",
            "Summary": "V-Mart Retail receives penalty notice from Banka Municipal Council for installing 200 unauthorized promotional flex banners on electric poles. Company plans to appeal the ₹10.00 lakh fine.",
            "Sentiment": "negative",
            "PublishDate": 1768973018289,
            "Source": "stocks"
        },
        {
            "Title": "V-Mart Retail schedules Q3FY26 earnings call",
            "Summary": "V-Mart Retail Limited announces conference call for investors and analysts on January 23, 2026 at 10:00 AM IST to discuss Q3FY26 and nine-month performance ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768556342991,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Mart Retail Q3 Revenue Grows 10% YoY to ₹1,126 Cr",
            "Summary": "V-Mart Retail reported Q3 total revenue from operations of ₹1,126 crores, marking a 10% year-on-year growth. The retail chain continues its steady expansion trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1767576780936,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Mart Retail Q3FY26: 10% Revenue Growth, 554 Stores",
            "Summary": "V-Mart Retail reported ₹1,126 crores revenue in Q3FY26, up 10% YoY. Company expanded to 554 stores with 23 new openings during the quarter across multiple states.",
            "Sentiment": "positive",
            "PublishDate": 1767350723443,
            "Source": "co_actions_results"
        },
        {
            "Title": "V-Mart Retail Receives GST Demand Order for FY22",
            "Summary": "V-Mart Retail Limited disclosed receiving a GST demand order for Financial Year 2021-22 under regulatory compliance requirements, with the company planning to appeal the assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1766216042200,
            "Source": "stocks"
        },
        {
            "Title": "V-Mart Promoter Lalit Agarwal Completes Acquisition of 1.97 Crore CCDs from Madan Gopal Agarwal",
            "Summary": "Lalit Agarwal acquired 1,97,33,161 Compulsory Convertible Debentures of Conquest Business Service Pvt. Ltd. (V-Mart's promoter company) through a gift deed, after resolving technical ISIN issues with the RTA. The inter-se transfer among qualifying persons increases Agarwal's indirect holding in V-Mart through CBSPL, which holds 37.74% in the retail company.",
            "Sentiment": "neutral",
            "PublishDate": 1764762995000,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Mart Retail's Vice President Ramesh Kumar Agarwal Superannuates from Senior Management Role",
            "Summary": "V-Mart Retail Limited announced that Mr. Ramesh Kumar Agarwal, Vice President of Supply Change Management and designated Senior Management Personnel, has superannuated from the company effective November 15, 2025. The departure represents a change in the company's senior management structure as the executive concluded his tenure through retirement.",
            "Sentiment": "neutral",
            "PublishDate": 1763212189399,
            "Source": "corporate_governance"
        },
        {
            "Title": "V-Mart Retail Reports 22% Revenue Growth in Q2 FY26 with Highest Quarterly Store Additions",
            "Summary": "V-Mart Retail delivered 22% total growth and 11% like-to-like sales growth in Q2 FY26, opening 25 new stores with plans to add 75 stores for the full year. The company maintained gross margins at 33.6% and achieved positive EBITDA of 8.9% for offline business, while expanding aggressively in southern India and introducing new product categories like cosmetics and artificial jewelry.",
            "Sentiment": "positive",
            "PublishDate": 1763118769219,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Allots 51,893 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "V-Mart Retail Limited allotted 51,893 equity shares with a face value of Rs. 10 each to employees under its Employee Stock Options Scheme, 2020. The allotment was approved by the company's Nomination Remuneration Committee and completed on November 10, 2025. Following this allotment, the company's total number of equity shares increased from 7,93,87,132 to 7,94,39,025 shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762829524062,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Mart Retail Announces Superannuation of Vice President Supply Chain Management",
            "Summary": "V-Mart Retail Limited announced that Mr. Ramesh Kumar Agarwal, Vice President of Supply Chain Management and designated Senior Management Personnel, will superannuate from the company effective November 15, 2025. The Nomination Remuneration Committee acknowledged his contributions during his tenure at their meeting held on November 10, 2025. The superannuation represents a planned retirement transition in the company's senior management structure.",
            "Sentiment": "neutral",
            "PublishDate": 1762810695649,
            "Source": "corporate_governance"
        },
        {
            "Title": "V-Mart Retail Reports Mixed Performance with Revenue Growth but Retail Trade Segment Loss",
            "Summary": "V-Mart Retail Limited announced its quarterly results for the quarter ended September 30, 2025. The company's retail trade segment generated revenue of Rs 80,032 lakhs but reported a segment loss of Rs 563 lakhs. Total segment revenue reached Rs 80,880 lakhs across both retail trade and digital marketplace segments. The digital marketplace segment recorded revenue of Rs 848 lakhs with a loss of Rs 370 lakhs. The company's total assets stood at Rs 262,631 lakhs as of September 30, 2025, compared to Rs 243,624 lakhs as of March 31, 2025. Cash and cash equivalents decreased to Rs 2,386 lakhs from Rs 3,942 lakhs. The company issued 13,328 shares during the quarter under its Employee Stock Option Scheme. The results were reviewed by the audit committee and approved by the Board of Directors in their meeting held on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762804324396,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Targets 25% Revenue Growth and 450+ Store Count with Omnichannel Strategy",
            "Summary": "V-Mart Retail has outlined its expansion strategy targeting 25% year-over-year revenue growth and achieving a store count of over 450 locations. The company is accelerating omnichannel integration and increasing its private label product mix. V-Mart is strengthening its rural market presence through a 'Value Fashion' strategy while focusing on supply chain digitization and inventory efficiency improvements. The retailer is targeting sustained EBITDA margin recovery over the second half of fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762786892893,
            "Source": "stock"
        },
        {
            "Title": "V-Mart Retail Reports Strong Q2 Performance with Revenue Growth and Reduced Losses",
            "Summary": "V-Mart Retail delivered improved quarterly results with EBITDA rising to 715 million rupees from 386 million rupees year-over-year. The company's EBITDA margin expanded to 8.9% compared to 5.84% in the previous year. Revenue grew to 8.1 billion rupees from 6.6 billion rupees year-over-year. The company reduced its net loss significantly to 89 million rupees from a loss of 560 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762763308934,
            "Source": "earnings"
        },
        {
            "Title": "V-mart Reports Q2 Revenue Growth to 8.07 Billion Rupees",
            "Summary": "V-mart reported quarterly revenue of 8.07 billion rupees compared to 6.61 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1759456946161,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Reports 22% Revenue Growth to Rs 807 Crores in Q2 FY26",
            "Summary": "V-Mart Retail Limited reported total revenue from operations of Rs 807 crores for Q2 FY26, representing a 22% year-on-year increase from Rs 661 crores in the previous year. The company achieved same-store sales growth of 11% for both V-Mart and Unlimited brands. During the quarter, V-Mart expanded its retail footprint by opening 25 new stores while closing 2 stores, bringing the total store count to 533 as of September 30, 2025. The new store openings were distributed across multiple states, with Karnataka receiving 5 stores, Uttar Pradesh and Bihar each getting 4 stores, West Bengal and Jharkhand receiving 2 stores each, and single store additions in Jammu & Kashmir, Odisha, Rajasthan, Telangana, Uttarakhand, Chhattisgarh, Andhra Pradesh, and Meghalaya.",
            "Sentiment": "positive",
            "PublishDate": 1759316789732,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Targets Mid to High Single-Digit Same-Store Sales Growth in FY26",
            "Summary": "V-Mart is targeting mid to high single-digit same-store sales growth in FY26, driven by festive demand and GST benefits. CFO Anand Agarwal noted that footfall has increased during the Navratri festival, with early signs of strong consumer sentiment. The company benefits significantly from the GST rate cut implemented on September 22, where apparels under Rs 2,500 are now taxed at 5% instead of the previous 12% for items under Rs 1,000. Most of V-Mart's apparel is priced below Rs 1,000, positioning the retailer as a key beneficiary. The company plans to open 65 new stores this year and has gained market share despite rising competition from domestic players. V-Mart's digital business, currently under 5% of total revenue, has reduced losses by 50% year-on-year, with the company expecting digital contribution margins to turn positive soon. The retailer operates primarily in tier 2 and tier 3 cities, selling apparel at an average price of Rs 350.",
            "Sentiment": "positive",
            "PublishDate": 1758802968687,
            "Source": "stock"
        },
        {
            "Title": "V-Mart Retail Faces ₹29.93 Lakh Penalty Order Under Minimum Wages Act",
            "Summary": "V-Mart Retail Limited received an order from the Assistant Labour Commissioner in Kasganj, Uttar Pradesh, directing the company to pay ₹29,93,034 as penalty. The order was based on a complaint by the Labour Enforcement Officer alleging that the company was paying employees less than the prescribed minimum wage. The complaint specifically cited non-payment of wages and overtime wages to workers as per the Minimum Wages Act, 1948. V-Mart plans to challenge the order at the appropriate appellate forum, citing merit and procedural lapses in the proceedings. The company has classified this as a contingent liability of ₹29,93,034.",
            "Sentiment": "negative",
            "PublishDate": 1757090291494,
            "Source": "stock"
        },
        {
            "Title": "V-Mart Retail Reports 13% Revenue Growth in Q1 FY26 with Improved Margins",
            "Summary": "V-Mart Retail delivered 13% year-on-year revenue growth in Q1 FY26, with V-Mart brand growing 14% and Unlimited at 12%. The company achieved normalized same-store sales growth of 5% after adjusting for Eid timing shift. Gross margins improved by 60 basis points to 34.8% (excluding LimeRoad) due to better full-price sell-through and old inventory liquidation. EBITDA margins expanded by 170 basis points to 14.3% including LimeRoad, with the online platform's losses reducing by 56%. The retailer added 15 new stores during the quarter while closing 2, targeting 65 net new store additions for the full year. Management noted positive customer sentiment in Bharat markets despite some sluggishness, with expectations for stronger Q2 performance driven by upcoming festivals. The company reported challenges in eastern regions due to reduced Bangladesh consumer traffic and early monsoon impact, but remains optimistic about rural consumption supported by good monsoon conditions and government policies.",
            "Sentiment": "positive",
            "PublishDate": 1753781865223,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Reports Strong Q1 Performance with 177% Jump in Net Profit",
            "Summary": "V-Mart Retail delivered robust quarterly results with net profit surging to 336 million rupees from 121.4 million rupees year-over-year, representing significant growth. The company's revenue increased to 8.8 billion rupees compared to 7.86 billion rupees in the same period last year. EBITDA rose to 1.26 billion rupees from 989.8 million rupees year-over-year, while EBITDA margin improved to 14.25% from 12.59% in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1753343983293,
            "Source": "earnings"
        },
        {
            "Title": "V Mart Schedules Q1 FY26 Earnings Call for July 25, 2025",
            "Summary": "V Mart has scheduled its quarterly earnings call for July 25, 2025, at 11 AM to discuss Q1 FY26 results.",
            "Sentiment": "neutral",
            "PublishDate": 1753081899742,
            "Source": "earnings"
        },
        {
            "Title": "V-mart Retail Reports 13% YoY Revenue Growth in Q1FY26",
            "Summary": "V-mart Retail announced its Q1FY26 results, reporting revenue from operations of 8.85 billion rupees, a 13% year-over-year increase. The company achieved a same-store sales growth of 1%, with a normalized same-store sales growth of 5% compared to the previous year. V-mart Retail's total store count stands at 510.",
            "Sentiment": "positive",
            "PublishDate": 1751415198000,
            "Source": "default"
        },
        {
            "Title": "V-Mart Retail: Q1 Revenue Up 12.6%, Expands Store Network",
            "Summary": "V-Mart Retail reported Q1 FY2025 revenue of ₹885 crore, up 12.6% YoY. The company opened 15 new stores across various states, bringing total store count to 510. Same Store Sales Growth was 1%.",
            "Sentiment": "positive",
            "PublishDate": 1751392215000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Reports 13% Revenue Growth in Q1",
            "Summary": "V-Mart Retail announced its Q1 financial results, reporting revenue of 8.85 billion rupees, a 13% year-over-year increase. The company experienced a 1% growth in same-store sales, with normalized same-store sales growth at 5% year-over-year. V-Mart Retail now operates a total of 510 stores.",
            "Sentiment": "positive",
            "PublishDate": 1751382258000,
            "Source": "default"
        },
        {
            "Title": "V-Mart Retail: Bonus Issue Record Date Set for June 23",
            "Summary": "V-Mart Retail Ltd. has announced a bonus issue of shares in the ratio of 3:1. The record date is set for June 23, 2023. Shareholders must hold shares in their demat account by June 22 to be eligible. The company's Q4 revenue increased by 17% to Rs 780 crore, with a net profit of Rs 19 crore. V-Mart plans to expand aggressively, aiming to add 50-60 stores annually.",
            "Sentiment": "positive",
            "PublishDate": 1750570524000,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Mart Retail: Last Day to Buy for 3:1 Bonus Issue Eligibility",
            "Summary": "V-Mart Retail shares will trade ex-bonus on June 23, 2025, for a 3:1 bonus issue. June 20 is the last day to purchase shares to be eligible for the bonus. This is V-Mart's first-ever bonus share issuance. The record date for determining eligible shareholders is set for June 23.",
            "Sentiment": "positive",
            "PublishDate": 1750387153000,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Mart Retail: Q4 Profit Turnaround and Bonus Share Announcement",
            "Summary": "V-Mart Retail reported a net profit of Rs 19 crore in Q4FY25, reversing a loss from the previous year. Revenue increased 17% YoY to Rs 780 crore. The company announced a 3:1 bonus share issue, subject to shareholder approval. Despite positive results, shares fell 6.2% to Rs 3,161.15 on the BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1746421740000,
            "Source": "result"
        },
        {
            "Title": "V-Mart Retail: Q4 Profit, 3:1 Bonus Shares Announced",
            "Summary": "V-Mart Retail reported Q4 FY25 net profit of ₹19 crore, up from a loss in the previous year. Revenue increased 17% to ₹780 crore. The company announced a 3:1 bonus share issue but skipped dividend for FY24-25.",
            "Sentiment": "positive",
            "PublishDate": 1746181543000,
            "Source": "result,corporate_action"
        },
        {
            "Title": "V-Mart Retail Reports Exceptional Gain and Reduced Q4 Loss",
            "Summary": "V-Mart Retail has reported an exceptional gain of 242 million rupees. The company's Q4 loss before tax has significantly improved to 13 million rupees, compared to a loss of 520 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746180092000,
            "Source": "result"
        },
        {
            "Title": "V-Mart Retail Ltd: Announces 3:1 Bonus Issue and Q4 Profit",
            "Summary": "V-Mart Retail announced a 3:1 bonus share issue, its first ever. The company reported a Q4 net profit of ₹18.5 crore, reversing a loss from the previous year. Revenue increased by 16.7% YoY to ₹780 crore. No dividend was declared for FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1746179099000,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Mart Retail Reports Strong Q4 Results and Announces Bonus Issue",
            "Summary": "V-Mart Retail has reported significant growth in its Q4 financial results. Revenue increased to 7.8 billion rupees from 6.69 billion rupees year-over-year. EBITDA rose to 681 million rupees from 402.3 million rupees, with EBITDA margin improving to 8.74% from 6.02%. The company turned profitable with a net profit of 185 million rupees compared to a loss of 398.2 million rupees in the same quarter last year. Additionally, V-Mart Retail has recommended a bonus issue in the ratio of 3:1.",
            "Sentiment": "positive",
            "PublishDate": 1746178336000,
            "Source": "result"
        },
        {
            "Title": "V-Mart Retail: Board to Consider Bonus Shares and Q4 Results",
            "Summary": "V-Mart Retail's board will meet on May 2, 2025, to consider Q4 FY25 results, FY25 annual results, and a proposal for bonus share issuance. The company reported 18% revenue growth in Q4FY25 to ₹772 crore and 18% growth for FY25 to ₹3,213 crore. Same-store sales growth was 8% for Q4 and 11% for FY25. The company now has 497 stores after opening 13 and closing 4 in Q4.",
            "Sentiment": "positive",
            "PublishDate": 1745989297000,
            "Source": "corporate_action"
        },
        {
            "Title": "V-Mart Retail to Consider Bonus Share Issue",
            "Summary": "V-Mart Retail Ltd. has announced that its board of directors will meet on May 2 to consider the issuance of bonus shares to its shareholders. This corporate action, if approved, would increase the number of shares held by existing shareholders without affecting the company's market capitalization.",
            "Sentiment": "positive",
            "PublishDate": 1745972627000,
            "Source": "default"
        },
        {
            "Title": "V-Mart Retail to Consider Bonus Share Issue",
            "Summary": "V-Mart Retail has announced that its board will meet on May 2 to consider issuing bonus shares to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1745940218000,
            "Source": "default"
        },
        {
            "Title": "V-Mart Retail: Mutual Funds Boost Stake to All-Time High in Q4FY25",
            "Summary": "Mutual funds increased their stake in V-Mart Retail to 32.22% in Q4FY25, an all-time high. The company opened its 500th store, now present in over 300 cities. Q4 revenue grew 17% YoY, with same-store sales growth over 8%.",
            "Sentiment": "positive",
            "PublishDate": 1745907354000,
            "Source": "normal_news"
        },
        {
            "Title": "V-Mart Retail to Consider Q4 Results on May 2",
            "Summary": "V-Mart Retail Limited has announced that it will consider and approve its financial results for the fourth quarter on May 2.",
            "Sentiment": "neutral",
            "PublishDate": 1745415572000,
            "Source": "default"
        },
        {
            "Title": "V-Mart Retail Ltd: Q4 Revenue Surges 17% Amid Store Expansion",
            "Summary": "V-Mart Retail Ltd reported a 17% increase in Q4 FY2025 revenue to Rs 780 crore. Annual revenue grew 17% to Rs 3,254 crore. Same-store sales growth was 8% for the quarter. The company opened 13 new stores and closed 4 during Q4, expanding its presence across multiple states.",
            "Sentiment": "positive",
            "PublishDate": 1743566876000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Reports 17% Revenue Growth in Q4FY25",
            "Summary": "V-Mart Retail announced its Q4FY25 financial results. The company reported revenue from operations of 7.80 billion rupees, representing a 17% year-over-year increase. Additionally, V-Mart Retail achieved a same-store sales growth of 8% for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1743519307000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail: Ambitious Expansion Plan of 60+ Stores Annually",
            "Summary": "V-Mart Retail plans to add over 60 stores annually, targeting 10-12% yearly retail space growth. CFO Anand Agarwal projects mid to high teens sales growth over 3-5 years, prioritizing profitability over revenue. The company aims for sustainable growth, expecting Ebitda to outpace sales growth. V-Mart acknowledges e-commerce challenges but remains focused on its brick-and-mortar model.",
            "Sentiment": "positive",
            "PublishDate": 1743237000000,
            "Source": "normal_news"
        },
        {
            "Title": "V-Mart Retail: Confident of High Single-Digit Growth Despite High Base Effect",
            "Summary": "V-Mart Retail Ltd.'s CFO Anand Agarwal expressed confidence in achieving mid to high single-digit growth in upcoming quarters, despite challenges from a higher base effect. The company reported a 154% increase in Q3 net profit to Rs 72 crore, with a 15% growth in revenue to Rs 1,027 crore.",
            "Sentiment": "positive",
            "PublishDate": 1738905022000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail: Q3 Net Profit Surges 154% YoY, Stock Soars",
            "Summary": "V-Mart Retail reported a 154% YoY increase in Q3FY25 consolidated net profit to ₹72 crore. Revenue rose 15% YoY to ₹1,027 crore, with EBITDA up 43% YoY. Same-store sales growth was 10% for Q3. The company operates 488 stores across India, focusing on Tier II and III cities.",
            "Sentiment": "positive",
            "PublishDate": 1738737969000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Reports 15.9% Revenue Growth in Q3",
            "Summary": "V-Mart Retail, an Indian retail company, has announced its financial results for the third quarter. The company reported revenue of 10.3 billion rupees, compared to 8.89 billion rupees in the same period last year, representing a year-over-year growth of approximately 15.9%.",
            "Sentiment": "positive",
            "PublishDate": 1738657589000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Reports Improved Q3 EBITDA and Margin",
            "Summary": "V-Mart Retail has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.71 billion rupees from 1.19 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 16.69% from 13.46% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738657546000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Reports Significant Increase in Q3 Net Profit",
            "Summary": "V-Mart Retail has announced its financial results for the third quarter, reporting a net profit of 716 million rupees. This represents a substantial increase from the 282.3 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738657513000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Reports 16% Revenue Growth in Q3FY25",
            "Summary": "V-Mart Retail has announced its financial results for the third quarter of fiscal year 2025. The company's total revenue reached 10.27 billion rupees, marking a 16% year-over-year increase. Additionally, V-Mart Retail reported a same-store sales growth of 10% for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1735827329000,
            "Source": "earnings"
        },
        {
            "Title": "V-Mart Retail Ltd Block Trade: 50,031 Shares Traded for Rs. 19.20 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving V-Mart Retail Ltd. Approximately 50,031 shares were traded at a price of Rs. 3,836.85 per share, totaling Rs. 19.20 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1735191534000,
            "Source": "block_deals"
        }
    ]
}