{
    "Symbol": "VMARCIND",
    "ISIN": "INE0GXK01018",
    "News": [
        {
            "Title": "V-MARC India Reports Strong H1 Performance with Revenue Doubling to 6.9B Rupees",
            "Summary": "V-MARC India delivered robust H1 results with revenue reaching 6.9 billion rupees compared to 3.5 billion rupees in the previous year. The company's EBITDA increased significantly to 783 million rupees from 344 million rupees year-over-year, while EBITDA margin improved to 11.32% from 9.96%. Net profit surged to 364 million rupees versus 114 million rupees in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1762525811976,
            "Source": "earnings"
        },
        {
            "Title": "Ashish Kacholia Acquires 2.71% Stake in V-Marc India, Stock Delivers 1,350% Returns in Three Years",
            "Summary": "Ashish Kacholia purchased a 2.71% stake in V-Marc India during the September quarter. The smallcap wire and cable manufacturer, founded in 1996, has generated 1,350% returns over three years and 123% returns in the past six months, significantly outperforming the Nifty (13%) and BSE Sensex (12%). V-Marc shares closed at Rs 542 on Friday, gaining 5.5%. The stock trades above its 50-day and 200-day moving averages but is in overbought territory with RSI at 73 and MFI at 84. Kacholia's portfolio contains 50 stocks worth Rs 2,941 crore. He recently added Jain Resource Recycling as his 50th portfolio stock through a pre-IPO allocation and reduced his stake in Jyoti Structures to below 1%.",
            "Sentiment": "positive",
            "PublishDate": 1760336515430,
            "Source": "stock"
        },
        {
            "Title": "V-Marc India Establishes New Defence and Aerospace Manufacturing Company",
            "Summary": "V-Marc India has established a new company called V-Marc Defence and Aerospace focused on manufacturing defence and aerospace parts.",
            "Sentiment": "positive",
            "PublishDate": 1758719090364,
            "Source": "stock"
        },
        {
            "Title": "V-MARC Allots 5 Lakh Shares to Investor Ashish Kacholia",
            "Summary": "<p>V-MARC has <span class='positive'>allotted</span> <b>5 lakh shares</b> to <span class='neutral'>prominent investor</span> <b>Ashish Kacholia</b> at a price of <b>Rs 286 per share</b>. This information was reported as an <span class='neutral'>SME update</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728367925000,
            "Source": "corporate_action"
        }
    ]
}