{
    "Symbol": "VMM",
    "ISIN": "INE01EA01019",
    "News": [
        {
            "Title": "Vishal Mega Mart Plans 100 New Stores by FY26",
            "Summary": "Vishal Mega Mart announces ambitious expansion plan to open 100 new stores by the end of FY26, as revealed in recent management concall update.",
            "Sentiment": "positive",
            "PublishDate": 1769582923318,
            "Source": "stocks"
        },
        {
            "Title": "Vishal Mega Mart Q3FY26 Profit Surges 19.1% YoY",
            "Summary": "Vishal Mega Mart reports consolidated profit of ₹3,129.23 million for Q3FY26, up 19.1% YoY. Revenue grows 17.0% to ₹36,704.11 million with strong operational performance across segments.",
            "Sentiment": "positive",
            "PublishDate": 1769524342482,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vishal Mega Mart Board Meet Set for Jan 27, 2026",
            "Summary": "Vishal Mega Mart Limited has scheduled a board meeting on January 27, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768907434198,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vishal Mega Mart VP Supply Chain Resigns",
            "Summary": "Vishal Mega Mart announces resignation of S Raamesh, Vice President - Supply Chain, effective January 09, 2026, citing personal reasons for departure from senior management role.",
            "Sentiment": "neutral",
            "PublishDate": 1767963545442,
            "Source": "stocks"
        },
        {
            "Title": "JPMorgan Maintains Overweight on Vishal Mega Mart",
            "Summary": "JPMorgan continues its positive outlook on Vishal Mega Mart with an 'Overweight' rating and sets price target at ₹158.00, reflecting confidence in the retail chain's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1767930985119,
            "Source": "stocks"
        },
        {
            "Title": "Vishal Mega Mart Subsidiary Faces ₹17.94L CGST Order",
            "Summary": "Vishal Mega Mart's subsidiary Airplaza Retail Holdings receives CGST order for ₹17.94 lakh over alleged excess input tax credit claims for FY 2021-22. Company reviewing order and evaluating next steps.",
            "Sentiment": "negative",
            "PublishDate": 1767007910498,
            "Source": "stocks"
        },
        {
            "Title": "Vishal Mega Mart Concludes Postal Ballot with Strong Approval",
            "Summary": "Vishal Mega Mart Limited successfully completed postal ballot voting on December 18, 2025, with overwhelming shareholder support for appointing Vageesh Gupta as Non-Executive Director (99.16% approval) and Yogesh Yadav as Independent Director (99.84% approval).",
            "Sentiment": "positive",
            "PublishDate": 1766056818396,
            "Source": "stocks"
        },
        {
            "Title": "Vishal Mega Mart Receives CGST Order for Rs. 13.48 Crore Tax Demand",
            "Summary": "Vishal Mega Mart Limited received an order from Additional Commissioner, CGST Commissionerate, Gurugram under Section 74 of CGST Act, 2017, alleging excess Input Tax Credit availed for Financial Year 2018-19 to 2022-23. The total demand amounts to Rs. 13,48,25,880 including tax demand of Rs. 6,73,56,857, interest of Rs. 1,12,166 and penalty of Rs. 6,73,56,857, with the company reviewing the order and evaluating next steps.",
            "Sentiment": "negative",
            "PublishDate": 1765285262638,
            "Source": "stock"
        },
        {
            "Title": "Vishal Mega Mart Allots 19.35 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Vishal Mega Mart Limited allotted 19,34,880 equity shares of Rs. 10 face value each to eligible employees and subsidiary employees following exercise of stock options under the 2019 ESOP plan at exercise prices ranging from Rs. 10 to Rs. 65. The allotment increased the company's paid-up share capital from Rs. 46,71,06,79,260 to Rs. 46,73,00,28,060, with the new shares ranking equally with existing equity shares including dividend entitlement.",
            "Sentiment": "neutral",
            "PublishDate": 1764586706817,
            "Source": "corporate_action"
        },
        {
            "Title": "Kedaara Capital Considers Selling Additional 13% Stake in Vishal Mega Mart",
            "Summary": "Kedaara Capital, promoter of Vishal Mega Mart, is open to selling an additional 13% stake in the company through a block deal at a discounted price. This potential stake sale would reduce Kedaara Capital's ownership in the retail chain and provide liquidity for the private equity firm.",
            "Sentiment": "neutral",
            "PublishDate": 1764064084855,
            "Source": "order&deals"
        },
        {
            "Title": "Vishal Mega Mart Reports Strong Q2 FY26 Results with 22.4% Revenue Growth",
            "Summary": "Vishal Mega Mart achieved revenue of INR 2,981 crores in Q2 FY26 with 22.4% growth and 12.8% adjusted same-store sales growth, benefiting from early Durga Puja and Chhath Puja festivals. The company expanded to 742 stores across 493 cities, improved EBITDA margins to 13.2%, and expects positive consumption impact from GST rate rationalization while maintaining accelerated store opening momentum.",
            "Sentiment": "positive",
            "PublishDate": 1763560510659,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Seeks Shareholder Approval for Two Director Appointments via Postal Ballot",
            "Summary": "Vishal Mega Mart has issued a postal ballot notice seeking shareholder consent to appoint Vageesh Gupta as Non-Executive Director and Yogesh Yadav as Independent Director, with remote e-voting scheduled from November 18 to December 17, 2025. The appointments require ordinary and special resolution approvals respectively, as both directors were initially appointed as Additional Directors on November 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763364676295,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vishal Mega Mart Declines to Provide Specific Financial Guidance During Concall",
            "Summary": "Vishal Mega Mart management declined to provide specific capex guidance numbers and same-store sales growth projections during their conference call, stating they do not provide forward-looking guidance. The company outlined general investment areas and expressed general optimism about market conditions while avoiding specific financial forecasts.",
            "Sentiment": "neutral",
            "PublishDate": 1763216452142,
            "Source": "stock"
        },
        {
            "Title": "Vishal Mega Mart Reports Strong Q2 Performance and Strengthens Board with Key Appointments",
            "Summary": "Vishal Mega Mart Limited approved unaudited financial results for the quarter and half-year ended September 30, 2025, while appointing Yogesh Yadav as Independent Director and Vageesh Gupta as Non-Executive Director. The company also appointed Sambit Swain as General Counsel and will seek shareholder approval for the director appointments through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1763062892626,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Plans Aggressive Expansion to 1,200+ Stores by FY28",
            "Summary": "Vishal Mega Mart has outlined an aggressive retail expansion strategy targeting over 1,200 stores by FY28, focusing on Tier-II and Tier-III cities while strengthening supply chain and private label offerings. The company aims to achieve revenue CAGR above 25% with consistent margin improvement and enhanced digital channel contribution.",
            "Sentiment": "positive",
            "PublishDate": 1763051627167,
            "Source": "stock"
        },
        {
            "Title": "Vishal MegaMart Reports Strong Q2FY26 Performance with 30.5% EBITDA Growth and Accelerated Store Expansion",
            "Summary": "Vishal MegaMart delivered robust quarterly results with revenue from operations reaching ₹29,815 crores and EBITDA growing 30.5% YoY to ₹3,946 crores, while maintaining gross profit margin at 28.3%. The company accelerated its expansion by adding 28 new stores in Q2FY26, bringing total store count to 742 across 291 cities, while strengthening its loyalty program with 157 million registered customers contributing 95% of revenue.",
            "Sentiment": "positive",
            "PublishDate": 1763045744102,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Reports Decline in Q2 Financial Performance",
            "Summary": "Vishal Mega Mart reported quarterly results showing a decline across key financial metrics. Net profit dropped to 1.52 billion rupees from 2.06 billion rupees compared to the previous quarter. Revenue decreased to 29.81 billion rupees from 31.4 billion rupees quarter-on-quarter. EBITDA fell to 3.95 billion rupees from 4.59 billion rupees, while EBITDA margin compressed to 13.23% from 14.62% compared to the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1763030677653,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Grants 40.25 Lakh Stock Options to Employees",
            "Summary": "Vishal Mega Mart Limited's Nomination and Remuneration Committee approved the grant of 40,25,000 stock options to eligible employees of the company and its subsidiary under the Vishal Mega Mart Employees Stock Options Plan 2019. The options are priced at Rs. 100 per option for 4,00,000 options and Rs. 138 per option for 36,25,000 options. Each stock option is convertible into one fully paid-up equity share with a face value of Rs. 10. The exercise period for vested options is 10 years from the grant date. The total equity shares covered by these stock options amount to 40,25,000 shares with a face value of Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1763024205397,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishal Mega Mart Subsidiary Faces Rs 3 Lakh Penalty for Food Safety Violations",
            "Summary": "Airplaza Retail Holdings Private Limited, a subsidiary of Vishal Mega Mart Limited, received a penalty of Rs 3,00,000 from the Additional District Magistrate Court in Cuttack. The penalty stems from a Food Safety Officer's inspection conducted on May 29, 2023, where samples of food products were collected from the subsidiary's store. The Food Safety Officer subsequently filed a complaint alleging violations of the Food Safety and Standards Act, 2006. The company states the financial impact is limited to the penalty amount with no material operational impact, as the penalty involves third-party manufactured products and will be recovered from the concerned manufacturer. The subsidiary is reviewing the order and evaluating next steps.",
            "Sentiment": "negative",
            "PublishDate": 1759318088009,
            "Source": "stock"
        },
        {
            "Title": "Vishal Mega Mart Subsidiary Faces Rs 1 Lakh Penalty for Food Safety Violation",
            "Summary": "Airplaza Retail Holdings Private Limited, a subsidiary of Vishal Mega Mart Limited, received a penalty of Rs 1,00,000 from the Additional District Magistrate court in Ghaziabad. The penalty stems from a February 2023 food safety inspection where a sampled product 'First Crop Vermicelli' was found non-compliant with Food Safety and Standards Act, 2006 provisions. The company states there is no material impact on operations and plans to recover the penalty amount from the third-party manufacturer. The subsidiary is reviewing the order and evaluating next steps.",
            "Sentiment": "negative",
            "PublishDate": 1756982381712,
            "Source": "stock"
        },
        {
            "Title": "Vishal Mega Mart Management Forecasts Flat Gross Margin for FY26",
            "Summary": "Vishal Mega Mart management has predicted that the company's gross margin will remain flat for FY26. This forecast was shared during a conference call update.",
            "Sentiment": "neutral",
            "PublishDate": 1755154235086,
            "Source": "stock"
        },
        {
            "Title": "Vishal Mega Mart Reports Strong Q1 Growth with 21% Revenue Increase and Margin Expansion",
            "Summary": "Vishal Mega Mart reported quarterly results showing revenue growth of 21% to ₹3,140.3 crore from ₹2,596.2 crore year-on-year. EBITDA increased 25.6% to ₹459 crore with margins expanding 60 basis points to 14.6% despite higher costs. Net profit surged 37.3% to ₹206 crore from ₹150 crore, supported by higher other income. Same store sales growth reached 10.5% year-on-year. The company operates 717 stores across 472 cities with a customer base of 151 million. Its Quick Commerce initiative spans 670 stores across 445 cities with 9.8 million registered users. Vishal Mega Mart will be included in the MSCI Standard Index, potentially attracting $258 million in inflows. Shares ended 3.5% higher at ₹144.85 and have nearly doubled from the IPO price of ₹78.",
            "Sentiment": "positive",
            "PublishDate": 1755084669213,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Reports Strong Q1 FY26 Results, Appoints New Auditors",
            "Summary": "Vishal Mega Mart Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 25,478.94 million and profit after tax of Rs 2,060.73 million. On a standalone basis, revenue was Rs 16,679.39 million with profit after tax of Rs 1,766.12 million. Basic earnings per share stood at Rs 0.45 (consolidated) and Rs 0.38 (standalone). The Board also approved several auditor appointments: Chandrasekaran Associates as Secretarial Auditors for five years (from 7th to 12th AGM), Walker Chandiok & Co LLP's re-appointment as Statutory Auditors for four years (from 7th to 11th AGM), and Ernst & Young LLP's re-appointment as Internal Auditors for FY 2025-26. All auditor appointments are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1755082395485,
            "Source": "earnings"
        },
        {
            "Title": "Four Companies Including Vishal Mega Mart and Swiggy Expected for MSCI Standard Index Addition",
            "Summary": "Nuvama Alternative & Quantitative Research expects Vishal Mega Mart, Swiggy, Hitachi Energy India, and Waaree Energies to be added to MSCI's Standard index during the August review announcement. These four stocks are projected to attract combined inflows of $1.03 billion. Conversely, Sonacoms and Thermax may face exclusion from the Standard index, potentially resulting in outflows of $186 million and $154 million respectively. The MSCI Smallcap Index is anticipated to see 12 additions and 4 exclusions, with potential inclusions of Inventurus Knowledge Solutions, Brainbees Solutions, Ather Energy, and Zinka Logistics Solutions.",
            "Sentiment": "neutral",
            "PublishDate": 1754355723498,
            "Source": "stock"
        },
        {
            "Title": "Vishal Mega Mart: Fire Breaks Out at Karol Bagh Store, One Person Suspected Missing",
            "Summary": "A fire erupted on the second floor of a four-story Vishal Mega Mart building in Karol Bagh, Delhi. 13 fire tenders responded, and while no injuries are reported, one person is suspected to be missing. The cause of the fire is unknown, and search and rescue operations are ongoing.",
            "Sentiment": "negative",
            "PublishDate": 1751649692000,
            "Source": "normal_news"
        },
        {
            "Title": "Vishal Mega Mart: Vanguard Group Acquires 1.1% Stake for ₹655 Crore",
            "Summary": "Vanguard Group purchased a 1.1% stake in Vishal Mega Mart for ₹655 crore through open market transactions. The investment firm bought over 5.04 crore shares at an average price of ₹129.74 per share. Following the acquisition, Vishal Mega Mart's stock rose 2.12% to close at ₹128.80 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1750478000000,
            "Source": "block_deals"
        },
        {
            "Title": "Vishal Mega Mart: Vanguard Acquires Rs 655 Crore Stake in Block Deals",
            "Summary": "US asset manager Vanguard purchased over 5 crore shares of Vishal Mega Mart Limited worth Rs 655 crore through two block deals. The shares were bought at Rs 129.74 per share via Vanguard Total International Stock Index Fund and Vanguard Emerging Markets Stock Index Fund.",
            "Sentiment": "positive",
            "PublishDate": 1750435749000,
            "Source": "block_deals"
        },
        {
            "Title": "Vishal Mega Mart: FTSE Global Mid Cap Index Inclusion Set for June 20",
            "Summary": "Vishal Mega Mart will be included in the FTSE Global Mid Cap Index on June 20, following a 20% promoter stake sale. This could lead to inflows of $115 million. The company is also expected to be considered for MSCI Index inclusion in August, potentially bringing in $225 million.",
            "Sentiment": "positive",
            "PublishDate": 1750293567000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishal Mega Mart: Shares Jump 5% After Promoter's Stake Sale",
            "Summary": "Vishal Mega Mart shares rose 5% to Rs 133.1 following a block deal where promoter Samayat Services LLP sold a 20% stake for Rs 10,488 crore at Rs 115 per share. The company's Q4 FY25 results showed an 88% YoY increase in net profit to Rs 115.1 crore and a 23.2% rise in revenue to Rs 2,547.9 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750222858000,
            "Source": "block_deals"
        },
        {
            "Title": "Vishal Mega Mart: Promoter Sells ₹10,220 Crore Stake, Mutual Funds Buy In",
            "Summary": "Vishal Mega Mart's promoter entity Samayat Services LLP sold 90 crore equity shares worth ₹10,220 crore via block deals. SBI Mutual Fund, HDFC MF, and Kotak Mahindra MF collectively purchased 32 crore shares for ₹3,636 crore. The shares were sold at a 9% discount to the previous closing price.",
            "Sentiment": "neutral",
            "PublishDate": 1750168852000,
            "Source": "block_deals"
        },
        {
            "Title": "Vishal Mega Mart: Promoter Plans ₹5,057 Crore Stake Sale via Block Deal",
            "Summary": "Samayat Services LLP, a promoter entity of Vishal Mega Mart, plans to sell a 10% stake in the company through block deals. The sale is estimated at ₹5,057 crore with a floor price of ₹110 per share, 12% below Monday's closing price. The company's Q4 FY25 results showed an 88% YoY increase in net profit to ₹115.1 crore and a 23.2% rise in revenue to ₹2,547.9 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1750126285000,
            "Source": "block_deals"
        },
        {
            "Title": "Vishal Mega Mart: Promoter to Sell 10% Stake in ₹5,057-Crore Block Deal",
            "Summary": "Samayat Services LLP, promoter of Vishal Mega Mart, plans to sell 10% equity stake through block deals. The deal size is estimated at ₹5,057 crore with a floor price of ₹110 per share. Vishal Mega Mart recently reported an 88% YoY increase in Q4 net profit and a 23.2% rise in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1750075768000,
            "Source": "block_deals"
        },
        {
            "Title": "Samayat Services to Sell 10% Stake in Vishal Mega Mart",
            "Summary": "Samayat Services is expected to sell a 10% stake in Vishal Mega Mart through block deals. The stake is valued at ₹50.57 billion, with an anticipated sale price of ₹110 per share. This information comes from sources cited by CNBC-TV18.",
            "Sentiment": "neutral",
            "PublishDate": 1750074573000,
            "Source": "default"
        },
        {
            "Title": "Vishal Mega Mart Fined ₹275,000 for Food Product Violation",
            "Summary": "An inspection of Vishal Mega Mart revealed a violation related to food products. As a result, a court has imposed a penalty of ₹275,000 on the company. The specific details of the violation or the inspection process were not provided in the given information.",
            "Sentiment": "negative",
            "PublishDate": 1749131665000,
            "Source": "default"
        },
        {
            "Title": "Vishal Mega Mart: Security Guard Job Listing Goes Viral",
            "Summary": "Vishal Mega Mart's recent hiring drive for security guards has sparked a viral trend on social media. The job listing, which includes a written exam on current affairs and languages, physical training, and medical checks, has been humorously compared to tough competitive exams like UPSC and IIT-JEE. The position offers a salary range of ₹9,000 to ₹25,000 per month with benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1747831913000,
            "Source": "normal_news"
        },
        {
            "Title": "Vishal Mega Mart: Q4 Profit Soars 88%, Analysts Bullish on Growth",
            "Summary": "Vishal Mega Mart's Q4 FY25 net profit rose 88% YoY, driven by strong festive demand and private label growth. Revenue increased 23% to Rs 2,547.89 crore. Analysts from Jefferies and JPMorgan raised target prices, citing double-digit same-store sales growth and expansion into new geographies.",
            "Sentiment": "positive",
            "PublishDate": 1746160461000,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart: Share Price Surges 10% Post Strong Q4 Results",
            "Summary": "Vishal Mega Mart's share price hit the 10% upper circuit at ₹118.35 on BSE, following the release of strong Q4 results. The stock opened at ₹112 and traded at ₹117.90, up 9.57% around 12:10 PM.",
            "Sentiment": "positive",
            "PublishDate": 1745994987000,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart: Q4 Net Profit Soars 88% YoY, Revenue Up 23%",
            "Summary": "Vishal Mega Mart reported an 88% YoY increase in Q4 FY25 net profit to Rs 115.1 crore. Revenue rose 23.2% to Rs 2,547.9 crore. EBITDA grew 42.6% to Rs 357 crore with margin expansion to 14%. For FY25, net profit increased 36.8% to Rs 631.97 crore on 20.2% higher revenue of Rs 10,716.35 crore. The company operates 668 stores as of December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1745980857000,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Reports Strong Q4 FY23 Results",
            "Summary": "Vishal Mega Mart has announced its Q4 FY23 results, showing significant year-over-year growth. The company's consolidated net profit increased to 1.15 billion rupees, up from 612 million rupees in the same quarter last year. Revenue also saw a substantial rise to 25.48 billion rupees from 20.7 billion rupees year-over-year. The company's Same Store Sales Growth (SSSG) improved to 13.4%, compared to 10.5% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745972709000,
            "Source": "default"
        },
        {
            "Title": "Vishal Mega Mart Reports Strong Q4 Same-Store Sales Growth",
            "Summary": "Vishal Mega Mart, a retail chain, has reported a significant increase in its same-store sales growth (SSSG) for the fourth quarter. The SSSG is reported at 13.4%, up from 10.5% in the previous quarter, indicating a robust performance and improved consumer demand.",
            "Sentiment": "positive",
            "PublishDate": 1745939165000,
            "Source": "result"
        },
        {
            "Title": "Vishal Mega Mart: Q4 Net Profit Soars 88%, Revenue Up 23%",
            "Summary": "Vishal Mega Mart reported an 88% YoY increase in Q4 net profit to ₹115.1 crore. Revenue rose 23.2% to ₹2,547.9 crore. EBITDA grew 42.6% to ₹357 crore, with margin improving to 14%. The company operates 668 stores as of December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1745937654000,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Reports Strong Q4 Financial Results",
            "Summary": "Vishal Mega Mart has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 3.57 billion rupees from 2.5 billion rupees in the previous year, with EBITDA margin rising to 14.02% from 12.11%. Consolidated net profit grew to 1.15 billion rupees, up from 612 million rupees year-over-year, but down from 2.6 billion rupees quarter-over-quarter. Revenue for Q4 reached 25.48 billion rupees, compared to 20.7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745932704000,
            "Source": "result"
        },
        {
            "Title": "Vishal Mega Mart to Consider Q4 Results on April 29",
            "Summary": "Vishal Mega Mart has announced that it will consider its fourth quarter (Q4) financial results on April 29. This indicates that the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745409597000,
            "Source": "default"
        },
        {
            "Title": "Vishal Mega Mart: Jefferies Bullish, Bernstein Cautious",
            "Summary": "Jefferies initiates 'Buy' with ₹125 target, citing 20% upside and strong growth potential. Bernstein rates 'Underperform' with ₹90 target, warning of valuation risks and margin pressures. Stock closed at ₹104.50, up 1.96%.",
            "Sentiment": "neutral",
            "PublishDate": 1744167229000,
            "Source": "normal_news"
        },
        {
            "Title": "Vishal Mega Mart: Shareholder Lock-In Period Ends March 17",
            "Summary": "Vishal Mega Mart's three-month shareholder lock-in period ends on March 17, freeing up 15.38 crore shares (3% of outstanding equity) for potential trading. The stock closed at ₹99.95 on Thursday, below its listing price of ₹104 but still 25% above its IPO price.",
            "Sentiment": "neutral",
            "PublishDate": 1741926003000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishal Mega Mart: Kotak Initiates Coverage with 9% Upside Potential",
            "Summary": "Kotak Institutional Equities initiated coverage on Vishal Mega Mart with an 'ADD' rating and a price target of ₹110 per share, projecting a 9% upside. The brokerage expects 17% revenue CAGR over FY2025-2028, driven by 9-13% SSSG and 12.6% retail area CAGR. Kotak forecasts 18% EBITDA CAGR and 24% PAT CAGR for the same period.",
            "Sentiment": "positive",
            "PublishDate": 1740969610000,
            "Source": "normal_news"
        },
        {
            "Title": "Vishal Mega Mart: Shares Surge to New Post-Listing High",
            "Summary": "Vishal Mega Mart shares gained 7% on February 4, marking the seventh consecutive day of gains. The stock reached a new post-listing high of ₹127, up 56% from its IPO price. Analysts cite potential benefits from recent income tax relief and strong expansion potential. Elara Securities maintains a 'buy' rating with a ₹140 target, while Morgan Stanley initiated coverage with an 'overweight' rating and ₹161 target.",
            "Sentiment": "positive",
            "PublishDate": 1738664242000,
            "Source": "normal_news"
        },
        {
            "Title": "Vishal Mega Mart: Q3 Net Profit Surges 28% YoY to Rs 263 Crore",
            "Summary": "Vishal Mega Mart reported a 28% YoY increase in Q3 FY25 net profit to Rs 262.7 crore. Revenue from operations rose 19.5% to Rs 3,136 crore. EBITDA grew 18.3% to Rs 505 crore. The company operates 668 stores across 432 cities with 11.8 million square feet of retail space.",
            "Sentiment": "positive",
            "PublishDate": 1738382169000,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Reports Q3 EBITDA Growth",
            "Summary": "Vishal Mega Mart has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 505 million rupees, up from 427 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 16.11% from 16.28% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738330551000,
            "Source": "earnings"
        },
        {
            "Title": "Vishal Mega Mart Reports Q3 Financial Results",
            "Summary": "Vishal Mega Mart has announced its Q3 consolidated net profit of 263 million rupees, showing an increase from 205 million rupees year-over-year and 104 million rupees quarter-over-quarter. The company's Q3 revenue reached 3.1 billion rupees, up from 2.6 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738330491000,
            "Source": "earnings"
        }
    ]
}