{
    "Symbol": "VMSTMT",
    "ISIN": "INE0SJA01013",
    "News": [
        {
            "Title": "VMS TMT Reports Fund Utilization Deviation in Q3FY26",
            "Summary": "VMS TMT Limited reports deviation in IPO fund utilization for Q3FY26, with Rs. 2.81 crore variance in debt repayment allocation due to banking procedural delays.",
            "Sentiment": "neutral",
            "PublishDate": 1770912506541,
            "Source": "stocks"
        },
        {
            "Title": "VMS TMT Board Meet Set for Feb 12 to Review Q3 Results",
            "Summary": "VMS TMT Limited has scheduled its board meeting for February 12, 2026, to consider and approve standalone unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770194518158,
            "Source": "co_actions_results"
        },
        {
            "Title": "VMSTMT Limited Reports Zero Deviation in IPO Fund Utilization for Q2 FY26",
            "Summary": "VMSTMT Limited's monitoring agency CARE Ratings confirmed no deviation from stated IPO objectives for the quarter ended September 30, 2025, with Rs. 23.63 crore utilized out of Rs. 148.50 crore raised. The company deployed funds toward loan repayment preparations, general corporate purposes including raw materials, and issue-related expenses, with unutilized proceeds of Rs. 124.87 crore invested in fixed deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1763146221571,
            "Source": "earnings"
        },
        {
            "Title": "VMS TMT Secures Orders Worth ₹46 Crores for Over 10,000 Metric Tonnes During Diwali",
            "Summary": "VMS TMT secured cumulative orders exceeding 10,000 metric tonnes valued at approximately ₹46 crores during the Diwali period. The company attributes this strong demand to growth in infrastructure and housing sectors.",
            "Sentiment": "positive",
            "PublishDate": 1760948783245,
            "Source": "order&deals"
        },
        {
            "Title": "VMS TMT Limited Signs One-Year Contract with EquiBridgeX Advisors for PR and Investor Relations Services",
            "Summary": "VMS TMT Limited's Board of Directors approved entering into a contract with EquiBridgeX Advisors Private Limited during their meeting on October 10, 2025. The contract covers management of Public Relations, Investor Relations and Social Media Services for the company. The agreement is valid for one year from October 10, 2025 to October 9, 2026, with potential renewal based on mutual consent. VMS TMT Limited holds no shareholding in EquiBridgeX Advisors, and the parties are not related to the promoter or group companies. The transaction does not fall under related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1760095979966,
            "Source": "stock"
        }
    ]
}