{
    "Symbol": "VOLTAS",
    "ISIN": "INE226A01021",
    "News": [
        {
            "Title": "Voltas Q3 Net Profit Drops 36% to ₹850 Million",
            "Summary": "Voltas reported consolidated net profit of ₹850 million in Q3, down from ₹1.32 billion year-on-year. Revenue declined marginally to ₹30.7 billion from ₹31 billion in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1769692223710,
            "Source": "co_actions_results"
        },
        {
            "Title": "Voltas Shares Drop 2.04% Despite Strong FY25 Growth",
            "Summary": "Voltas shares declined 2.04% to Rs 1,288.60 amid bearish sentiment. Company reported strong FY25 performance with revenue rising to Rs 15,412.79 crore and net profit surging to Rs 960.28 crore.",
            "Sentiment": "negative",
            "PublishDate": 1769506591665,
            "Source": "stocks"
        },
        {
            "Title": "Voltas Q3FY26 Earnings Call Set for January 29",
            "Summary": "Voltas Limited announces Q3FY26 earnings conference call scheduled for January 29, 2026 at 7:00 PM IST. Senior management including MD and CFO to participate in analyst meet.",
            "Sentiment": "neutral",
            "PublishDate": 1769167465683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Cuts Voltas Q3 Revenue Growth Forecast",
            "Summary": "Morgan Stanley revises Voltas Q3 revenue estimates to -7% decline from earlier 20% growth projection, citing elevated channel inventory levels impacting performance.",
            "Sentiment": "negative",
            "PublishDate": 1768798249047,
            "Source": "stocks"
        },
        {
            "Title": "Voltas Breaks Year-Long Triangle Pattern",
            "Summary": "Voltas stock breaks out of triangular formation after a year, with technical analysts suggesting potential upside targets of ₹1,600 in coming weeks despite recent momentum loss from January highs.",
            "Sentiment": "positive",
            "PublishDate": 1768260771431,
            "Source": "stocks"
        },
        {
            "Title": "Voltas Sees ₹75.78 Cr Block Trade on NSE",
            "Summary": "Voltas Ltd witnessed a significant block trade worth ₹75.78 crores on NSE involving 502,344 shares at ₹1,508.60 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767774435491,
            "Source": "co_actions_results"
        },
        {
            "Title": "Voltas Faces ₹27.04 Lakh GST Demand from Authorities",
            "Summary": "Voltas receives GST demand orders totaling ₹27.04 lakh with equal penalty amounts from CGST authorities for alleged short payment and Input Tax Credit disallowance covering FY2018-19 to FY2023-24.",
            "Sentiment": "negative",
            "PublishDate": 1767249627544,
            "Source": "stocks"
        },
        {
            "Title": "Voltas Gets Major Relief in Tax Demand Reduction",
            "Summary": "Voltas announces significant reduction in tax demand from ₹2.65 billion to ₹107.70 million, providing substantial financial relief to the consumer durables company.",
            "Sentiment": "positive",
            "PublishDate": 1767233829565,
            "Source": "stocks"
        },
        {
            "Title": "Voltas Gets Major Relief in GST Penalty Reduction",
            "Summary": "Voltas reports significant reduction in GST penalty from ₹265.25 crores to ₹10.77 crores following detailed submissions to tax authorities, providing substantial financial relief to the company.",
            "Sentiment": "positive",
            "PublishDate": 1767185462673,
            "Source": "stocks"
        },
        {
            "Title": "Voltas Appoints Jayant Balan as Head of AC Business",
            "Summary": "Voltas Limited announces the appointment of Mr. Jayant Balan as Head – Room Air Conditioner Business effective January 1, 2026. Balan brings over 25 years of experience with the Tata Group.",
            "Sentiment": "positive",
            "PublishDate": 1766760057612,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Issues Buy Call on Voltas with ₹1,635 Target",
            "Summary": "Jefferies maintains bullish stance on Voltas with buy recommendation and target price of ₹1,635 per share, indicating positive outlook for the consumer durables company.",
            "Sentiment": "positive",
            "PublishDate": 1766115553652,
            "Source": "stocks"
        },
        {
            "Title": "Citi Maintains 'Buy' Rating on Voltas at ₹1,775",
            "Summary": "Citi Research continues its positive outlook on Voltas with a 'Buy' recommendation and price target of ₹1,775, reflecting confidence in the consumer durables company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766115241251,
            "Source": "stocks"
        },
        {
            "Title": "Voltas GST demand reduced to ₹20.14 lakhs from ₹31.77 cr",
            "Summary": "Voltas receives favorable GST order with tax demand reduced from ₹31.77 crores to ₹20.14 lakhs following detailed submissions to Commissioner CGST Indore for FY2018-21 period.",
            "Sentiment": "positive",
            "PublishDate": 1765540278318,
            "Source": "stocks"
        },
        {
            "Title": "Voltas Appoints Amit Jaiswal as Head Internal Audit",
            "Summary": "Voltas Limited appointed Amit Jaiswal, a Chartered Accountant with over 17 years of internal audit experience, as Head Internal Audit effective December 8, 2025. Jaiswal previously served as Global Head - Internal Audit at Cipla and brings expertise in internal audit, risk management, forensic investigations, and compliance.",
            "Sentiment": "positive",
            "PublishDate": 1765169885886,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Increases Stake in Voltas by 2.03% Over Six-Week Period",
            "Summary": "Life Insurance Corporation of India raised its shareholding in Voltas by 2.03 percentage points to reach 7.08% between September 25 and November 11. The acquisition represents a significant increase in LIC's investment position in the air conditioning and engineering services company.",
            "Sentiment": "neutral",
            "PublishDate": 1763983168754,
            "Source": "corporate_action"
        },
        {
            "Title": "Voltas Q2 FY26 Results: Revenue Drops to ₹2,412 Crores Amid Extended Monsoons and GST-Related Demand Deferment",
            "Summary": "Voltas reported consolidated total income of ₹2,411.93 crores for Q2 FY26 compared to ₹2,724.58 crores in the same period last year, with net profit declining to ₹31.50 crores from ₹132.83 crores due to extended monsoons and GST-related demand deferment in the cooling segment. The company strengthened its market leadership position with air conditioner market share increasing sequentially from 16% in Q4 FY25 to 18.5% in Q2 FY26, while maintaining a robust project business order book exceeding ₹6,200 crores.",
            "Sentiment": "negative",
            "PublishDate": 1763636459328,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Management Declines to Provide Specific Financial Guidance During Concall",
            "Summary": "Voltas management declined to provide specific revenue and profitability guidance for the near term, stating it was too early to make predictions, while indicating directionally positive margin trends due to expected cost reductions. The company also could not specify timing for Voltbek appliances business EBITDA breakeven, though noting some months come close to profitability.",
            "Sentiment": "negative",
            "PublishDate": 1763218270024,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Reports 10% Revenue Decline Due to Cooling Products Segment Drop",
            "Summary": "Voltas experienced a 10% year-over-year revenue decline to Rs 23.47 billion, primarily driven by a 23% drop in its unitary cooling products segment. The decline was attributed to prolonged monsoon conditions, elevated channel inventory levels, and customers delaying purchases in anticipation of GST rate reductions.",
            "Sentiment": "neutral",
            "PublishDate": 1763182469805,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Shares Worth Rs. 99.40 Crores Traded in NSE Block Deal",
            "Summary": "Voltas Ltd. witnessed a block trade on the National Stock Exchange involving approximately 727,534 shares at a price of Rs. 1,366.2 per share, with the total transaction value amounting to Rs. 99.40 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1759899970365,
            "Source": "order&deals"
        },
        {
            "Title": "Voltas Ltd. Executes ₹62.59 Crore Block Trade on NSE",
            "Summary": "Voltas Ltd. completed a block trade worth ₹62.59 crores on the National Stock Exchange. The transaction involved approximately 461,217 shares at a price of ₹1,357.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759299347726,
            "Source": "order&deals"
        },
        {
            "Title": "Voltas Expects Sequential Recovery in Q3 and Q4 Amid Market Challenges",
            "Summary": "Voltas management anticipates sequential recovery through Q3 and Q4, with Q3 expected to perform particularly well. The company's optimism is supported by strong festive demand, GST rate reduction from 28% to 18% for air conditioners and dishwashers effective September 22, and pent-up demand following a subdued summer season. Nirmal Bang maintains a 'Hold' rating on the stock with a revised target price.",
            "Sentiment": "positive",
            "PublishDate": 1758522843540,
            "Source": "stock"
        },
        {
            "Title": "Voltas Links Demand Recovery to Summer Season Strength Amid Competitive Pressures",
            "Summary": "Voltas management indicated that the company's demand recovery depends on a strong summer season, though they noted this remains uncertain. The company acknowledged that increasing competition continues to pose challenges for maintaining market share in their business segments.",
            "Sentiment": "neutral",
            "PublishDate": 1758514571351,
            "Source": "stock"
        },
        {
            "Title": "Voltas Transfers Dubai and Abu Dhabi Projects to Subsidiary UMCL",
            "Summary": "Voltas has transferred its projects in Dubai and Abu Dhabi to its subsidiary UMCL.",
            "Sentiment": "neutral",
            "PublishDate": 1755705476594,
            "Source": "stock"
        },
        {
            "Title": "Voltas Reports 58% Drop in Net Profit for Q1 FY26 Due to Weak Summer Season",
            "Summary": "Voltas Limited reported consolidated net profit of ₹140.61 crores for Q1 FY26, down 58% from ₹335 crores in the same period last year. Total income fell to ₹4,020.65 crores from ₹5,001.27 crores. The decline was attributed to a late, mild summer season that curtailed peak demand for air conditioners. Despite challenges, Voltas maintained its market leadership in room air conditioners with 17.80% market share. The Unitary Cooling Products segment revenue dropped to ₹2,867.86 crores from ₹3,802.17 crores, while EBIT fell to ₹104.37 crores from ₹327.02 crores. Voltas Beko showed strong performance with 33% year-on-year volume growth, selling close to one million units. The company expects recovery during the festive season and anticipates flat to 5-10% degrowth for the full year. Management cited inventory normalization efforts and cost improvement initiatives to address margin pressures.",
            "Sentiment": "negative",
            "PublishDate": 1755181501833,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Reports 58% Decline in Q1 Net Profit to 1.4 Billion Rupees",
            "Summary": "Voltas reported consolidated net profit of 1.4 billion rupees for Q1, down from 3.34 billion rupees year-over-year, missing analyst estimates of 2.43 billion rupees. Revenue declined to 39.38 billion rupees from 49.2 billion rupees in the same period last year, falling short of the estimated 43.55 billion rupees. EBITDA dropped significantly to 1.78 billion rupees from 4.24 billion rupees year-over-year, while EBITDA margin compressed to 4.53% from 8.61% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754871997498,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Q1 Net Profit Falls 58% to 1.4 Billion Rupees, Misses Estimates",
            "Summary": "Voltas reported Q1 consolidated net profit of 1.4 billion rupees, down from 3.34 billion rupees year-over-year, falling short of analyst estimates of 2.43 billion rupees. The company's Q1 revenue declined to 39.38 billion rupees from 49.2 billion rupees in the same period last year, also missing analyst expectations of 43.55 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1754648633601,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Schedules Q1FY26 Earnings Call for August 8, 2025",
            "Summary": "Voltas Limited has scheduled a Q1FY26 earnings call on August 8, 2025, at 18:00 hrs IST. The group conference call with analysts and institutional investors will be hosted by DAM Capital Advisors Ltd. Key management participants include Managing Director & CEO Pradeep Bakshi, Managing Director Designate Mukundan Menon C P, Chief Financial Officer K V Sridhar, Head Corporate Finance Nikhil R Chandarana, and Head Treasury Vaibhv Vora. The call will be accessible via dial-in numbers with international timing options for Hong Kong, Singapore, UK, and USA markets.",
            "Sentiment": "neutral",
            "PublishDate": 1754400361798,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Schedules Board Meeting on August 8 to Approve Quarterly Financial Results",
            "Summary": "Voltas Limited has scheduled a Board of Directors meeting on August 8, 2025 to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The trading window for company shares will remain closed until 48 hours after the results are declared. The trading window was initially closed from June 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754057595638,
            "Source": "corporate_action"
        },
        {
            "Title": "Voltas Ltd. Block Trade: 156,591 Shares Sold for Rs. 21.82 Crores",
            "Summary": "A block trade of approximately 156,591 shares of Voltas Ltd. was executed on the National Stock Exchange (NSE) for a total value of Rs. 21.82 Crores. The trade was conducted at a price of Rs. 1393.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752637711000,
            "Source": "block_details"
        },
        {
            "Title": "Voltas Launches New FLO Series of Fans",
            "Summary": "Voltas has introduced a new line of fans called the FLO Series. The announcement suggests an expansion of the company's product offerings in the home appliance sector, specifically in the fan category.",
            "Sentiment": "positive",
            "PublishDate": 1751958726000,
            "Source": "default"
        },
        {
            "Title": "Voltas Ltd: Receives ₹265.25 Crore GST Show Cause Notice",
            "Summary": "Voltas Ltd received a show cause notice from GST authorities for alleged short payment of ₹265.25 crore in taxes by its merged entity, Universal Comfort Products Limited, for FY2018-19 to FY2020-21. The company is evaluating the matter and will respond within the prescribed time.",
            "Sentiment": "negative",
            "PublishDate": 1751457309000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Voltas Receives GST Underpayment Notice for 2.65 Billion Rupees",
            "Summary": "Voltas has been issued a notice for underpaying Goods and Services Tax (GST). The company is expected to pay a total of 2.65 billion rupees, which includes the unpaid tax amount, interest, and associated fines.",
            "Sentiment": "negative",
            "PublishDate": 1751456651000,
            "Source": "default"
        },
        {
            "Title": "Avendus Upgrades Voltas Stock Rating",
            "Summary": "Avendus has upgraded its rating on Voltas stock from 'Reduce' to 'Buy'. This change in recommendation suggests a more positive outlook on the company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1750910332000,
            "Source": "normal_news"
        },
        {
            "Title": "Voltas: Target Price Cut as Early Monsoon Dampens AC Sales",
            "Summary": "Voltas stock dropped over 2% following Nuvama's target price cut from Rs 1,250 to Rs 1,190 due to weaker AC sales caused by early monsoon. Industry-wide RAC sales declined 15-20% YoY. Voltas maintains 'hold' rating, aims for 4-5% margins in project business. UBS keeps 'buy' rating with Rs 1,725 target, while Motilal Oswal downgrades to 'neutral' with Rs 1,350 target.",
            "Sentiment": "negative",
            "PublishDate": 1750221123000,
            "Source": "normal_news"
        },
        {
            "Title": "Voltas Reports 20-25% Decline in Room AC Sales for April and May",
            "Summary": "According to a recent conference call update, Voltas has reported a decline of 20-25% in room air conditioner sales volumes for the months of April and May.",
            "Sentiment": "negative",
            "PublishDate": 1750153285000,
            "Source": "default"
        },
        {
            "Title": "Voltas Ltd: Q4 Profit Doubles, Shares Rise 4%",
            "Summary": "Voltas Ltd's Q4 consolidated net profit surged 107% to Rs 241 crore. Revenue increased 13% to Rs 4,767 crore. EBITDA up 75% to Rs 333 crore. Board recommends Rs 7 per share dividend for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746680376000,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Reports Strong Q4 Results with Increased Profit and Revenue",
            "Summary": "Voltas announced its Q4 financial results, showing significant growth. The consolidated net profit rose to 2.4 billion rupees, up from 1.16 billion rupees year-over-year and 1.3 billion rupees quarter-over-quarter. Revenue increased to 47.8 billion rupees from 42.03 billion rupees in the same quarter last year. The company has also recommended a dividend of 7 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746663164000,
            "Source": "default"
        },
        {
            "Title": "Voltas Ltd: Q4 Profit Doubles, Misses Estimates, Declares ₹7 Dividend",
            "Summary": "Voltas Ltd reported Q4 net profit up 108% YoY to ₹241 crore, missing estimates. Revenue rose 13.4% to ₹4,768 crore, EBITDA grew 74.6% to ₹332.8 crore, and operating margin improved to 7%. The company declared a dividend of ₹7 per share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1746625101000,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Reports Strong Q4 Results and Announces Dividend",
            "Summary": "Voltas has reported significant year-over-year improvements in its Q4 financial results. The company's consolidated net profit increased to 2.4 billion rupees from 1.16 billion rupees in the previous year. Revenue rose to 47.8 billion rupees from 42.03 billion rupees. EBITDA improved to 3.3 billion rupees with a margin of 6.96%, up from 1.91 billion rupees and 4.53% respectively. Additionally, Voltas has recommended a dividend of 7 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746622254000,
            "Source": "result"
        },
        {
            "Title": "Voltas Ltd: Q4 Results Date and Dividend Announcement Scheduled",
            "Summary": "Voltas Ltd will announce Q4 and FY2025 results on May 7, 2025. The board will also consider dividend recommendation. Trading window closed from March 25 until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1746440478000,
            "Source": "corporate_action"
        },
        {
            "Title": "Government to Relax BIS Norms for Voltas",
            "Summary": "The government is planning to ease Bureau of Indian Standards (BIS) norms for Voltas, potentially impacting the company's operations and regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1745308064000,
            "Source": "default"
        },
        {
            "Title": "Voltas Ltd: Customs Duty Notice for ₹24.81 Crore Underpayment",
            "Summary": "Voltas Ltd received a show cause notice from customs authorities alleging underpayment of import duties worth ₹24.81 crore. The notice, dated April 1, 2025, seeks explanation and potential recovery of the amount with interest and penalties. Voltas is reviewing the matter and plans to respond within the prescribed timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1744898173000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Voltas Ltd.: Strong Summer Demand Expected Despite High Base",
            "Summary": "Voltas anticipates robust demand for the upcoming summer season, outpacing industry growth. The company is focusing on profit expansion through value engineering rather than price hikes. Voltas has secured adequate compressors for expected demand and is deploying more in-shop demonstrators to expand market share. Analysts maintain mostly positive outlook with varying price targets.",
            "Sentiment": "positive",
            "PublishDate": 1742452905000,
            "Source": "normal_news"
        },
        {
            "Title": "Voltas Ltd: HSBC Cuts Target Price Amid Margin Concerns",
            "Summary": "HSBC reduced Voltas Ltd's target price by 15% to Rs 1,630 due to margin recovery concerns, rising costs, and competition. The company faces challenges in compressor sourcing and manufacturing costs. Analysts expect volume growth but not margin recovery in the upcoming summer season. Voltas is focusing on market share gains over margin expansion.",
            "Sentiment": "negative",
            "PublishDate": 1742447247000,
            "Source": "normal_news"
        },
        {
            "Title": "Voltas Approves Transfer of Dubai and Abu Dhabi Branches to UMCL",
            "Summary": "Voltas has approved the transfer of its Dubai and Abu Dhabi branches to UMCL (Unitary Mechanical Contracting LLC). The total consideration for this transfer is set between 450 million rupees to 700 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1741871748000,
            "Source": "corporate_action"
        },
        {
            "Title": "Voltas Ltd: Completes ₹61.84 Crore Stake Transfer in Saudi Subsidiary",
            "Summary": "Voltas Ltd has transferred 92% stake in Saudi Ensas Company to its Singapore subsidiary Universal MEP Projects Pte Ltd for ₹61.84 crore. The transaction was completed on February 28, 2025. Voltas' economic interest in Saudi Ensas remains unchanged as UMPPL is a wholly owned subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1740766771000,
            "Source": "corporate_action"
        },
        {
            "Title": "Voltas Shares Rise as India Faces Unusually Warm March",
            "Summary": "Voltas shares have increased by 1% following reports from the Indian weather office that the country is set to experience one of the warmest March months on record as it enters the summer season. This news potentially signals increased demand for cooling products, which could benefit Voltas, a major player in the air conditioning and cooling systems market.",
            "Sentiment": "positive",
            "PublishDate": 1740648510000,
            "Source": "normal_news"
        },
        {
            "Title": "Voltas Ltd: Qatar Court Orders ₹402 Crore Payout in Legal Battle",
            "Summary": "Voltas Ltd has been ordered to pay QAR 167.720 million (₹402 crore) by a Qatar court in a legal dispute with OHL&C consortium. The court dismissed Voltas' claims and ruled in favor of releasing bank guarantees. Voltas plans to appeal the verdict. The company's shares dropped over 3% following the news.",
            "Sentiment": "negative",
            "PublishDate": 1738831689000,
            "Source": "order&deals"
        },
        {
            "Title": "Voltas Reports Significant Improvement in Q3 EBITDA and Margin",
            "Summary": "Voltas, an Indian multinational home appliances company, has reported a substantial increase in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA rose to 1.98 billion rupees, up from 279 million rupees in the same quarter of the previous year. Additionally, Voltas' EBITDA margin improved significantly, reaching 6.38% compared to 1.06% in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738152321000,
            "Source": "earnings"
        },
        {
            "Title": "Voltas Reports Significant Profit Turnaround in Q3",
            "Summary": "Voltas has reported a consolidated net profit of 1.32 billion rupees in the third quarter, marking a substantial turnaround from a loss of 304 million rupees in the same period last year. The company's revenue also saw an increase, rising to 30.9 billion rupees from 26.26 billion rupees year-over-year. Sequentially, the net profit showed a slight improvement from 1.33 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738152247000,
            "Source": "earnings"
        }
    ]
}