{
    "Symbol": "VOLTAMP",
    "ISIN": "INE540H01012",
    "News": [
        {
            "Title": "Voltamp Transformers Q3 Net Profit Surges 35%",
            "Summary": "Voltamp Transformers reports strong Q3 performance with standalone net profit rising to ₹991 million from ₹734 million year-on-year, marking significant growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1770279946180,
            "Source": "co_actions_results"
        },
        {
            "Title": "Voltamp Transformers Secures ₹85.05 Crore Order from Gujarat Energy Transmission Corporation",
            "Summary": "Voltamp Transformers Limited received a Letter of Intent worth ₹85.05 crore (inclusive of GST) from Gujarat Energy Transmission Corporation Limited for supply of various ratings of power transformers. The order involves design, manufacture, testing and supply of power transformers as per tender specifications, with no related party transaction involvement.",
            "Sentiment": "positive",
            "PublishDate": 1764246138780,
            "Source": "order&deals"
        },
        {
            "Title": "Voltamp Transformers Reports Q2 Results and Elevates Vijay Gupta as COO",
            "Summary": "Voltamp Transformers Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a profit before tax of ₹104.19 crore for the quarter compared to ₹104.65 crore in the same quarter last year. For the half-year period, profit before tax stood at ₹208.84 crore versus ₹204.79 crore in the previous year. The company's total assets increased to ₹1,900.94 crore as of September 30, 2025, from ₹1,775.66 crore as of March 31, 2025. Additionally, the Board approved the elevation of Mr. Vijay Gupta as Chief Operating Officer (COO), categorized as Senior Management Personnel, effective November 8, 2025. Mr. Gupta holds a Bachelor's degree in Electrical Engineering and MBA, with 18 years at the company and 33 years of total experience in the transformer industry. He previously served as Business Unit Head of Power Transformer Unit and had spent 15 years with Crompton Greaves Ltd before joining Voltamp.",
            "Sentiment": "neutral",
            "PublishDate": 1762590545411,
            "Source": "earnings"
        },
        {
            "Title": "Voltamp Transformers Reports Growth in Q2 Financial Results",
            "Summary": "Voltamp Transformers reported Q2 net profit of 788.5 million rupees compared to 757.4 million rupees in the same period last year. Revenue increased to 4.82 billion rupees from 3.98 billion rupees year-over-year. EBITDA rose to 935.6 million rupees from 749.8 million rupees, while EBITDA margin improved to 19.39% from 18.85% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762589245902,
            "Source": "earnings"
        },
        {
            "Title": "Voltamp Transformers Secures ₹149 Crore Order",
            "Summary": "Voltamp Transformers has secured an order worth ₹149 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761727159267,
            "Source": "order&deals"
        },
        {
            "Title": "Citigroup and Domestic Institutions Invest Rs 364 Crore in Voltamp Transformers Bulk Deal",
            "Summary": "Citigroup purchased 57,000 shares of Voltamp Transformers for Rs 43 crore at Rs 7,605 per share, representing a 2% discount to the previous closing price. Domestic institutional investors including Aditya Birla Sun Life Insurance Company (Rs 65 crore), The Prudential Assurance Company (Rs 116 crore), UTI Small Cap Fund (Rs 40 crore), and Bajaj Allianz Life Insurance Company (Rs 100 crore) also participated in the bulk deal totaling Rs 364 crore. The stock closed at Rs 7,508.75, down 3.42% for the day. Despite declining 40% over the past 12 months and trading 47% below its 52-week high of Rs 14,260.30, the stock has delivered 630% returns over five years and 190% over three years. Voltamp Transformers is a Vadodara-based transformer manufacturer with 61 years of operations and 70,000 installations domestically and internationally.",
            "Sentiment": "neutral",
            "PublishDate": 1757435786300,
            "Source": "order&deals"
        },
        {
            "Title": "Voltamp Transformers Shares Drop 2% Following ₹618 Crore Block Deal",
            "Summary": "Voltamp Transformers shares declined 2% after 8.12 lakh shares (8% of outstanding equity) changed hands in a block deal worth ₹618 crore at ₹7,611 per share. Promoter Kunjal Patel is reportedly the seller in this transaction. The company showed revenue growth of 11% from Q2 FY24 to Q1 FY26, while margins contracted by 90 basis points to 17.1% and net profit increased 16%. Post-transaction, promoter holding is expected to fall below 30%. This represents Patel's second major stake sale within a year, following a 12% stake sale in September 2023 at ₹4,633 per share. The stock has corrected 25% year-to-date and 46% from its 52-week high of ₹14,880, but remains up 66.3% since the previous block deal.",
            "Sentiment": "negative",
            "PublishDate": 1757390675416,
            "Source": "order&deals"
        },
        {
            "Title": "Voltamp Transformers Sees Rs 603.97 Crore Block Trade on NSE",
            "Summary": "Voltamp Transformers executed a block trade worth Rs 603.97 crore on the National Stock Exchange. The transaction involved approximately 794,125 shares priced at Rs 7,605.5 per share at market open.",
            "Sentiment": "neutral",
            "PublishDate": 1757390183684,
            "Source": "order&deals"
        },
        {
            "Title": "Voltamp Transformers Promoter Plans $67 Million Block Deal to Sell 7% Stake",
            "Summary": "Promoter Kunjal Patel plans to sell up to 7.88 lakh shares representing approximately 7% equity in Voltamp Transformers through a block deal valued at around $67 million. The floor price is set at ₹7,600 per share compared to the last closing price of ₹7,777.50. Nuvama Wealth Management will serve as the placement agent for the transaction scheduled for September 8-9. Patel currently holds about 37.8% stake in the company. The deal includes a two-year lock-up period for sold shares and one-year lock-in for any unsold portion. Voltamp shares closed 1.18% lower at ₹7,768. The company reported flat net profit of ₹79.5 crore in the June quarter with revenue declining 1.1% year-on-year to ₹423.6 crore. EBITDA fell 2.8% to ₹72.7 crore with margins at 17.2%. Management highlighted 33% year-on-year growth in order volumes and 17% value growth since April 1, providing revenue visibility of ₹1,685 crore for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1757342601557,
            "Source": "order&deals"
        },
        {
            "Title": "Voltamp Transformers Reports Flat Net Profit Growth in Q1",
            "Summary": "Voltamp Transformers reported a net profit of 795 million rupees in its quarterly results, representing minimal growth from 794 million rupees in the same period last year. The company's profit increased by just 1 million rupees year-over-year, indicating essentially flat performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753774992914,
            "Source": "earnings"
        },
        {
            "Title": "Voltamp Transformers Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Voltamp Transformers has reported a decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 991 million rupees from 1.05 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 20.49% from 25.67% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738222515000,
            "Source": "earnings"
        },
        {
            "Title": "Voltamp Transformers Reports Q3 Financial Results",
            "Summary": "Voltamp Transformers has announced its financial results for the third quarter. The company reported a net profit of 734 million rupees, down from 946 million rupees in the same period last year. However, revenue increased to 4.8 billion rupees from 4.08 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738222488000,
            "Source": "earnings"
        },
        {
            "Title": "Voltamp Transformers Secures Order Worth 41 Crore Rupees",
            "Summary": "Voltamp Transformers has announced that it has won a new order valued at 41 crore rupees. This order represents a significant business development for the company, potentially boosting its revenue and market position in the transformer manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1736316947000,
            "Source": "order&deals"
        },
        {
            "Title": "Voltamp Transformers: Secures ₹263.33 Crore Order from GETCO",
            "Summary": "Voltamp Transformers received a Letter of Intent from Gujarat Energy Transmission Corporation Limited for supplying power transformers worth ₹263.33 crore, excluding GST. The contract will be executed within 12 months and involves designing, manufacturing, testing, and supplying transformers as per GETCO's specifications.",
            "Sentiment": "positive",
            "PublishDate": 1730808125000,
            "Source": "normal_news"
        },
        {
            "Title": "Voltamp Transformers Secures Major Order",
            "Summary": "Voltamp Transformers has won a significant order valued at 263 crore rupees. This represents a substantial business opportunity for the company, potentially boosting its revenue and market position in the transformer manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1730800535000,
            "Source": "corporate_action"
        },
        {
            "Title": "Voltamp Transformers Reports Q2 Profit and Revenue Growth",
            "Summary": "Voltamp Transformers has announced its Q2 financial results. The company's net profit increased to 757 million rupees, up from 684 million rupees in the same quarter last year. Revenue also saw growth, rising to 3.97 billion rupees from 3.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729932456000,
            "Source": "result"
        }
    ]
}