{
    "Symbol": "VPRPL",
    "ISIN": "INE0AE001013",
    "News": [
        {
            "Title": "VPRPL Board Meet on Feb 14 for Q3FY26 Results",
            "Summary": "Vishnu Prakash R Punglia Limited announces board meeting scheduled for February 14, 2026 to consider unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770467048342,
            "Source": "co_actions_results"
        },
        {
            "Title": "VPRPL Promoter Pledges Additional Shares Worth ₹69,000",
            "Summary": "Vishnu Prakash Punglia pledged 69,000 additional shares to meet margin shortfall, increasing total pledged holding to 8.39% of company's share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1770374272380,
            "Source": "stocks"
        },
        {
            "Title": "VPRPL Promoter Pledges Shares Worth ₹1.10 Cr to Banks",
            "Summary": "Vishnu Prakash R Punglia Limited promoter pledged 3,40,000 shares (0.27%) to HDFC Bank and Siddhpur Commodities to meet margin shortfall requirements on January 19, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1769757317880,
            "Source": "stocks"
        },
        {
            "Title": "VPRPL Completes ₹177.47 Crore Silchar Water Project",
            "Summary": "Vishnu Prakash R Punglia Limited successfully delivers Silchar 24x7 Water Supply Project worth ₹177.47 crore under AMRUT Mission in Assam, strengthening its urban infrastructure portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769488230005,
            "Source": "stocks"
        },
        {
            "Title": "VPRPL Credit Rating Downgraded by CARE Ratings",
            "Summary": "Vishnu Prakash R Punglia Limited's long-term bank facilities rating downgraded to CARE BBB- from CARE BBB by CARE Ratings, citing high working capital intensity and delayed collections.",
            "Sentiment": "negative",
            "PublishDate": 1768907472781,
            "Source": "stocks"
        },
        {
            "Title": "VPRPL Reports ₹5,000 Cr Order Book, ₹570 Cr H1 Revenue",
            "Summary": "Vishnu Prakash R Punglia Limited maintains robust order book of ₹5,000 crore with diversified portfolio across water supply, railway and road projects. Company achieved ₹570 crore turnover in H1 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768794429341,
            "Source": "stocks"
        },
        {
            "Title": "VPRPL Gets Contract Termination Notice from Railways",
            "Summary": "Vishnu Prakash R Punglia Limited received termination notice from North Western Railway for Jaipur-Sawai Madhopur Doubling Project. Company faces ₹8.87 crore financial impact and has filed legal remedy.",
            "Sentiment": "negative",
            "PublishDate": 1768388433517,
            "Source": "stocks"
        },
        {
            "Title": "VPRPL Promoters Reinvest ₹200 Cr After 19.18% Stake Sale",
            "Summary": "Vishnu Prakash R Punglia promoters sold 19.18% stake but reinvested entire ₹200 crore proceeds as interest-free loan. Stock declined 3.5% despite capital infusion showing promoter confidence.",
            "Sentiment": "neutral",
            "PublishDate": 1768208723321,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vishnu Prakash R Punglia Clarifies Promoter Stake Sale",
            "Summary": "Company provides clarification on promoter stake sale transaction and announces ₹200 crore interest-free loan reinvestment to support business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768041681434,
            "Source": "co_actions_results"
        },
        {
            "Title": "VPRPL Promoter Creates ₹47.5 Cr Share Encumbrance",
            "Summary": "Vishnu Prakash R Punglia promoter Kamal Kishor Pungalia pledged 47.5 lakh shares worth 3.81% stake to HDFC Bank for company fund infusion on December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767676987706,
            "Source": "co_actions_results"
        },
        {
            "Title": "VPRPL Promoter Pledges 47.5L Shares to HDFC Bank",
            "Summary": "Vishnu Prakash R Punglia Limited promoter Ajay Pungalia pledged 47,50,000 shares (3.81% stake) to HDFC Bank on December 26, 2025, for liquidity generation to infuse funds into the company.",
            "Sentiment": "neutral",
            "PublishDate": 1767676955408,
            "Source": "stocks"
        },
        {
            "Title": "Vishnu Prakash R Punglia crashes 85% from peak",
            "Summary": "Infrastructure services provider Vishnu Prakash R Punglia shares fall 85% from December 2024 high of ₹345, trading at ₹50.31. Stock has declined for 8 consecutive months with only 4 gains in last 25 sessions.",
            "Sentiment": "negative",
            "PublishDate": 1767247900473,
            "Source": "stocks"
        },
        {
            "Title": "Vishnu Prakash R Punglia Promoter Sells 10L Shares",
            "Summary": "Anil Punglia, promoter group member of Vishnu Prakash R Punglia Limited, sold 10 lakh shares through market sale between December 19-22, 2025, reducing his stake from 6.017% to 5.215%.",
            "Sentiment": "neutral",
            "PublishDate": 1766553350738,
            "Source": "co_actions_results"
        },
        {
            "Title": "VPRPL Promoter Sells 9 Lakh Shares for Liquidity",
            "Summary": "Vishnu Prakash R Punglia Limited promoter group member Pushpa Pungalia sold 9 lakh shares worth 0.722% stake through market sale on December 22, 2025 to generate funds for company infusion.",
            "Sentiment": "neutral",
            "PublishDate": 1766406895301,
            "Source": "co_actions_results"
        },
        {
            "Title": "VPRPL Secures 5-Year River Sand Mining Lease",
            "Summary": "Vishnu Prakash R Punglia Limited finalizes river sand mining lease in Rajasthan with annual production capacity of 1,54,350 metric tonnes, strengthening diversification strategy.",
            "Sentiment": "positive",
            "PublishDate": 1766239097418,
            "Source": "stocks"
        },
        {
            "Title": "Vishnu Prakash R Punglia Limited Reports Earnings Decline in Q2/H1-FY26",
            "Summary": "Vishnu Prakash R Punglia Limited, an infrastructure EPC company, reported revenue of INR 2,957 Mn in Q2-FY26 (down 11.7% YoY) and INR 5,721 Mn in H1-FY26 (down 3.3% YoY), with net profit declining 84.4% to INR 37 Mn in Q2 and 72.2% to INR 107 Mn in H1. The company maintains a strong order book of INR 50,011 Mn across water supply, railway, and road projects, providing revenue visibility for the next 24-36 months despite current profitability pressures.",
            "Sentiment": "negative",
            "PublishDate": 1763373842729,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R Punglia Limited Appoints New Company Secretary and Compliance Officer",
            "Summary": "Vishnu Prakash R Punglia Limited's Board of Directors approved the appointment of Ms. Nitisha Jain as Company Secretary and Compliance Officer, designated as Key Managerial Personnel, effective November 15, 2025. The appointment was made based on the recommendation of the Nomination and Remuneration Committee, with Ms. Jain being an Associate Member of the Institute of Company Secretaries of India.",
            "Sentiment": "neutral",
            "PublishDate": 1763136640871,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R. Punglia Limited Schedules Earnings Conference Call for Q2/H1-FY2025-26 Results",
            "Summary": "Vishnu Prakash R. Punglia Limited has announced an earnings conference call scheduled for November 17, 2025, at 5:00 PM IST to discuss their unaudited financial results for the quarter and half year ended September 30, 2025. The call will be represented by Managing Director Mr. Manohar Lal Punglia, Project Coordinator Mr. Jayant Punglia, and Chief Financial Officer Mr. Sarfaraz Ahmed. The company operates as an ISO 9001:2015 certified engineer, contractor and designer, and is listed on BSE with scrip code 543974 and NSE with symbol VPRPL.",
            "Sentiment": "neutral",
            "PublishDate": 1762949465767,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R Punglia Limited Company Secretary Resigns Due to Personal Reasons",
            "Summary": "Neha Matnani resigned from her position as Company Secretary and Compliance Officer at Vishnu Prakash R Punglia Limited effective October 31, 2025, citing personal reasons. Her resignation was accepted by the company and she was relieved from her duties on the same date. With her departure, Matnani also ceased to be a Key Managerial Personnel and the designated person authorized to make disclosures to stock exchanges. In her resignation letter dated October 24, 2025, Matnani mentioned personal and unavoidable circumstances impacting her availability and well-being as the reason for leaving. She committed to ensuring a smooth transition of responsibilities and expressed gratitude to the Board of Directors, management, and colleagues for their support during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1761918693468,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vishnu Prakash R Punglia Limited Wins Court Case Against Income Tax Notice for Assessment Year 2019-20",
            "Summary": "Vishnu Prakash R Punglia Limited received a favorable court order from the High Court of Judicature at Bombay on October 17, 2025. The court set aside and quashed a notice issued under Section 148 of the Income-tax Act for Assessment Year 2019-20, along with all related proceedings and orders. This follows earlier communications from April 23, 2025 and July 9, 2025 regarding notices alleging income having escaped assessment. The company stated it does not foresee any material financial impact from this development.",
            "Sentiment": "positive",
            "PublishDate": 1760792917499,
            "Source": "stock"
        },
        {
            "Title": "Vishnu Prakash R Punglia Limited Cleared of GST Allegations, Rs 25.13 Crore Demand Dropped",
            "Summary": "Vishnu Prakash R Punglia Limited announced that proceedings initiated by the Directorate General of GST Intelligence have been dropped entirely. The company and its directors were cleared of allegations regarding ineligible Input Tax Credit availment of Rs 2.01 crore, along with proposed penalties of Rs 23.13 crore. The adjudicating authority concluded that the company complied with all applicable provisions under Section 16 of the CGST Act, 2017, supported by valid documentation including tax invoices, work orders, and banking records. The entire demand of Rs 25.13 crore including tax, interest, and penalties has been set to nil, with no financial or legal implications on the company or its directors.",
            "Sentiment": "positive",
            "PublishDate": 1760436497170,
            "Source": "stock"
        },
        {
            "Title": "VPRPL Promoters Sell 9.15% Stake and Pledge Additional Shares to Provide Interest-Free Loan to Company",
            "Summary": "Vishnu Prakash R Punglia Limited announced that its promoters have sold 9.15% of their equity holding through open market transactions. Additionally, Managing Director Manohar Lal Punglia has pledged 1.78% of his equity stake. The proceeds from these transactions are being provided to the company as an interest-free loan to strengthen its financial position and enhance operational flexibility. The funds will support ongoing operational requirements, working capital needs, and future strategic growth initiatives. The company emphasized that promoters continue to hold a substantial stake and remain committed to the company's long-term success. Management assured stakeholders that the company maintains strong financial integrity, a healthy order book, and a consistent execution track record.",
            "Sentiment": "neutral",
            "PublishDate": 1759503104801,
            "Source": "stock"
        },
        {
            "Title": "Vishnu Prakash R Punglia Promoter Ajay Pungalia Sells 6 Lakh Shares to Generate Liquidity",
            "Summary": "Ajay Pungalia, a promoter of Vishnu Prakash R Punglia Limited, sold 6,00,000 shares representing 0.481% of the company's total share capital through market sale on September 18, 2025. The transaction reduced his shareholding from 5.816% to 5.335% of the total diluted share capital. Pungalia stated the sale was conducted to generate liquidity for intended infusion of funds into the company. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited, with total equity share capital of 124,644,000 shares of Rs 10 each remaining unchanged after the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1758604660322,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnu Prakash R Punglia Promoter Sells 550,117 Shares, Reduces Stake to 5.744%",
            "Summary": "Sanjay Kumar Punglia, a promoter of Vishnu Prakash R Punglia Limited, sold 550,117 shares through market sale on September 15, 2025. The transaction reduced his shareholding from 77,10,000 shares (6.185%) to 71,59,883 shares (5.744%) of the company's total diluted share capital. The company has 124,644,000 shares of Rs 10 each and is listed on BSE Limited and National Stock Exchange of India Limited. Punglia stated the reason for the sale was to generate liquidity for intended infusion of funds into the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758164750437,
            "Source": "stock"
        },
        {
            "Title": "Vishnu Prakash R Punglia Promoter Sells 30,000 Shares to Generate Liquidity",
            "Summary": "Kamal Kishor Pungalia, a promoter of Vishnu Prakash R Punglia Limited, sold 30,000 shares through market sale on September 15, 2025. The transaction reduced his shareholding from 68,80,000 shares (5.519%) to 68,50,000 shares (5.495%) of the company's total diluted share capital. The sale represents 0.024% of the company's equity. Pungalia stated the reason for the sale was to generate liquidity for intended infusion of funds into the company. The company's total equity share capital remains unchanged at 124,644,000 shares of Rs 10 each. The company is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758163847348,
            "Source": "stock"
        },
        {
            "Title": "Vishnu Prakash R Punglia Promoters Sell 3.38% Stake to Fund Company Operations",
            "Summary": "Promoters of Vishnu Prakash R Punglia have sold 3.38% of their shareholding in the open market. The proceeds from this share sale will be provided as an interest-free loan to the company to enhance its cash flow and support operational activities.",
            "Sentiment": "positive",
            "PublishDate": 1756888634038,
            "Source": "stock"
        },
        {
            "Title": "Vishnu Prakash R Punglia Limited Uploads Q1 FY25-26 Earnings Call Audio Recording",
            "Summary": "Vishnu Prakash R Punglia Limited conducted its quarterly earnings conference call with investors on August 14, 2025, discussing the company's unaudited financial results. The company has made the audio recording of the earnings call publicly available on its website. The company is listed on both NSE (symbol: VPRPL) and BSE (code: 543974) and operates as an ISO 9001:2015 certified engineer, contractor, and designer.",
            "Sentiment": "neutral",
            "PublishDate": 1755193634342,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R Punglia Limited Reports 52.5% Decline in Quarterly Profit to Rs 70.05 Million",
            "Summary": "Vishnu Prakash R Punglia Limited announced quarterly results with profit declining to Rs 70.05 million compared to Rs 147.63 million in the same period last year. Revenue from operations increased to Rs 2,764.05 million from Rs 2,565.63 million year-over-year. Total income reached Rs 2,776.91 million versus Rs 2,588.08 million previously. The company's earnings per share dropped to Rs 0.56 from Rs 1.18 in the corresponding quarter. Total expenses rose to Rs 2,671.78 million from Rs 2,391.14 million, with construction expenses increasing to Rs 1,077.12 million from Rs 1,582.64 million. The results include 18 jointly controlled operations on a proportionate basis. The company operates exclusively in construction and infrastructure development in India.",
            "Sentiment": "negative",
            "PublishDate": 1755086314330,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R Punglia: Secures ₹78 Crore Infrastructure Project Amid Credit Rating Downgrade",
            "Summary": "Vishnu Prakash R Punglia Limited received a ₹77.9 crore contract from Jaipur Development Authority for constructing a Road Over Bridge. CARE Ratings recently downgraded the company's credit rating due to increased working capital intensity and lower-than-expected operations scale.",
            "Sentiment": "neutral",
            "PublishDate": 1752317597000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Secures ₹779 Million Road Construction Contract",
            "Summary": "Vishnu Prakash R Punglia has been awarded a contract worth ₹779 million by the Jaipur Development Authority for road construction. The project involves building new roads in Jaipur, indicating potential infrastructure development in the area.",
            "Sentiment": "positive",
            "PublishDate": 1752315509000,
            "Source": "default"
        },
        {
            "Title": "Vishnu Prakash R Punglia: CARE Downgrades Ratings on ₹960 Crore Loans",
            "Summary": "CARE Ratings has downgraded Vishnu Prakash R Punglia Ltd.'s long-term and short-term bank facilities worth ₹960 crore, citing increased working capital intensity and lower-than-expected scale of operations. The outlook has been revised from stable to negative due to elongated collection periods and inventory holdings, particularly in water supply projects.",
            "Sentiment": "negative",
            "PublishDate": 1749510872000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vishnu Prakash R Punglia Reports Q4 Financial Results",
            "Summary": "Vishnu Prakash R Punglia has reported its quarterly financial results. The company's Q4 net profit stands at 162 million rupees, compared to 671.34 million rupees year-over-year and 39 million rupees quarter-over-quarter. The Q4 revenue is reported at 4.05 billion rupees, compared to 6.57 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748559806000,
            "Source": "default"
        },
        {
            "Title": "Vishnu Prakash R Punglia Reports Decline in Q4 Financial Performance",
            "Summary": "Vishnu Prakash R Punglia has reported its Q4 financial results. The company's EBITDA decreased to 456 million rupees from 1.05 billion rupees year-over-year. The EBITDA margin fell to 11.26% from 15.96% compared to the same period last year. Net profit for Q4 declined to 162 million rupees from 671.34 million rupees year-over-year, and increased from 39 million rupees quarter-over-quarter. Revenue for Q4 was 4.05 billion rupees, down from 6.57 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748520329000,
            "Source": "result"
        },
        {
            "Title": "Vishnu Prakash R Punglia's Joint Venture Secures 2.7 Billion Rupee Contract from North Western Railway",
            "Summary": "Vishnu Prakash R Punglia has announced that its joint venture with SBEL has been awarded a significant contract by the North Western Railway. The total value of the contract is approximately 2.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740961208000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia JV Secures 2.7B Rupee Contract from North Western Railway",
            "Summary": "Vishnu Prakash R Punglia has announced that its joint venture with SBEL has been awarded a significant contract by the North Western Railway. The total value of the contract is approximately 2.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740751580000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Secures ₹248 Crore Contract from BHEL",
            "Summary": "Vishnu Prakash R Punglia has been awarded a contract by Bharat Heavy Electricals Limited (BHEL). The contract has a total value of 248 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738806582000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Reports Q3 Financial Results",
            "Summary": "Vishnu Prakash R Punglia has released its Q3 financial results. The company reported a net profit of 39 million rupees, down from 174 million rupees in the same quarter last year. Revenue remained relatively stable at 2.41 billion rupees compared to 2.4 billion rupees in the previous year. EBITDA decreased to 275 million rupees from 339 million rupees, with the EBITDA margin declining to 11.43% from 14.00% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738628123000,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R Punglia Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Vishnu Prakash R Punglia has reported a decrease in its third-quarter EBITDA, which fell to 275 million rupees from 339 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 11.43% from 14.00% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738577010000,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R Punglia Reports Decline in Q3 Net Profit",
            "Summary": "Vishnu Prakash R Punglia has reported a significant decrease in its third-quarter net profit, which fell to 39 million rupees from 174 million rupees in the same period last year. The company's revenue remained relatively stable at 2.41 billion rupees, compared to 2.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738576949000,
            "Source": "earnings"
        },
        {
            "Title": "Vishnu Prakash R Punglia: JV Secures ₹51.4 Crore Sewage Treatment Plant Contract",
            "Summary": "Vishnu Prakash R Punglia's joint venture with RBIPL and JDA won a ₹513.99 million contract to build a 30 MLD sewerage treatment plant in Jaipur. This marks the company's third consecutive order win in 2024. The stock was trading up 1.6% at ₹254.25.",
            "Sentiment": "positive",
            "PublishDate": 1737626216000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia: Secures ₹43.31 Crore Road Project in Rajasthan",
            "Summary": "Vishnu Prakash R Punglia Ltd. has been selected as the lowest bidder for a ₹43.31 crore road development project in Rajasthan. The project involves constructing a two-lane bypass with paved shoulder connecting NH-158 to NH-48 in Bhilwara district. This is the company's second consecutive order win, following a ₹31.34 crore project for the Fintech Digital Institute in Jodhpur.",
            "Sentiment": "positive",
            "PublishDate": 1735810975000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Receives Letter of Intent Worth 313.40 Million Rupees",
            "Summary": "Vishnu Prakash R Punglia, a company in the construction sector, has received a Letter of Intent (LOI) valued at 313.40 million rupees. This LOI indicates a potential upcoming project or contract for the company, which could positively impact its business operations and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1735776569000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Receives Letter of Intent for 313.40 Million Rupees Project",
            "Summary": "Vishnu Prakash R Punglia, a company in the construction sector, has received a Letter of Intent (LOI) for a project valued at 313.40 million rupees (approximately $3.8 million USD). This LOI indicates that the company has been selected for the project, pending final contract negotiations.",
            "Sentiment": "positive",
            "PublishDate": 1735732840000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Secures 72.96 Million Rupee Contract",
            "Summary": "Vishnu Prakash R Punglia has been awarded a contract by Hissar Builders. The contract is valued at 72.96 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735689826000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Secures 72.96 Million Rupee Contract",
            "Summary": "Vishnu Prakash R Punglia has been awarded a contract by Hissar Builders. The contract is valued at 72.96 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735652421000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash Punglia Registered for Steel Bridge Girder Fabrication",
            "Summary": "Vishnu Prakash Punglia has been granted registration in the Vendor Directory of RDSO (Research Designs and Standards Organisation) for the fabrication of steel bridge girders. This registration allows the company to participate in projects involving the construction of steel bridges for railway infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1735518022000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vishnu Prakash Punglia Registered for Steel Bridge Girder Fabrication",
            "Summary": "Vishnu Prakash Punglia has been granted registration in the vendor directory of RDSO (Research Designs and Standards Organisation) for the fabrication of steel bridge girders. This registration allows the company to participate in projects involving the construction of steel bridges for railway infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1735449767000,
            "Source": "corporate_action"
        },
        {
            "Title": "VPRPL Secures 1.03 Billion Rupee Contract from North Western Railway",
            "Summary": "VPRPL has been awarded a contract by the North Western Railway's Ajmer Division. The contract is valued at approximately 1.03 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733736473000,
            "Source": "order&deals"
        },
        {
            "Title": "Vishnu Prakash R Punglia Reports Q2 EBITDA Growth",
            "Summary": "Vishnu Prakash R Punglia has announced its Q2 financial results. The company's EBITDA increased to 486 million rupees from 384 million rupees year-over-year. Additionally, the EBITDA margin improved to 14.52% from 12.93% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731067413000,
            "Source": "result"
        },
        {
            "Title": "Vishnu Prakash R Punglia Reports Q2 Revenue Growth",
            "Summary": "Vishnu Prakash R Punglia, an Indian company, has reported its second quarter (Q2) revenue. The company's revenue for Q2 stands at 3.35 billion rupees, compared to 2.9 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731067404000,
            "Source": "result"
        }
    ]
}