{
    "Symbol": "VRAJ",
    "ISIN": "INE0S2V01010",
    "News": [
        {
            "Title": "VRAJ Iron Steel Q3FY26 Results & Solar Plant Approval",
            "Summary": "VRAJ Iron and Steel reported Q3FY26 results with revenue of ₹1,464.28 million and net profit of ₹9.97 million. Board approved 21 MW solar plant for Bilaspur division with ₹70 crore investment.",
            "Sentiment": "positive",
            "PublishDate": 1770899077174,
            "Source": "co_actions_results"
        },
        {
            "Title": "VRAJ Iron Steel Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirms VRAJ Iron and Steel's credit ratings at CARE A- (Stable) for ₹40 crore long-term facilities and CARE A-/A2+ for ₹30 crore long-term/short-term facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767360428048,
            "Source": "stocks"
        },
        {
            "Title": "Vraj Iron Steel Enhances Corporate Guarantee to ₹35 Cr",
            "Summary": "Vraj Iron and Steel Limited increases corporate guarantee for associate company Vraj Metaliks Private Limited from ₹25 crores to ₹35 crores in favour of HDFC Bank Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1766227487425,
            "Source": "stocks"
        },
        {
            "Title": "Vraj Iron & Steel Commissions 15MWp Solar Plant",
            "Summary": "Vraj Iron and Steel Limited successfully commissioned its 15MWp solar power plant in Chhattisgarh on December 18, 2025, marking a significant step towards renewable energy capacity enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1766041969173,
            "Source": "stocks"
        },
        {
            "Title": "Vraj Iron & Steel Consolidates Promoter Holdings Under Single Entity",
            "Summary": "Vraj Iron & Steel has merged its promoter and holding firms, streamlining its ownership structure. Gopal Sponge & Power will serve as the sole holding company for VISL, simplifying the corporate hierarchy.",
            "Sentiment": "positive",
            "PublishDate": 1764677317033,
            "Source": "corporate_action"
        },
        {
            "Title": "Vraj Iron & Steel Faces Gujarat High Court Application Over Company Name Dispute",
            "Summary": "Vraj Iron & Steel has received a court application from the Gujarat High Court concerning a dispute over the company's name. The legal proceeding indicates potential trademark or naming rights issues that could affect the company's operations and branding.",
            "Sentiment": "negative",
            "PublishDate": 1764677019310,
            "Source": "stock"
        },
        {
            "Title": "Vraj Iron and Steel Reports Strong Q2 Performance with 52% Revenue Growth",
            "Summary": "Vraj Iron and Steel Limited announced its quarterly results for the period ended September 30, 2025. The company reported revenue from operations of Rs. 1,329.80 million for the quarter, compared to Rs. 875.47 million in the same period last year, representing a 52% increase. For the half-year period, revenue reached Rs. 2,712.88 million versus Rs. 2,021.48 million in the previous year. The company posted a profit after tax of Rs. 71.94 million for the quarter, down from Rs. 96.55 million in the corresponding quarter last year. Half-year profit after tax stood at Rs. 145.07 million compared to Rs. 244.36 million in the previous year. Basic earnings per share for the quarter was Rs. 2.18 versus Rs. 3.35 in the same quarter last year. The company operates in steel product manufacturing and has one reportable operating segment. The Board of Directors approved these unaudited standalone and consolidated financial results in a meeting held on November 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762943166758,
            "Source": "earnings"
        },
        {
            "Title": "Vraj Iron and Steel Limited Faces Rs 15 Crore Trademark Lawsuit at Bombay High Court",
            "Summary": "Vraj Iron and Steel Limited has received a commercial suit from the High Court of Judicature at Bombay in its Commercial Division. The lawsuit was filed by Vraj Profiles Private Limited under the Trademark Act, 1999 and Civil Procedure Code 1908. The plaintiff alleges that Vraj Iron and Steel Limited's name is identical or too nearly resembles the plaintiff's name. The plaintiff has claimed damages of Rs 15 crores (Rs 15,00,00,000). The company disclosed this litigation as per regulatory requirements.",
            "Sentiment": "negative",
            "PublishDate": 1758636863598,
            "Source": "stock"
        },
        {
            "Title": "Yraj Iron and Steel Limited Enhances Credit Facilities to Rs. 128 Crores for Solar Power Project",
            "Summary": "Yraj Iron and Steel Limited's Board of Directors approved an enhancement of existing loan facilities, increasing total credit facilities from Rs. 70 crores to Rs. 128 crores. The enhancement includes a Rs. 38 crore Term Loan specifically for setting up a Solar Power Project. The facility breakdown shows Letter of Credit increasing from Rs. 30 crores to Rs. 50 crores, while Cash Credit remains at Rs. 40 crores. The solar power generated will be directly utilized at the company's Steel Unit in Raipur to reduce energy costs, enhance operational efficiency through captive renewable energy, and position products under the 'green category' for improved market competitiveness. The initiative aims to reduce dependency on conventional energy sources, improve cost structures, and strengthen the company's ESG credentials while creating long-term shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1758186889782,
            "Source": "corporate_action"
        },
        {
            "Title": "Vraj Iron And Steel Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Vraj Iron And Steel reported Q1 net profit of 73.3 million rupees, down from 148 million rupees in the previous year. Revenue increased to 1.38 billion rupees from 1.14 billion rupees year-over-year. EBITDA declined to 132 million rupees from 211 million rupees, while EBITDA margin compressed to 9.54% from 18.41% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754872155358,
            "Source": "earnings"
        },
        {
            "Title": "Vraj Iron and Steel Reports IPO Proceeds Utilization with Billet Plant Delays",
            "Summary": "Vraj Iron and Steel Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing utilization of Rs. 171 crore IPO proceeds. The company utilized Rs. 168.08 crore of the total proceeds, with Rs. 70 crore used for loan repayment, Rs. 59.25 crore for expansion project capital expenditure, Rs. 22.80 crore for general corporate purposes, and Rs. 16.01 crore for IPO expenses. The monitoring agency CARE Ratings Limited reported no deviations from stated objectives. However, the Billet Plant implementation faced delays due to supplier delays and early monsoon onset. The Sponge Iron Plant was completed in December 2024, and the Captive Power Plant was completed in March 2025, with a 2-month delay. Rs. 2.94 crore remains unutilized and is deployed in fixed deposits with HDFC Bank earning 6.60% returns.",
            "Sentiment": "neutral",
            "PublishDate": 1754737649583,
            "Source": "stock"
        },
        {
            "Title": "Vraj Iron and Steel Reports 50% Jump in Q1 FY2026 Profit on Strong Revenue Growth",
            "Summary": "Vraj Iron and Steel Limited reported strong financial performance for Q1 FY2026, with standalone revenue growing 20.7% year-over-year to Rs. 1,383.01 crores. The company's standalone profit after tax surged 50.2% to Rs. 73.26 crores, while consolidated profit after tax increased 51.4% to Rs. 75.91 crores. EBITDA grew 26.9% to Rs. 153.35 crores with margins improving to 11.1% from 10.5% in the previous year. The performance was driven by higher sales volumes and improved realizations in the steel segment. The Board approved these unaudited results at its meeting on August 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754735680436,
            "Source": "earnings"
        },
        {
            "Title": "VRAJ IRON AND STEEL Reports Q4 Financial Results",
            "Summary": "VRAJ IRON AND STEEL has released its Q4 financial results. The company's EBITDA decreased to 164.8 million rupees from 181.5 million rupees year-over-year. The EBITDA margin declined to 10.77% from 15.31% in the same period last year. Revenue increased to 1.53 billion rupees from 1.18 billion rupees year-over-year. Consolidated net profit decreased to 100.14 million rupees from 128 million rupees year-over-year, but increased from 82.4 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748357887000,
            "Source": "result"
        },
        {
            "Title": "Vraj Iron and Steel Commissions Power Plant in Chhattisgarh",
            "Summary": "Vraj Iron and Steel has announced the commissioning of a new power plant in Chhattisgarh. This development represents a significant expansion of the company's infrastructure and energy production capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1742828049000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vraj Iron Secures Coal Linkage Bid for 78,000 MT",
            "Summary": "Vraj Iron has successfully won a bid for a coal linkage of 78,000 metric tonnes. This acquisition of coal supply is likely to support the company's operations and potentially improve its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1740123889000,
            "Source": "order&deals"
        },
        {
            "Title": "VRAJ IRON AND STEEL Reports Stable Q3 EBITDA, Margin Decline",
            "Summary": "VRAJ IRON AND STEEL announced its Q3 financial results. The company's EBITDA remained unchanged at 120 million rupees year-over-year. However, the EBITDA margin decreased from 14.89% to 10.01% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739360031000,
            "Source": "earnings"
        },
        {
            "Title": "Vraj Iron and Steel Commences Commercial Operation of Sponge Iron Plant",
            "Summary": "Vraj Iron and Steel has announced the successful start of commercial operations at its sponge iron plant. The company is also in the process of commissioning its power plant, indicating a significant expansion of its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734950280000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vraj Iron and Steel Receives Consent for Expansion Project",
            "Summary": "Vraj Iron and Steel has obtained consent to operate for its expansion project of sponge iron and power plant located in Village Dighora, Takhatpur District, Bilaspur, Chhattisgarh. The consent was granted by the Chhattisgarh Environment Conservation Board.",
            "Sentiment": "positive",
            "PublishDate": 1733836556000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vraj Iron and Steel Signs 3-Year Iron Ore Supply Agreement with NMDC",
            "Summary": "<p><span class='positive'>Vraj Iron and Steel</span> has entered into a <b>three-year agreement</b> with <span class='neutral'>NMDC</span> (National Mineral Development Corporation) for the <span class='positive'>procurement of iron ore lump</span>. This <span class='positive'>long-term supply contract</span> ensures a <span class='positive'>stable source of raw materials</span> for Vraj Iron and Steel's operations.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728394406000,
            "Source": "corporate_action"
        }
    ]
}