{
    "Symbol": "VRLLOG",
    "ISIN": "INE366I01010",
    "News": [
        {
            "Title": "VRL Logistics Declares Rs 5 Per Share Dividend",
            "Summary": "VRL Logistics has announced a dividend distribution of Rs 5 per share for its shareholders, marking a significant return to investors through direct cash distribution.",
            "Sentiment": "positive",
            "PublishDate": 1770284671214,
            "Source": "co_actions_results"
        },
        {
            "Title": "VRL Logistics Q3 Net Profit Rises 8.9% to ₹647M",
            "Summary": "VRL Logistics reported net profit of ₹647 million in Q3, marking an 8.9% year-on-year growth from ₹594 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770284611353,
            "Source": "co_actions_results"
        },
        {
            "Title": "VRL Logistics Board Meet on Feb 5 for Q3 Results",
            "Summary": "VRL Logistics has scheduled a board meeting on February 5, 2026, to approve Q3FY26 financial results for the quarter ended December 31, 2025, and consider declaring an interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769229795391,
            "Source": "co_actions_results"
        },
        {
            "Title": "VRL Logistics Credit Rating Outlook Upgraded to Positive by ICRA",
            "Summary": "ICRA Limited revised VRL Logistics' long-term credit rating outlook from Stable to Positive, maintaining the ICRA A+ rating. The upgrade reflects expectations of sustained growth in the company's core goods transport business, supported by fleet and branch network expansion, freight rate revisions, and exit from low-margin operations leading to improved profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763526327931,
            "Source": "stock"
        },
        {
            "Title": "VRL Logistics Reports 39% Jump in Net Profit Despite 11% Volume Decline in Q2 FY26",
            "Summary": "VRL Logistics delivered mixed results with total income flat at INR 804 crores compared to the previous year, while tonnage declined 11% year-on-year due to deliberate exit from low-margin contracts. However, the company showed strong profitability with net profit surging 39% to INR 50 crores from INR 36 crores. EBITDA grew 17% to INR 158 crores with margins improving. Realization per ton increased 11.6% year-on-year to INR 8,079. The period was impacted by GST regulation changes affecting customer demand across sectors including consumer durables, electronics, agriculture products, and garments. For H1 FY26, total income grew 1% while EBITDA reached INR 316 crores versus INR 237 crores, with PAT nearly doubling to INR 100 crores. The company expects volume recovery in H2 FY26, projecting 4-5% revenue growth for the full year while maintaining EBITDA margins around 19%. VRL operates 1,243 branches and 50 transshipment hubs with a fleet of 5,782 vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1762533229986,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Sets Long-Term Growth Targets and FY26 Guidance",
            "Summary": "VRL Logistics has provided guidance during a conference call outlining its growth targets and financial projections. The company expects to achieve long-term volume growth of 8-10% from FY27 onwards. For FY26, management projects a 4-5% decline in tonnage but anticipates 4% revenue growth. The company expects sequential tonnage growth of 5-6% in Q3 FY26, followed by 7-8% growth in Q4. VRL Logistics aims to maintain an EBITDA margin of around 19%. The company has allocated INR 160 crores for capital expenditure in H2 FY26, with INR 130-140 crores designated for branches and hubs expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762399362352,
            "Source": "stock"
        },
        {
            "Title": "VRL Logistics Plans Operational Revival Through Strategic Restructuring and Cost Control",
            "Summary": "VRL Logistics is implementing a comprehensive operational revival strategy focused on exiting low-margin business segments while expanding through new branch additions. The company is pursuing disciplined cost control measures and aims to achieve sustainable EBITDA margin expansion through tonnage recovery and higher realization per ton.",
            "Sentiment": "positive",
            "PublishDate": 1762181416649,
            "Source": "stock"
        },
        {
            "Title": "VRL Logistics Reports Strong Q2 Performance with 39% Jump in Net Profit",
            "Summary": "VRL Logistics delivered robust quarterly results with revenue remaining stable at 8 billion rupees compared to the same period last year. The company's EBITDA grew to 1.51 billion rupees from 1.3 billion rupees year-over-year, while EBITDA margin expanded significantly to 18.97% from 16.64%. Net profit showed strong growth, rising to 499 million rupees from 358 million rupees in the previous year, representing a 39% increase.",
            "Sentiment": "positive",
            "PublishDate": 1762163204612,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Schedules Q2FY26 Results Conference Call with Analysts",
            "Summary": "VRL Logistics has announced a conference call with analysts and institutional investors scheduled for November 4, 2025, at 10:30 AM IST. The earnings call, hosted by ICICI Securities, will discuss the company's financial results for the quarter and half-year ended September 30, 2025. The call will be represented by Chief Financial Officer Sunil Nalavadi, with multiple access numbers provided for domestic and international participants including toll-free numbers for Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1761319813331,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Sets Record Date for 1:1 Bonus Share Issue",
            "Summary": "VRL Logistics has set Thursday, August 14, as the record date for its 1:1 bonus share issue, with today being the final opportunity for investors to purchase shares to qualify. Under the bonus issue terms, the company will issue one bonus share for every one share held by eligible shareholders, effectively doubling the number of shares in investors' portfolios without additional cost. The share price will be adjusted proportionally post-issue to maintain the same overall value. This marks the first time in VRL Logistics' history that the company is distributing free shares to eligible shareholders. Investors must purchase shares before the ex-date to be eligible, with trades executed today reflecting in demat accounts by the record date due to the T+1 settlement cycle.",
            "Sentiment": "positive",
            "PublishDate": 1755052228253,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics Announces 1:1 Bonus Share Issue with Record Date Set for August 14",
            "Summary": "VRL Logistics has announced a 1:1 bonus share issue, meaning shareholders will receive one new fully paid-up equity share for every existing share held. The record date is August 14, and the bonus shares will be available for trading on August 19. The company's paid-up share capital will double from 8.74 crore equity shares to 17.49 crore equity shares, valued at Rs 17,493.70 lakh. The bonus shares will be issued from company reserves totaling over Rs 99,000 lakh, including securities premium, general reserves, capital redemption reserve, and retained earnings. VRL Logistics operates as a logistics and transport company providing parcel services and last-mile delivery across India. The company's shares closed 1.37% lower at Rs 556.",
            "Sentiment": "positive",
            "PublishDate": 1754829323874,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics Reports Strong Profit Growth Despite Volume Decline in Q1 FY26",
            "Summary": "VRL Logistics reported net profit of Rs. 50 crores in Q1 FY26, significantly higher than Rs. 13 crores in Q1 FY25, despite total income growing only 1% year-on-year. The company maintained EBITDA margins at approximately 21% and PAT margins at 7%. Volumes declined 12% due to the company's strategic exit from low-margin contracts and price rationalization implemented in Q2 and Q4 of FY25. The logistics firm operates 1,241 branches and 50 transshipment hubs with a fleet of 5,949 vehicles, serving 9 lakh GST registered customers. Management expects volume normalization from Q3 FY26 onwards and anticipates FY27 volume growth of 7-8%. The company reduced fuel costs from 29% to 25% of total income and improved internal fuel procurement from 33% to 41.5%. VRL is investing in technology upgrades and planning new hub investments in Kerala worth Rs. 20-25 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754725834592,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Shareholders Approve Capital Clause Amendment in Memorandum of Association",
            "Summary": "VRL Logistics Limited shareholders approved an alteration to the Capital Clause of the company's Memorandum of Association at the 42nd Annual General Meeting held on August 6, 2025. The amended authorized share capital stands at ₹237 crore, divided into 23.7 crore equity shares of ₹10 each. The alteration provides the Board with powers to increase or reduce capital and divide shares into different classes with various rights and privileges as permitted by law and the company's Articles of Association.",
            "Sentiment": "neutral",
            "PublishDate": 1754485603824,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics Appoints New Statutory and Secretarial Auditors for Five-Year Terms",
            "Summary": "VRL Logistics Limited has appointed Walker Chandiok & Co LLP as its new statutory auditors for a five-year term, replacing Kalyaniwalla & Mistry LLP. The appointment was made at the company's 42nd Annual General Meeting held on August 6, 2025, with the term running until the conclusion of the 47th Annual General Meeting. Walker Chandiok & Co LLP, established in 1935 and converted to a Limited Liability Partnership in 2014, operates 17 offices across 15 cities in India and provides auditing, taxation, and management consultancy services. Additionally, VRL Logistics appointed R. Parthasarathy as secretarial auditor for a five-year period. Parthasarathy is a practicing company secretary based in Bengaluru with over 25 years of experience, specializing in corporate laws, SEBI regulations, and FEMA compliance. Both appointments are effective from the conclusion of the 42nd Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1754483685286,
            "Source": "corporate_governance"
        },
        {
            "Title": "VRL Logistics Plans Growth Through LTL Market Expansion and Fleet Optimization",
            "Summary": "VRL Logistics has outlined its growth strategy focusing on expanding its Less Than Truckload (LTL) market presence by opening branches in new areas and improving the utilization of its own fleet. The company plans to manage fuel supply internally and will use its strong cash flow to support the expansion of its network, fleet, and infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1754476769885,
            "Source": "stock"
        },
        {
            "Title": "VRL Logistics Reports Strong Q1 Performance with Revenue at 7.4B Rupees",
            "Summary": "VRL Logistics reported Q1 revenue of 7.4 billion rupees compared to 7.27 billion rupees in the same period last year. The company's EBITDA increased significantly to 1.52 billion rupees from 869 million rupees year-over-year, with EBITDA margin improving to 20.4% from 11.95%. Net profit surged to 500 million rupees versus 134.3 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754462615155,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Sets August 14, 2025 Record Date for 1:1 Bonus Share Issue",
            "Summary": "VRL Logistics Limited has fixed August 14, 2025 as the record date for determining shareholder eligibility for bonus equity shares in a 1:1 ratio. Shareholders will receive one bonus equity share of ₹10 each for every existing share held. The bonus issue is subject to shareholder approval at the annual general meeting scheduled for August 6, 2025, and regulatory approvals from BSE and NSE. The company will allot 8,74,68,495 bonus equity shares on August 18, 2025, with trading expected to commence on August 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754132584618,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics: Board Approves First-Ever Bonus Share Issue",
            "Summary": "VRL Logistics Ltd. has approved a 1:1 bonus share issue, its first ever. The record date is yet to be announced. Bonus shares will be issued from eligible reserves by September 2, 2025. This follows a ₹61 crore share buyback earlier in 2023.",
            "Sentiment": "positive",
            "PublishDate": 1751611907000,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics Approves 1:1 Bonus Share Issue",
            "Summary": "VRL Logistics has announced the approval of a bonus issue at a ratio of 1:1. This means shareholders will receive one additional share for each share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1751610339000,
            "Source": "default"
        },
        {
            "Title": "VRL Logistics Ltd: Board to Consider First-Ever Bonus Share Issue",
            "Summary": "VRL Logistics Ltd. shares surge over 4% as the company announces a board meeting on July 4, 2025, to consider its first-ever bonus issue of shares. The record date is yet to be determined. Promoters currently hold a 60.24% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1751256563000,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics Schedules Board Meeting to Discuss Bonus Shares",
            "Summary": "VRL Logistics has announced a board meeting scheduled for July 4 to discuss the potential issuance of bonus shares. This corporate action, if approved, would involve distributing additional shares to existing shareholders at no cost.",
            "Sentiment": "positive",
            "PublishDate": 1751025742000,
            "Source": "default"
        },
        {
            "Title": "VRL Logistics: Q4 Profit Soars 245% YoY, Beats Estimates",
            "Summary": "VRL Logistics reported a 245% YoY increase in Q4 profit after tax, significantly beating consensus expectations. Revenue grew 5.3% YoY to Rs 809 crore, driven by an 18% improvement in realisations, despite an 11% volume decline. Ebitda margin expanded by 9.4 percentage points to 23.1%. Management expects volume growth to recover in Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748230553000,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics: Q4 Earnings Show Significant Margin Improvement",
            "Summary": "VRL Logistics reported a 244.7% increase in Q4 profit to ₹74.25 crore, with revenue up 5.3% to ₹809.03 crore. EBITDA margin expanded to 23.1% from 13.7% year-over-year. The company's focus on higher-margin business and increased freight rates contributed to the improved performance. VRL plans to prioritize volume growth and expand into new markets.",
            "Sentiment": "positive",
            "PublishDate": 1747896309000,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Reports Q4 Results and Dividend Declaration",
            "Summary": "VRL Logistics announced its Q4 financial results. The company's net profit increased to 742.5 million rupees from 215.4 million rupees in the same quarter last year. Revenue rose to 8 billion rupees from 7.68 billion rupees year-over-year. Additionally, the company declared a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747873049000,
            "Source": "default"
        },
        {
            "Title": "VRL Logistics: Q4 Profit Triples, Beats Estimates",
            "Summary": "VRL Logistics reported a 245% increase in Q4 FY25 net profit to Rs 74 crore, surpassing Bloomberg estimates. Revenue rose 5.3% to Rs 809 crore, while EBITDA grew 78.1% to Rs 187 crore. The company declared a final dividend of Rs 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747825082000,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Announces Dividend and Q4 Results",
            "Summary": "VRL Logistics has declared a dividend of 10 rupees per share. The company's Q4 EBITDA increased to 1.86 billion rupees from 1.05 billion rupees year-over-year. The Q4 margin improved to 23.06% from 13.71% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747823923000,
            "Source": "result"
        },
        {
            "Title": "VRL Logistics Reports Q4 Financial Results",
            "Summary": "VRL Logistics has announced its financial results for the fourth quarter. The company's revenue increased to 8 billion rupees, compared to 7.68 billion rupees in the same period last year. The standalone net profit for Q4 rose significantly to 742.5 million rupees, up from 215.4 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747823595000,
            "Source": "result"
        },
        {
            "Title": "VRL Logistics to Meet with Abakkus Asset Manager",
            "Summary": "VRL Logistics has scheduled a meeting with Abakkus Asset Manager on February 20. This meeting suggests potential discussions about investment strategies, company performance, or future plans.",
            "Sentiment": "neutral",
            "PublishDate": 1739949924000,
            "Source": "corporate_governance"
        },
        {
            "Title": "VRL Logistics Reports Significant Profit Growth in Q3",
            "Summary": "VRL Logistics has announced its Q3 financial results, showing a substantial increase in net profit from 137 million rupees to 594 million rupees year-over-year. The company's revenue also grew from 7.4 billion rupees to 8.25 billion rupees in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1738801368000,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Reports Significant EBITDA Growth in Q3",
            "Summary": "VRL Logistics has reported a substantial increase in its Q3 EBITDA, rising to 1.66 billion rupees from 943 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 20.16% compared to 12.81% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738750980000,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Reports Significant Profit Increase in Q3",
            "Summary": "VRL Logistics has announced its financial results for the third quarter. The company's net profit has risen substantially to 594 million rupees, compared to 137 million rupees in the same period last year. Revenue also saw an increase, reaching 8.25 billion rupees, up from 7.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738750974000,
            "Source": "earnings"
        },
        {
            "Title": "VRL Logistics Acquires 27.30-Acre Transhipment Hub in Bengaluru",
            "Summary": "VRL Logistics has approved the purchase of a 27.30-acre transhipment hub in Bengaluru for ₹229.30 crore. The acquisition is aimed at improving operational efficiency and facilitating expansion of the company's logistics operations.",
            "Sentiment": "positive",
            "PublishDate": 1733711450000,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics Declares Interim Dividend",
            "Summary": "VRL Logistics has announced an interim dividend of 5 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731493372000,
            "Source": "corporate_action"
        },
        {
            "Title": "VRL Logistics Reports Strong Q2 Financial Performance",
            "Summary": "VRL Logistics has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.3 billion rupees, up from 918 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 16.64% from 12.96% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731493215000,
            "Source": "result"
        },
        {
            "Title": "VRL Logistics Reports Q2 Revenue Growth",
            "Summary": "VRL Logistics announced its second quarter revenue for the current fiscal year. The company reported revenue of 8 billion rupees, compared to 7.09 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731493046000,
            "Source": "result"
        },
        {
            "Title": "VRL Logistics Reports Significant Profit Growth in Q2",
            "Summary": "VRL Logistics has announced its Q2 financial results, showing a substantial increase in net profit. The company's net profit for the quarter reached 358 million rupees, up from 197 million rupees in the same quarter last year (YoY). This also represents an increase from 134 million rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1731493004000,
            "Source": "result"
        }
    ]
}