{
    "Symbol": "VSSL",
    "ISIN": "INE050M01012",
    "News": [
        {
            "Title": "Vardhman Special Steels Q3 FY26 Monitoring Report",
            "Summary": "CRISIL submits monitoring agency report for Vardhman Special Steels' preferential issue proceeds utilization for Q3 FY26, showing Rs 191.48 crore deployed during quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1769575474065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vardhman Special Steels Q3 Net Profit Jumps 57%",
            "Summary": "Vardhman Special Steels reported a significant 57% year-on-year increase in Q3 net profit, rising to ₹336 million from ₹214 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768897778777,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vardhman Special Steels Allots 1.23L ESOP Shares",
            "Summary": "Vardhman Special Steels allotted 1,23,750 equity shares under ESOP plans to eligible employees, including 61,875 bonus shares in 1:1 ratio, with face value of ₹10 each.",
            "Sentiment": "positive",
            "PublishDate": 1767853195704,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vardhman Special Steels Plans ₹475 Cr Steel Plant",
            "Summary": "Vardhman Special Steels announces corrected investment of ₹475 crore for new steel forging and machining facility in Ludhiana, partnering with Aichi Steel Corporation for automotive parts production.",
            "Sentiment": "positive",
            "PublishDate": 1766471191740,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Special Steels Plans ₹475 Cr Forging Plant",
            "Summary": "Vardhman Special Steels board approves construction of new forging plant in Punjab with ₹475 crore investment, targeting Japanese-quality automotive standards for enhanced manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766387236189,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Special Steels Faces ₹11.56 Lakh GST Penalty",
            "Summary": "Vardhman Special Steels receives GST penalty from Pune tax authorities over e-way bill discrepancy. Company plans appeal, states minimal business impact expected from the regulatory action.",
            "Sentiment": "negative",
            "PublishDate": 1766224464906,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Special Steels Loses Head of Research and Development as Senior Executive Resigns",
            "Summary": "Dinesh Singh, Head of Research and Development at Vardhman Special Steels, has resigned from his position as senior management personnel. The departure affects the company's research and development leadership structure and could impact future innovation initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1764072132052,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Special Steels Seeks Shareholder Approval for Director Appointments and Employee Stock Option Plan",
            "Summary": "Vardhman Special Steels Limited has issued a postal ballot notice seeking shareholder approval through special resolutions for three key proposals. The company is seeking approval to appoint Mr. Dinkar Gupta and Mr. Nishant Arya as Independent Directors for five-year terms starting from September 25, 2025. Mr. Gupta is a former Director General of the National Investigation Agency with over 30 years of security domain experience, while Mr. Arya is Vice Chairman MD of JBM Group with expertise in electric vehicles and renewable energy. The company is also seeking approval for the Vardhman Special Steels Limited Employee Stock Option Plan 2025, which would allow the issuance of up to 12,00,000 equity shares of Rs. 10 face value each, representing approximately 1.243% of total issued capital. The ESOP plan includes a minimum vesting period of two years and exercise period of two years from vesting date. The e-voting period runs from November 11, 2025, to December 10, 2025, with results to be declared by December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762773855257,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Special Steels Reports 16% EBITDA Growth Despite Volume Decline in Q2 FY26",
            "Summary": "Vardhman Special Steels Limited reported quarterly sales of 55,500 tons versus 59,000 tons in the previous year, with revenue declining 12.64% year-on-year to Rs. 432 crores due to both lower volumes and price reductions. However, EBITDA increased 16% to Rs. 56 crores compared to Rs. 48 crores last year, with EBITDA per ton at Rs. 10,000. PAT grew to Rs. 34.5 crores from Rs. 26 crores, benefiting from reduced finance costs following Aichi Steel's Rs. 385 crore investment for a 25% stake. The company renewed its technical assistance agreement with Aichi for three years and commissioned the Kocks Block successfully. A new reheating furnace is expected to be commissioned by March, which will increase rolling capacity to 2,70,000 tons and reduce job work costs. The company started a circular economy initiative with Maruti Suzuki, buying CRC scrap from Maruti plants to make steel in a closed loop. Management expects FY27 volumes of around 2,45,000 tons and maintains EBITDA guidance of Rs. 8,000-11,000 per ton from next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1762460386288,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Reports No Deviation in Fund Utilization from Preferential Issue",
            "Summary": "Vardhman Special Steels Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its preferential issue. CRISIL Ratings Limited, serving as the monitoring agency, reported no deviation from the disclosed objects of the issue. The company raised Rs 3,849,088,060 through the preferential issue on July 4, 2025. The funds were allocated for three purposes: Rs 1,349,088,060 for capital expenditure to set up a greenfield steel manufacturing plant at Ludhiana, Punjab; Rs 1,000,000,000 for capital expenditure requirements at the existing plant; and Rs 1,500,000,000 for repayment of working capital borrowing. During the reported quarter, Rs 500,000,000 was utilized for working capital borrowing repayment. The unutilized proceeds of Rs 2,349,088,060 are deployed in fixed deposits with ICICI Bank, earning returns and maturing between April 2026 and October 2025. The monitoring agency confirmed that utilization was as per disclosures in the notice to shareholders, with no material deviations requiring shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1762316290024,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Special Steels Projects EBITDA Growth with Production Scale-Up Plans Through FY28",
            "Summary": "Vardhman Special Steels has outlined its financial and production targets for the coming years. The company expects minimum EBITDA of INR 216 crores at 270,000 tons production capacity, with potential to reach INR 300 crores. For FY26, EBITDA per ton guidance is projected at INR 7,000-10,000, rising to INR 8,000-11,000 the following financial year. Production volume is estimated at around 245,000 tons for FY27, with the company aiming to achieve full capacity of 270,000 tons by FY28. At full capacity, EBITDA per ton is expected to range from INR 8,000-11,000, potentially increasing to INR 8,000-12,000 or INR 9,000-12,000.",
            "Sentiment": "positive",
            "PublishDate": 1762227543170,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Special Steels Increases Investment in Sone Solar by Rs 1.13 Crore",
            "Summary": "Vardhman Special Steels Limited made an additional investment of Rs 1.13 crore in Sone Solar Private Limited through 11,35,425 compulsory convertible debentures of face value Rs 10 each. This follows an earlier investment of Rs 3.67 crore made in May 2025. The company's total investment in Sone Solar now stands at Rs 12.46 crore, while maintaining its 26% shareholding in the equity share capital of Sone Solar.",
            "Sentiment": "neutral",
            "PublishDate": 1761850340153,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Special Steels Invests 11.4 Million Rupees in Sone Solar Private Limited",
            "Summary": "Vardhman Special Steels has made an investment of 11.4 million rupees in Sone Solar Private Limited. The investment represents Vardhman Special Steels' entry into the solar energy sector through its stake in Sone Solar Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1761828727152,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Special Steels Plans Capacity Expansion and Export Growth Strategy",
            "Summary": "Vardhman Special Steels has outlined strategic plans for capacity expansion and operational efficiency improvements. The company aims to establish long-term partnerships with original equipment manufacturers (OEMs) to drive export growth and strengthen EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1761755148911,
            "Source": "stock"
        },
        {
            "Title": "VSSL Reports Quarterly Volume Decline While Achieving Debt-Free Status",
            "Summary": "VSSL reported quarterly volumes of 55,536 tonnes, representing a decrease from 59,018 tonnes in the same period last year. The company has completely cleared both its long-term and short-term debts, achieving debt-free financial status and reducing interest expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1761662352586,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Special Steels Reports Mixed Q2 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "Vardhman Special Steels announced Q2 financial results showing EBITDA of 453 million rupees compared to 391.7 million rupees year-over-year, with EBITDA margin improving to 10.47% from 7.92% year-over-year. However, Q2 revenue declined to 4.3 billion rupees from 4.95 billion rupees year-over-year. The company's Q2 net profit increased to 346 million rupees from 258 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1761640882773,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Shareholders Approve All 10 Resolutions at Annual General Meeting",
            "Summary": "Vardhman Special Steels Limited held its 15th Annual General Meeting on September 24, 2025, where shareholders approved all 10 resolutions. Key approvals included adoption of audited standalone and consolidated financial statements for the year ended March 31, 2025, dividend declaration, and re-appointment of directors Mrs. Suchita Jain and Mrs. Soumya Jain. Shareholders also approved the appointment of Mr. Koichiro Hayashida as Non-Executive Non-Independent Director and resolved not to fill the vacancy caused by retirement of Mr. Rajeev Gupta. The meeting approved ratification of Cost Auditors' remuneration for FY2026, appointment of M/s Harsh Goyal & Associates as Secretarial Auditors for five years, and interim use of funds raised from Aichi Steel Corporation through preferential allotment. The meeting had 37,083 shareholders on record date with 19 promoter group members and 37 public shareholders attending via video conferencing. Voting participation was 80.3% of outstanding shares.",
            "Sentiment": "positive",
            "PublishDate": 1758811505539,
            "Source": "corporate_action"
        },
        {
            "Title": "Sachit Jain Appointed Chairman & Managing Director of Vardhman Special Steels",
            "Summary": "Vardhman Special Steels Limited announced a change in leadership designation effective September 25, 2025. Sachit Jain, who held the position of Vice-Chairman & Managing Director, has been designated as Chairman & Managing Director. This change follows the cessation of directorship of Rajeev Gupta, who served as Chairman (Non-Executive Director) on the company's Board.",
            "Sentiment": "neutral",
            "PublishDate": 1758810233907,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Special Steels Appoints Two Independent Directors for Five-Year Terms",
            "Summary": "Vardhman Special Steels Limited appointed Mr. Dinkar Gupta and Mr. Nishant Arya as Independent Directors on the company's Board for five-year terms effective September 25, 2025, subject to shareholder approval. Mr. Dinkar Gupta is a Commerce graduate with a Master's degree in Police Administration, an Indian Police Service Officer of the 1987 batch with over 30 years of security domain experience. He served as Director General of the National Investigation Agency from June 2022 to March 2024 and as Director-General of Punjab Police from 2019-2021. Mr. Nishant Arya graduated in Business Administration from Bradford University, UK and is Vice Chairman & MD of the $3.3 billion JBM Group and Chairman of Linde Wiemann GmbH, Germany. JBM Group operates across Electric Vehicles & Buses, EV Charging Infrastructure, Environment Management, Renewable Energy, and Auto systems. Both directors have no pecuniary relationship with other company directors and are not debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1758809382043,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Special Steels Appoints Koichiro Hayashida as Non-Executive Director",
            "Summary": "Vardhman Special Steels Limited appointed Mr. Koichiro Hayashida as a Non-Executive Non-Independent Director on the Board, effective July 4, 2025. The appointment was approved by company members at the Annual General Meeting held on September 24, 2025. The meeting commenced at 10:00 a.m. and concluded at 10:28 a.m.",
            "Sentiment": "neutral",
            "PublishDate": 1758714279890,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Special Steels Reports Q1 FY26 Results; Plans Forging Business Entry with Aichi Partnership",
            "Summary": "Vardhman Special Steels Limited achieved sales volume of 55,500 tons in Q1 FY26, up 10% year-over-year, with revenue from operations at INR433 crores, higher by 5%. EBITDA per ton stood at INR7,077, at the lower end of the company's stated range, impacted by pricing pressure from larger competitors and inventory valuation loss of INR6 crores. The company successfully commissioned its Kocks Block equipment and became debt-free after Aichi Steel Corporation increased its equity stake to 24.9% with INR385 crores investment. Management announced plans to enter the forging business with Aichi, targeting specialized automotive products with no direct competition in India. The first forging line is expected to have 12,000-15,000 tons annual capacity. The company maintains its annual sales target of 225,000 tons and expects to commission a new heating furnace in the last quarter. A greenfield steel plant worth INR2,000 crores is planned for commissioning by July 2029. Management highlighted the company's green steel credentials with a carbon footprint of 0.73, significantly below government norms of 2.2 for green steel classification.",
            "Sentiment": "neutral",
            "PublishDate": 1754034768045,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Provides Audio Recording Link for Q1 FY26 Earnings Conference Call",
            "Summary": "Vardhman Special Steels Limited has provided a link to the audio recording of their earnings conference call held on July 28, 2025 at 12:00 p.m. The call discussed the company's business and financial performance for Q1 FY26. The audio recording link has been shared with stock exchanges NSE and BSE for record purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1753706926619,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Completes Full Debt Repayment, Expects Reduced Finance Costs",
            "Summary": "Vardhman Special Steels has completed the repayment of all long-term and short-term loans in early July. The company expects this debt elimination to result in lower finance costs in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1753451538544,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Special Steels Announces ₹2,000 Crore Greenfield Expansion",
            "Summary": "Vardhman Special Steels has announced a ₹2,000 crore greenfield expansion project targeting 5 lakh tonnes per annum capacity by FY30. The company aims to establish leadership in EV-grade steel and the global forging market with strategic backing from Aichi Steel.",
            "Sentiment": "positive",
            "PublishDate": 1753449895174,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Special Steels Reports Q1 Results with Net Profit of Rs 1,989.51 Lakhs",
            "Summary": "Vardhman Special Steels Limited announced its quarterly results for the period ended June 30, 2025. The company reported revenue from operations of Rs 43,369.85 lakhs compared to Rs 41,477.99 lakhs in the same quarter last year. Net profit after tax stood at Rs 1,989.51 lakhs versus Rs 2,607.82 lakhs in the corresponding quarter of the previous year. Basic earnings per share was Rs 2.43 compared to Rs 3.20 in the same period last year. The company received government incentives of Rs 671.30 lakhs under the Industrial and Business Development Policy 2017. Additionally, Aichi Steel Corporation increased its shareholding from 11.33% to 24.90% through a preferential allotment of shares worth Rs 384.91 crore completed on July 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753432630932,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Reports Mixed Q1 Results with Revenue Growth but Lower Profits",
            "Summary": "Vardhman Special Steels reported quarterly revenue of 4.3 billion rupees compared to 4.15 billion rupees in the same period last year, representing an increase. However, the company's net profit declined to 199 million rupees from 260 million rupees year-over-year. The results show revenue growth alongside reduced profitability for the steel company.",
            "Sentiment": "neutral",
            "PublishDate": 1753432205672,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Schedules Q1 FY26 Earnings Conference Call for July 28",
            "Summary": "Vardhman Special Steels Limited has scheduled an earnings conference call to discuss the company's business and financial performance for Q1 FY26 on July 28, 2025, at 12:00 PM IST. The call is organized by IIFL Securities and will feature key management participants including Vice Chairman and Managing Director Sachit Jain, Chief Financial Officer Sanjeev Singla, Executive Director R K Rewari, and Executive Director Soumya Jain. The company has provided dial-in details for both domestic and international participants, with toll-free numbers available for USA, UK, Singapore, and Hong Kong. The invite is available on the company's websites.",
            "Sentiment": "neutral",
            "PublishDate": 1753273610521,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Amends Solar Power Project Agreements with ASG HOLDCO BETA and Sone Solar",
            "Summary": "Vardhman Special Steels Limited has executed amended agreements with ASG HOLDCO BETA PTE. LTD. and Sone Solar Private Limited for their 55 MW DC solar capacity project in Punjab. The amendments include changes to power tariff recovery mechanisms, where dividends received from Sone will be recovered through upward revision in power tariffs for subsequent months. The contracted energy delivery targets have been increased upward due to more efficient solar panels capable of producing higher power output. Additionally, the share valuation terms have been modified - if Fair Market Value exceeds Face Value during Call or Put Option exercise, the company will refund the excess to ASG net of tax liability, while if FMV is below Face Value, ASG will compensate the company for the difference. The amendments are effective from April 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753181332989,
            "Source": "order&deals"
        },
        {
            "Title": "Vardhman Special Steels Approves Preferential Share Issuance",
            "Summary": "Vardhman Special Steels has approved the issuance of shares on a preferential basis. The shares will be priced at ₹260.60 each, with the total investment amounting to ₹384.90 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748954345000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Special Steels: Shares Surge 20% on New Greenfield Plant Announcement",
            "Summary": "Vardhman Special Steels Ltd. shares hit 20% upper circuit after announcing plans to invest in a new Greenfield steel plant in Punjab with 5,00,000 MT annual billet production capacity. The ₹2,000 crore project, funded by internal accruals and debt, is expected to be commissioned by FY 2029-2030. Q4 results show 3% drop in revenue and 40% decline in net profit year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1745393538000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Special Steels Approves New Green Steel Plant in Punjab",
            "Summary": "Vardhman Special Steels has approved the construction of a new green steel plant in Punjab. The proposed capacity addition is 500,000 MT of billet production, to be completed by FY 2029-30. The company estimates an investment of approximately 20 billion rupees for this project.",
            "Sentiment": "positive",
            "PublishDate": 1745367694000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Special Steels Approves New Green Steel Plant in Punjab",
            "Summary": "Vardhman Special Steels has approved the construction of a new green steel plant in Punjab. The proposed capacity addition is 500,000 MT of billet production, which is expected to be completed by FY 2029-30. The company estimates that the investment required for this expansion will be approximately 20 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745320830000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Special Steels Reports Q4 FY23 Results and Announces Dividend",
            "Summary": "Vardhman Special Steels reported its Q4 FY23 financial results. Revenue decreased to 4.3 billion rupees from 4.39 billion rupees year-over-year. Net profit declined to 197 million rupees from 328 million rupees. EBITDA fell to 314 million rupees from 488.4 million rupees, with EBITDA margin dropping to 7.34% from 11.1%. The company announced a dividend of 3 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1745315973000,
            "Source": "result"
        },
        {
            "Title": "Vardhman Special Steels Reports Q4 Net Profit Decline",
            "Summary": "Vardhman Special Steels has reported a net profit of 197 million rupees for the fourth quarter, compared to 328 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1745315860000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Special Steels Invests in Sone Solar Private Limited",
            "Summary": "Vardhman Special Steels has made an investment of 29.8 million rupees in Sone Solar Private Limited. This strategic move suggests the company's interest in diversifying its portfolio or potentially exploring opportunities in the solar energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1738930896000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Special Steels: Q3 Profit Dips 1.6% Despite Revenue Growth",
            "Summary": "Vardhman Special Steels reported Q3 FY25 results with revenue up 7.39% YoY to ₹426.77 crore, but profit down 1.6% to ₹21.46 crore. QoQ performance shows revenue decline of 13.75% and profit fall of 16.89%. EPS decreased 2.24% YoY to ₹2.62.",
            "Sentiment": "neutral",
            "PublishDate": 1738303651000,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Reports Q3 EBITDA Growth",
            "Summary": "Vardhman Special Steels has reported its Q3 financial results. The company's EBITDA increased to 351 million rupees, up from 333 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 8.22% from 8.37% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738140782000,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Reports Q3 Revenue Increase",
            "Summary": "Vardhman Special Steels has reported a revenue of 4.3 billion rupees for the third quarter, compared to 3.97 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738140708000,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Reports Slight Decrease in Q3 Net Profit",
            "Summary": "Vardhman Special Steels has reported a net profit of 214 million rupees for the third quarter, compared to 218 million rupees in the same period last year. This represents a marginal year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1738140694000,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Special Steels Reports Improved Q2 EBITDA and Margin",
            "Summary": "Vardhman Special Steels has announced its Q2 financial results. The company's EBITDA increased to 391.7 million rupees, up from 311 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 7.92% from 7.50% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730968500000,
            "Source": "result"
        },
        {
            "Title": "Vardhman Special Steels Reports Q2 Revenue Growth",
            "Summary": "Vardhman Special Steels has announced its Q2 revenue figures. The company reported revenue of 4.95 billion rupees, compared to 4.15 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730968443000,
            "Source": "result"
        },
        {
            "Title": "Vardhman Special Steels Reports Q2 Profit Increase",
            "Summary": "Vardhman Special Steels has reported a net profit of 258 million rupees for the second quarter, up from 185 million rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730968421000,
            "Source": "result"
        }
    ]
}