{
    "Symbol": "VSTIND",
    "ISIN": "INE710A01016",
    "News": [
        {
            "Title": "VST Industries Q3FY26 Results & Leadership Changes",
            "Summary": "VST Industries reported Q3FY26 revenue of ₹49,137 lakhs with net profit of ₹6,023 lakhs. Company appointed Piyush Srivastava as new MD & CEO and selected PwC as statutory auditor.",
            "Sentiment": "positive",
            "PublishDate": 1769676449226,
            "Source": "co_actions_results"
        },
        {
            "Title": "VST Industries Appoints Saurabh Grover as VP Sales",
            "Summary": "VST Industries Limited announces the appointment of Mr. Saurabh Grover as Vice President-Sales & Marketing, effective January 19, 2026. Grover brings over 24 years of FMCG experience from leading companies.",
            "Sentiment": "positive",
            "PublishDate": 1768811619693,
            "Source": "stocks"
        },
        {
            "Title": "VST Industries Receives ₹2.21 Crore Assessment Order from Telangana Power Distribution Company",
            "Summary": "VST Industries Limited received an assessment order dated December 3, 2025, from Southern Power Distribution Company of Telangana State Limited for energy charge dues of ₹2.21 crore arising from reclassification of power supply from industrial to commercial under Section 126 of the Electricity Act, 2003. The company disclosed that the financial impact is limited to the assessment order amount, with the order received on December 9, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1765277932025,
            "Source": "stock"
        },
        {
            "Title": "Government Studying Options to Replace Tobacco Compensation Cess, May Announce in Budget 2026",
            "Summary": "The government is exploring multiple options to replace the existing compensation cess on tobacco products and may announce a new levy in Budget 2026. This development affects tobacco companies including Godfrey Phillips and VST Industries, potentially impacting their tax structure and operational costs.",
            "Sentiment": "neutral",
            "PublishDate": 1764061082919,
            "Source": "sectoral"
        },
        {
            "Title": "VST Industries Reports Mixed Q2 Results with Higher Profits Despite Revenue Decline",
            "Summary": "VST Industries reported quarterly results showing net profit increased to 592 million rupees from 475.6 million rupees year-over-year. EBITDA rose to 786 million rupees compared to 676.1 million rupees in the same period last year, while EBITDA margin improved to 17.46% from 14.66%. However, revenue declined to 4.5 billion rupees from 4.61 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1761733777375,
            "Source": "earnings"
        },
        {
            "Title": "VST Industries Wins Tax Appeal, Rs 2.5 Crore Demand Dropped by Chhattisgarh Authorities",
            "Summary": "VST Industries Limited received a favorable order from the adjudicating authority, which dropped a tax demand of Rs 2,49,57,830 related to alleged discrepancies in excess claim of Input Tax Credit in Chhattisgarh. The Joint Commissioner of State Tax Raipur Division-1 passed the order on September 16, 2025, fully withdrawing the demand that was originally raised through a Show Cause Notice issued under the CGST Act on January 31, 2024. The company stated that since the demand has been fully withdrawn, it has no financial impact on the company.",
            "Sentiment": "positive",
            "PublishDate": 1758102719090,
            "Source": "stock"
        },
        {
            "Title": "Bengal Minister Proposes Higher GST on Tobacco and Pan Masala Products",
            "Summary": "A Bengal Minister has suggested increasing the Goods and Services Tax (GST) on tobacco and pan masala products. This proposal could impact VST Industries, which operates in the tobacco sector.",
            "Sentiment": "negative",
            "PublishDate": 1755765803525,
            "Source": "sectoral"
        },
        {
            "Title": "Government Proposes 40% GST Rate on Sin Products Including VST Industries",
            "Summary": "The government has suggested implementing a 40% GST rate on sin products, which would affect VST Industries and other companies in similar sectors.",
            "Sentiment": "negative",
            "PublishDate": 1755488095214,
            "Source": "stock"
        },
        {
            "Title": "VST Industries Reconstitutes Board Committees with New Leadership Structure",
            "Summary": "VST Industries Limited announced changes to its Board Committee composition effective July 22, 2025. The company reconstituted six key committees: Audit Committee (chaired by Sudip Bandyopadhyay), Nomination and Remuneration Committee (chaired by Rajeev Bakshi), Stakeholders Relationship Committee (chaired by Rama Bijapurkar), Corporate Social Responsibility Committee (chaired by Rajeev Bakshi), Risk Management Committee (chaired by Sudip Bandyopadhyay), and Strategy Committee (chaired by Rajeev Bakshi). The committees include various combinations of board members, with the Risk Management Committee also incorporating management representatives Anish Gupta and S. Sriram. The changes were approved by the Board of Directors and communicated to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753197991529,
            "Source": "corporate_governance"
        },
        {
            "Title": "VST Industries Reports Strong Volume Recovery in Latest Quarter",
            "Summary": "VST Industries has reported a positive start to the year, driven by strong volume recovery in the current quarter. The company attributes this performance to improved volume metrics during the period.",
            "Sentiment": "positive",
            "PublishDate": 1753195949991,
            "Source": "stock"
        },
        {
            "Title": "VST Industries Reports Strong Sequential Growth in Q1 FY26 with 10% Revenue and EBITDA Increase",
            "Summary": "VST Industries Limited reported strong sequential growth in Q1 FY26 compared to Q4 FY25. Gross cigarette revenue increased 10% to Rs. 371 crores from Rs. 337 crores, while EBITDA grew 10% to Rs. 77 crores from Rs. 70 crores. Cigarette volume averaged 714 million per month, up 10.4% quarter-on-quarter and 10.9% year-on-year. EBITDA margin improved to 26.0% from 19.9% in the previous quarter. Profit after tax rose 5.8% to Rs. 56.1 crores. The company attributed the performance to strong volume recovery, portfolio rebalancing efforts, better micro market execution, and early signs of rural recovery. However, unmanufactured tobacco revenue declined to Rs. 41 crores from Rs. 116 crores in the previous quarter due to demand stress. Management noted that raw material prices remain high but expects recovery in the unmanufactured tobacco segment.",
            "Sentiment": "positive",
            "PublishDate": 1753181298440,
            "Source": "earnings"
        },
        {
            "Title": "VST Industries Reports Mixed Q1 Results with Revenue Decline but Profit Growth",
            "Summary": "VST Industries reported quarterly revenue of 4.14 billion rupees, down from 4.2 billion rupees in the same period last year. However, the company's net profit increased to 561 million rupees compared to 536 million rupees year-over-year. EBITDA rose to 769 million rupees from 733 million rupees, while EBITDA margin improved to 18.58% from 17.32% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753172994208,
            "Source": "earnings"
        },
        {
            "Title": "VST Industries: Radhakrishnan Damani-Backed Stock Surges 200% in Five Years",
            "Summary": "VST Industries, backed by investor Radhakrishnan Damani, has seen a 200% increase in share price over the last five years. Damani currently holds a 3.15% stake. The stock has shown mixed performance in 2025, with a year-to-date decline of 18.69%. Analysts have differing views on the stock, with one recommending buy and another suggesting sell.",
            "Sentiment": "neutral",
            "PublishDate": 1750654114000,
            "Source": "normal_news"
        },
        {
            "Title": "VST Industries: Q4 Profit Plunges 40%, Shares Tumble",
            "Summary": "VST Industries reported a 40% year-on-year drop in Q4 net profit to ₹53 crore. Revenue fell 6.9% to ₹349 crore, while EBITDA declined 28.6% to ₹69.3 crore. Operating margins narrowed to 20% from 26% a year ago. The company's board recommended a final dividend of ₹10 per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1745572132000,
            "Source": "earnings"
        },
        {
            "Title": "VST Industries Reports Q4 Financial Results",
            "Summary": "VST Industries has released its Q4 financial results. The company's EBITDA decreased to 695 million rupees from 965.9 million rupees year-over-year. The EBITDA margin also declined to 15.32% from 20.29% in the same period. Revenue for Q4 was reported at 4.54 billion rupees, down from 4.76 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1745569885000,
            "Source": "result"
        },
        {
            "Title": "VST Industries Reports 41.8% Decline in Q4 Net Profit",
            "Summary": "VST Industries, an Indian tobacco company, reported a net profit of 513 million rupees for the fourth quarter, down from 882 million rupees in the same period last year. This represents a significant year-over-year decline of 41.8% in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1745569505000,
            "Source": "result"
        },
        {
            "Title": "SBI Mutual Fund: Partial Profit Booking in VST Industries",
            "Summary": "SBI Mutual Fund has reduced its stake in VST Industries by selling 65,705 shares, decreasing its holding from 5.7029% to 3.69% of the company's paid-up share capital as of March 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1741792772000,
            "Source": "block_deals"
        },
        {
            "Title": "VST Industries Reports Q3 Revenue of 4.7 Billion Rupees",
            "Summary": "VST Industries has announced its third quarter revenue, which stands at 4.7 billion rupees. This represents a slight increase from the previous year's figure of 4.68 billion rupees for the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1738914352000,
            "Source": "earnings"
        },
        {
            "Title": "VST Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "VST Industries has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 684 million rupees from 723 million rupees in the same quarter last year. Additionally, the EBITDA margin declined to 14.53% from 15.45% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738914321000,
            "Source": "earnings"
        },
        {
            "Title": "VST Industries Reports Significant Increase in Q3 Net Profit",
            "Summary": "VST Industries has announced its financial results for the third quarter, reporting a net profit of 1.4 billion rupees. This represents a substantial increase from the 537 million rupees reported in the same period last year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738914081000,
            "Source": "earnings"
        },
        {
            "Title": "VST Industries Under CGST Inspection in Telangana",
            "Summary": "VST Industries has reported that Central GST authorities from the Hyderabad Zone have initiated an inspection at the company's offices and factory premises in Telangana. The company states that the process is ongoing and they are fully cooperating by providing requested data and clarifications.",
            "Sentiment": "neutral",
            "PublishDate": 1737678189000,
            "Source": "corporate_governance"
        },
        {
            "Title": "GST Authorities Inspect VST Industries Premises in Telangana",
            "Summary": "VST Industries has reported that Central GST authorities from the Hyderabad Zone have initiated an inspection at the company's offices and factory premises in Telangana. The company states that the process is ongoing and they are fully cooperating by providing requested data and clarifications.",
            "Sentiment": "neutral",
            "PublishDate": 1737637468000,
            "Source": "corporate_governance"
        },
        {
            "Title": "VST Industries: BAT's Executive Chairman Nominee Rejected by Shareholders",
            "Summary": "British American Tobacco's nominee Naresh Kumar Sethi failed to secure appointment as VST Industries' Executive Chairman. The proposal received only 56% of votes, falling short of the required 75% for special resolutions. Billionaire Radhakishan Damani, holding nearly 31% stake, likely opposed the appointment.",
            "Sentiment": "negative",
            "PublishDate": 1734924470000,
            "Source": "corporate_governance"
        },
        {
            "Title": "VST Industries: Sale of Hyderabad Property for Rs 101.7 Crore",
            "Summary": "VST Industries has sold an immovable property in Hyderabad for Rs 101.7 crore. The property, measuring about 2.7 acres with structures, was sold to ViNS Bioproducts Ltd and others. The transaction is not considered a related party transaction. Following the news, VST Industries' shares rose 4% to Rs 328 on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1732507454000,
            "Source": "corporate_action"
        },
        {
            "Title": "VST Industries Sells Immovable Property in Hyderabad",
            "Summary": "VST Industries has sold an immovable property located in Hyderabad to VINS Bioproducts. The transaction was completed through the execution of sale deeds, with the agreement size amounting to 1.02 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1732492577000,
            "Source": "corporate_action"
        },
        {
            "Title": "VST Industries Sells Immovable Property in Hyderabad for 1.02 Billion Rupees",
            "Summary": "VST Industries has sold an immovable property located in Hyderabad by executing sale deeds. The transaction size is reported to be 1.02 billion rupees. The property was sold to Vins Bioproducts.",
            "Sentiment": "neutral",
            "PublishDate": 1732275751000,
            "Source": "corporate_action"
        },
        {
            "Title": "VST Industries Reports Q2 Financial Results",
            "Summary": "VST Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 676.1 million rupees, compared to 789 million rupees in the same quarter last year. The EBITDA margin has decreased from 17.45% to 14.66% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729786652000,
            "Source": "result"
        },
        {
            "Title": "VST Industries Reports Q2 Revenue Growth",
            "Summary": "VST Industries has announced its second quarter revenue of 4.61 billion rupees, showing a slight increase from 4.52 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1729786643000,
            "Source": "result"
        },
        {
            "Title": "VST Industries Reports Q2 Net Profit Decline",
            "Summary": "VST Industries has reported a net profit of 475.6 million rupees for the second quarter, showing a significant decrease from 759.5 million rupees in the same quarter last year. However, it represents a slight improvement from the previous quarter's 535.8 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1729786636000,
            "Source": "result"
        }
    ]
}