{
    "Symbol": "VSTL",
    "ISIN": "INE0QTF01015",
    "News": [
        {
            "Title": "Vibhor Steel Tubes schedules Q3 FY26 earnings call",
            "Summary": "Vibhor Steel Tubes Limited announces earnings conference call on February 19, 2026 to discuss Q3 and nine months FY2026 financial and operational performance under Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770724633447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vibhor Steel Tubes Factory Manager Resigns",
            "Summary": "Vibhor Steel Tubes Limited announces resignation of Mr. Suresh Kumar Agrawal, Factory Manager-Odisha, effective February 6, 2026, citing personal reasons for departure from senior management role.",
            "Sentiment": "neutral",
            "PublishDate": 1770357066109,
            "Source": "stocks"
        },
        {
            "Title": "Vibhor Steel Tubes Board Meet Set for Feb 13, 2026",
            "Summary": "Vibhor Steel Tubes Limited has scheduled a board meeting for February 13, 2026, to consider and approve Q3FY26 unaudited standalone financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770355965895,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vibhor Steel Tubes Head of Finance Resigns",
            "Summary": "Vibhor Steel Tubes Limited announces resignation of Mr. Akula Laxman Rao, Head - Accounts & Finance, effective January 19, 2026, citing personal reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768822016581,
            "Source": "stocks"
        },
        {
            "Title": "Vibhor Steel Tubes Q2 FY26 Results Show Strong Growth",
            "Summary": "Vibhor Steel Tubes reports 19% revenue surge and 60% PAT jump in Q2 FY26, with new Odisha plant operational and diversification into crash barriers and transmission towers driving expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767963076280,
            "Source": "stocks"
        },
        {
            "Title": "Vibhor Steel Tubes makes investor call recording available",
            "Summary": "Vibhor Steel Tubes Limited has made the audio recording of its January 7, 2026 investor update conference call available on its website, discussing operational and financial performance and the newly launched Odisha plant.",
            "Sentiment": "neutral",
            "PublishDate": 1767415038976,
            "Source": "stocks"
        },
        {
            "Title": "Vibhor Steel Tubes Launches Octagonal Poles Product",
            "Summary": "Vibhor Steel Tubes Limited successfully launched Octagonal Poles on January 2, 2026, after delays from electricity connection issues. Monopoles and High Mast Lightning Poles expected by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767344928677,
            "Source": "stocks"
        },
        {
            "Title": "Vibhor Steel Tubes Wins ₹7.43 Cr Metal Crash Barrier Order",
            "Summary": "Vibhor Steel Tubes Limited secures new work order worth ₹7.43 crores from YNM Pan Global Trade Private Limited for supply of metal crash barriers on December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765860991801,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vibhor Steel Tubes Wins ₹3.52 Cr Metal Crash Barrier Order",
            "Summary": "Vibhor Steel Tubes Limited secures new work order worth ₹3.52 crores from Surich Industries LLP for supply of metal crash barriers, strengthening its infrastructure segment presence.",
            "Sentiment": "positive",
            "PublishDate": 1765629826775,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vibhor Steel Tubes Secures Rs. 4.02 Crore Order for Metal Crash Barriers from Veda Metallics",
            "Summary": "Vibhor Steel Tubes Limited received a new work order worth approximately Rs. 4.02 crores from Veda Metallics for the supply of Metal Crash Barriers on November 13, 2025. The domestic order involves manufacturing METAL CRASH BARRIER THRIE BEAM products and represents a significant business development for the steel tubes manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1763105572116,
            "Source": "order&deals"
        },
        {
            "Title": "Vibhor Steel Tubes Reports Quarterly Results and Dissolves IPO Committee",
            "Summary": "Vibhor Steel Tubes Limited announced its unaudited standalone financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved these results during their meeting on November 12, 2025. The company reported total revenue of Rs 202.13 crores for the quarter ended September 30, 2025, compared to Rs 231.04 crores in the same quarter of the previous year. Net profit for the quarter was Rs 17.92 crores versus Rs 17.72 crores in the corresponding quarter last year. For the half year period, total revenue stood at Rs 513.18 crores compared to Rs 461.48 crores in the previous year, with net profit of Rs 60.56 crores against Rs 57.22 crores. The Board also approved the dissolution of the IPO Committee. The company operates in manufacturing ERW Pipes, GI Pipes, Crash Barriers and Transmission Line Towers with manufacturing units in Maharashtra, Telangana and Odisha.",
            "Sentiment": "neutral",
            "PublishDate": 1762985309651,
            "Source": "earnings"
        },
        {
            "Title": "Vibhor Steel Tubes Withdraws Decision to Enter Hotel and Hospitality Business",
            "Summary": "Vibhor Steel Tubes Limited has withdrawn its decision to incorporate a wholly-owned subsidiary in the hotel and hospitality business. The board of directors reconsidered the earlier plan announced on August 12th, 2025, which involved creating a subsidiary under names like Vishank Hotels Private Limited or Pratima Hospitality Private Limited. After evaluating market conditions, the company decided to focus on its core business of manufacturing steel pipes, where it sees significant opportunities. The board concluded that leveraging core strengths in steel pipe manufacturing would deliver better value to stakeholders compared to diversifying into hospitality.",
            "Sentiment": "neutral",
            "PublishDate": 1757420265566,
            "Source": "corporate_action"
        },
        {
            "Title": "Vibhor Steel Tubes Secures Rs. 3.26 Crore Metal Crash Barriers Contract",
            "Summary": "Vibhor Steel Tubes Limited received a work order worth approximately Rs. 3.26 crores from YNM Pan Global Trade Private Limited for supplying metal crash barriers on September 5, 2025. The contract involves supplying METAL CRASH BARRIER THRIE BEAM products and must be executed by September 8, 2025. This is a domestic order with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1757074256806,
            "Source": "order&deals"
        },
        {
            "Title": "Vibhor Steel Tubes Begins Supply from New 1.56 Lakh MT Odisha Plant",
            "Summary": "Vibhor Steel Tubes Limited has commenced supply of Electric Resistance Welded (ERW) and Galvanized (GI) pipes from its newly commissioned greenfield plant in Sundargarh, Odisha. The facility has a capacity of 156,000 MTPA and required an investment of Rs 119.83 crore over 30 months. Commercial production began in July 2025 after receiving electricity access. The plant will also manufacture value-added products including crash barriers, power transmission line towers, high mast lighting poles, octagonal poles and monopoles. With this addition, the company's total capacity across three plants in Maharashtra, Telangana and Odisha has increased to 377,000 MTPA. Chairman Vijay Kaushik stated the facility will strengthen production capabilities and boost margins while enabling expansion into new markets and exports. The company has a manufacturing agreement with Jindal Pipes, which accounts for over 80% of total turnover. For the quarter ended June 30, 2025, VSTL reported net profit of Rs 3.14 crore and operating income of Rs 230.96 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756111775590,
            "Source": "stock"
        },
        {
            "Title": "Vibhor Steel Tubes and Borana Weaves Face Lock-in Period Expiry",
            "Summary": "Vibhor Steel Tubes and Borana Weaves will see their shareholder lock-in periods end on Thursday, August 21. Vibhor Steel Tubes will have 38 lakh shares (20% of outstanding equity) become eligible for trading as its one-and-a-half-year lock-in expires. Borana Weaves will have 15 lakh shares (6% of outstanding equity) become tradeable after its three-month lock-in ends. Vibhor Steel Tubes achieved over 300x subscription in its IPO and debuted at ₹425, a 151% premium to its ₹151 issue price, but has since corrected back to IPO levels. Borana Weaves recorded nearly 150x subscription and remains at its IPO price of ₹216. Both companies had relatively small IPO sizes - Vibhor Steel at ₹72 crore and Borana Weaves at over ₹140 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1755732895090,
            "Source": "stock"
        },
        {
            "Title": "Vibhor Steel Tubes Reports Smooth Q1 Performance as New Jharsuguda Plant Becomes Operational",
            "Summary": "Vibhor Steel Tubes Limited reported a smooth first quarter with positive turnover reflecting in top line and margins. The company's new Jharsuguda plant in Odisha has become operational after electricity connection delays, with two tube mills successfully tested and currently manufacturing three sizes of steel pipes. The plant has produced approximately 1,000 tonnes of highway guard rails and galvanized over 500 tonnes of products. The facility has an annual capacity of 100,000-120,000 tonnes, similar to the company's Maharashtra and Telangana plants, with total CAPEX of ₹120 crore. Management noted steady domestic demand for steel pipes and expects healthy margin realization due to stable raw material prices. The company aims to capture market share in North-East India, West Bengal, Odisha, and Raipur through the new facility while leveraging its existing dealer network. Management described the outlook as very promising with steady order intake observed.",
            "Sentiment": "positive",
            "PublishDate": 1755596641049,
            "Source": "earnings"
        },
        {
            "Title": "VSTL Reports Q1 FY26 Results, Appoints New Auditors and Approves Hospitality Subsidiary",
            "Summary": "Vibhor Steel Tubes Limited (VSTL) approved its unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 23,095.51 lacs compared to Rs 22,474.62 lacs in the same quarter last year. Net profit increased to Rs 314.13 lacs from Rs 302.02 lacs year-over-year. The board reappointed S.K Agarwal & Associates as Cost Auditors for FY 2025-26 and appointed KRS AND CO. as Secretarial Auditors for five consecutive years from FY 2025-26. VSTL also approved the incorporation of a wholly-owned subsidiary in the hospitality sector with an initial capital of Rs 5 lacs, comprising 50,000 equity shares of Rs 10 each. Additionally, the company appointed Suresh Kumar Agrawal as Factory Manager at Unit III, Odisha, effective August 13, 2025. The tower facility at the Orissa plant commenced operations on June 24, 2025. The 22nd Annual General Meeting is scheduled for September 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755005702340,
            "Source": "earnings"
        },
        {
            "Title": "Vibhor Steel Tubes Initiates Power Supply at Unit III in Odisha",
            "Summary": "Vibhor Steel Tubes has started power supply operations at its Unit III facility located in Odisha. This development indicates an expansion or improvement in the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1752234024000,
            "Source": "default"
        },
        {
            "Title": "Vibhor Steel Tubes Ltd: IPO Star Now Trading Below Issue Price",
            "Summary": "Vibhor Steel Tubes Ltd, which had the second-most subscribed mainboard IPO in India, is now trading below its IPO price of ₹151. The stock is down 1.8% at ₹135.8, marking a 30% decline in 2025 and a 60% drop from its post-listing high of ₹333. Retail shareholding has increased from 12% at listing to 17.9% as of December 2024.",
            "Sentiment": "negative",
            "PublishDate": 1741768048000,
            "Source": "normal_news"
        },
        {
            "Title": "Vibhor Steel Tubes Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Vibhor Steel Tubes experienced a decline in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 96 million rupees from 128 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 3.89% from 5.08% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738933058000,
            "Source": "earnings"
        },
        {
            "Title": "Vibhor Steel Tubes Reports Q3 and 9M Financial Results",
            "Summary": "Vibhor Steel Tubes has reported its financial results for the third quarter and nine months. The company's Q3 net profit decreased to 34 million rupees from 43 million rupees year-over-year. The Q3 revenue slightly declined to 2.47 billion rupees from 2.5 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738932964000,
            "Source": "earnings"
        },
        {
            "Title": "Vibhor Steel Tubes Completes Construction of Unit III in Odisha",
            "Summary": "Vibhor Steel Tubes has announced the completion of construction and setup activities for their Unit III in Odisha. The company anticipates that this new unit will become operational by the end of January 2025.",
            "Sentiment": "positive",
            "PublishDate": 1733396354000,
            "Source": "corporate_action"
        }
    ]
}