{
    "Symbol": "VSTTILLERS",
    "ISIN": "INE764D01017",
    "News": [
        {
            "Title": "VST Tillers Posts 43.4% Revenue Growth in Q3 FY26",
            "Summary": "VST Tillers Tractors reported strong Q3 FY26 results with revenue rising 43.4% to ₹314.3 crore and net profit surging to ₹30.7 crore from ₹1.7 crore year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1770461764368,
            "Source": "co_actions_results"
        },
        {
            "Title": "VST Tillers Board Meet Set for Feb 7 to Review Q3 Results",
            "Summary": "VST Tillers Tractors has scheduled its board meeting for February 07, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769932430857,
            "Source": "co_actions_results"
        },
        {
            "Title": "VST Tillers Tractors Reports 54% Sales Growth",
            "Summary": "VST Tillers Tractors achieved 5,257 unit sales in January 2026, marking 54% growth over previous year with strong performance in both power tillers and tractors segments.",
            "Sentiment": "positive",
            "PublishDate": 1769924068375,
            "Source": "stocks"
        },
        {
            "Title": "VST Tillers Reports December 2025 Sales Data",
            "Summary": "VST Tillers Tractors disclosed sales figures for December 2025, showing combined power tiller and tractor sales of 4,376 units for the month and 41,611 units year-to-date, compared to 3,372 units and 28,016 units respectively in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1767239856614,
            "Source": "stocks"
        },
        {
            "Title": "VST Tillers Gets ESG Rating of 68.7 (Grade B) for FY25",
            "Summary": "V.S.T. Tillers Tractors Ltd received an ESG score of 68.7 with Grade B rating from SES ESG Research for FY2024-25, disclosed under SEBI regulations on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767179315190,
            "Source": "stocks"
        },
        {
            "Title": "VST Tillers Showcases Engineering Excellence at EXCON 2025",
            "Summary": "VST Tillers Tractors displayed advanced 3-cylinder and 4-cylinder compact engines ranging from 17HP to 30HP at EXCON 2025 in Bengaluru, highlighting its evolution from farm equipment to diversified engineering solutions.",
            "Sentiment": "positive",
            "PublishDate": 1765542096452,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Mahindra MF Raises Stake in VST Tillers to 9.18%",
            "Summary": "Kotak Mahindra Mutual Fund increased its shareholding in VST Tillers Tractors from 9.11% to 9.18% through open market acquisition of 6,105 equity shares on December 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765518863789,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kotak Mahindra Mutual Fund Increases Stake in VST Tillers Tractors to 9.18%",
            "Summary": "Kotak Mahindra Mutual Fund acquired 6,105 equity shares of VST Tillers Tractors Limited through open market transactions on December 05, 2025, increasing its holding from 9.11% to 9.18% of the company's total share capital. The acquisition was made through the mutual fund's schemes and disclosed under SEBI substantial acquisition regulations, with VST Tillers having a total equity capital of 86,43,358 shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1765270721831,
            "Source": "corporate_action"
        },
        {
            "Title": "V.S.T Tillers Reports Strong Sales Growth Across Tractor and Power Tiller Segments",
            "Summary": "V.S.T Tillers reported November tractor sales increased to 490 units from 347 units year-over-year, while power tiller yearly sales surged to 4,676 units from 1,904 units. The significant growth in both product segments demonstrates strong performance for the agricultural equipment manufacturer and indicates robust demand in the farming machinery market.",
            "Sentiment": "positive",
            "PublishDate": 1764563941271,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Tractors Launches First Electric Power Tiller and Weeder",
            "Summary": "VST Tillers Tractors has launched its first electric power tiller and weeder, marking the company's entry into electric agricultural equipment. This product launch represents the company's expansion into sustainable farming technology solutions.",
            "Sentiment": "positive",
            "PublishDate": 1764238654293,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Showcases Expanded Fieldtrac Range at Agritechnica 2025",
            "Summary": "VST Tillers displayed its expanded Fieldtrac product range at Agritechnica 2025 as part of efforts to strengthen its presence in European markets.",
            "Sentiment": "positive",
            "PublishDate": 1763033367787,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Tractors Reports 26% Revenue Growth in H1 with Strong Power Tiller Performance",
            "Summary": "VST Tillers Tractors Limited achieved its highest quarterly turnover at Rs. 315 crores versus Rs. 283 crores in the previous year, marking 11% growth. The company's H1 revenue reached Rs. 598 crores compared to Rs. 474 crores last year, representing 26% growth. Power tiller sales grew 43% in H1 with 24,829 units sold versus 17,325 units previously. The domestic tractor business showed 10% growth, reversing the previous downward cycle. Power weeder sales increased 42% in H1. The company generated Rs. 62.5 crores cash from operations compared to deploying Rs. 52.1 crores last year. Operational EBITDA improved to 13.2% in H1 from 10.8% previously. The company is launching new tractor platforms with upgraded engines - moving from 0.9 liter to 1.2 liter engines in compact tractors and introducing 3.22 liter engines in higher horsepower segments. Management expects to achieve 7,000+ tractor sales this year and targets 10,000-12,000 annual tractor sales within two years. Export volumes declined 33% due to logistics challenges, with the company planning European operations within 6-9 months.",
            "Sentiment": "positive",
            "PublishDate": 1763030431186,
            "Source": "earnings"
        },
        {
            "Title": "VST Tillers Tractors Reports 26% Revenue Growth in Half-Year Results",
            "Summary": "VST Tillers Tractors Limited announced its financial results for the quarter and half-year ended September 30, 2025. For Q2, revenue from operations increased 11.2% to ₹315.15 crore compared to ₹283.43 crore in the previous year. Net profit declined to ₹25.43 crore from ₹44.93 crore, primarily due to lower fair value gains on investments. Excluding fair value adjustments, net profit would be ₹27.70 crore versus ₹24.35 crore. For the half-year period, revenue grew 26.1% to ₹597.60 crore from ₹474.02 crore. Net profit was ₹69.99 crore compared to ₹67.78 crore in the previous year. Operational EBITDA for the half-year was ₹78.66 crore against ₹51.17 crore previously. VST is described as India's leading farm equipment manufacturer, established in 1967, and the largest Indian manufacturer of tillers and 4WD compact tractors.",
            "Sentiment": "positive",
            "PublishDate": 1762567695181,
            "Source": "earnings"
        },
        {
            "Title": "VST Tillers Tractors Provides Revenue and Production Guidance in Conference Call",
            "Summary": "VST Tillers Tractors management discussed their financial targets during a conference call. The company affirmed that achieving their INR 2000 crore revenue target faster than planned is possible if conditions remain stable. For tractor production, management expects to reach 6,400-7,000 units this fiscal year. The management has become hesitant to provide specific revenue projections due to past surprises, but indicated they will continue to grow faster if conditions remain normal.",
            "Sentiment": "positive",
            "PublishDate": 1762486874643,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Tractors Reports Record Revenue Growth in Q2 and H1 Results",
            "Summary": "VST Tillers Tractors Ltd achieved its highest turnover for Q2 at Rs 315 crores compared to Rs 283 crores in the previous year, marking a 26% growth. The company also recorded its highest ever H1 turnover of Rs 598 crores versus Rs 474 crores, representing a 26% increase. Power tiller sales showed strong performance with 43% growth in H1, selling 24,829 units compared to 17,325 units previously. The domestic tractor business grew 10% year-on-year. Power weeder sales increased 42% to 4,970 units against 3,490 units last year. Power reaper sales surged 140% in Q2 and 139% in H1. The company improved cash generation from operations to Rs 62.5 crores against Rs 52.1 crores. Operational EBITDA margin stood at 13.1% for Q2 and 13.2% for H1. PAT excluding fair value adjustments reached Rs 44.9 crores for Q2 and Rs 70 crores for H1. The company received awards including Machinist Super Shop Floor Award 2025 and Gold Award in Kaizen Competition, and signed an MOU with TNAU to promote small farm mechanization.",
            "Sentiment": "positive",
            "PublishDate": 1762434116312,
            "Source": "earnings"
        },
        {
            "Title": "VST Tillers Tractors Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "VST Tillers Tractors reported quarterly revenue of 3.1 billion rupees, up from 2.83 billion rupees year-over-year. However, net profit declined to 254 million rupees from 449 million rupees in the same period last year. EBITDA dropped to 386 million rupees from 584 million rupees year-over-year, with EBITDA margin compressing to 12.26% from 20.6% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762418942951,
            "Source": "earnings"
        },
        {
            "Title": "V.S.T Tillers Reports Mixed October Sales Performance",
            "Summary": "V.S.T Tillers reported October sales figures showing contrasting performance across product segments. Tractor sales declined to 587 units compared to 680 units in the same period last year. Power tillers sales increased significantly to 4,077 units versus 1,783 units in the previous year period.",
            "Sentiment": "neutral",
            "PublishDate": 1761989891134,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Tractors Reports 34.7% Sales Growth in September",
            "Summary": "VST Tillers and Tractors Ltd. reported total sales of 3,480 units in September 2025, marking a 34.7% increase from 2,583 units in the same period last year. Power tillers dominated sales with 3,002 units, while tractors accounted for 480 units. Year-to-date sales grew 37.6% to 27,405 units compared to 19,924 units in the previous year. The company's quarterly results showed strong financial performance with net profit nearly doubling by 96.5% to ₹44.2 crore from ₹22.5 crore. Revenue increased 48.2% to ₹282.5 crore from ₹190.6 crore. EBITDA nearly tripled to ₹37.6 crore from ₹13.4 crore, with margins expanding to 13.3% from 7%.",
            "Sentiment": "positive",
            "PublishDate": 1759309697299,
            "Source": "stock"
        },
        {
            "Title": "V.S.T Tillers Reports 42% Jump in September Sales to 3,002 Units",
            "Summary": "V.S.T Tillers sold 3,002 units in September, marking a significant increase from 2,110 units sold in the same month last year. This represents a year-over-year growth in the company's monthly sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1759298854844,
            "Source": "stock"
        },
        {
            "Title": "V.S.T Tillers Reports Mixed August Sales Performance with Overall Growth",
            "Summary": "V.S.T Tillers reported August sales of 4,100 units, representing an increase from 4,022 units in the same period last year. However, the company also reported another category of August sales at 399 units, up from 394 units in the previous year. The sales figures show year-over-year growth in both reported categories.",
            "Sentiment": "positive",
            "PublishDate": 1756706592017,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Tractors Reports 48% Revenue Growth in Q1 FY26 with Record Power Tiller Sales",
            "Summary": "VST Tillers Tractors achieved revenue of Rs. 282.5 crore in Q1 FY26, marking a 48% year-on-year increase. The company recorded its highest ever Q1 turnover and power tiller sales, with power tiller units growing 92% to 11,701 units and power weeder sales rising 63% to 2,349 units. Operational EBITDA improved significantly to Rs. 37.5 crore (13.3% margin) from Rs. 13.5 crore (7% margin) in the previous year. Profit after tax nearly doubled to Rs. 44.6 crore from Rs. 22.8 crore. The company launched new FENTM series tractors and several SFM products including Ranger 50 and 80 models. VST targets Rs. 3,000 crore revenue by FY30 and expects operational EBITDA to remain in the 11-13% range. The company plans to establish its first European operations base by end of 2025 while expanding in northern India through the OneVST project. Management expressed positive outlook for Q2 FY26 based on July 2025 sales volumes.",
            "Sentiment": "positive",
            "PublishDate": 1755596803601,
            "Source": "earnings"
        },
        {
            "Title": "VST Tillers Tractors Reports Strong Q1 Growth with Revenue Up 47% and Profit Nearly Doubling",
            "Summary": "VST Tillers Tractors delivered robust quarterly performance with revenue rising to 2.8 billion rupees from 1.9 billion rupees year-over-year. The company's EBITDA increased significantly to 613 million rupees compared to 324 million rupees in the previous year, while EBITDA margin expanded to 21.7% from 17%. Net profit nearly doubled to 446 million rupees from 228 million rupees year-over-year, reflecting strong operational efficiency and business growth.",
            "Sentiment": "positive",
            "PublishDate": 1754903714482,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Reports Higher Quarterly Profit and Revenue",
            "Summary": "Afcons Infrastructure reported a net profit of 1.36 billion rupees compared to 1.03 billion rupees in the same period last year. The company's revenue increased to 33.6 billion rupees from 31.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754650073263,
            "Source": "earnings"
        },
        {
            "Title": "VST Tillers Launches New Fuel-Efficient FENTM Tractor Series for Indian Farmers",
            "Summary": "VST Tillers has introduced a new FENTM tractor series that focuses on fuel efficiency and is specifically designed for Indian farmers. The new product line represents the company's effort to address the needs of the domestic agricultural market.",
            "Sentiment": "positive",
            "PublishDate": 1754291874956,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Reports 16.7% Growth in July Sales with 6,471 Units Sold",
            "Summary": "VST Tillers sold 6,471 units in July, representing an increase from 5,543 units sold in the same month last year. This reflects a year-over-year growth in the company's unit sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1754023231524,
            "Source": "stock"
        },
        {
            "Title": "VST Tillers Tractors Discusses GST Reduction on Tractors and Farming Equipment",
            "Summary": "VST Tillers Tractors is engaged in discussions to potentially reduce the Goods and Services Tax (GST) on tractors and farming equipment from the current 12% to 5%. This information was reported by Zee Business.",
            "Sentiment": "positive",
            "PublishDate": 1752652017000,
            "Source": "default"
        },
        {
            "Title": "V.S.T Tillers Reports Mixed June Sales Results",
            "Summary": "V.S.T Tillers reported total sales of 7,149 units in June, up from 3,710 units in the same period last year. Power tiller sales increased significantly to 6,651 units from 3,128 units last year. However, the company's tiller sales decreased to 498 units from 582 units year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1751346010000,
            "Source": "default"
        },
        {
            "Title": "VST Tillers Reports Mixed Sales Performance in May",
            "Summary": "VST Tillers has reported its sales figures for May. Tractor sales decreased to 439 units from 496 units in the same period last year. However, power tiller sales increased significantly to 3,047 units from 1,978 units year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748833370000,
            "Source": "default"
        },
        {
            "Title": "V.S.T Tillers Tractors Expects Stable EBITDA Performance",
            "Summary": "V.S.T Tillers Tractors has announced that its operational EBITDA is anticipated to remain within the range of 11-13%. This projection suggests a consistent financial performance for the company in the near future.",
            "Sentiment": "neutral",
            "PublishDate": 1747200393000,
            "Source": "default"
        },
        {
            "Title": "V.S.T Tillers Tractors Anticipates Strong Growth in Q1 FY26",
            "Summary": "V.S.T Tillers Tractors has expressed optimistic projections for the first quarter of fiscal year 2026, expecting a growth rate of 20-30%. The company also maintains a positive outlook for the entire fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1747200343000,
            "Source": "default"
        },
        {
            "Title": "V.S.T Tillers Tractors Reports Q4 Results and Dividend",
            "Summary": "V.S.T Tillers Tractors has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit decreased to 244 million rupees from 348 million rupees year-over-year. Revenue increased to 3 billion rupees from 2.73 billion rupees. EBITDA declined to 365 million rupees from 398 million rupees, with EBITDA margin decreasing to 12.12% from 14.57%. The company has recommended a dividend of 20 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747148191000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors to Consider Q4 Results on May 13",
            "Summary": "VST Tillers Tractors Limited has announced that it will consider its fourth quarter financial results on May 13. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746186669000,
            "Source": "default"
        },
        {
            "Title": "VST Tillers Reports Strong Sales Growth in April",
            "Summary": "VST Tillers has reported significant year-over-year sales growth for both power tillers and tractors in April. Power tiller sales more than doubled to 2003 units from 923 units last year. Tractor sales also showed robust growth, increasing to 317 units from 208 units in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746144594000,
            "Source": "default"
        },
        {
            "Title": "VST Tillers Reports Significant Sales Growth in April",
            "Summary": "VST Tillers has reported a substantial increase in sales for April. Tractor sales rose to 317 units from 208 units year-over-year, while power tiller sales more than doubled to 2003 units from 923 units in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746100489000,
            "Source": "default"
        },
        {
            "Title": "VST Tillers Reports Decrease in March Total Sales",
            "Summary": "VST Tillers has reported total sales of 671 units for March, compared to 762 units in the same period last year, indicating a year-over-year decrease in sales.",
            "Sentiment": "negative",
            "PublishDate": 1743488004000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Reports Significant Increase in March Sales",
            "Summary": "VST Tillers has reported total sales of 7,221 units for March, compared to 4,061 units in the same period last year. This represents a substantial year-over-year increase in sales for the company's power tillers.",
            "Sentiment": "positive",
            "PublishDate": 1743487991000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors Reports Decline in February Tractor Sales",
            "Summary": "VST Tillers Tractors Limited has reported total tractor sales of 308 units in February, compared to 397 units in the same month last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1740894892000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractor Reports Decline in February Power Tiller Sales",
            "Summary": "VST Tillers Tractor has reported a decrease in power tiller sales for February. The company sold 2,952 units in February, compared to 3,773 units in the same month last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1740894831000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors: Q3 Profit Plummets 92.45% YoY",
            "Summary": "VST Tillers Tractors reported Q3 FY25 results with revenue up 28.91% YoY to ₹219.1 crore, but profit fell 92.45% YoY to ₹1.28 crore. Compared to Q2, revenue declined 22.7% and profit decreased 97.14%. EPS dropped to ₹1.47, down 92.51% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739345801000,
            "Source": "earnings"
        },
        {
            "Title": "V.S.T. Tillers Tractors Reports Decline in Q3 EBITDA and Margin",
            "Summary": "V.S.T. Tillers Tractors has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 85 million rupees from 95 million rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 3.88% from 5.61% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739178765000,
            "Source": "earnings"
        },
        {
            "Title": "V.S.T. Tillers Tractors Reports Significant Decline in Q3 Net Profit",
            "Summary": "V.S.T. Tillers Tractors has reported a substantial decrease in its third-quarter net profit, which fell to 17 million rupees from 170 million rupees in the same period last year. Despite the profit decline, the company's revenue increased to 2.2 billion rupees from 1.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739178710000,
            "Source": "earnings"
        },
        {
            "Title": "VST Tillers Tractors Reports Decrease in January Sales",
            "Summary": "VST Tillers Tractors reported total sales of 311 units in January, compared to 326 units in the same month of the previous year, representing a year-over-year decrease in sales.",
            "Sentiment": "negative",
            "PublishDate": 1738542337000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors Reports Decline in January Sales",
            "Summary": "VST Tillers Tractors Limited reported total sales of 3,105 units in January, compared to 3,820 units in the same month of the previous year, representing a year-over-year decrease in sales volume.",
            "Sentiment": "negative",
            "PublishDate": 1738542334000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors Reports Decline in January Sales",
            "Summary": "VST Tillers Tractors reported total sales of 311 units in January, compared to 326 units in the same month last year, representing a year-over-year decrease in sales.",
            "Sentiment": "negative",
            "PublishDate": 1738516240000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors Reports Decrease in December Sales",
            "Summary": "VST Tillers Tractors reported total sales of 365 units in December, compared to 395 units in the same month of the previous year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1735725305000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors Reports Significant Increase in December Sales",
            "Summary": "VST Tillers Tractors Limited reported total sales of 3,007 units in December, compared to 2,039 units in the same month of the previous year. This represents a year-over-year increase of approximately 47.5% in total unit sales.",
            "Sentiment": "positive",
            "PublishDate": 1735725274000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Tractors: Revenue Target of ₹2,000 Crore by FY26, 20% Growth in FY25",
            "Summary": "VST Tillers Tractors aims to achieve ₹2,000 crore revenue by fiscal year 2026 and targets 20% growth in fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1733662401000,
            "Source": "normal_news"
        },
        {
            "Title": "VST Tillers Reports Increase in November Power Tiller Sales",
            "Summary": "VST Tillers has reported total sales of 1,904 power tiller units in November, compared to 1,801 units in the same month last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1733104178000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers Reports Increased Tractor Sales in November",
            "Summary": "VST Tillers has reported total tractor sales of 347 units in November, compared to 295 units in the same month last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1733104160000,
            "Source": "result"
        },
        {
            "Title": "VST Tillers: Ambitious Plan to Triple Revenue by FY27",
            "Summary": "VST Tillers aims to triple its annual revenue to Rs 3,000 crore by FY27. Strategies include entering the high-horsepower tractor segment with Zetor JV, expanding exports to US and Europe, and launching new models in small farm equipment. The company reported steady Q2 results with 1.8% revenue growth and 22% profit increase, despite industry slowdown.",
            "Sentiment": "positive",
            "PublishDate": 1730794736000,
            "Source": "normal_news"
        }
    ]
}