{
    "Symbol": "VTL",
    "ISIN": "INE825A01020",
    "News": [
        {
            "Title": "Vardhman Textiles Seeks Shareholder Approval for MOA Amendment",
            "Summary": "Vardhman Textiles Limited has issued a postal ballot notice seeking shareholder approval through special resolution to alter the Object Clause of its Memorandum of Association to include captive power generation provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1770661565859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vardhman Textiles clarifies volume surge to BSE",
            "Summary": "Vardhman Textiles responds to BSE inquiry about increased trading volume, confirms no pending price-sensitive information awaiting disclosure under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770009452041,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Textiles Navigates Global Trade Uncertainty",
            "Summary": "Vardhman Textiles management acknowledges limited near-term visibility but remains optimistic about stabilizing global trade conditions, focusing on integrated capabilities and diversified customer base for competitive advantage.",
            "Sentiment": "neutral",
            "PublishDate": 1769049455047,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Textiles Plans to Double Garment Capacity",
            "Summary": "Vardhman Textiles announces ambitious expansion plan to double its garment division capacity through an eight-month project timeline, signaling significant growth in textile operations.",
            "Sentiment": "positive",
            "PublishDate": 1769049425838,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Textiles Plans Major Green Power Expansion",
            "Summary": "Vardhman Textiles announces ambitious plan to increase green power usage from current 9% to 49-50% of total energy demand by FY27, marking significant sustainability push.",
            "Sentiment": "positive",
            "PublishDate": 1769049396776,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Textiles Commissions Fabric Expansion",
            "Summary": "Vardhman Textiles has commissioned fabric expansion at its Budhni facility on the existing cotton-blend line, with operations expected to gain momentum from Q1 next year.",
            "Sentiment": "positive",
            "PublishDate": 1769049366362,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Textiles Eyes 60% Capacity Utilization",
            "Summary": "Vardhman Textiles management expects Performance Fabrics division to start scaling operations in Q1 of next financial year, targeting over 60% capacity utilization for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1769049340830,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Textiles Q3 Net Profit Drops 19% YoY",
            "Summary": "Vardhman Textiles reported consolidated net profit of ₹1.70 billion in Q3, marking a 19.05% decline from ₹2.10 billion in the same quarter last year, reflecting challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1768980170745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vardhman Textiles Completes ₹50.52 Cr Solar Investment",
            "Summary": "Vardhman Textiles has completed its ₹50.52 crore investment in Sone Solar Energy One by subscribing to equity shares and convertible debentures for a 30 MW solar facility in Punjab.",
            "Sentiment": "positive",
            "PublishDate": 1765540715647,
            "Source": "stocks"
        },
        {
            "Title": "Vardhman Textiles Allots 10,000 Equity Shares Under Employee Stock Option Plan 2024",
            "Summary": "Vardhman Textiles Limited allotted 10,000 equity shares of face value Rs. 2 each to eligible employees who exercised stock options under the company's Employee Stock Option Plan 2024. The newly allotted shares will rank equally with existing equity shares in all respects.",
            "Sentiment": "positive",
            "PublishDate": 1764676198727,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Textiles Acquires 19.5% Stake in Solar Energy Company for Punjab Power Plant",
            "Summary": "Vardhman Textiles approved the acquisition of a 19.5% stake in Sone Solar Energy One Private Limited and signed share subscription and power purchase agreements. The partnership involves plans to build a 30 MWac solar power plant in Punjab, marking the textile company's entry into renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1764054223896,
            "Source": "order&deals"
        },
        {
            "Title": "Vardhman Textiles Expects Market Stabilization by Q4 FY26, New Plant to Reach 20-30% Capacity",
            "Summary": "Vardhman Textiles anticipates market stabilization by Q4 FY26, with its new synthetic fabric plant expected to achieve 20-30% capacity utilization in Q4. The company expects possible negative effects in Q3 and Q4 due to their typical focus on exports. Management remains cautiously hopeful about the future, citing positive signs from US trade talks. Cotton crop output is anticipated to be approximately 31 million bales.",
            "Sentiment": "neutral",
            "PublishDate": 1761276107923,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Textiles Reports Q2 FY26 Results with Revenue of Rs 2,480 Crores",
            "Summary": "Vardhman Textiles Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs 2,480.10 crores for the quarter, compared to Rs 2,454.78 crores in the same quarter last year. Net profit after tax stood at Rs 187.76 crores for the quarter versus Rs 196.51 crores in the previous year quarter. For the half-year period, revenue was Rs 4,865.76 crores against Rs 4,811.01 crores in the corresponding period last year, while net profit was Rs 395.44 crores compared to Rs 435.35 crores. The company issued 500 equity shares under its Employee Stock Options Scheme during the quarter. Vardhman noted it is monitoring US tariff developments on textile imports, stating it has limited direct exposure to the US market but serves some US-based brands indirectly.",
            "Sentiment": "neutral",
            "PublishDate": 1761203591829,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Textiles Schedules Board Meeting for October 23, 2025 to Approve Quarterly Results",
            "Summary": "Vardhman Textiles Limited has scheduled a Board of Directors meeting on October 23, 2025, to consider and approve the unaudited financial results for the quarter and half-year ended September 30, 2025. The company has notified BSE Limited and The National Stock Exchange of India about this scheduled meeting through Company Secretary Sanjay Gupta.",
            "Sentiment": "neutral",
            "PublishDate": 1760519442058,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Textiles Announces Retirement of Director Tara Chand Gupta",
            "Summary": "Vardhman Textiles Limited announced the retirement of Mr. Tara Chand Gupta, Director (M.P. Location), from the company's services effective September 30, 2025. He will cease to be a Senior Management Personnel of the company from the close of business hours on that date.",
            "Sentiment": "neutral",
            "PublishDate": 1759239117482,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vardhman Textiles Commences Commercial Production of 18,000 Spindles",
            "Summary": "Vardhman Textiles Limited has started commercial production of approximately 18,000 spindles as part of its expansion and modernization plan for spinning capacity. This development follows the company's earlier capex plan announcement made on January 24, 2024, regarding the expansion-cum-modernization of its spinning operations.",
            "Sentiment": "positive",
            "PublishDate": 1754397327285,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Textiles Reports Stable Q1 FY26 Performance Despite Cotton Cost Pressures and US Trade Uncertainties",
            "Summary": "Vardhman Textiles held its earnings conference call for Q1 FY26, reporting operational performance at par or slightly better than the previous quarter, excluding extraordinary items. The company faces significant challenges as Indian cotton trades at a premium of $0.80-$0.82 per pound during the quarter, rising to $0.85 in July 2025 due to higher MSP. The MSP for the upcoming cotton season increased by nearly 8%, making Indian cotton among the most expensive globally. Cotton Corporation of India (CCI) bought 30% of total cotton produced and increased prices by INR 2,500-3,000 per candy in the past month. Indian mills doubled cotton imports to 35-40 lakh bales compared to typical 15-18 lakh bales annually, but face an 11% import duty disadvantage versus competitors like Bangladesh and Vietnam. New US tariffs on textile imports created market volatility and cautious buyer behavior, leading to delayed orders and inventory adjustments. However, diversified geographic exposure across UK, EU, Japan, South America, Egypt, Australia and domestic markets provided stability. Yarn and fabric sales remained broadly in line with the corresponding quarter last year. The company's fabric expansion is progressing on schedule, expected to contribute meaningfully from Q3 onwards. ReNova mechanical recycling plant expansion began operations in July, and 14,000 spindles capacity for Melange yarn became operational. Management indicated yarn margins around $0.70 for Indian spinners versus international spread of $0.85-$0.90, with fabric margins at 17-18%. Both yarn and fabric divisions operated at full capacity utilization during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753706479342,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Textiles Reports Mixed Production Performance Across Product Lines",
            "Summary": "Vardhman Textiles Limited disclosed production and sales figures for yarn, grey fabric, and processed fabric for the quarter ended June 30, 2025. Yarn production increased to 68,639 metric tons from 67,694 metric tons in the previous quarter and 66,881 metric tons in the same quarter last year. However, yarn sales declined to 65,329 metric tons from 68,684 metric tons in the previous quarter, though they rose from 62,969 metric tons year-over-year. Grey fabric production decreased to 496 lac meters from 515 lac meters in the previous quarter and 524 lac meters in the corresponding quarter last year. Grey fabric sales remained relatively stable at 497 lac meters. Processed fabric production fell to 410 lac meters from 421 lac meters in the previous quarter and 422 lac meters year-over-year, while sales increased to 418 lac meters from 415 lac meters in the previous quarter and 407 lac meters in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753169193651,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Textiles Commences Commercial Production of 17,000 Spindles in Capacity Expansion",
            "Summary": "Vardhman Textiles Limited has started commercial production of approximately 17,000 spindles as part of its previously announced capacity expansion plan in the spinning division. This development follows the company's earlier capex plan announcement made in May 2024, which included expansion of spinning capacity.",
            "Sentiment": "positive",
            "PublishDate": 1753167720719,
            "Source": "stock"
        },
        {
            "Title": "Vardhman Textiles Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Vardhman Textiles reported quarterly revenue of 23.9 billion rupees, up from 23.1 billion rupees in the same period last year. However, consolidated net profit declined to 2.1 billion rupees from 2.4 billion rupees year-over-year. EBITDA decreased to 3.38 billion rupees from 3.61 billion rupees, while EBITDA margin compressed to 14.16% from 15.63% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753166931997,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Textiles Invests 166.7 Million Rupees in Renew Green",
            "Summary": "Vardhman Textiles has invested 166.7 million rupees in Renew Green, a move aimed at sustainable growth. This investment suggests the company is focusing on environmentally friendly initiatives, potentially in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1750767712000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Textiles Amends Power Purchase Agreement",
            "Summary": "Vardhman Textiles has executed an amended Power Purchase Agreement. The company has changed the location of its wind-solar hybrid plant within Madhya Pradesh.",
            "Sentiment": "neutral",
            "PublishDate": 1747136707000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Textiles Reports Q4 FY23 Financial Results",
            "Summary": "Vardhman Textiles Ltd. announced its Q4 consolidated financial results. The company reported a net profit of 2.3 billion rupees, up from 2 billion rupees year-over-year and 2.1 billion rupees quarter-over-quarter. Revenue for Q4 stood at 25 billion rupees, compared to 24.59 billion rupees in the same quarter last year and 24.65 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746403479000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Textiles to Consider Q4 Results on May 3",
            "Summary": "Vardhman Textiles has announced that it will consider its fourth quarter financial results on May 3. This is a routine corporate announcement regarding the company's upcoming earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1745841829000,
            "Source": "default"
        },
        {
            "Title": "Vardhman Textiles Reports Improved Q3 EBITDA and Margin",
            "Summary": "Vardhman Textiles has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 3.25 billion rupees from 2.55 billion rupees in the same quarter last year. Additionally, the EBITDA margin rose to 13.18% from 10.99% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737528469000,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Textiles Reports Q3 Revenue Increase",
            "Summary": "Vardhman Textiles has reported a revenue of 24.6 billion rupees for the third quarter, compared to 23.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737528397000,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Textiles Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Vardhman Textiles has announced its Q3 consolidated net profit, which stands at 2.1 billion rupees, compared to 1.6 billion rupees in the same period last year. This represents a significant year-over-year increase in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1737528358000,
            "Source": "earnings"
        },
        {
            "Title": "Vardhman Textiles Approves Capacity Expansion at Budhni Facility",
            "Summary": "Vardhman Textiles has approved an increase in processed fabric capacity at its Vardhman Fabrics unit in Budhni, Madhya Pradesh. The expansion will add approximately 31 million meters per annum to the facility's capacity. The company plans to invest around Rs. 350 crore for this expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1732772281000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Textiles Focuses on Recycling and Manmade Fabrics for Growth",
            "Summary": "Vardhman Textiles is expanding into recycling as a growth area, with their recycled products gaining acceptance among reputable brands. The company is also implementing a project for 100% manmade fabrics, which they believe has the potential to improve margins as they gain more experience and knowledge in this product area.",
            "Sentiment": "positive",
            "PublishDate": 1730777021000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhman Textiles Projects Strong PBDIT to Sales Ratio",
            "Summary": "During a conference call, Vardhman Textiles announced that it is projecting a PBDIT (Profit Before Depreciation, Interest, and Tax) to sales ratio in the range of 25% to 30%. This projection indicates the company's expectation of strong profitability relative to its sales revenue.",
            "Sentiment": "positive",
            "PublishDate": 1730777013000,
            "Source": "result"
        },
        {
            "Title": "Vardhman Textiles Reports Strong Q2 Financial Performance",
            "Summary": "Vardhman Textiles has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 3.57 billion rupees from 2.14 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 14.27% from 8.93% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1730269442000,
            "Source": "result"
        },
        {
            "Title": "Vardhman Textiles Reports Q2 Revenue Growth",
            "Summary": "Vardhman Textiles has announced its second quarter revenue, which increased to 25 billion rupees from 24 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730269331000,
            "Source": "result"
        },
        {
            "Title": "Vardhman Textiles Reports Q2 Profit Increase",
            "Summary": "Vardhman Textiles has announced its Q2 consolidated net profit, which has risen to 1.97 billion rupees from 1.3 billion rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730269310000,
            "Source": "result"
        }
    ]
}