{
    "Symbol": "WAAREEINDO",
    "ISIN": "INE866K01023",
    "News": [
        {
            "Title": "Indosolar Independent Director Resigns",
            "Summary": "Indosolar Limited announces resignation of Independent Director Mr. Shiv Kumar Agarwal effective January 28, 2026, citing other commitments and personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1769676478131,
            "Source": "stocks"
        },
        {
            "Title": "Indosolar Seeks Shareholder Approval for Director Appointment",
            "Summary": "Indosolar Limited has issued a postal ballot notice seeking member approval for the appointment of Dr. Jignesh Devchandbhai Rathod as Non-Executive Director and shifting of registered office from Delhi to Maharashtra. E-voting period runs from January 22 to February 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768998367790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indosolar Q3FY26: EBITDA Surges 202% to ₹71 Cr",
            "Summary": "Indosolar Limited reports Q3FY26 EBITDA of ₹71 crores vs ₹23.5 crores YoY, with EBITDA margin expanding to 35.59% from 22.77%. Revenue grew 92.7% to ₹199.53 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768569461885,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indosolar Limited Files Application to Reclassify Five Shareholders from Promoter to Public Category",
            "Summary": "Indosolar Limited has filed an application with BSE Limited and National Stock Exchange to reclassify five shareholders from the Promoter and Promoter Group category to the Public category. The shareholders include Hulas Rahul Gupta, Bhushan Kumar Gupta, Priyadesh Gupta, Abha Gupta, and Greenlite Lighting Corporation. The application was submitted on June 7, 2025, following an order from the National Company Law Tribunal dated April 21, 2022. The reclassification arises from an approved resolution plan under the NCLT order.",
            "Sentiment": "neutral",
            "PublishDate": 1762806171350,
            "Source": "corporate_governance"
        }
    ]
}