{
    "Symbol": "WAAREERTL",
    "ISIN": "INE299N01021",
    "News": [
        {
            "Title": "Waaree Renewable Tech Gets Rating Watch Alert",
            "Summary": "India Ratings places Waaree Renewable Technologies' INR 258.00 million bank loan facilities on Rating Watch with Developing Implications, maintaining IND A rating amid ongoing assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1770397701908,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Renewable Acquires 55% Stake in ASPL for ₹1,225 Cr",
            "Summary": "Waaree Renewable Technologies announces acquisition of ~55% stake in Associated Power Structures Limited for INR ~1,225 crores through mix of primary & secondary transactions.",
            "Sentiment": "positive",
            "PublishDate": 1769418168766,
            "Source": "co_actions_results"
        },
        {
            "Title": "5 Small-Cap Stocks Report 100%+ Net Profit Growth in Q3 FY26",
            "Summary": "Waaree Renewable Technologies, Ravindra Energy, and three other small-cap companies delivered impressive Q3 FY26 results with net profits surging over 100%, led by Ravindra Energy's 650% YoY growth.",
            "Sentiment": "positive",
            "PublishDate": 1769055556478,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Wins ₹37.96 Cr Solar EPC Contract",
            "Summary": "Waaree Renewable Technologies secured a ₹37.96 crore EPC contract for developing a 10 MWac/14 MWp ground mount solar plant in Uttar Pradesh, scheduled for completion in FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1768828617518,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Pursues 29 GW Pipeline & 120 MW IPP",
            "Summary": "Waaree Renewable Technologies is pursuing a massive 29 gigawatt order pipeline with 5-6 gigawatts in active tenders, while planning 120 megawatt IPP projects for next financial year at INR 3.0-3.5 crore per megawatt.",
            "Sentiment": "positive",
            "PublishDate": 1768797725992,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Renewable Technologies Q3FY26 Earnings Call",
            "Summary": "Waaree Renewable Technologies Limited releases audio recording of Q3FY26 earnings call held on January 16, 2026, discussing financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768562091361,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Q3 Results: Net profit jumps 2x",
            "Summary": "Waaree Renewable Technologies reports 136.18% revenue growth to ₹851.06 crores in Q3 FY26, with PAT rising 124.74% to ₹120.19 crores. Company maintains strong order book of 2.92 GWp.",
            "Sentiment": "positive",
            "PublishDate": 1768405121270,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Technologies Q3FY26 Results",
            "Summary": "Waaree Renewable Technologies reports highest ever quarterly revenue of ₹851.06 crores in Q3FY26, up 136.18% YoY, with PAT growing 124.74% to ₹120.19 crores. Strong orderbook of 2.92 GWp.",
            "Sentiment": "positive",
            "PublishDate": 1768404296207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Q3FY26 Net Profit Jumps 124.7%",
            "Summary": "Waaree Renewable Technologies reports consolidated net profit of ₹120.19 crores for Q3FY26, up 124.7% YoY. Revenue grows 136.2% to ₹851.06 crores. Board approves 80 MW solar power park project.",
            "Sentiment": "positive",
            "PublishDate": 1768404192377,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Q3FY26 Net Profit Surges 124.7%",
            "Summary": "Waaree Renewable Technologies reports consolidated net profit of ₹120.19 cr in Q3FY26, up 124.7% YoY. Revenue jumps 136.2% to ₹851.06 cr. Board approves 80 MW solar park project.",
            "Sentiment": "positive",
            "PublishDate": 1768403900558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Technologies Gets Credit Upgrade",
            "Summary": "India Ratings upgrades Waaree Renewable Technologies' bank loan facilities to IND A/Stable from IND A-/Stable, with facility amount reduced to ₹258 crores from ₹289.40 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767955190298,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Renewable Solar Order Cut by ₹212 Crore",
            "Summary": "Waaree Renewable Technologies receives revised Letter of Award with contract value reduced from ₹1,252.43 crore to ₹1,039.60 crore for 704 MWac solar project due to evacuation constraints.",
            "Sentiment": "negative",
            "PublishDate": 1767939852109,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Renewable gets revised LoA; order value drops ₹212.8 cr",
            "Summary": "Waaree Renewable Technologies receives revised letter of award for 704 MWac solar project with contract value reduced from ₹1,252.43 crore to ₹1,039.60 crore due to evacuation considerations and DC overloading optimization.",
            "Sentiment": "neutral",
            "PublishDate": 1767935118148,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Revises Major Solar Project Capacity",
            "Summary": "Waaree Renewable Technologies receives revised letter of award reducing project capacity to 704 MWac/1,000 MWp with contract value reduced by ₹212.83 crores to ₹1,039.60 crores due to evacuation considerations.",
            "Sentiment": "neutral",
            "PublishDate": 1767170223771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Gets 17% Capacity Boost in Solar Project",
            "Summary": "Waaree Renewable Technologies receives formal contract enhancement from 30 MWp to 35 MWp for solar project, increasing order value to ₹102.93 crores with completion targeted for FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1767074812008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Allots 99,223 ESOP Shares",
            "Summary": "Waaree Renewable Technologies allots 99,223 equity shares under ESOP 2022 to eligible employee, raising ₹22.23 lakhs and increasing paid-up share capital to ₹20.87 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766574580103,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Renewable Gets GST Assessment Order",
            "Summary": "Waaree Renewable Technologies receives GST assessment order of ₹1.24 lakh from Maharashtra tax authorities for FY22. Company to file appeal against the order related to input tax credit reversal.",
            "Sentiment": "negative",
            "PublishDate": 1766495428819,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Renewable Technologies Shareholders Approve Employee Stock Option Plan Amendment",
            "Summary": "Waaree Renewable Technologies Limited shareholders approved the amendment to the company's Employee Stock Option Plan 2022 through postal ballot voting conducted from October 16 to November 14, 2025. The special resolution passed with 99.85% votes in favor, with 79,874,512 votes supporting the amendment and only 123,346 votes against it.",
            "Sentiment": "positive",
            "PublishDate": 1763198482733,
            "Source": "corporate_action"
        },
        {
            "Title": "Waaree Renewable Tech Secures ₹27.22 Cr Scope Expansion, Total Project Value Reaches ₹1,017.82 Cr",
            "Summary": "Waaree Renewable Tech has secured a scope expansion worth ₹27.22 crore for a 980 MWp / 700 MWac solar EPC project. Following this expansion, the total order value for the project has increased to ₹1,017.82 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762774296412,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Renewable Technologies Reports Record Q2 Results with 47.73% Revenue Growth",
            "Summary": "Waaree Renewable Technologies Limited reported its highest ever quarterly revenue and profit for Q2 FY 2026. Revenue from operations reached Rs. 774.78 crores, up 47.73% year-on-year, while EBITDA grew 120.69% to Rs. 157.94 crores with margins expanding to 20.39% from 13.65% in the previous year. PAT increased 117.40% to Rs. 116.34 crores. For the first half of FY 2026, total revenue grew 81.12% to Rs. 1,377.97 crores, with EBITDA rising 144.56% to Rs. 275.48 crores and PAT up 148.21% to Rs. 202.73 crores. The company maintains an unexecuted order book of 3.48 GWp, providing visibility for upcoming quarters. During H1, the company executed 1,621 MWp of EPC projects, exceeding its full-year execution for FY 2025. Management expects margins to remain above 15% for the financial year and indicated the current order book is expected to be executed over the next 12-15 months. The company operates three revenue streams: EPC, O&M, and IPP, with the board approving additional IPP projects of 14 MWp in Maharashtra and 37 MWp in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1760770500213,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Renewable Technologies Secures ₹156.66 Crore Solar EPC Contract",
            "Summary": "Waaree Renewable Technologies Limited received a Letter of Award for executing Engineering, Procurement and Construction (EPC) works for a 150 MWac/217.5 MWp Ground Mount Solar Power Project. The contract, valued at approximately ₹156.66 crore (excluding taxes), was awarded by a leading renewable energy company. The project is scheduled for completion in financial year 2026-27. This is a commercial order from a domestic entity, with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1760516237259,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Renewable Shares Drop 10.5% Despite Record Quarterly Results",
            "Summary": "Waaree Renewable Technologies shares fell 10.5% over two days to Rs 1,182.90 from Rs 1,325.90 due to profit booking by investors. The decline occurred despite the solar energy company reporting record quarterly performance with consolidated net profit more than doubling to Rs 116.34 crore compared to Rs 53.51 crore in the same period last year. Revenue jumped 47.73% to Rs 2,774.78 crore, driven by strong project execution and renewable energy demand. The company expanded into Battery Energy Storage Systems and data centres. Waaree maintains an unexecuted order book of 3.48 GWp expected to be fulfilled over 12-15 months. The board approved capital expenditure for solar projects in Maharashtra and Rajasthan. Market capitalisation stands at Rs 12,331.33 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1760508904251,
            "Source": "stock"
        },
        {
            "Title": "Waaree Renewable Technologies Seeks Shareholder Approval to Extend ESOP Vesting Period to 10 Years",
            "Summary": "Waaree Renewable Technologies Limited has issued a postal ballot notice seeking shareholder approval to amend its Employee Stock Option Plan 2022. The company proposes to extend the maximum vesting period for stock options from 4 years to 10 years from the date of grant. The amendment maintains the minimum vesting period at 1 year. The Board approved this change on October 10, 2025, following a recommendation from the Nomination and Remuneration Committee. The company states this change aims to foster long-term employee association and will apply to future option grants. Remote e-voting will be conducted from October 16, 2025, to November 14, 2025, with the cut-off date for eligible shareholders set as October 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760431133755,
            "Source": "corporate_action"
        },
        {
            "Title": "Waaree Renewable Technologies Shares Jump 10% as Quarterly Profit More Than Doubles",
            "Summary": "Waaree Renewable Technologies shares surged 10% to Rs 1,244 per share after reporting strong quarterly results. The solar energy company's consolidated net profit more than doubled to Rs 116.34 crore from Rs 53.51 crore in the same period last year. Revenue jumped to Rs 2,774.78 crore compared with Rs 524.47 crore, reflecting 47.73% year-on-year growth. The company achieved its highest-ever quarterly revenue and profit, driven by robust execution and strong sectoral tailwinds. Waaree Renewable has an unexecuted order book of 3.48 GWp expected to be completed over 12-15 months, with a bidding pipeline of 27+ GWp. The board approved capital expenditure for new solar power plants in Maharashtra and Rajasthan. The stock trades near its 52-week high of Rs 1,272 and is positioned above all key moving averages, indicating bullish momentum.",
            "Sentiment": "positive",
            "PublishDate": 1760328770024,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Renewable Tech to Build 107.1 MWP Power Plant, Maintains 769 MWP O&M Portfolio",
            "Summary": "Waaree Renewable Tech will construct a 107.1 MWP independent power plant. The company currently operates a 769 MWP operations and maintenance portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1760168865506,
            "Source": "stock"
        },
        {
            "Title": "Waree Renewable Tech Reports 3.48 GWP Unexecuted Solar EPC Orders",
            "Summary": "Waree Renewable Tech's CFO highlighted the company's 3.48 GWP unexecuted solar EPC orders. The company is positioning for large-scale energy projects and developing substations and transmission lines for solar initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760166912564,
            "Source": "stock"
        },
        {
            "Title": "Waaree Renewable Technologies Reports Strong Q2 Results, Approves Solar Plant Capex Budgets",
            "Summary": "Waaree Renewable Technologies Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of Rs 77,477.92 lakhs for the quarter, up from Rs 52,446.59 lakhs in the same period last year. Net profit for the quarter stood at Rs 11,634.46 lakhs compared to Rs 5,351.54 lakhs in the previous year. For the six-month period, revenue reached Rs 1,37,796.50 lakhs with net profit of Rs 20,273.40 lakhs. The Board also approved capital expenditure budgets for three solar plant projects: two 14 MWp/10 MWac IPP solar plants in Maharashtra and one 37.5 MWp/25 MWac IPP solar plant in Rajasthan. Additionally, the company approved a postal ballot notice for amending the Employee Stock Option Plan 2022. Basic earnings per share for the quarter was Rs 11.16 compared to Rs 5.14 in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1760105427920,
            "Source": "earnings"
        },
        {
            "Title": "WAAREERTL Secures INR 1,252 Crore Solar Power Project Contract",
            "Summary": "Waaree Renewable Technologies Limited (WAAREERTL) received a Letter of Award for executing EPC works for an 870 MWac/1218 MWp grid-connected ground mount solar power project. The contract, valued at approximately INR 1,252.43 crores excluding taxes, includes construction of a 33kV/400kV substation, transmission line works, and two years of operation and maintenance services. The project is scheduled for completion in financial year 2026-27. The contract was awarded by Waaree Forever Energies Private Limited (WFEPL), which is a subsidiary of the holding company, making this a related party transaction. WAAREERTL is a subsidiary of Waaree Energies Limited.",
            "Sentiment": "positive",
            "PublishDate": 1757401574765,
            "Source": "order&deals"
        },
        {
            "Title": "India Considers GST Relief for Solar and Wind Sectors, May Extend Grid Fee Waiver",
            "Summary": "India is considering providing GST relief for the solar and wind energy sectors. The government is also exploring the possibility of extending the grid fee waiver for these renewable energy segments.",
            "Sentiment": "positive",
            "PublishDate": 1756370536476,
            "Source": "sectoral"
        },
        {
            "Title": "Waaree Renewable Technologies Appoints Three New Whole Time Directors and Sets AGM Date",
            "Summary": "Waaree Renewable Technologies Limited's Board of Directors approved the appointment of three new Whole Time Directors - Mr. Viren Doshi, Mr. Hitesh Mehta, and Mr. Sunil Rathi - each for a term of 5 years effective August 26, 2025. The board also approved the annual report for Financial Year 2024-25 and scheduled the 26th Annual General Meeting for September 23, 2025. Additionally, the company appointed M/s Makarand M. Joshi & Co. as Secretarial Auditor for five consecutive financial years from 2025-26 to 2029-30, subject to shareholder approval. Mr. Kamlesh Harchandani was appointed as CEO Data Centre under Senior Management Personnel category effective September 1, 2025. The share transfer books will remain closed from September 17-23, 2025 for the AGM. Mr. Viren Doshi is related to Mr. Pujan Doshi, Managing Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1756201874258,
            "Source": "corporate_governance"
        },
        {
            "Title": "Waaree Renewable Technologies Delays Smart Joules Acquisition Completion to August 30, 2025",
            "Summary": "Waaree Renewable Technologies Limited has executed definitive agreements for acquiring Smart Joules Private Limited through a Share Subscription Agreement and Share Purchase Agreement. The acquisition involves purchasing equity shares from existing shareholders and subscribing to compulsory convertible preference shares. The completion timeline has been extended from July 31, 2025 to August 30, 2025 due to procedural requirements for the transfer and allotment of securities. A Deed of Adherence will be executed upon completion of the acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1753966938495,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Renewable Tech Receives Expanded Scope for Solar Project, Order Value Rises by Rs 296.5 Million",
            "Summary": "Waaree Renewable Tech has received an updated scope for its 2012.47 MWP solar project. The expanded scope has resulted in an increase in the order value by Rs 296.5 million.",
            "Sentiment": "positive",
            "PublishDate": 1753878133407,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Renewable Technologies Reports Strong Q1 FY26 Results with 155% Revenue Growth",
            "Summary": "Waaree Renewable Technologies Limited reported robust quarterly results with revenue of INR 603.19 crores, marking 155.20% year-on-year growth. EBITDA increased 186.14% to INR 117.54 crores, while PAT surged 206.77% to INR 86.39 crores. The company executed 699 MWp of EPC projects during the quarter and maintains an unexecuted order book of 3.15 GWp. Management expects to maintain EBITDA margins in the 14-16% range and is pursuing a 25 GW order pipeline. The company is expanding into battery energy storage systems (BESS) with 40 MWh worth of orders in the current order book, and exploring opportunities in green hydrogen and data center EPC projects. India's renewable energy capacity reached 234 GW as of June 2025, with solar contributing 116.25 GW, supporting the company's growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1753366871513,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Renewable Technologies Shares Drop 6% on US Solar Panel Tariff Petition",
            "Summary": "Waaree Renewable Technologies shares fell 6.2% to Rs 1,112.35 following reports that US solar panel manufacturers petitioned the Commerce Department to impose tariffs on imports from India, Indonesia, and Laos. The Alliance for American Solar Manufacturing and Trade accused manufacturers in these countries of dumping products below cost and receiving unfair government subsidies. The petition targets Chinese-owned firms shifting production and Indian manufacturers directly. Imports from the three countries rose to $1.6 billion in 2024 from $289 million in 2022. The Commerce Department has 20 days to decide on launching a formal investigation. Despite the stock decline, Waaree reported strong quarterly results with net profit jumping 205% to Rs 86.44 crore and revenue more than doubling to Rs 603.18 crore. The company's shares remain down 20.3% year-to-date despite recent monthly gains.",
            "Sentiment": "negative",
            "PublishDate": 1753079292486,
            "Source": "stock"
        },
        {
            "Title": "Waaree Renewable Tech Cancels 125 MWAC Solar Project EPC Order",
            "Summary": "Waaree Renewable Tech has announced the cancellation of a 125 MWAC solar project EPC (Engineering, Procurement, and Construction) order. The company made this announcement regarding the termination of the solar project contract.",
            "Sentiment": "negative",
            "PublishDate": 1753012560757,
            "Source": "stock"
        },
        {
            "Title": "Waaree Renewable Technologies: Q1 Profit Triples, Stock Surges",
            "Summary": "Waaree Renewable Technologies reported a 205% increase in Q1 FY2026 net profit to Rs 86.44 crore. Revenue jumped 155% YoY to Rs 603.18 crore. The stock rallied 4.7% to Rs 1,239.50 on BSE following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752818984000,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Renewable Technologies: Q1 Profit Soars 205%, Revenue Doubles",
            "Summary": "Waaree Renewable Technologies reported a net profit of Rs 86.44 crore for Q1 FY2026, up 205% YoY. Revenue from operations surged 155% YoY to Rs 603.18 crore. Total expenses rose 146% to Rs 491.44 crore. The company's stock fell 0.8% after the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752747087000,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Renewable Tech Reports 3.15 GWp Unexecuted Order Book",
            "Summary": "Waaree Renewable Tech has announced an unexecuted order book of 3.15 GWp. The company expects to complete these orders within the next 12 to 15 months.",
            "Sentiment": "positive",
            "PublishDate": 1752745803000,
            "Source": "default"
        },
        {
            "Title": "Waaree Renewable Tech Partners with SJPL for Clean Energy Growth",
            "Summary": "Waaree Renewable Tech has formed a partnership with SJPL to enhance their clean energy capabilities and expand their presence in the industry. The collaboration aims to promote renewable energy solutions, though specific details about the partnership or its objectives are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752742240000,
            "Source": "default"
        },
        {
            "Title": "Waaree Renewable Tech Reports Significant Q1 EBITDA Growth",
            "Summary": "Waaree Renewable Tech has reported its Q1 financial results. The company's EBITDA increased to 1.18 billion rupees, up from 411 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 19.49% from 17.38% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752742061000,
            "Source": "result"
        },
        {
            "Title": "Waaree Renewable Tech Reports Strong Q1 Financial Growth",
            "Summary": "Waaree Renewable Tech has reported significant year-over-year growth in its quarterly financial results. The company's revenue increased to 6 billion rupees from 2.4 billion rupees in the same quarter last year. Additionally, the consolidated net profit rose to 864 million rupees from 283 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752742014000,
            "Source": "result"
        },
        {
            "Title": "Waaree Renewable Technologies: Stock Surges 30% Ahead of Q1 Results",
            "Summary": "Waaree Renewable Technologies shares have rallied 29.8% in three days, reaching Rs 1,265.80. The surge comes ahead of the company's Q1FY26 results announcement scheduled for today. The stock has gained 23% in July, recovering from previous losses. Investors are anticipating strong performance following the company's 83% YoY profit growth in Q4FY25.",
            "Sentiment": "positive",
            "PublishDate": 1752730151000,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Renewable Technologies: Stock Surges on Record Volumes Ahead of Q1 Results",
            "Summary": "Waaree Renewable Technologies' stock has gained for the third consecutive session with unprecedented trading volumes. The company clarified there's no undisclosed price-sensitive information driving the surge. The stock reached a 52-week high ahead of Q1 results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752727564000,
            "Source": "normal_news"
        },
        {
            "Title": "Waaree Renewable Technologies: Shares Surge 10% Before Q1 Earnings",
            "Summary": "Waaree Renewable Technologies shares rose over 10% ahead of Q1 FY26 results announcement on July 17. The company will hold a board meeting to approve unaudited financial results and host an investor call on July 18.",
            "Sentiment": "positive",
            "PublishDate": 1752642491000,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Renewable Technologies: Stock Surges 17% Amid Fresh Breakout",
            "Summary": "Waaree Renewable Technologies' stock rose over 17% in a single session, signaling a potential fresh breakout after a year-long consolidation. The company reported an 83% YoY increase in Q4FY25 net profit to Rs 93.76 crore and a 74% surge in revenue to Rs 476 crore. Recent EPC contract wins totaling over Rs 800 crore strengthen the company's execution pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1752641865000,
            "Source": "normal_news"
        },
        {
            "Title": "Waaree Renewable Technologies: Q1FY26 Results Date Announced, Trading Window Closure in Effect",
            "Summary": "Waaree Renewable Technologies to announce Q1FY26 results on July 17, 2025. Board meeting scheduled to approve unaudited financial results. Earnings call set for July 18. Trading window closed from July 1 until 48 hours after results declaration. Stock price up 25.16% in last five sessions.",
            "Sentiment": "neutral",
            "PublishDate": 1752640180000,
            "Source": "corporate_action"
        },
        {
            "Title": "Waaree Renewable Technologies: Stock Surges 15% Ahead of Q1 Results",
            "Summary": "Waaree Renewable Technologies shares jumped 15% to Rs 1,120 intraday on BSE. The company's board will meet on July 17, 2025, to approve Q1 FY2026 results. Trading volume was high with 25 lakh shares worth Rs 270 crore changing hands.",
            "Sentiment": "positive",
            "PublishDate": 1752563863000,
            "Source": "corporate_action"
        },
        {
            "Title": "Waaree Renewable Secures EPC Contract for Solar Power Project",
            "Summary": "Waaree Renewable has received a Letter of Award (LoA) for executing an Engineering, Procurement, and Construction (EPC) contract. The project involves a 21 MW AC / 29.4 MW DC ground-mounted solar power project under the Mukhyamantri Saur Krushi Vahini Yojana 2.0 (MSKVY 2.0) scheme. The contract is valued at 26.17 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751506333000,
            "Source": "default"
        },
        {
            "Title": "Waaree Renewable Secures 21 MW Solar Project Contract",
            "Summary": "Waaree Renewable has received approval for an EPC (Engineering, Procurement, and Construction) contract for a 21 MW AC / 29.4 MW DC solar project. The project is part of the Mukhyamantri Saur Krushi Vahini Yojana 2.0 scheme and is valued at 26.17 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751465427000,
            "Source": "default"
        },
        {
            "Title": "Waaree Renewable Signs Non-Binding Agreement for 100 MW EPC Project",
            "Summary": "Waaree Renewable has entered into a non-binding agreement with an unnamed international company for the development of a 100 MW EPC (Engineering, Procurement, and Construction) project. The agreement is focused on renewable energy, as indicated by the company's name and the nature of the project.",
            "Sentiment": "positive",
            "PublishDate": 1750656753000,
            "Source": "default"
        }
    ]
}