{
    "Symbol": "WAAREEENER",
    "ISIN": "INE377N01017",
    "News": [
        {
            "Title": "Waaree Energies Secures 150MW Solar Module Order",
            "Summary": "Waaree Energies receives significant order for 150MW solar modules from Waaree Solar Americas, strengthening its position in the North American solar market.",
            "Sentiment": "positive",
            "PublishDate": 1770212195180,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Reports Record Q3 FY26 Results",
            "Summary": "Waaree Energies delivered exceptional Q3 FY26 performance with revenue growth of 118.81% YoY to Rs. 7,565.05 crores and EBITDA surge of 167.16% YoY to Rs. 1,928.15 crores, backed by record module production.",
            "Sentiment": "positive",
            "PublishDate": 1769686185363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Forms New IPP Subsidiary",
            "Summary": "Waaree Energies announces incorporation of step-down subsidiary Decarbon X Projects Private Limited through its wholly-owned subsidiary for Independent Power Producer operations.",
            "Sentiment": "positive",
            "PublishDate": 1769167337708,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Plans 20 GW Battery Manufacturing Plant",
            "Summary": "Waaree Energies announces ambitious 20 GW battery manufacturing facility in phases from FY27, backed by ₹1,000 crore equity raise and ₹25,000 crore capex plan over 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1769096565487,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Reports Insider Trading Violation",
            "Summary": "Waaree Energies reports Code of Conduct violation by designated person Ruchit Jain involving unauthorized share trades worth ₹6.43 lakh in November 2025, resulting in ₹1,400.00 profit disgorgement to SEBI.",
            "Sentiment": "negative",
            "PublishDate": 1769011791376,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Targets EBITDA Goals Achievement",
            "Summary": "Waaree Energies has outlined its commitment to achieving its established EBITDA targets, signaling the company's focus on maintaining profitability metrics in line with strategic objectives.",
            "Sentiment": "positive",
            "PublishDate": 1769009323624,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Acknowledges ₹2.95 Billion US Customs Liabilities",
            "Summary": "Waaree Energies has acknowledged ₹2.95 billion in liabilities related to a US Customs investigation from the previous year, marking a significant financial disclosure for the solar energy company.",
            "Sentiment": "negative",
            "PublishDate": 1769008380080,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Q3 Net Profit Surges 116% YoY",
            "Summary": "Waaree Energies reports exceptional Q3 performance with consolidated net profit jumping to ₹10.60 billion from ₹4.90 billion year-on-year, while revenue more than doubles to ₹75.65 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769008332734,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Q3 FY26 Results Call on Jan 22",
            "Summary": "Waaree Energies has scheduled a conference call for January 22, 2026, to discuss Q3 and nine-month FY26 financial results with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768834005139,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Secures Major Solar Module Orders",
            "Summary": "Waaree Energies Limited received significant orders for 210 MW DCR solar modules for India and 2000 MW solar modules for the USA, strengthening its position in domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1768829532212,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Secures Major Solar Module Orders",
            "Summary": "Waaree Energies receives significant orders totaling 2,210 MW for solar modules, including 210 MW DCR solar modules and 2,000 MW solar modules, strengthening its position in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1768829370104,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Forms 8 New IPP Subsidiaries",
            "Summary": "Waaree Energies announces incorporation of eight step-down subsidiaries through its wholly-owned subsidiary Waaree Forever Energies Private Limited for Independent Power Producer projects.",
            "Sentiment": "positive",
            "PublishDate": 1768557535130,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Forms Eight New Subsidiaries",
            "Summary": "Waaree Energies Limited establishes eight new subsidiaries under Waaree Forever Energies Private Limited, all registered in India but operations yet to commence.",
            "Sentiment": "positive",
            "PublishDate": 1768557474159,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Surges on China Solar Export Policy",
            "Summary": "Waaree Energies shares jumped over 5% after China announced gradual cuts to solar export tax rebates from April 2026, potentially benefiting Indian solar manufacturers through reduced Chinese competition.",
            "Sentiment": "positive",
            "PublishDate": 1768200893295,
            "Source": "stocks"
        },
        {
            "Title": "Waaree, Premier Energies rally on China solar policy",
            "Summary": "Waaree Energies and Premier Energies shares surged up to 5% on January 12 after China announced plans to cancel or reduce tax rebates on solar exports, potentially easing pricing pressure.",
            "Sentiment": "positive",
            "PublishDate": 1768197764014,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Bags 105 MW Solar Module Order",
            "Summary": "Waaree Energies secures 105 MW solar module order from reputed customer, adding to its ₹47,000 crore order book. Q2 FY26 revenue surged 70% YoY to ₹6,066 crores with net profit jumping to ₹878 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767959443790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Secures 105 MW Solar Module Order",
            "Summary": "Waaree Energies Ltd has received an order to supply 105 MW solar modules to a domestic client, with project completion scheduled for FY 2025-26, strengthening its order book.",
            "Sentiment": "positive",
            "PublishDate": 1767945094022,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Secures 105 MW Solar Module Order",
            "Summary": "Waaree Energies Limited received order worth 105 MW solar modules from domestic renewable power company for supply in FY2025-26. One-time contract from established Indian renewable energy developer.",
            "Sentiment": "positive",
            "PublishDate": 1767944923305,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Shares Drop 15% Despite ₹1,003 Cr Raise",
            "Summary": "Waaree Energies shares fell 15% over 9 sessions despite raising ₹1,003 crores for 20 GWh battery facility. Stock shows bearish technical signals across all moving averages.",
            "Sentiment": "negative",
            "PublishDate": 1767665955030,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energy Storage Solutions Raises ₹1,003 Cr",
            "Summary": "Waaree Energy Storage Solutions successfully raises ₹1,003 crores from strategic investors for establishing 20 GWh lithium-ion manufacturing facility, part of ₹10,000 crore capex plan.",
            "Sentiment": "positive",
            "PublishDate": 1767603131444,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies shares gain on 1,500 MW solar order",
            "Summary": "Waaree Energies shares rise 0.80% after securing 1,500 MW solar module order and announcing leadership transition with new CEO appointment effective May 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767162538934,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies CEO Amit Paithankar Steps Down",
            "Summary": "Waaree Energies board accepts CEO Amit Paithankar's resignation effective May 15, 2026, appoints Jignesh Rathod as CEO-Designate with immediate effect following December 29 board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1767019795114,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Starts 3.05 GW Solar Inverter Plant",
            "Summary": "Waaree Energies' subsidiary commences operations at new 3.05 GW solar inverter manufacturing facility in Gujarat on December 29, featuring two production lines with 1.525 GW capacity each.",
            "Sentiment": "positive",
            "PublishDate": 1767012993299,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energy Unit Launches Ten New Subsidiaries",
            "Summary": "Waaree Energy's unit Waaree Forever Energies has established ten fully-owned subsidiaries as part of its corporate expansion strategy in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1766499376004,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies schedules investor meet for Dec 27",
            "Summary": "Waaree Energies Limited has scheduled a physical investor meeting for December 27, 2025, in Delhi under SEBI Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1766498119828,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies receives multiple GST demand orders",
            "Summary": "Waaree Energies receives two GST demand orders totaling ₹4.81 crores from Surat and Mumbai tax authorities for alleged Input Tax Credit violations across different periods.",
            "Sentiment": "negative",
            "PublishDate": 1766498027798,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Clarifies 300 MW Module Supply Order",
            "Summary": "Waaree Energies provides regulatory clarification on its 300 MW solar module supply contract with Sembcorp subsidiary, stating the transaction was undertaken in normal business course.",
            "Sentiment": "neutral",
            "PublishDate": 1766220124021,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Forms Step-Down Subsidiary Hydro Bloom",
            "Summary": "Waaree Energies' subsidiary Waaree Forever Energies incorporated Hydro Bloom Energy Private Limited as a wholly-owned step-down subsidiary for Independent Power Producer projects.",
            "Sentiment": "positive",
            "PublishDate": 1766149967387,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies to Acquire US Solar Firm Stake",
            "Summary": "Waaree Energies plans $30 million investment in United Solar Holding Inc's Series B preferred shares to strengthen polysilicon supply chain operations.",
            "Sentiment": "positive",
            "PublishDate": 1766139030474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Subsidiary Forms Two New IPP Companies",
            "Summary": "Waaree Energies announces the creation of two new fully-owned Independent Power Producer companies through its subsidiary, expanding its renewable energy portfolio and operational capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766063336281,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Subsidiary Forms Three New Renewable Firms",
            "Summary": "Waaree Energies subsidiary has established three new fully-owned renewable energy companies, expanding the group's presence in the clean energy sector through strategic corporate restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1765981310411,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Adds 10 More Subsidiaries on Dec 23",
            "Summary": "Waaree Energies incorporates 10 additional wholly-owned subsidiaries through Waaree Forever Energies for IPP power projects, expanding total to 15 new entities in one week.",
            "Sentiment": "positive",
            "PublishDate": 1765981086568,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies CMO Nilesh Malani Resigns",
            "Summary": "Waaree Energies announces resignation of Chief Marketing Officer Nilesh Malani effective December 10, 2025, after nearly 2 years leading marketing efforts and special modules business development.",
            "Sentiment": "neutral",
            "PublishDate": 1765980129267,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Subsidiary Launches Two New IPP Firms",
            "Summary": "Waaree Energies announces subsidiary has launched two new fully owned Independent Power Producer companies - Windora Energy and Agni Vayu Energy.",
            "Sentiment": "positive",
            "PublishDate": 1765892984481,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Subsidiaries Incorporate Two New Firms",
            "Summary": "Waaree Forever Energies incorporates Windora Energy and Agni Vayu Energy as wholly-owned subsidiaries for power projects under IPP framework on December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765889138184,
            "Source": "co_actions_results"
        },
        {
            "Title": "Waaree Energies Forms New Subsidiary EcoFlux Renewables",
            "Summary": "Waaree Energies announces incorporation of EcoFlux Renewables Private Limited through its wholly-owned subsidiary for power project operations under IPP framework.",
            "Sentiment": "positive",
            "PublishDate": 1765803296290,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Subsidiary Launches 1500 MW Plant",
            "Summary": "Sangam Solar One, a subsidiary of Waaree Energies, has commenced operations at its new 1500 MW solar module manufacturing facility in Gujarat, featuring two production lines of 750 MW each.",
            "Sentiment": "positive",
            "PublishDate": 1765531087570,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Forms New IPP Subsidiary",
            "Summary": "Waaree Energies establishes Solaris Horizon Energy as wholly owned subsidiary to serve as independent power producer arm, expanding company's renewable energy operations.",
            "Sentiment": "positive",
            "PublishDate": 1765377628482,
            "Source": "stocks"
        },
        {
            "Title": "Waaree Energies Subsidiary Secures 288 MW Solar Module Order from US Customer",
            "Summary": "Waaree Solar Americas, a wholly owned subsidiary of Waaree Energies Limited, received an order for supply of 288 MW solar modules from a renowned US-based developer and owner-operator of utility scale solar and energy storage projects. The solar modules are scheduled for delivery in Financial Year 2026-27, marking a significant international contract for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764911994171,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Energies Receives Rs 85.09 Lakh GST Penalty from Surat Tax Authority",
            "Summary": "Waaree Energies has been imposed a penalty of Rs 85.09 lakh by the Assistant Commissioner, Central GST Central Excise Division-IV, Surat, for GST payment issues related to subsidy amounts on rooftop solar panel installations for residential consumers. The company states there is no impact on its financials or operations and plans to file an appeal against the penalty order, having already paid the demanded GST amount with interest.",
            "Sentiment": "negative",
            "PublishDate": 1764595030553,
            "Source": "stock"
        },
        {
            "Title": "Waaree Energies Secures 140MW Solar Module Supply Order",
            "Summary": "Waaree Energies has received an order to supply 140MW of solar modules. This order strengthens the company's position in the solar energy sector and adds to its order book.",
            "Sentiment": "positive",
            "PublishDate": 1764332373437,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Energies Completes Income Tax Department Investigation",
            "Summary": "Waaree Energies announced that the Income Tax Department's investigation at some of the company's offices and facilities in India has been completed, with the company providing full cooperation throughout the process. All plant operations and offices functioned without interruption during the investigation period and continue to operate normally.",
            "Sentiment": "neutral",
            "PublishDate": 1764074227979,
            "Source": "stock"
        },
        {
            "Title": "Income Tax Department Conducts Search Operations at Waaree Energies Offices",
            "Summary": "The Income Tax Department has conducted search operations at Waaree Energies' company offices. The company has stated that it is extending full cooperation with the tax authorities during the search process.",
            "Sentiment": "negative",
            "PublishDate": 1763507343272,
            "Source": "stock"
        },
        {
            "Title": "Waaree Energies Subsidiary Commences Operations at 1,500 MW Solar Module Manufacturing Facility",
            "Summary": "Sangam Solar One Private Limited, a wholly owned subsidiary of Waaree Energies Limited, has commenced operations at its new solar module manufacturing facility in Samakhiali-Kutch, Gujarat on November 15, 2025. The facility comprises 2 solar module production lines with annual capacity of 750 MW each, totaling 1,500 MW manufacturing capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763220257456,
            "Source": "stock"
        },
        {
            "Title": "Waaree Energies Secures 360 MW Solar Module Supply Order",
            "Summary": "Waaree Energies Limited received an order for supply of 360 MW solar modules from a customer who is a developer and owner-operator of utility scale solar and energy storage projects. The order is from a domestic entity and involves supply of solar modules during Financial Year 2025-26. The company disclosed this information to stock exchanges BSE and NSE as required under SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762869472555,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Energies to Acquire Full Ownership of Sunbreeze Ninth Cloud",
            "Summary": "Waaree Energies plans to acquire complete ownership of Sunbreeze Ninth Cloud. The acquisition will give Waaree Energies full control over the entity.",
            "Sentiment": "positive",
            "PublishDate": 1762257304549,
            "Source": "order&deals"
        },
        {
            "Title": "Waaree Transpower Launches Next-Generation Inverter Duty Transformers for Solar Applications",
            "Summary": "Waaree Transpower, a subsidiary of Waaree Energies Limited, launched its next-generation Inverter Duty Transformers at the Renewable Energy India Expo 2025 in New Delhi. The products target utility-scale solar plants, renewable developers, industrial captive units and smart grid operators. The flagship model is a 17.6 MVA, 4X660V/33 kV, five-winding aluminium-wound IDT that has completed full type testing at CPRI. The transformers are manufactured at a dedicated facility with backward integration and digital testing capabilities. Waaree Energies operates manufacturing facilities with approximately 16.7 GW solar PV module capacity worldwide and up to 5.4 GW solar cell capacity. The company maintains operations across India and over 25 countries. Shares of Waaree Energies Limited closed at ₹3,423, down ₹9.20 or 0.27%.",
            "Sentiment": "positive",
            "PublishDate": 1761913754516,
            "Source": "stock"
        },
        {
            "Title": "Waaree Energies Reports Record Q2 FY26 Results with 70% Revenue Growth and Strong Order Book",
            "Summary": "Waaree Energies delivered record-breaking quarterly performance with revenue of INR 6,227 crores, marking 70% year-on-year growth. EBITDA surged 155% to INR 1,567 crores with margins expanding to 25.17% from 17%. PAT grew 134% to INR 878 crores. The company achieved highest-ever module production of 2.6 gigawatts and cell production of 0.6 gigawatts. Total module capacity reached 18.7 gigawatts with cell capacity at 5.4 gigawatts. Order book stands strong at INR 47,000 crores equivalent to 24 gigawatts, with 60% overseas and 40% domestic split. The Board approved interim dividend of INR 2 per share and additional capex of INR 8,175 crores for expanding battery energy storage capacity to 20 gigawatt hours, electrolyser capacity to 1 gigawatt, and inverter capacity to 4 gigawatts. The company completed strategic acquisitions including 76% stake in Racemosa Energy India, 64% stake in Kotsons Private Limited, and Meyer Burger's US solar manufacturing assets. Management reaffirmed FY26 EBITDA guidance of INR 5,500-6,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761634581464,
            "Source": "earnings"
        },
        {
            "Title": "Waaree Energies Shares Worth ₹15,840 Crore Set to Free Up as Lock-in Period Ends",
            "Summary": "Waaree Energies Ltd.'s shareholder lock-in period ends on Monday, October 27, freeing up 4.5 crore shares (16% of outstanding equity) worth ₹15,840 crore for trading. The shares becoming eligible for trade does not guarantee they will be sold in the open market. Promoters hold 64.22% stake while retail shareholders own 7.34%. The renewable energy components manufacturer reported 70% revenue growth and 168% EBITDA increase to ₹1,406.3 crore in July-September results. Shares closed Friday at ₹3,520, down 1.31%, but remain 134% above IPO price of ₹1,503.",
            "Sentiment": "neutral",
            "PublishDate": 1761528118692,
            "Source": "stock"
        },
        {
            "Title": "Waaree Energies Secures Solar Module Orders Including 122MW Unit Order",
            "Summary": "Waaree Energies has received orders for solar modules. The company's unit has secured a specific order for 122MW solar modules. The orders represent new business for the solar energy company.",
            "Sentiment": "positive",
            "PublishDate": 1761523754269,
            "Source": "order&deals"
        }
    ]
}