{
    "Symbol": "WABAG",
    "ISIN": "INE956G01038",
    "News": [
        {
            "Title": "VA Tech Wabag Q3 Profit Jumps 30% to ₹913 Million",
            "Summary": "VA Tech Wabag reported strong Q3 performance with consolidated net profit rising 30% to ₹913 million and revenue growing 18.5% to ₹9.6 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770294691152,
            "Source": "co_actions_results"
        },
        {
            "Title": "VA Tech Wabag Gets Credit Rating Reaffirmation",
            "Summary": "India Ratings & Research affirms VA Tech Wabag's bank loan facilities at INR 49,505.20 million and NCDs at INR 666.67 million with 'IND AA-/Stable' rating, though both facility sizes were reduced from previous levels.",
            "Sentiment": "neutral",
            "PublishDate": 1770174236224,
            "Source": "stocks"
        },
        {
            "Title": "VA Tech Wabag Schedules Q3FY26 Results Call",
            "Summary": "VA Tech Wabag announces investor conference call on February 06, 2026 at 4:00 PM IST to discuss Q3 and 9M FY26 financial results with analysts and stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1770124310038,
            "Source": "co_actions_results"
        },
        {
            "Title": "VA Tech WABAG Allots 4,256 Shares Under ESOP Scheme",
            "Summary": "VA Tech WABAG allotted 4,256 equity shares to employees under its Centenary Stock Option Scheme 2023, increasing paid-up capital to ₹12.46 crores with exercise price at ₹513 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769167003240,
            "Source": "co_actions_results"
        },
        {
            "Title": "VA Tech Wabag gains 4% on ₹600 cr BPCL order win",
            "Summary": "VA Tech Wabag shares jumped 4% after securing a large EPC order worth ₹250-600 crore from BPCL for water treatment at Bina refinery. The 22-month project strengthens the company's order book.",
            "Sentiment": "positive",
            "PublishDate": 1768285449796,
            "Source": "co_actions_results"
        },
        {
            "Title": "VA Tech Wabag wins ₹600 cr BPCL order for MP project",
            "Summary": "VA Tech Wabag secured a major order worth ₹250-600 crore from BPCL for advanced water treatment facilities at Bina Refinery in Madhya Pradesh. The comprehensive EPC project includes multiple treatment plants to be completed in 22 months.",
            "Sentiment": "positive",
            "PublishDate": 1768283918247,
            "Source": "co_actions_results"
        },
        {
            "Title": "VA Tech Wabag Wins Major BPCL Water Treatment Order",
            "Summary": "VA Tech Wabag secures significant industrial water treatment contract from Bharat Petroleum Corporation Limited, with order value ranging between ₹250-600 crores, strengthening company's position in water infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1768274166068,
            "Source": "co_actions_results"
        },
        {
            "Title": "WABAG Wins Large Water Treatment Order from BPCL",
            "Summary": "VA TECH WABAG secured a 'Large' order from BPCL for comprehensive water treatment facilities at Bina Refinery, including RWTP, RODMP, and ZLD plants to be executed over 22 months.",
            "Sentiment": "positive",
            "PublishDate": 1768274088481,
            "Source": "co_actions_results"
        },
        {
            "Title": "VA Tech Wabag Receives Updated GST Order for ₹23.21 Lakhs",
            "Summary": "VA Tech Wabag received revised GST assessment order from Bengaluru authorities for FY 2018-19 to 2022-23 period totaling ₹23.21 lakhs including tax, interest and penalty. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767177603607,
            "Source": "stocks"
        },
        {
            "Title": "VA Tech Wabag shares rise on Saudi Water Authority order",
            "Summary": "VA Tech Wabag shares gained 1% after winning repeat large order from Saudi Water Authority for 50 MLD BWRO plant at Aljouf, to be completed in 14 months.",
            "Sentiment": "positive",
            "PublishDate": 1766978339365,
            "Source": "co_actions_results"
        },
        {
            "Title": "VA Tech Wabag wins major Saudi Arabia EPC contract",
            "Summary": "VA Tech Wabag declared preferred EPC partner for Hadda ISTP project in Saudi Arabia, involving sewage treatment plant with 100,000-250,000 metric cube daily capacity and 38km pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1766587194324,
            "Source": "co_actions_results"
        },
        {
            "Title": "WABAG Selected as Preferred EPC Partner for Saudi Project",
            "Summary": "VA Tech Wabag announced selection as preferred EPC partner for Hadda ISTP Project in Saudi Arabia, featuring 100,000 m³/day treatment capacity expandable to 250,000 m³/day under 25-year BOOT model.",
            "Sentiment": "positive",
            "PublishDate": 1766545676989,
            "Source": "co_actions_results"
        },
        {
            "Title": "VATECH WABAG Allots 3,022 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "VATECH WABAG's Board approved allotment of 3,022 equity shares of INR 2/- each to eligible employees who exercised options under the WABAG Centenary Stock Option Scheme 2023. The company's paid-up equity share capital increased to INR 12,45,94,504/- from INR 12,45,88,460/-, raising total equity shares to 6,22,97,252 from 6,22,94,230.",
            "Sentiment": "neutral",
            "PublishDate": 1765290379595,
            "Source": "corporate_action"
        },
        {
            "Title": "Va Tech Wabag Secures USD 30-75 Million ADB-Funded Water Treatment Contract in Nepal",
            "Summary": "Va Tech Wabag has received an ADB-funded order valued between USD 30-75 million for constructing a 255 MLD Sundarijal Water Treatment Plant in Nepal. This significant infrastructure contract expands the company's international project portfolio and strengthens its presence in the South Asian water treatment market.",
            "Sentiment": "positive",
            "PublishDate": 1763608297821,
            "Source": "order&deals"
        },
        {
            "Title": "WABAG Makes First Investment Under BLUESEED Initiative, Backs Bengaluru-Based NimbleVision",
            "Summary": "VATECH WABAG announced its first investment commitment under BLUESEED in NimbleVision, a Bengaluru-based startup developing indigenous deep tech solutions for water conservation, automation, and real-time analytics. BLUESEED is WABAG's strategic initiative to support water-tech entrepreneurs and scale innovative startups. The investment will help NimbleVision expand IoT-based automation systems for water supply and treatment, enhance AI-driven predictive analytics for leak detection and energy optimization, accelerate development of indigenous smart sensors under the Atmanirbhar Bharat initiative, and deploy scalable water conservation platforms across municipalities and industries. The collaboration aims to strengthen India's self-reliant water technology ecosystem by combining NimbleVision's deep tech innovation with WABAG's global experience.",
            "Sentiment": "positive",
            "PublishDate": 1762918485943,
            "Source": "stock"
        },
        {
            "Title": "Va Tech Wabag Maintains EBITDA Margin Target, Aims for Accelerated Growth",
            "Summary": "Va Tech Wabag has maintained its EBITDA margin target of 13-15%. The company aims to achieve faster growth beyond its previous forecast of 15-20%.",
            "Sentiment": "positive",
            "PublishDate": 1762832288529,
            "Source": "stock"
        },
        {
            "Title": "VATECH WABAG Allots 5,987 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "VATECH WABAG LIMITED's Board of Directors approved the allotment of 5,987 equity shares of INR 2/- each to eligible option grantees who exercised their options under the WABAG Centenary Stock Option Scheme 2023. The allotment increased the company's paid-up equity share capital to INR 12,45,88,460/- consisting of 6,22,94,230 equity shares from the previous INR 12,45,76,486/- consisting of 6,22,88,243 equity shares. The shares were issued on November 07, 2025, and will rank equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762537494709,
            "Source": "corporate_action"
        },
        {
            "Title": "VA TECH WABAG Reports Mixed Q2 Results with Higher Revenue and Profit but Lower EBITDA",
            "Summary": "VA TECH WABAG reported quarterly consolidated net profit of 848 million rupees compared to 706 million rupees in the same period last year. Revenue increased to 8.35 billion rupees from 7 billion rupees year-over-year. However, EBITDA declined to 893 million rupees from 989 million rupees, while EBITDA margin compressed to 10.70% from 14.12% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762517960300,
            "Source": "earnings"
        },
        {
            "Title": "Va Tech Wabag Bids for $1 Billion in Orders with Additional ₹3,500 Crore Pipeline",
            "Summary": "Va Tech Wabag has submitted bids for orders worth $1 billion and identifies potential for an additional ₹3,500 crore in business opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1756876596127,
            "Source": "stock"
        },
        {
            "Title": "Va Tech Wabag Faces ₹871.6 Million in Duties, Penalties and Fines Over Duty Refund Claims",
            "Summary": "Va Tech Wabag has received an order regarding duty refunds totaling ₹69.2 million that are claimed to be incorrect. The company faces a penalty of ₹201.2 million and a redemption fine of ₹601.2 million in connection with this matter.",
            "Sentiment": "negative",
            "PublishDate": 1756133195429,
            "Source": "stock"
        },
        {
            "Title": "VA Tech Wabag Reports 15% Revenue Growth, Strong Order Book of INR 16,000 Crores",
            "Summary": "VA Tech Wabag released its 30th Annual General Meeting transcript showing revenue of INR 3,294 crores with 15% year-on-year growth and profit after tax of INR 295 crores with 20% growth. The company maintains an order book of INR 16,000 crores and declared a dividend of INR 4 per equity share. The water treatment company secured orders worth over INR 5,700 crores during the year and operates in over 25 countries with nearly 50% of revenues from international markets. Major projects include the 400 MLD Chennai Desalination Plant and a 300 MLD facility in Saudi Arabia. The company faces challenges including geopolitical tensions in the Middle East, currency volatility, and 20% employee attrition rate. Management appointed new secretarial auditors for a five-year term and continues focusing on emerging markets in Asia, Africa, and the Middle East.",
            "Sentiment": "positive",
            "PublishDate": 1756132420603,
            "Source": "earnings"
        },
        {
            "Title": "Va Tech Wabag Wins ₹46.5 Crore Water Technology Contract from Renewsys",
            "Summary": "Va Tech Wabag has secured a ₹46.5 crore order to provide advanced water technology solutions for Renewsys' solar cell manufacturing plant. The contract involves supplying water treatment technology for the solar manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1755745612373,
            "Source": "order&deals"
        },
        {
            "Title": "VA Tech WABAG Secures ₹118 Crore Repeat Order for Bahrain Sewage Treatment Plant Operations",
            "Summary": "VA Tech WABAG has secured a repeat order worth 5.12 million Bahraini Dinars (approximately ₹118 crores) from the Ministry of Works, Municipalities Affairs and Urban Planning in Bahrain. The contract involves operating and maintaining the 40 MLD Madinat Salman Sewage Treatment Plant and Long Sea Outfall for five years. WABAG originally constructed this facility under an EPC contract awarded in October 2015, completed it in 2018, and has been operating it since November 2018. The sewage treatment plant features tertiary treatment, sludge treatment with aerobic digestion and thermal drying, and serves irrigation water requirements for 13 islands. The facility includes an automatic bagging plant for commercial sales of EPA Class A sludge. This repeat order strengthens WABAG's operations and maintenance portfolio, providing annuity income and improved cash flow predictability.",
            "Sentiment": "positive",
            "PublishDate": 1755572565429,
            "Source": "order&deals"
        },
        {
            "Title": "Va Tech Wabag Reports ₹14,220 Crore Order Backlog, Targets Record Fulfillment",
            "Summary": "Va Tech Wabag has a backlog of ₹14,220 crore and aims for record order fulfillment. The company is focusing on water recycling, desalination, and global expansion. The company has provided a strong forecast for FY26 with emphasis on high-profit technology projects.",
            "Sentiment": "positive",
            "PublishDate": 1755015974288,
            "Source": "stock"
        },
        {
            "Title": "VA TECH WABAG Reports Strong Q1 Performance with Revenue Growth to 7.3B Rupees",
            "Summary": "VA TECH WABAG delivered robust quarterly results with revenue rising to 7.3 billion rupees from 6.3 billion rupees year-over-year. The company's consolidated net profit increased to 658 million rupees compared to 550 million rupees in the same period last year. EBITDA grew to 956 million rupees from 813 million rupees year-over-year, while EBITDA margin improved slightly to 13.02% from 12.98%.",
            "Sentiment": "positive",
            "PublishDate": 1754993658173,
            "Source": "earnings"
        },
        {
            "Title": "Va Tech Wabag Trades Ex-Dividend After 525% Rally, Rekha Jhunjhunwala Holds 8.04% Stake",
            "Summary": "Va Tech Wabag, a smallcap water technology company, is trading ex-dividend with a final dividend of Rs 4 per equity share for the financial year ended March 31, 2025. The stock has delivered 525% returns over three years. Rekha Jhunjhunwala holds an 8.04% stake as of June 2025. The shares experienced three consecutive months of declines due to profit booking but reversed momentum in March, gaining 27.6%. The dividend will be paid by September 10, 2025, following AGM approval. Va Tech Wabag is a century-old water technology company providing end-to-end solutions for wastewater projects.",
            "Sentiment": "positive",
            "PublishDate": 1754383817993,
            "Source": "corporate_action"
        },
        {
            "Title": "VA Tech Wabag Secures Rs 380 Crore Water Treatment Contract from Bangalore Board",
            "Summary": "VA Tech Wabag won a Rs 380 crore design, build, and operate contract from the Bangalore Water Supply and Sewerage Board for advanced wastewater treatment plants with tertiary treatment facilities, biogas generation, and solar sludge drying beds. The project spans four sites in Bommanahalli under the Karnataka Water Security and Disaster Resilience Program, with 30 months for completion and 10 years of operation and maintenance. This follows recent major wins including a USD 272 million seawater desalination plant project in Saudi Arabia and a Rs 3,251 crore consortium order for sewage treatment in Riyadh. Analysts maintain a 'Strong Buy' rating with an average target price of Rs 1,839, suggesting 13% upside potential. The company's market capitalization stands at approximately Rs 10,092 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753674160413,
            "Source": "stock"
        },
        {
            "Title": "Va Tech Wabag Secures 3.80 Billion Rupees Order",
            "Summary": "Va Tech Wabag has secured an order worth 3.80 billion rupees. No additional details about the nature of the order, client, or timeline were provided.",
            "Sentiment": "positive",
            "PublishDate": 1753662223714,
            "Source": "order&deals"
        },
        {
            "Title": "VA TECH WABAG Secures INR 380 Crore Water Treatment Order from Bangalore Water Board",
            "Summary": "VA TECH WABAG has secured a Design, Build, Operate order worth INR 380 crores from Bangalore Water Supply and Sewerage Board for constructing wastewater treatment plants in Bengaluru. The World Bank-funded project involves designing and building wastewater treatment facilities with tertiary treatment, biogas generation, and solar sludge drying beds at four sites in Bommanahalli. The project is scheduled for completion within 30 months, followed by 10 years of operation and maintenance. The advanced treatment plants will enable industrial reuse of treated wastewater and include green initiatives such as anaerobic digestion to generate biogas for plant operations. The facilities are part of the Karnataka Water Security and Disaster Resilience Program aimed at strengthening the region's water sustainability.",
            "Sentiment": "positive",
            "PublishDate": 1753452414485,
            "Source": "order&deals"
        },
        {
            "Title": "VA TECH WABAG Wins USD 272 Million Desalination Plant Contract in Saudi Arabia",
            "Summary": "VA TECH WABAG Limited has received a Letter of Award from the Saudi Water Authority for a 300 MLD Sea Water Reverse Osmosis desalination plant project in Yanbu, Saudi Arabia, valued at approximately USD 272 million (SAR 1,019 million / INR 2,332 crores). The project involves design, engineering, supply, construction, and commissioning of the mega desalination plant on a greenfield site along the west coast of Saudi Arabia. The execution timeline is set for 30 months from the effective date, which will be announced after contract signing formalities are completed. According to Rohan Mittal, Head of Strategy and Business Growth for GCC, this represents a repeat success for the company in prestigious projects and aligns with Saudi Vision 2030 goals while reinforcing WABAG's global leadership in the desalination sector.",
            "Sentiment": "positive",
            "PublishDate": 1753326192067,
            "Source": "order&deals"
        },
        {
            "Title": "VA TECH WABAG Sets Book Closure Dates for 30th AGM and Final Dividend Record Date",
            "Summary": "VA TECH WABAG LIMITED has announced that its register of members and share transfer books will be closed from August 6-12, 2025 for the company's 30th Annual General Meeting. The company has set August 5, 2025 as the record date for determining shareholders eligible to receive the final dividend. The board recommended a final dividend of INR 4 per equity share for the financial year ended March 31, 2025 at its May 21, 2025 meeting. The final dividend will be paid on or before September 10, 2025 following approval at the AGM, subject to tax deduction at source.",
            "Sentiment": "neutral",
            "PublishDate": 1753158596471,
            "Source": "corporate_action"
        },
        {
            "Title": "VA Tech Wabag: Targets 15-20% Revenue Growth, Shifts Focus to Cash Flow",
            "Summary": "VA Tech Wabag aims for 15-20% annual revenue growth over the next five years. The company is prioritizing cash flow over revenue as part of its 'Wriddhi' strategy. It's shifting from EPC to EP projects, focusing on industrial contracts, O&M agreements, and international projects. The company targets O&M to constitute 20% of topline and sees Middle East and Africa as key growth regions.",
            "Sentiment": "positive",
            "PublishDate": 1750570339000,
            "Source": "normal_news"
        },
        {
            "Title": "VA Tech Wabag: Water Treatment Specialist's Shares Surge 1000% in Five Years",
            "Summary": "VA Tech Wabag Ltd., a Chennai-based water treatment company, has seen its shares rally over 1000% in the last five years. The company's Q3 FY2025 results show an 11.6% rise in net profit to Rs 70 crore and a 15.1% increase in revenue to Rs 811 crore. All seven analysts tracking the company have a 'buy' call, with a 12-month consensus return potential of 21.6%. Management expects to maintain an EBITDA of 13% to 15% in the medium term.",
            "Sentiment": "positive",
            "PublishDate": 1750226877000,
            "Source": "earnings"
        },
        {
            "Title": "VA TECH WABAG Reports Strong Order Book and Performance",
            "Summary": "VA TECH WABAG announced a robust order book providing visibility for the next three to four years, sufficient to execute revenues and cash flows without needing new orders. The company aims to maintain an order backlog of at least 3x of its revenues, currently at 4x. EBITDA guidance is between 13% to 15%, depending on project mix. The company has achieved performance in line with its first-year guidance and is on track to meet or surpass most targets set for a three to five year scale.",
            "Sentiment": "positive",
            "PublishDate": 1748230246000,
            "Source": "default"
        },
        {
            "Title": "VA TECH WABAG Plans Expansion into New Markets",
            "Summary": "VA TECH WABAG has announced plans to expand its operations into new markets in the Gulf Cooperation Council (GCC) region, Africa, and Central Asia. The company specifically mentioned targeting UAE, Kuwait, Jordan, Morocco, Uzbekistan, and Kazakhstan as potential new markets. This information was shared in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1747971041000,
            "Source": "default"
        },
        {
            "Title": "VA Tech Wabag: Targeting 13-15% EBITDA in Medium Term",
            "Summary": "VA Tech Wabag aims for 13-15% EBITDA in the medium term, with a 15-20% CAGR. The company plans to focus on larger, technically complex projects and increase its international mix. It has secured preferred bidder status for orders worth Rs 3,000 crore and recently won a $370 million order with a consortium partner.",
            "Sentiment": "positive",
            "PublishDate": 1747962735000,
            "Source": "normal_news"
        },
        {
            "Title": "VA Tech Wabag: Strong Execution and Order Book Growth Ahead",
            "Summary": "VA Tech Wabag expects order book to reach ₹16,000-₹17,000 crore, maintains 15-20% annual revenue growth guidance. Q4 saw 30% topline growth. Company focuses on emerging markets, with 95% of EPC orders from multilateral or sovereign sources. Anticipates strong demand in industrial water sector.",
            "Sentiment": "positive",
            "PublishDate": 1747894707000,
            "Source": "earnings"
        },
        {
            "Title": "VA TECH WABAG Reports Q4 Financial Results and Recommends Dividend",
            "Summary": "VA TECH WABAG announced its Q4 financial results. The company's revenue increased to 11.56 billion rupees from 9.34 billion rupees year-over-year. Consolidated net profit rose to 995 million rupees from 724 million rupees in the same quarter last year and 702 million rupees in the previous quarter. EBITDA grew to 1.43 billion rupees from 1.16 billion rupees year-over-year, with an EBITDA margin of 12.33% compared to 12.42% in the previous year. The company also recommended a final dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747829550000,
            "Source": "result"
        },
        {
            "Title": "VA Tech Wabag: Q4 Profit Surges 37%, Declares ₹4 Dividend",
            "Summary": "VA Tech Wabag reported a 37.4% YoY increase in Q4 net profit to ₹99.5 crore. Revenue grew 23.8% to ₹1,156.2 crore. The company proposed a final dividend of ₹4 per share for FY25. It ended the year with a net cash position of ₹589 crore and an order book of ₹13,700 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747829126000,
            "Source": "earnings"
        },
        {
            "Title": "VA TECH WABAG to Consider Q4 Results on May 21",
            "Summary": "VA TECH WABAG, a water technology company, has announced that it will consider its fourth quarter (Q4) financial results on May 21. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747141566000,
            "Source": "default"
        },
        {
            "Title": "VA TECH WABAG Secures $100M Equity Partnership for Municipal Projects",
            "Summary": "VA TECH WABAG has entered into a non-binding equity partnership worth $100 million (approximately 862 crore rupees) with an investor consortium that includes Norfund. This partnership is aimed at capital project investments in municipal projects.",
            "Sentiment": "positive",
            "PublishDate": 1742526421000,
            "Source": "corporate_action"
        },
        {
            "Title": "VA TECH WABAG Secures Orders Worth 3.60 Billion Rupees",
            "Summary": "VA TECH WABAG, a water technology company, has announced that it has secured new orders valued at 3.60 billion rupees. This development indicates significant business growth and potential expansion for the company in its sector.",
            "Sentiment": "positive",
            "PublishDate": 1741835223000,
            "Source": "order&deals"
        },
        {
            "Title": "VA TECH WABAG Secures Major Sewage Treatment Plant Order in Saudi Arabia",
            "Summary": "VA TECH WABAG, as part of a consortium, has secured a significant order valued at approximately 3,251 crore rupees for the Al Haer Independent Sewage Treatment Plant project in the Kingdom of Saudi Arabia. This order represents a major international contract for the company in the water treatment sector.",
            "Sentiment": "positive",
            "PublishDate": 1739154231000,
            "Source": "order&deals"
        },
        {
            "Title": "Va Tech Wabag Reports Increased Q3 Profit and Revenue",
            "Summary": "Va Tech Wabag, a water technology company, has announced its financial results for the third quarter. The company's consolidated net profit increased to 702 million rupees, up from 629 million rupees in the same quarter last year and 706 million rupees in the previous quarter. Revenue also saw growth, reaching 8.1 billion rupees compared to 7 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739146419000,
            "Source": "earnings"
        },
        {
            "Title": "Va Tech Wabag: Secures ₹3,251 Crore Sewage Treatment Plant Order in Saudi Arabia",
            "Summary": "Va Tech Wabag has won a consortium order worth $371 million (₹3,251 crores) for a 200 MLD Independent Sewage Treatment Plant in Riyadh, Saudi Arabia. The company will lead the EPC consortium as the Technology Partner, collaborating with Miahona Company, Marafiq, and N.V. Besix S.A. This project is part of Saudi Arabia's Vision 2030.",
            "Sentiment": "positive",
            "PublishDate": 1739091154000,
            "Source": "order&deals"
        },
        {
            "Title": "VA TECH WABAG Reports Mixed Q3 Results",
            "Summary": "VA TECH WABAG, a water technology company, has reported its Q3 financial results. The company's EBITDA increased to 1 billion rupees from 989 million rupees in the same quarter last year. However, the EBITDA margin decreased to 12.38% from 14.04% year-over-year, indicating a slight decline in profitability despite higher earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1738929975000,
            "Source": "earnings"
        },
        {
            "Title": "VA TECH WABAG Reports Increased Q3 Profit and Revenue",
            "Summary": "VA TECH WABAG has announced its Q3 financial results. The company's consolidated net profit increased to 702 million rupees, up from 629 million rupees year-over-year and 706 million rupees quarter-over-quarter. Revenue for Q3 also saw growth, reaching 8.1 billion rupees compared to 7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738929881000,
            "Source": "earnings"
        },
        {
            "Title": "VA TECH WABAG to Consider Q3 Results on February 7",
            "Summary": "VA TECH WABAG, a water technology company, has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738240003000,
            "Source": "earnings"
        },
        {
            "Title": "VA Tech Wabag Secures 7-Year Operation Contract in Bahrain",
            "Summary": "VA Tech Wabag has been awarded a 7-year operation contract for the BAPCO Refining Industrial Wastewater Treatment Plant in the Kingdom of Bahrain. The contract is valued at 121 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738119702000,
            "Source": "order&deals"
        },
        {
            "Title": "VA TECH WABAG's Corporate Office Achieves Triple Green Building Certifications",
            "Summary": "VA TECH WABAG's corporate office, WABAG HOUSE, has received three significant certifications from CII-IGBC (Confederation of Indian Industry - Indian Green Building Council). It has become India's first operational corporate office to attain IGBC Net-Zero Water and Near Net-Zero Energy certifications. This achievement demonstrates the company's commitment to sustainable practices and environmental leadership in the corporate sector.",
            "Sentiment": "positive",
            "PublishDate": 1736305861000,
            "Source": "corporate_governance"
        }
    ]
}