{
    "Symbol": "WALCHANNAG",
    "ISIN": "INE711A01022",
    "News": [
        {
            "Title": "Walchandnagar Industries Reports No Deviation in Fund Use",
            "Summary": "Walchandnagar Industries confirms no deviation in Rs. 247.59 crores preferential issue proceeds utilization for Q3 FY26, with funds deployed across loan repayment and capex as planned.",
            "Sentiment": "neutral",
            "PublishDate": 1769699291275,
            "Source": "stocks"
        },
        {
            "Title": "Walchandnagar Industries Board Approves Key Changes",
            "Summary": "Walchandnagar Industries' board approved registered office relocation from Mumbai to Pune and re-appointed Chirag C. Doshi as Managing Director & CEO for three years until March 31, 2029.",
            "Sentiment": "positive",
            "PublishDate": 1769697816881,
            "Source": "stocks"
        },
        {
            "Title": "Walchandnagar Industries Q3FY26 Results",
            "Summary": "Walchandnagar Industries reports Q3FY26 profit of ₹466 lakhs vs loss of ₹1,713 lakhs in Q3FY25. Revenue rises to ₹8,095 lakhs from ₹5,907 lakhs YoY.",
            "Sentiment": "positive",
            "PublishDate": 1769696597924,
            "Source": "co_actions_results"
        },
        {
            "Title": "Walchandnagar Industries Holds ₹670 Cr Orderbook",
            "Summary": "Walchandnagar Industries maintains strong orderbook of ₹670 crores primarily from nuclear sector, anticipates major aerospace orders in Q4 and additional nuclear contracts within 3-6 months.",
            "Sentiment": "positive",
            "PublishDate": 1767156559650,
            "Source": "stocks"
        },
        {
            "Title": "Walchandnagar Industries Clarifies Price Movement",
            "Summary": "Walchandnagar Industries attributes recent share price surge to GHANTI Bill passage, enabling private nuclear sector participation. Company positioned to benefit from nuclear policy reforms.",
            "Sentiment": "positive",
            "PublishDate": 1765974512224,
            "Source": "stocks"
        },
        {
            "Title": "Walchandnagar Industries Allots 15,609 Equity Shares Under Employee Stock Options Plan",
            "Summary": "Walchandnagar Industries Limited allotted 15,609 equity shares of face value Rs. 2 each to eligible employees under the WIL Employee Stock Options Plan 2020 on November 29, 2025. The allotment increased the company's paid-up equity share capital to Rs. 13,56,84,120 divided into 6,78,42,060 equity shares, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764396461066,
            "Source": "corporate_action"
        },
        {
            "Title": "Walchandnagar Industries Ends Lockout at Satara Plant, Operations to Resume in December",
            "Summary": "Walchandnagar Industries has called off the lockout at its Satara plant effective November 24, 2025, after discussions with union representatives, with production expected to restart from December 20, 2025 in phases. The company lost revenue of around Rs. 27 crores due to the suspension of work and lockout since March 20, 2025, impacting overall profitability.",
            "Sentiment": "positive",
            "PublishDate": 1764051473166,
            "Source": "stock"
        },
        {
            "Title": "Walchandnagar Industries Reports No Deviation in Preferential Issue Fund Utilization for Q2 FY2026",
            "Summary": "ICRA Limited's monitoring report confirms Walchandnagar Industries Limited utilized INR 177.67 crore of its INR 216 crore preferential issue proceeds without deviation from approved objectives for the quarter ended September 30, 2025. The company deployed funds across loan repayment (INR 45 crore completed), capital expenditure (INR 48.48 crore utilized), working capital (INR 64.19 crore), and general corporate purposes (INR 20 crore completed), with INR 38.33 crore remaining unutilized in fixed deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1763115740646,
            "Source": "corporate_action"
        },
        {
            "Title": "Walchandnagar Industries Reports Second Consecutive Quarter of Positive EBITDA",
            "Summary": "Walchandnagar Industries Limited reported quarterly revenue of Rs. 51.78 crores with positive EBITDA of Rs. 0.61 crores, marking the second successive quarter of positive EBITDA despite foundry business lockdown. The engineering company showed 9% sequential growth in Heavy Engineering segment and improved net cash flow from operations to Rs. 12.15 crores in H1FY26, expecting healthy order book of Rs 150-200 crores in H2FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763065767934,
            "Source": "earnings"
        },
        {
            "Title": "Walchandnagar Industries Reports Wider Losses in Q2 FY2026 Results",
            "Summary": "Walchandnagar Industries posted a net loss of Rs 1,190 lakhs for the quarter ended September 30, 2025, compared to Rs 1,102 lakhs loss in the same period last year, with revenue from operations declining to Rs 5,379 lakhs from Rs 6,786 lakhs. The company's half-year losses widened to Rs 2,229 lakhs from Rs 1,276 lakhs in the previous year, reflecting continued operational challenges across its Heavy Engineering, Foundry and Machine Shop segments.",
            "Sentiment": "negative",
            "PublishDate": 1763055649975,
            "Source": "earnings"
        },
        {
            "Title": "Walchandnagar Industries Reports No Deviation in Rs 247.59 Crore Preferential Issue Fund Utilization",
            "Summary": "Walchandnagar Industries Limited confirmed no deviation in the use of proceeds from its preferential issue of fully convertible equity warrants totaling Rs 247.59 crores. The company raised Rs 216 crores in cash from investors and adjusted Rs 31.59 crores towards conversion of outstanding promoter entity loans. Fund utilization as of September 30, 2025 includes Rs 45 crores for term loan and working capital facility repayment, Rs 48.48 crores for capital expenditure, Rs 64.19 crores for working capital, and Rs 20 crores for general corporate purposes. The board approved reallocation of Rs 4 crores from capital expenditure to loan repayment and Rs 17 crores from capital expenditure to working capital. The Audit Committee reviewed and confirmed the statement on November 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763036820905,
            "Source": "corporate_action"
        },
        {
            "Title": "Walchandnagar Industries Clarifies Significant Share Volume Increase to BSE",
            "Summary": "Walchandnagar Industries Limited responded to BSE's inquiry regarding significant increase in share trading volume. The company stated it has disclosed all material information and price-sensitive data in accordance with SEBI regulations. The company reported being unaware of specific reasons for the volume increase, attributing the movement to market-driven factors. Management confirmed no undisclosed price-sensitive information exists that requires disclosure to exchanges at this time. The company assured continued compliance with regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761841066817,
            "Source": "stock"
        },
        {
            "Title": "Walchandnagar Industries Reports Loss of Rs 1,039 Lakhs in Q1 FY2026, Reappoints Whole Time Director",
            "Summary": "Walchandnagar Industries Ltd reported a net loss of Rs 1,039 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 173 lakhs in the same period last year. Revenue from operations declined to Rs 4,943 lakhs from Rs 7,917 lakhs year-on-year. The company's Heavy Engineering segment generated revenue of Rs 4,209 lakhs, while Foundry and Machine Shop contributed Rs 202 lakhs. Basic earnings per share stood at negative Rs 1.54. The Board of Directors approved these unaudited financial results on August 14, 2025. Additionally, the company reappointed Mr. Giriraj Sharan Agrawal as Whole Time Director & Company Secretary for a 3-year term effective August 2, 2025, following board approval and shareholder confirmation at the AGM.",
            "Sentiment": "negative",
            "PublishDate": 1755180356992,
            "Source": "earnings"
        },
        {
            "Title": "Walchandnagar Industries Reports Increased Losses in Q4",
            "Summary": "Walchandnagar Industries has reported financial results for its latest quarter. The company's EBITDA showed a loss of 471 million rupees, compared to a gain of 53 million rupees in the same quarter last year. The net loss for the quarter increased to 561 million rupees, up from a loss of 36 million rupees year-over-year and 171 million rupees quarter-over-quarter. Revenue for the quarter decreased to 531 million rupees from 914 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747920734000,
            "Source": "result"
        },
        {
            "Title": "Walchandnagar Industries Secures 307.5 Million Rupee Order",
            "Summary": "Walchandnagar Industries has received a new order valued at 307.5 million rupees. This order represents a significant business development for the company, potentially boosting its revenue and order book.",
            "Sentiment": "positive",
            "PublishDate": 1743425696000,
            "Source": "order&deals"
        },
        {
            "Title": "Walchandnagar Industries Temporarily Suspends Production at Satara Plant",
            "Summary": "Walchandnagar Industries has announced a temporary suspension of production activities at its plant located in Satara. This suspension is affecting the operations at the facility. The company has not provided details on the reasons for the suspension or its expected duration.",
            "Sentiment": "negative",
            "PublishDate": 1742543600000,
            "Source": "corporate_action"
        },
        {
            "Title": "Walchandnagar Industries Acquires Majority Stake in Defense Tech Startup",
            "Summary": "Walchandnagar Industries has acquired a 60.3% stake in AICITTA, a defense technology startup, for ₹16 crore. This acquisition represents a significant corporate action that could potentially strengthen Walchandnagar Industries' position in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1741166176000,
            "Source": "corporate_action"
        },
        {
            "Title": "Walchandnagar Industries to Acquire Majority Stake in Aicitta Intelligent Technology",
            "Summary": "Walchandnagar Industries has approved the acquisition of a 60.3% stake in Aicitta Intelligent Technology for 160 million rupees. This strategic investment represents a significant corporate action for Walchandnagar Industries, potentially expanding its technological capabilities and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1741084849000,
            "Source": "corporate_action"
        },
        {
            "Title": "Walchandnagar Industries Reports Q3 Financial Results",
            "Summary": "Walchandnagar Industries has reported its Q3 financial results. The company recorded a net loss of 171 million rupees, which is an improvement from the loss of 187 million rupees in the same quarter last year. However, it represents a slight increase in loss compared to the previous quarter's loss of 152 million rupees. The company's revenue for Q3 stood at 591 million rupees, showing a year-over-year increase from 559 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738851810000,
            "Source": "earnings"
        },
        {
            "Title": "Walchandnagar Industries Secures Major Order from Fluorine Korea",
            "Summary": "Walchandnagar Industries has received a significant purchase order from Fluorine Korea Co. Ltd. The order is valued at approximately USD 5.3 million, which is equivalent to Rs 44.94 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735172386000,
            "Source": "order&deals"
        },
        {
            "Title": "Walchandnagar Industries Secures Major Purchase Order from Fluorine Korea",
            "Summary": "Walchandnagar Industries has received a significant purchase order from Fluorine Korea Co. Ltd. The order is valued at approximately USD 5.3 million, which is equivalent to Rs 44.94 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735043049000,
            "Source": "order&deals"
        },
        {
            "Title": "Walchandnagar Industries Reports Increased Q2 Losses",
            "Summary": "Walchandnagar Industries has reported a net loss of 110 million rupees in Q2, compared to a loss of 81 million rupees in the same quarter last year. The company's revenue also declined to 679 million rupees from 879 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731593430000,
            "Source": "result"
        },
        {
            "Title": "Walchandnagar Industries to Hold Board Meeting for Q2 Results and Fund Raising",
            "Summary": "Walchandnagar Industries has scheduled a board meeting for November 14 to discuss and approve the company's second quarter financial results. Additionally, the board will consider options for raising funds.",
            "Sentiment": "neutral",
            "PublishDate": 1731318764000,
            "Source": "corporate_action"
        },
        {
            "Title": "Walchandnagar Industries Signs MoU with IIT Ropar for Defence and Aerospace R&D",
            "Summary": "Walchandnagar Industries has entered into a Memorandum of Understanding (MoU) with the Indian Institute of Technology (IIT) Ropar. The collaboration aims to promote focused research and development, encourage innovations, and support indigenization efforts in the defence and aerospace sectors. This partnership is expected to address challenges in these industries through joint research initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1730812383000,
            "Source": "corporate_action"
        }
    ]
}