{
    "Symbol": "WANBURY",
    "ISIN": "INE107F01022",
    "News": [
        {
            "Title": "Wanbury Q3FY26 Results: Profit Surges 1194% YoY",
            "Summary": "Wanbury Limited reported exceptional Q3FY26 performance with profit after tax jumping to ₹1,575.90 lakhs from ₹121.77 lakhs YoY. Revenue grew 21.7% to ₹16,244.75 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770302653819,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wanbury Launches Four New Anesthetic APIs at Tanuku",
            "Summary": "Wanbury Limited announces launch of four new anesthetic APIs at its Tanuku facility, targeting ₹100 crore revenue in FY 2026-27, expected to add 15% to company's annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1769580039423,
            "Source": "stocks"
        },
        {
            "Title": "Wanbury Board Approves Director Re-appointment",
            "Summary": "Wanbury Limited's board approved re-appointment of Mr. Manojkumar Khubchand Gursahani as Non-Executive Independent Director for one year from January 8, 2026. EGM scheduled for January 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765379882548,
            "Source": "stocks"
        },
        {
            "Title": "Catalyst Trusteeship Increases Pledge on Wanbury Limited Shares to 37.12%",
            "Summary": "Catalyst Trusteeship Limited, acting as Debenture Trustee, increased its encumbered shareholding in Wanbury Limited from 35.11% to 37.12% through additional pledge of 6,59,488 equity shares. The pledge involves shares worth 1,22,03,818 equity shares held as security for debenture holders through non-disposal undertaking arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1764573871049,
            "Source": "corporate_action"
        },
        {
            "Title": "Wanbury Limited Reports Strong Q2 FY26 Performance with 20% EBITDA Growth",
            "Summary": "Wanbury Limited achieved EBITDA of ₹26.0 crore (16.2% margin) in Q2 FY26 compared to ₹21.6 crore (13.3% margin) in Q2 FY25, marking 20% growth driven by enhanced product yields and procurement efficiencies. The pharmaceutical company's PAT surged 89% to ₹15.2 crore from ₹8.0 crore year-over-year, with formulations business turning EBITDA positive and successful launch of new iron supplement brand C-red.",
            "Sentiment": "positive",
            "PublishDate": 1763974821977,
            "Source": "earnings"
        },
        {
            "Title": "Wanbury Limited Posts Strong Q2 FY26 Results with 20% EBITDA Growth and 90% PAT Surge",
            "Summary": "Wanbury Limited reported robust quarterly results with EBITDA rising 20% to ₹26 crore (16.2% margin) and PAT jumping 89% to ₹15.2 crore, driven by enhanced product yields, procurement efficiencies, and lower finance costs. The pharmaceutical company's formulations business turned EBITDA positive while API business maintained strong performance, with management highlighting successful digital transformation and commitment to sustainable growth through new product launches.",
            "Sentiment": "positive",
            "PublishDate": 1763797813802,
            "Source": "earnings"
        },
        {
            "Title": "Wanbury Reports Strong H1FY26 Results with 216.6% PAT Growth",
            "Summary": "Wanbury Limited reported robust half-year performance with PAT jumping 216.6% YoY to Rs. 28.7 crore and revenue growing 10.6% to Rs. 323.2 crore for H1FY26. The pharmaceutical company's strong results were driven by volume growth, cost efficiencies, improved product yield, and lower finance costs, with EBITDA margins expanding to 15.7% from 11.4% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763467680240,
            "Source": "earnings"
        },
        {
            "Title": "Wanbury Limited Reports Strong Q2 Performance and Allots Employee Stock Options",
            "Summary": "Wanbury Limited's Board approved quarterly results for the second quarter and half year ended September 30, 2025, showing profit after tax of Rs. 1,518.03 lakhs for Q2 and Rs. 2,867.08 lakhs for H1. The pharmaceutical company also allotted 15,000 equity shares to an employee under its ESOP 2016 scheme at Rs. 10 per share, increasing paid-up share capital to Rs. 34,89,19,980.",
            "Sentiment": "positive",
            "PublishDate": 1763068041153,
            "Source": "earnings"
        },
        {
            "Title": "Wanbury Launches SAP S/4HANA Private Cloud System to Enhance Operations",
            "Summary": "Wanbury has launched a SAP S/4HANA Private Cloud system as part of its operational enhancement strategy. The company describes this implementation as a significant milestone in its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1759734317239,
            "Source": "stock"
        },
        {
            "Title": "Wanbury Reports Strong Q1 Performance with Net Profit Surge to 135 Million Rupees",
            "Summary": "Wanbury delivered robust quarterly results with consolidated net profit jumping to 135 million rupees from 10.4 million rupees in the same period last year. Revenue grew to 1.6 billion rupees compared to 1.3 billion rupees year-over-year. EBITDA more than doubled to 244 million rupees from 110 million rupees, while EBITDA margin expanded significantly to 14.98% from 8.37% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754352719868,
            "Source": "earnings"
        },
        {
            "Title": "Wanbury Limited Reports Q1 Results, Approves Stock Options Grant and Director Reappointment",
            "Summary": "Wanbury Limited released unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 16,318.40 lakhs and profit after tax of Rs 1,349.05 lakhs for the quarter. The Board approved granting 91,500 stock options to employees under the Wanbury ESOP 2016 scheme, with options vesting over two years and exercisable at Rs 10 per option. The company reappointed Mr. Chandran Krishnamoorthy as Whole-time Director for a five-year term starting September 18, 2025, subject to shareholder approval. Additionally, the Board initiated closure of three foreign subsidiaries in Netherlands, China and UAE, which had not commenced any business operations since incorporation.",
            "Sentiment": "neutral",
            "PublishDate": 1754322590625,
            "Source": "earnings"
        },
        {
            "Title": "Wanbury Launches New Iron Supplement 'Wanbury Cred'",
            "Summary": "Wanbury has introduced a new iron supplement called 'Wanbury Cred'. The product is designed to combat anemia and offers improved safety and absorption compared to other iron supplements. This launch represents Wanbury's effort to address the widespread issue of iron deficiency.",
            "Sentiment": "positive",
            "PublishDate": 1750997358000,
            "Source": "default"
        },
        {
            "Title": "Wanbury Ltd: Secures GMP Certification from Brazil's ANVISA for Maharashtra Facility",
            "Summary": "Wanbury Ltd received GMP certification from Brazil's ANVISA for its Raigad, Maharashtra facility, valid until May 12, 2027. The certification covers production of metformin hydrochloride API. This follows a similar approval for its Tanuku site in Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1747723281000,
            "Source": "normal_news"
        },
        {
            "Title": "Wanbury Receives GMP Certificate from Brazilian FDA for Maharashtra Facility",
            "Summary": "Wanbury has been granted a Good Manufacturing Practices (GMP) certificate, also known as CBPF, by ANVISA, the Brazilian FDA equivalent, for its facility located in Patalganga, Maharashtra. This certification is a recognition of the company's manufacturing standards at the specified location.",
            "Sentiment": "positive",
            "PublishDate": 1747711709000,
            "Source": "default"
        },
        {
            "Title": "Wanbury Reports Q4 Financial Results",
            "Summary": "Wanbury has released its Q4 financial results. The company's EBITDA increased to 296.3 million rupees from 185.2 million rupees year-over-year. The EBITDA margin improved to 17.22% from 13.25% in the same period. Revenue grew to 1.72 billion rupees from 1.39 billion rupees year-over-year. However, consolidated net profit decreased to 202.6 million rupees from 336 million rupees year-over-year, but increased from 12.2 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747326136000,
            "Source": "result"
        },
        {
            "Title": "Wanbury Receives GMP Certificate from ANVISA for Andhra Pradesh Facility",
            "Summary": "Wanbury Limited has obtained a Good Manufacturing Practice (GMP) certificate, also known as CBPF, from ANVISA (Brazilian Health Regulatory Agency) for its manufacturing facility located in Andhra Pradesh, India. This certification is significant for pharmaceutical companies as it allows them to export products to Brazil and potentially expand their market presence in South America.",
            "Sentiment": "positive",
            "PublishDate": 1747039636000,
            "Source": "default"
        },
        {
            "Title": "Wanbury to Implement SAP S/4 HANA Private Cloud Platform",
            "Summary": "Wanbury Limited has announced its intention to implement the SAP S/4 HANA Private Cloud Platform. This move suggests the company is upgrading its enterprise resource planning (ERP) system to a more advanced, cloud-based solution, which could potentially improve its operational efficiency and data management capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1745384231000,
            "Source": "default"
        },
        {
            "Title": "Wanbury Reports Improved Capacity Utilization and Margins in Q4",
            "Summary": "Wanbury Limited has announced updates regarding improved capacity utilization for the fourth quarter, along with enhanced profit margins. This suggests positive operational performance and potentially better financial results for the company in the recent quarter.",
            "Sentiment": "positive",
            "PublishDate": 1743653720000,
            "Source": "earnings"
        },
        {
            "Title": "Wanbury Launches New Hematinic Iron Tablets and Ketamine Hydrochloride API",
            "Summary": "Wanbury Limited has announced the launch of two new products. The first is a branded formulation of hematinic iron tablets called Wanbury C-Red. The second is an Active Pharmaceutical Ingredient (API) product, Ketamine Hydrochloride. This product launch expands Wanbury's portfolio in both the formulation and API segments of the pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1742799775000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wanbury Refinances ₹175 Crore Debt at Lower Interest Rate",
            "Summary": "Wanbury Limited has successfully refinanced ₹175 crore of its existing debt through Emerging India Credit Opportunities Fund II. The new financing comes at an interest rate of 12.5% per annum, which represents a significant reduction in the company's interest burden.",
            "Sentiment": "positive",
            "PublishDate": 1741232122000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wanbury's Tanuku Plant Successfully Completes ANVISA Audit",
            "Summary": "Wanbury Limited has announced the successful completion of an audit by the Brazilian Health Authority (ANVISA) at its plant facility in Tanuku, Andhra Pradesh. This regulatory approval is significant for the company's operations and potential market access in Brazil.",
            "Sentiment": "positive",
            "PublishDate": 1735896886000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wanbury's Tanuku Plant Passes ANVISA Inspection",
            "Summary": "Wanbury Limited announced that its Tanuku plant successfully completed an inspection by ANVISA (Brazilian Health Regulatory Agency) with zero observations. This is a positive development for the company, as it suggests compliance with international regulatory standards and may potentially open up opportunities in the Brazilian market.",
            "Sentiment": "positive",
            "PublishDate": 1734675999000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wanbury Reports Improved Q2 EBITDA and Margin",
            "Summary": "Wanbury, a pharmaceutical company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 200 million rupees from 173 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 12.41% from 12% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731513338000,
            "Source": "result"
        },
        {
            "Title": "Wanbury Reports Q2 Profit and Revenue Growth",
            "Summary": "Wanbury Limited announced its Q2 financial results, showing a net profit of 80 million rupees, up from 74 million rupees year-over-year and 10 million rupees quarter-over-quarter. The company's revenue increased to 1.6 billion rupees from 1.44 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731513282000,
            "Source": "result"
        }
    ]
}