{
    "Symbol": "WCIL",
    "ISIN": "INE0CJF01024",
    "News": [
        {
            "Title": "Western Carriers Q3 & 9MFY26 Earnings Call on Feb 16",
            "Summary": "Western Carriers (India) Ltd announces earnings conference call scheduled for February 16, 2026 at 1:00 PM IST to discuss Q3 & 9MFY26 financial performance for period ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770657050734,
            "Source": "co_actions_results"
        },
        {
            "Title": "Western Carriers Promoter Rajendra Sethia Acquires Additional 1 Lakh Equity Shares",
            "Summary": "Rajendra Sethia, Promoter Chairman and Managing Director of Western Carriers (India) Limited, acquired 1,00,000 equity shares of Rs. 5 face value each representing 0.098% of the company's paid-up capital through open market purchase. Following this acquisition, Sethia's total shareholding in the company stands at 72.650% of the voting rights.",
            "Sentiment": "positive",
            "PublishDate": 1764648389270,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Reports Q2 FY26 Results with 6% Revenue Growth and Reduced Debt",
            "Summary": "Western Carriers (India) Limited reported quarterly revenues of INR 440 crores with 6% quarter-on-quarter growth, while EBITDA remained stable at INR 19 crores with 4.3% margin. The company significantly reduced net debt to INR 8.4 crores from INR 228.55 crores last year and completed INR 30 crores capex in H1 FY26, focusing on specialized containers and heavy equipment.",
            "Sentiment": "positive",
            "PublishDate": 1763980863869,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers Promoter Kanishka Sethia Acquires Additional 1 Lakh Equity Shares",
            "Summary": "Kanishka Sethia, Promoter and Whole-time Director of Western Carriers (India) Limited, acquired 1,00,000 equity shares representing 0.098% of the company's paid-up capital through open market purchase on November 21, 2025. The acquisition increased Sethia's total shareholding from 1,04,920 shares (0.103%) to 2,04,920 shares (0.201%) in the logistics company listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1763969345801,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Promoter Kanishka Sethia Acquires Additional 1 Lakh Equity Shares",
            "Summary": "Kanishka Sethia, Promoter and Whole-time Director, CEO and CFO of Western Carriers (India) Limited, acquired 1,00,000 equity shares representing 0.098% of the company's paid-up share capital through open market purchase on November 21, 2025. The acquisition increased his total shareholding to 2,04,920 shares, representing 0.201% of the company's total equity share capital of 10,19,55,213 shares.",
            "Sentiment": "positive",
            "PublishDate": 1763797788352,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Promoter Rajendra Sethia Acquires Additional 1 Lakh Equity Shares",
            "Summary": "Rajendra Sethia, Promoter Chairman and Managing Director of Western Carriers (India) Limited, acquired 1,00,000 equity shares of Rs. 5 face value each representing 0.098% of the paid-up capital through open market purchase. Following this acquisition, Sethia's total shareholding increased from 72.454% to 72.552% of the company's voting capital.",
            "Sentiment": "positive",
            "PublishDate": 1763704174011,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Reports 47.9% Drop in H1 FY26 PAT Despite Stable Revenue",
            "Summary": "Western Carriers (India) Limited's profit after tax declined 47.9% to ₹19.7 crores in H1 FY26 from ₹37.8 crores in H1 FY25, while revenue remained flat at ₹855.4 crores. The multimodal logistics company's EBITDA margin compressed to 4.6% from 8.4% in the previous year, reflecting operational challenges despite maintaining volume levels at 106,621 TEUs.",
            "Sentiment": "negative",
            "PublishDate": 1763211245562,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers Reports IPO Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "Western Carriers (India) Limited submitted its monitoring agency report on IPO proceeds utilization for the quarter ended September 30, 2025. The company raised Rs 4,928.80 million through its IPO, comprising Rs 4,000 million fresh issue and Rs 928.80 million offer for sale. During the quarter, the company utilized Rs 136.33 million for purchasing commercial vehicles and containers, Rs 52.04 million for general corporate purposes including construction of Private Freight Terminal, and Rs 80.65 million for issue expenses. The company has Rs 1,455.74 million deployed in fixed deposits with HDFC Bank earning 7.50% returns. CRISIL Ratings Limited, the monitoring agency, reported no deviations from stated objectives and confirmed utilization is in line with prospectus disclosures. The company purchased different commercial vehicle models than originally specified due to market conditions and business requirements, which remains consistent with stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762934426429,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Promoter Rajendra Sethia Acquires Additional Equity Shares",
            "Summary": "Western Carriers (India) Limited disclosed that its Promoter, Chairman and Managing Director, Rajendra Sethia, acquired 28,363 equity shares through open market transactions on September 12, 2025. The acquisition represents 0.028% of the company's total issued and paid-up share capital. The disclosure was made under SEBI regulations regarding substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757759839095,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Promoter Rajendra Sethia Acquires Additional Equity Shares",
            "Summary": "Western Carriers (India) Limited disclosed that its Promoter, Chairman and Managing Director, Mr. Rajendra Sethia, acquired 7,404 equity shares through open market transactions on September 11, 2025. The acquisition represents 0.007% of the company's total issued and paid-up share capital. The disclosure was made under SEBI regulations regarding substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757684069652,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Promoter Rajendra Sethia Acquires 178,552 Equity Shares",
            "Summary": "Western Carriers (India) Limited disclosed that Mr. Rajendra Sethia, who serves as Promoter, Chairman and Managing Director, purchased 178,552 equity shares through open market transactions on September 10, 2025. The acquisition represents 0.175% of the company's total issued and paid-up share capital. The disclosure was made under SEBI regulations regarding substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757592551272,
            "Source": "stock"
        },
        {
            "Title": "Western Carriers Promoters Acquire Additional Shares Through Open Market Purchases",
            "Summary": "Two promoters of Western Carriers (India) Limited acquired additional shares through open market purchases on September 5, 2025. Kanishka Sethia, who serves as Promoter, Wholetime Director, CEO and CFO, purchased 100,000 equity shares representing 0.098% of the company's total issued and paid-up share capital. Rajendra Sethia, Promoter and Chairman and Managing Director, acquired 246,053 equity shares representing 0.241% of the total issued and paid-up share capital. The acquisitions were disclosed under SEBI regulations regarding substantial acquisition of shares.",
            "Sentiment": "positive",
            "PublishDate": 1757166057925,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Promoter Rajendra Sethia Acquires 100,000 Equity Shares",
            "Summary": "Western Carriers (India) Limited disclosed that Mr. Rajendra Sethia, who serves as Promoter, Chairman and Managing Director, purchased 100,000 equity shares through open market transactions on September 4, 2025. The acquisition represents 0.098% of the company's total issued and paid-up share capital. The disclosure was made under SEBI regulations regarding substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757098026895,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Makes Earnings Call Audio Recording Available to Investors",
            "Summary": "Western Carriers (India) Limited has made the audio recording of its earnings conference call available to investors and stakeholders. The call discussed the company's operational and financial performance for the quarter ended June 30, 2025, and was held on August 18, 2025, at 10:30 AM IST. The company trades on BSE with scrip code 544258 and on NSE with symbol WCIL. The disclosure was made under SEBI listing regulations, with Sapna Kochar serving as Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1755528822584,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers (India) Reports 43% Decline in Q1 Net Profit to 107.8 Million Rupees",
            "Summary": "Western Carriers (India) reported Q1 net profit of 107.8 million rupees, down from 189.9 million rupees in the previous year. Revenue decreased to 4.16 billion rupees from 4.23 billion rupees year-over-year. EBITDA fell to 208 million rupees compared to 354.5 million rupees in the same period last year. The company's EBITDA margin compressed to 5.0% from 8.39% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755469963710,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers India Reports Decline in Q1 Profitability and Margins",
            "Summary": "Western Carriers India reported Q1 EBITDA of 208 million rupees compared to 354.5 million rupees in the same period last year. The company's EBITDA margin decreased to 5.0% from 8.39% year-over-year. Net profit fell to 107.8 million rupees from 189.9 million rupees in the previous year's corresponding quarter. Revenue declined slightly to 4.16 billion rupees from 4.23 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755171366266,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers Submits IPO Proceeds Monitoring Report for Quarter Ended June 30, 2025",
            "Summary": "Western Carriers (India) Limited submitted a monitoring agency report on the utilization of proceeds from its Initial Public Offer for the quarter ended June 30, 2025. The company raised Rs 4,928.80 million through its IPO conducted from September 13-19, 2024, comprising a fresh issue of Rs 4,000 million and an offer for sale of Rs 928.80 million. Net proceeds after issue expenses totaled Rs 3,629.38 million. During the quarter, the company utilized Rs 111.83 million, bringing total utilization to Rs 2,529.59 million, leaving Rs 1,470.41 million unutilized. The proceeds were allocated toward debt repayment (Rs 1,635 million allocated, none utilized during quarter), capital expenditure for commercial vehicles and containers (Rs 85.51 million utilized during quarter), general corporate purposes (Rs 23.43 million utilized), and issue expenses (Rs 2.89 million). Unutilized funds of Rs 1,455.74 million are invested in fixed deposits with HDFC Bank earning 7.50% returns, with Rs 14.67 million maintained in the public issue account. CRISIL Ratings Limited, the monitoring agency, reported no deviations from stated objectives and confirmed utilization aligns with the offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1754910737362,
            "Source": "stock"
        },
        {
            "Title": "Western Carriers (India) Completes Gati Shakti Multi-Modal Cargo Terminal",
            "Summary": "Western Carriers (India) has announced the completion of construction for its Gati Shakti Multi-Modal Cargo Terminal. This development suggests an expansion of the company's logistics infrastructure, potentially enhancing its cargo handling capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1752159631000,
            "Source": "default"
        },
        {
            "Title": "Western Carriers India Ltd: Shares Surge on Rs 558-Crore Contract Win",
            "Summary": "Western Carriers India Ltd. secured a Rs 558-crore order from Jindal Stainless Ltd. for a three-year logistics contract. The deal involves dispatching steel products across India. The company's share price rose over 11% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750926855000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers: Secures ₹27.73 Crore Order from Jindal Stainless",
            "Summary": "Western Carriers (India) Ltd. has won a ₹27.73 crore order from Jindal Stainless Ltd for container movement inside JSL's Jaipur plant. The two-year contract involves hiring trailers on a trip basis.",
            "Sentiment": "positive",
            "PublishDate": 1749027695000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers (India) Secures ₹28 Crore Order",
            "Summary": "Western Carriers (India) has obtained a new order worth ₹28 crore. The news indicates a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1749023617000,
            "Source": "default"
        },
        {
            "Title": "Western Carriers (India) Reports Q4 Financial Results",
            "Summary": "Western Carriers (India) has released its Q4 financial results. The company's EBITDA decreased to 249 million rupees from 439 million rupees year-over-year. The EBITDA margin declined to 5.81% from 10.93% in the same period last year. Net profit for Q4 fell to 141 million rupees from 242 million rupees year-over-year. However, revenue increased to 4.3 billion rupees from 4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747408515000,
            "Source": "result"
        },
        {
            "Title": "Western Carriers Secures 70 Crore Rupee Order",
            "Summary": "Western Carriers has received an order worth 70 crore rupees. The company's current market capitalization stands at 840 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747296291000,
            "Source": "default"
        },
        {
            "Title": "Western Carriers (India) Reports Q3 Financial Results and Land Development Plan",
            "Summary": "Western Carriers (India) has reported its Q3 financial results, showing a net profit of 132 million rupees, down from 204 million rupees in the same period last year. The company's revenue for Q3 stood at 4.43 billion rupees, compared to 4.6 billion rupees in the previous year. Additionally, Western Carriers announced plans to develop land in Gujarat for container handling operations.",
            "Sentiment": "neutral",
            "PublishDate": 1739146352000,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers Secures Major Contract from Vedanta Ltd",
            "Summary": "Western Carriers has been awarded a significant contract by Vedanta Ltd for railway transportation, CHA (Custom House Agent), and logistics services. The order is valued at 1,089 crore rupees and will span over a four-year period.",
            "Sentiment": "positive",
            "PublishDate": 1739007172000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers Anticipates Double-Digit Growth in Q4 FY24",
            "Summary": "Western Carriers' CEO projects double-digit growth for Q4 FY24, attributing it to recovering export-import volumes and strong domestic performance. The company is focusing on expanding its integrated multimodal logistics model, strengthening client relationships, and improving operational efficiency to maintain long-term growth.",
            "Sentiment": "positive",
            "PublishDate": 1739006955000,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers (India) Reports Significant Decline in Q3 EBITDA",
            "Summary": "Western Carriers (India) has reported a substantial decrease in its Q3 EBITDA, dropping from 373 million rupees to 234 million rupees year-over-year. The company's EBITDA margin also saw a significant reduction, falling from 8.17% to 1.19% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738937846000,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers (India) Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "Western Carriers (India) has announced its financial results for the third quarter. The company's net profit decreased to 132 million rupees from 204 million rupees in the same period last year. Revenue also saw a decline, dropping to 4.43 billion rupees from 4.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738937837000,
            "Source": "earnings"
        },
        {
            "Title": "Western Carriers Secures Rs. 170 Crore Order from Hindustan Zinc",
            "Summary": "Western Carriers has received a significant order worth Rs. 170 crores from Hindustan Zinc. This order represents a major business opportunity for Western Carriers and demonstrates the company's ability to secure large contracts in the industrial sector.",
            "Sentiment": "positive",
            "PublishDate": 1738284145000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers Secures Rs. 170 Crore Order from Hindustan Zinc",
            "Summary": "Western Carriers has obtained a significant order worth Rs. 170 crores from Hindustan Zinc. This substantial contract represents a major business opportunity for Western Carriers and demonstrates Hindustan Zinc's confidence in the company's services or products.",
            "Sentiment": "positive",
            "PublishDate": 1738250761000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers Secures 139 Crore Rupees Order",
            "Summary": "Western Carriers has won a significant order worth 139 crore rupees. The company currently has a market capitalization of 1176 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735875662000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers (India) Secures 23 Crore Rupee Order",
            "Summary": "Western Carriers (India) has won a new order valued at 23 crore rupees (approximately $2.8 million USD). This represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1735283688000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers (India) Secures 80 Million Rupee Order",
            "Summary": "Western Carriers (India) has received a new order valued at 80 million rupees. This order represents a significant business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1735041843000,
            "Source": "order&deals"
        },
        {
            "Title": "Western Carriers (India) Reports Q2 EBITDA Growth",
            "Summary": "Western Carriers (India) has announced its Q2 financial results. The company's EBITDA increased to 361 million rupees, up from 336 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 8.37% from 7.89% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731509766000,
            "Source": "result"
        },
        {
            "Title": "Western Carriers (India) Reports Q2 FY2024 Financial Results",
            "Summary": "Western Carriers (India) has announced its financial results for the second quarter. The company reported a standalone net profit of 190 million rupees, showing a slight increase from 183 million rupees in the same quarter last year and 189 million rupees in the previous quarter. The revenue for Q2 remained stable at 4.3 billion rupees, matching the figure from the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731509679000,
            "Source": "result"
        },
        {
            "Title": "Western Carriers (India) Secures Major Contract from Tata Steel",
            "Summary": "Western Carriers (India) has been selected as the exclusive supply chain partner for Tata Steel. The handling contract is valued at 410 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729168612000,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Carriers Reports Q1 EBITDA Growth",
            "Summary": "<p>Western Carriers has announced its Q1 financial results. The company's <span class='positive'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) <span class='positive'>increased</span> to <b>354 million rupees</b>, up from 314 million rupees in the same quarter last year. Additionally, the Q2 EBITDA margin <span class='positive'>improved</span> to <b>8.37%</b> compared to 7.82% in the previous year's corresponding quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728467192000,
            "Source": "result"
        },
        {
            "Title": "Western Carriers Reports Q1 2023 Financial Results",
            "Summary": "<p>Western Carriers has <span class='positive'>announced</span> its financial results for the first quarter. The company's <span class='positive'>net profit increased</span> to <b>189 million rupees</b> from 174 million rupees in the same period last year. <span class='positive'>Revenue also saw growth</span>, rising to <b>4.23 billion rupees</b> from 4.02 billion rupees year-over-year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728467023000,
            "Source": "result"
        }
    ]
}