{
    "Symbol": "WEALTH",
    "ISIN": "INE658T01017",
    "News": [
        {
            "Title": "Wealth First Reports Q3 FY26 Results & Dividend",
            "Summary": "Wealth First Portfolio Managers Limited announced Q3 FY26 financial results with net profit of Rs. 138.49 lacs and declared third interim dividend of Rs. 4.00 per share for FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1770193223439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wealth First Board Meet on Feb 4 for Q3 Results",
            "Summary": "Wealth First Portfolio Managers schedules board meeting on February 4, 2026 to consider Q3FY26 unaudited results and third interim dividend declaration under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769584765760,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wealth First Portfolio Managers Declares Second Interim Dividend of Rs. 4 Per Share",
            "Summary": "Wealth First Portfolio Managers approved second interim dividend of Rs. 4 per equity share (40% on face value of Rs. 10) for FY 2025-26, totaling approximately Rs. 4.26 crores with record date fixed as November 19, 2025. The company also approved unaudited financial results for the second quarter and half year ended September 30, 2025, and made board composition changes including designation change of Ms. Binal Bhukhanwala Gandhi from Independent to Non-Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1763060607931,
            "Source": "earnings"
        },
        {
            "Title": "Wealth First Portfolio Reports 41% Drop in Q2 Net Profit Despite Expansion Plans",
            "Summary": "Wealth First Portfolio Managers reported Q2 net profit of 89 million rupees, down from 152 million rupees year-over-year, while revenue fell to 181 million rupees from 235 million rupees. The company is pursuing expansion across wealth advisory, PMS, and distribution services with plans to broaden its client base in Tier-II cities and enhance technology integration for scalable growth.",
            "Sentiment": "positive",
            "PublishDate": 1763052172097,
            "Source": "earnings"
        },
        {
            "Title": "Wealth First Portfolio Managers Reports 17% Growth in Net Profit and Revenue",
            "Summary": "Wealth First Portfolio Managers reported net profit of 162 million rupees in Q1, representing growth from 138 million rupees in the same period last year. The company's revenue increased to 248 million rupees compared to 203 million rupees year-over-year. Both key financial metrics showed positive growth trajectories for the portfolio management company.",
            "Sentiment": "positive",
            "PublishDate": 1754307014246,
            "Source": "earnings"
        },
        {
            "Title": "Wealth First Portfolio Managers Receives IRDAI Approval as Direct Insurance Broker",
            "Summary": "Wealth First Portfolio Managers has obtained approval from the Insurance Regulatory and Development Authority of India (IRDAI) to operate as a direct insurance broker.",
            "Sentiment": "positive",
            "PublishDate": 1752216195000,
            "Source": "default"
        },
        {
            "Title": "Wealth First Portfolio Managers Limited: Recovers 24% of Cyber Fraud Amount",
            "Summary": "Wealth First Portfolio Managers Limited has recovered ₹47.41 lakh through a court order, about 24% of the ₹1.98 crore lost in a recent cyber fraud. The company is working with the Cyber Cell to recover the remaining ₹1.50 crore. The fraud occurred on November 27, 2024, and did not impact daily operations or client data.",
            "Sentiment": "neutral",
            "PublishDate": 1735630423000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wealth First Portfolio Managers: Board Recommends Rs 8 Interim Dividend",
            "Summary": "<p>The <span class='neutral'>Board of Directors</span> of <span class='neutral'>Wealth First Portfolio Managers</span> has <span class='positive'>recommended</span> a <b>first interim dividend</b> of <span class='positive'>Rs 8 per equity share (80%)</span> on <b>October 14, 2024</b>, subject to <span class='neutral'>shareholder approval</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728907500000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wealth First Portfolio Managers Reports Strong Q2 Financial Results",
            "Summary": "<p><span class='positive'>Wealth First Portfolio Managers</span> has announced its <b>Q2 financial results</b>. The company's <span class='positive'>net profit increased</span> to <b>152 million rupees</b>, up from 102 million rupees in the same quarter last year. <span class='positive'>Revenue also saw significant growth</span>, reaching <b>235 million rupees</b> compared to 161 million rupees in the previous year's Q2.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728889456000,
            "Source": "result"
        }
    ]
}