{
    "Symbol": "WEBELSOLAR",
    "ISIN": "INE855C01023",
    "News": [
        {
            "Title": "Websol Energy Q3 FY26 Results Show Strong Growth",
            "Summary": "Websol Energy System Limited reported 77.2% YoY revenue growth to Rs. 261 crores in Q3 FY26, with EBITDA margin of 40.8% and PAT margin of 24.8%. Company holds order book of Rs. 1,150 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770303240621,
            "Source": "co_actions_results"
        },
        {
            "Title": "Websol Energy Q3FY26 Earnings Call on Jan 30",
            "Summary": "Websol Energy System Limited announces earnings call on January 30, 2026 at 4:00 PM IST to discuss Q3 and 9M FY26 unaudited financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769528985892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Websol Energy Gets Govt Nod for 4 GW Solar Project",
            "Summary": "Websol Energy System receives Andhra Pradesh government approval for 4 GW greenfield solar cell and module manufacturing facility at MPSEZ, Naidupeta, with incentive package and 100 MW captive solar unit.",
            "Sentiment": "positive",
            "PublishDate": 1768204584966,
            "Source": "stocks"
        },
        {
            "Title": "Websol Energy Gets AP Govt Nod for 4 GW Solar Project",
            "Summary": "Websol Energy System receives official approval from Andhra Pradesh government for its greenfield 4 GW solar cell and module manufacturing project at MPSEZ, Naidupeta, with comprehensive incentive package.",
            "Sentiment": "positive",
            "PublishDate": 1768187865728,
            "Source": "stocks"
        },
        {
            "Title": "Websol Energy Gets Nod for 4 GW Solar Plant in AP",
            "Summary": "Andhra Pradesh government approves Websol Energy System's ambitious plan to establish a 4 GW solar cell and module manufacturing expansion facility at MPSEZ Naidupeta, marking a significant step in renewable energy infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1768180828794,
            "Source": "stocks"
        },
        {
            "Title": "Websol Energy Gets CRISIL BBB+/Stable Rating",
            "Summary": "CRISIL assigns BBB+/Stable rating to Websol Energy System's ₹150 crore credit facilities including cash credit and term loan arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1767245767242,
            "Source": "stocks"
        },
        {
            "Title": "Websol Energy rallies 14% on Rs 73 cr tax relief",
            "Summary": "Websol Energy System shares surged 14.1% to Rs 97.55 after winning a major tax appeal, eliminating a Rs 73.04 crore demand from assessment year 2017-18. The stock remains down 46% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766587388179,
            "Source": "stocks"
        },
        {
            "Title": "Websol Energy Wins ₹73 Crore Tax Appeal Case",
            "Summary": "Websol Energy System successfully wins major tax appeal worth ₹73 crores, removing significant financial liability from company books and strengthening financial position.",
            "Sentiment": "positive",
            "PublishDate": 1766546982991,
            "Source": "stocks"
        },
        {
            "Title": "Websol Energy System Partners with Linton for PV Ingot and Wafer Production in India",
            "Summary": "Websol Energy System has signed an agreement with Linton to explore photovoltaic ingot and wafer production capabilities in India. The partnership aims to strengthen backward integration within the solar supply chain, potentially reducing dependency on external suppliers for critical solar manufacturing components.",
            "Sentiment": "positive",
            "PublishDate": 1764660026904,
            "Source": "stock"
        }
    ]
}