{
    "Symbol": "WEIZMANIND",
    "ISIN": "INE080A01014",
    "News": [
        {
            "Title": "Weizmann Limited Q3FY26 Results Show Strong Growth",
            "Summary": "Weizmann Limited reported Q3FY26 net profit of Rs. 270.16 lakhs, up from Rs. 236.92 lakhs in Q3FY25. Nine-month profit reached Rs. 638.12 lakhs versus Rs. 569.08 lakhs last year.",
            "Sentiment": "positive",
            "PublishDate": 1770913370311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Weizmann Limited Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Weizmann Limited announces board meeting scheduled for February 12, 2026, to consider and adopt unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769863878835,
            "Source": "co_actions_results"
        },
        {
            "Title": "Weizmann Limited Reports 29.7% Revenue Growth in Q2 FY26",
            "Summary": "Weizmann Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs 3,587.78 lakhs for the quarter compared to Rs 2,998.86 lakhs in the previous quarter, marking a 19.6% sequential growth. For the half-year period, revenue reached Rs 6,586.64 lakhs versus Rs 5,241.58 lakhs in the corresponding period last year, representing a 25.7% year-on-year increase. Net profit for the quarter stood at Rs 207.80 lakhs compared to Rs 160.16 lakhs in the previous quarter. Half-year net profit was Rs 367.96 lakhs against Rs 332.16 lakhs in the same period last year. Basic earnings per share for the quarter was Rs 1.34 and Rs 2.37 for the half-year. The company operates primarily in textile processing and manufacturing. The board meeting was held on November 12, 2025, and the results were subject to limited review by statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1762980789733,
            "Source": "earnings"
        },
        {
            "Title": "Weizmann Limited Sets Record Date for Dividend Payment",
            "Summary": "Weizmann Limited has established Thursday, September 18, 2025, as the record date for dividend payment, subject to declaration at the Annual General Meeting. The company communicated this decision through a letter dated September 15, 2025, signed by Company Secretary Ami Purohit. Weizmann Limited trades on NSE under symbol WEIZMANIND and on BSE with scrip code 523011.",
            "Sentiment": "neutral",
            "PublishDate": 1757945183879,
            "Source": "corporate_action"
        },
        {
            "Title": "Weizmann Ltd Reports 16% Drop in Annual Profit, Recommends 5% Dividend",
            "Summary": "Weizmann Ltd announced its audited financial results for the quarter and year ended March 31, 2025. The company reported a net profit of Rs 800.97 lakhs for the year, compared to Rs 957.70 lakhs in the previous year, representing a decline of approximately 16%. Revenue from operations decreased to Rs 11,724.53 lakhs from Rs 12,290.41 lakhs in the prior year. The Board recommended a dividend of 5% (Rs 0.50 per equity share of Rs 10 face value) subject to shareholder approval. The company completed a buyback of 3,65,169 equity shares at Rs 160 per share for Rs 584.27 lakhs during the year. Additionally, the Board appointed M/s Martinho Ferrao & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company operates primarily in textile processing and manufacturing.",
            "Sentiment": "negative",
            "PublishDate": 1757137377020,
            "Source": "earnings"
        },
        {
            "Title": "Weizmann Limited Appoints New Independent Director and Reports Q1 FY2026 Results",
            "Summary": "Weizmann Limited appointed Shri. Suryanarayanarao Narendra as Additional Director and Non-Executive Independent Director for a five-year term effective August 12, 2025, subject to shareholder approval. The 63-year-old appointee holds a Post-Graduate degree in Economics from Mysore University with over 30 years of experience in Housing Finance. The company also approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, revenue from operations was Rs. 2,998.86 lakhs with net profit of Rs. 160.16 lakhs and basic earnings per share of Rs. 1.03. On consolidated basis, the company reported net profit of Rs. 120.30 lakhs with basic earnings per share of Rs. 0.78. The Audit Committee was reconstituted to include the new director, and Shri. Suryanarayanarao Narendra will become Chairman of the Audit Committee after the current chairman's term expires at the upcoming Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1754997404973,
            "Source": "corporate_governance"
        }
    ]
}