{
    "Symbol": "WEL",
    "ISIN": "INE02WG01024",
    "News": [
        {
            "Title": "Wonder Electricals Q3FY26 Results & Interim Dividend",
            "Summary": "Wonder Electricals announced Q3FY26 financial results for quarter ended December 31, 2025, declared 10% interim dividend of ₹0.10 per share, and appointed new independent director.",
            "Sentiment": "positive",
            "PublishDate": 1770808258902,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wonder Electricals Reports Strong Growth in FY25",
            "Summary": "Wonder Electricals expands product portfolio with electric heaters and ventilating fans while achieving impressive financial growth. Revenue surged to ₹894.5 crore in FY25 from ₹306 crore in FY21.",
            "Sentiment": "positive",
            "PublishDate": 1770194817230,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wonder Electricals clarifies trading volume surge",
            "Summary": "Wonder Electricals Limited responds to NSE inquiry about significant trading volume increase, stating it appears market-driven and beyond company control while confirming regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768804764163,
            "Source": "stocks"
        },
        {
            "Title": "Wonder Electricals Independent Director Passes Away",
            "Summary": "Wonder Electricals Limited announces the demise of Independent Director Mr. Jugal Kishore Chugh on January 04, 2026, with corrected disclosure under SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1767705934209,
            "Source": "stocks"
        },
        {
            "Title": "Wonder Electricals Reports Mixed Financial Performance in Q2 Results",
            "Summary": "Wonder Electricals Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company's board meeting was held on November 12, 2025, where the results were approved. The company operates primarily in manufacturing of electrical appliances as a single business segment. During the year, the company established a Limited Liability Partnership firm named Integrated Motion Control LLP with 51% shareholding, which will manufacture PCB cards for ceiling fans and electronic products. However, operations of the LLP had not commenced by September 30, 2025. The statutory auditors conducted a limited review of the unaudited financial results and issued an unqualified opinion. The company's financial statements show various line items including assets, liabilities, revenue, and cash flows, though specific performance metrics and growth figures require detailed analysis of the numerical data presented.",
            "Sentiment": "neutral",
            "PublishDate": 1762935301921,
            "Source": "earnings"
        },
        {
            "Title": "Wonder Electricals Reports Mixed Q2 Results with Revenue Decline and EBITDA Growth",
            "Summary": "Wonder Electricals reported Q2 net profit of 2.5 million rupees, down from 5.5 million rupees in the same quarter last year. Revenue decreased to 925 million rupees from 1.3 billion rupees year-over-year. However, EBITDA improved to 43 million rupees from 35 million rupees, with EBITDA margin expanding to 4.5% from 2.7% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762934589216,
            "Source": "earnings"
        },
        {
            "Title": "Wonder Electricals Enters PCB Manufacturing with 51% Stake in New Entity",
            "Summary": "Wonder Electricals Ltd. has established Integrated Motion & Control LLP for PCB manufacturing, holding 51% equity in the venture. The company plans to complete machinery installation by end of October 2025, with trials in November-December 2025 and commercial production beginning in the fourth quarter. The first phase will focus on BLDC Motor Controllers for consumer and industrial applications, including ceiling fans, inverter fans, table fans, wall fans, induction fans, cooler motors, and industrial circulators. A state-of-the-art factory is under construction to support the expansion. The company expects 40-50% growth in the BLDC segment and aims to enhance its product portfolio and profitability through this diversification into energy-efficient power solutions for domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1758786245800,
            "Source": "stock"
        },
        {
            "Title": "Wonder Electricals Reports Quarterly Results for June 2025",
            "Summary": "Wonder Electricals Limited released unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 23,136.11 lakhs compared to Rs. 15,475.05 lakhs in the same quarter last year. Profit after tax increased to Rs. 110.68 lakhs from Rs. 178.41 lakhs in the previous quarter. The company's earnings per share stood at Rs. 0.08 for the quarter. Wonder Electricals established a Limited Liability Partnership called Integrated Motion & Control LLP on April 2, 2025, with 51% shareholding. The LLP will manufacture PCB cards for ceiling fans and electronic products at a facility in SIDCUL, Haridwar, though operations had not commenced by June 30, 2025. The company operates in a single business segment of manufacturing electrical goods.",
            "Sentiment": "neutral",
            "PublishDate": 1754984112325,
            "Source": "earnings"
        },
        {
            "Title": "Wonder Electricals Reports 38% Decline in Q1 Net Profit Despite Improved Margins",
            "Summary": "Wonder Electricals reported Q1 net profit of 11 million rupees, down from 17.8 million rupees in the same period last year. Revenue declined to 1.5 billion rupees from 2.3 billion rupees year-over-year. EBITDA decreased to 48 million rupees from 61 million rupees, though EBITDA margin improved to 3.13% from 2.65% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754983186244,
            "Source": "earnings"
        },
        {
            "Title": "Wonder Electricals to Launch 640-Kilowatt Solar Power Plant",
            "Summary": "Wonder Electricals is set to commence commercial operations of a 640-kilowatt solar power plant in Roorkee, Uttarakhand. The company plans to start operations within the next 15 days.",
            "Sentiment": "positive",
            "PublishDate": 1750842234000,
            "Source": "default"
        },
        {
            "Title": "Wonder Electricals Reports Improved Q4 EBITDA and Margin",
            "Summary": "Wonder Electricals has reported its Q4 financial results. The company's EBITDA increased to 175 million rupees from 136 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 5.61% from 5.26% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748075967000,
            "Source": "result"
        },
        {
            "Title": "Wonder Electricals Reports Q4 Financial Results",
            "Summary": "Wonder Electricals has announced its Q4 financial results. The company's net profit increased to 92 million rupees from 65 million rupees in the same quarter last year. Revenue for Q4 rose to 3.1 billion rupees from 2.59 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748075839000,
            "Source": "result"
        }
    ]
}