{
    "Symbol": "WELCORP",
    "ISIN": "INE191B01025",
    "News": [
        {
            "Title": "Welspun Corp Q3FY26 Results: Revenue Jumps 25.4%",
            "Summary": "Welspun Corp reported strong Q3FY26 performance with consolidated revenue rising 25.4% YoY to Rs 4,532.48 crores. Net profit reached Rs 456.36 crores while steel products segment drove growth.",
            "Sentiment": "positive",
            "PublishDate": 1769762747680,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Corp Ranks 5th Globally in Steel Sustainability",
            "Summary": "Welspun Corp Limited achieves 5th global ranking and 2nd position in India in S&P Global's Corporate Sustainability Assessment 2025, with ESG score improving to 78 from 73.",
            "Sentiment": "positive",
            "PublishDate": 1769700613499,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Corp Board Meet Set for Jan 30 for Q3 Results",
            "Summary": "Welspun Corp Limited has scheduled its Board of Directors meeting for January 30, 2026, to consider and approve Q3FY26 financial results. Trading window remains closed until February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769005651412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Corp to Acquire Remaining 2.57% Stake in WMHL",
            "Summary": "Welspun Corp approves purchase of 2.57% stake in Welspun Mauritius Holdings from Welspun Pipes Inc for up to $5.96 million, making WMHL a fully owned subsidiary through this strategic acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1768794897045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Corp Plans ₹5000 Cr Investment in Pipes",
            "Summary": "Chairman BK Goenka announces massive ₹5000 crore investment to expand pipeline business, targeting world's largest pipe manufacturer status by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1768189390738,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Corp wins new export contract, global order book at ₹23,460 cr",
            "Summary": "Welspun Corp secures new Americas export order for large diameter coated line pipes, consolidating global order book at ₹23,460 crores with business visibility until FY28.",
            "Sentiment": "positive",
            "PublishDate": 1767755223831,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Corp Completes ₹108.96 Cr Subsidiary Acquisition",
            "Summary": "Welspun Corp Limited has completed the acquisition of 4.11% equity shares in subsidiary Welspun Specialty Solutions Limited for ₹108.96 crores, increasing its shareholding from 51.06% to 55.17%.",
            "Sentiment": "positive",
            "PublishDate": 1766408977117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Corp Forms New Global Investment Subsidiary",
            "Summary": "Welspun Corp has established a new subsidiary called 'Welspun Global Holdings Ltd' to manage its worldwide investments and expand its global operational footprint.",
            "Sentiment": "positive",
            "PublishDate": 1765462731747,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Corp Incorporates Dubai DIFC Subsidiary",
            "Summary": "Welspun Corp has incorporated Welspun Global Holdings Limited in Dubai International Financial Centre as a wholly owned subsidiary to serve as an investment holding company for global investments.",
            "Sentiment": "positive",
            "PublishDate": 1765418332254,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Corp Unit Secures Rs 11.7 Billion Order from Saudi Water Authority",
            "Summary": "Welspun Corp's subsidiary has won a significant contract worth Rs 11.7 billion from the Saudi Water Authority. This major order win strengthens the company's presence in the Middle East water infrastructure sector and adds substantial value to its order book.",
            "Sentiment": "positive",
            "PublishDate": 1765237751328,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Corp Allots 1.83 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Welspun Corp allotted 1,83,750 equity shares of Rs. 5 each to employees who exercised stock options under the Employee Stock Option Plan 2005. The company's paid-up equity share capital increased from Rs. 131.80 crores to Rs. 131.90 crores, with total shares rising to 26,37,90,645.",
            "Sentiment": "neutral",
            "PublishDate": 1764936038059,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp Gets Rating Reaffirmation from CARE and CRISIL on Commercial Paper Enhancement",
            "Summary": "CARE Ratings and CRISIL have reaffirmed their ratings on Welspun Corp's financial instruments, with commercial paper limit enhanced from Rs. 500 crore to Rs. 600 crore. The ratings reflect the company's strong business profile in steel pipes, healthy order book of Rs. 23,500 crore, and improved financial metrics with reduced debt levels.",
            "Sentiment": "positive",
            "PublishDate": 1764683548089,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp Files $35.5-43.5 Million Arbitration Claim in London Against Wasco Entities",
            "Summary": "Welspun Corp has filed an arbitration claim in London seeking $35.5-43.5 million from Wasco Entities for a missed investment opportunity in Qatar. The legal action represents a significant financial dispute that could impact Welspun Corp's financial position depending on the arbitration outcome.",
            "Sentiment": "negative",
            "PublishDate": 1764119826414,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Reports 53% Jump in Quarterly Profit, Announces Investor Day Presentation",
            "Summary": "Welspun Corp held its Investor Day presentation on November 13, 2025, showcasing strong quarterly financial performance. The company reported profit after tax of INR 440 crores, representing a 53% year-on-year increase from INR 287 crores in the previous year. EBITDA grew 36% to INR 626 crores from INR 462 crores year-on-year. The company maintains a net cash position of INR 11 crores after spending INR 950 crores on capital expenditure. Welspun operates across multiple segments including line pipes, ductile iron pipes, and stainless steel products, with manufacturing facilities in India, USA, and KSA. The company holds an order book valued at INR 23,500 crores and has received credit ratings of AA with stable outlook for long-term facilities from CRISIL and CARE. Management provided growth guidance of 10-12% CAGR over three years with EBITDA margins of 22-23% and ROCE targets of 25%.",
            "Sentiment": "positive",
            "PublishDate": 1763011202136,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Executive Expresses Confidence in Exceeding Financial Estimates",
            "Summary": "An executive at Welspun Corp has expressed confidence that the company will exceed its financial estimates.",
            "Sentiment": "positive",
            "PublishDate": 1762751657428,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp to Establish Step-Down Subsidiary for Treasury Operations in Gujarat IFSC",
            "Summary": "Welspun Corp Limited announced the incorporation of a new step-down wholly owned subsidiary through its subsidiary Welspun Mauritius Holdings Limited. The proposed company, to be named Welspun Global IFSC Limited, will be incorporated in Gujarat International Finance Tec-City, India, to undertake global and regional corporate treasury center activities within the International Financial Services Centre framework. Welspun Mauritius Holdings Limited will hold 100% shareholding in the new entity, making it a step-down subsidiary of Welspun Corp. The incorporation is subject to approval from the Ministry of Corporate Affairs, and subscription of shares will be through cash consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1762473151451,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp Commences Operations of New 200 KMTPA Ductile Iron Pipes Facility",
            "Summary": "Welspun Corp has started operations of its new manufacturing facility with a capacity of 200 KMTPA (thousand metric tonnes per annum) for ductile iron pipes. The company began operations at this expanded capacity facility.",
            "Sentiment": "positive",
            "PublishDate": 1762439949697,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Guides for ₹23,500 Cr Order Book Execution in FY26-27 with 15-18% Revenue Growth",
            "Summary": "Welspun Corp has provided guidance for executing a record ₹23,500 crore order book in FY26-27. The execution will be driven by line pipes, DI pipes, and stainless steel expansion. The company expects margin improvements from U.S. order wins and water infrastructure projects. Strong global demand is expected to support revenue growth of 15-18%.",
            "Sentiment": "positive",
            "PublishDate": 1761835286012,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Q2 Net Profit Surges 53% to ₹439 Crore on Strong Revenue Growth",
            "Summary": "Welspun Corp reported consolidated net profit of ₹439 crore for the second quarter, marking a 53.2% year-on-year increase from ₹287 crore. Revenue grew 32.5% to ₹4,373 crore from ₹3,301.8 crore, while EBITDA rose 47.7% to ₹590.8 crore. EBITDA margin improved to 13.5% from 12.1% in the same period last year. The company announced acquisition of 2.72 crore equity shares representing 4.11% of Welspun Specialty Solutions Ltd from the promoter group, increasing its subsidiary holding from 51.06% to 55.17%. Welspun Corp plans to establish a wholly owned subsidiary in Dubai International Financial Centre as an investment holding company for global investments, subject to regulatory approvals. Shares closed at ₹928.70, up 2.42% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1761821967530,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp Reports Strong Q2 Growth with 54% Jump in Net Profit",
            "Summary": "Welspun Corp delivered robust quarterly results with consolidated net profit rising to 4.4 billion rupees from 2.86 billion rupees year-over-year. Revenue increased significantly to 43.73 billion rupees compared to 33 billion rupees in the same period last year. EBITDA grew to 5.91 billion rupees from 3.99 billion rupees, while EBITDA margin improved to 13.52% from 12.1% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761819320385,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp's US Subsidiary Wins $715 Million Line Pipe Orders, Order Book Reaches Record ₹23,500 Crores",
            "Summary": "Welspun Corp's US subsidiary has secured two major line pipe orders worth $715 million for natural gas and NGL pipeline projects. The company's consolidated order book has reached a record high of approximately ₹23,500 crores following these contract wins.",
            "Sentiment": "positive",
            "PublishDate": 1761795579999,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Schedules Q2&H1FY26 Earnings Conference Call",
            "Summary": "Welspun Corp Limited has announced an earnings conference call to discuss its Q2&H1FY26 results, scheduled for Friday, October 31, 2025 at 10:00 AM IST. The call will be hosted by JM Financial Institutional Securities and will feature key company participants including Managing Director and CEO Vipul Mathur, CFO Percy Birdy, and Director Yashovardhan Agarwal from Sintex. The company has provided multiple dial-in numbers for domestic and international participants across USA, UK, Singapore, and Hong Kong. Participants are advised to dial-in 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1761576083958,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp Appoints Rakesh Mehta as Chief Human Resource Officer",
            "Summary": "Welspun Corp Limited appointed Rakesh Mehta as Chief Human Resource Officer (CHRO), effective October 13, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Simultaneously, Bindu Nambiar will no longer be considered Senior Management Personnel but will continue as Vice President - HR due to organizational structure changes. Mehta brings nearly three decades of HR experience across leading Indian conglomerates including Uno Minda, JSW Energy, Reliance Industries, General Motors, Asian Paints and Crompton Greaves. He has expertise in cultural transformation, industrial relations, mergers & acquisitions, and has managed large-scale workforce integrations across 70+ plants globally. Mehta is an alumnus of Symbiosis Institute of Business Management, Pune.",
            "Sentiment": "positive",
            "PublishDate": 1760350156893,
            "Source": "corporate_governance"
        },
        {
            "Title": "Welspun Corp Secures ₹1,600 Crore Export Contract for Large Diameter Line Pipes",
            "Summary": "Welspun Corp has secured a new export contract worth ₹1,600 crore for large diameter line pipes. Following this contract, the company's total global orders have reached ₹18,000 crore. These orders are scheduled to be completed in FY26 and FY27.",
            "Sentiment": "positive",
            "PublishDate": 1758878986941,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Completes Divestment from Nauyaan Shipyard with Sale of Remaining 6.1% Stake for Rs. 45.32 Crores",
            "Summary": "Welspun Corp Limited sold its remaining 6.1% equity stake in Nauyaan Shipyard Private Limited to Nauyaan Tradings Private Limited for Rs. 45.32 crores, completing its full exit from the company. The buyer, Nauyaan Tradings Private Limited, is a wholly-owned subsidiary of Reliance Strategic Business Ventures Limited and is not part of Welspun's promoter group. The transaction was completed on August 22, 2025. Nauyaan Shipyard contributed 0.12% to Welspun's total income, 0.38% to profit before tax, and 0.11% to net worth based on the latest financial year. Welspun Corp no longer holds any shares in Nauyaan Shipyard following this divestment.",
            "Sentiment": "neutral",
            "PublishDate": 1755876888064,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp's US Manufacturing Base Shields Company from Tariff Impact",
            "Summary": "Welspun Corp shares dropped nearly 7% following Trump's tariff announcement, but management states the company remains unaffected due to its localized US production. MD Vipul Mathur emphasized that Welspun operates as a local producer in America through its Arkansas facility, with tariffs potentially helping rather than hampering the business. The company maintains a strong order book of ₹19,000 crore, providing revenue visibility for eight quarters in the US and four quarters domestically. Welspun is expanding through a joint venture with Saudi Aramco for a new plant in Dammam with 350,000 metric tonnes annual capacity, targeted for commissioning by end of FY26. The company is also expanding into new Indian regions including Chhattisgarh, Punjab, Goa, Odisha, and Telangana. Despite ₹450 crore capital expenditure in the June quarter, Welspun remains net-cash positive and has set FY26 targets of ₹17,500 crore revenue and ₹2,200 crore operating profit. JM Financial issued a price target of ₹1,180, representing 35% upside from the closing price of ₹875.",
            "Sentiment": "positive",
            "PublishDate": 1754442767289,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Reports 41% Jump in Net Profit to ₹349 Crores for Q1 FY26",
            "Summary": "Welspun Corp Limited reported net profit of ₹349.16 crores for the quarter ended June 30, 2025, compared to ₹247.94 crores in the same quarter last year. Revenue from operations increased to ₹3,551.49 crores from ₹3,137.23 crores year-on-year. The company's operating EBIDTA margin improved to 16.21% from 13.84% in the previous year quarter. Net profit margin stood at 9.83% compared to 7.90% in the corresponding quarter. The company allotted 8,72,500 equity shares during the quarter upon exercise of Employee Stock Options, increasing paid-up equity capital to ₹131.61 crores. Welspun Corp also sold additional 10% equity shares in Nauyaan Shipyard Private Limited for ₹51.72 crores, resulting in an exceptional gain. The debt-equity ratio remained low at 0.13 times.",
            "Sentiment": "positive",
            "PublishDate": 1753782666959,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp Reports Strong Q1 Growth with Revenue Rising to 35.5B Rupees",
            "Summary": "Welspun Corp delivered strong quarterly results with revenue increasing to 35.5 billion rupees from 31.4 billion rupees in the same period last year. The company's EBITDA grew significantly to 5.25 billion rupees compared to 3.74 billion rupees year-over-year, while EBITDA margin improved to 14.78% from 11.92%. Consolidated net profit also showed substantial growth, reaching 3.5 billion rupees versus 2.48 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753781322534,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp Secures ₹735 Crore Additional Order, Order Book Reaches ₹19,000 Crore",
            "Summary": "Welspun Corp has received an additional order worth ₹735 crore for its Little Rock facility. Following this new order, the company's total consolidated order book has reached ₹19,000 crore. The order strengthens Welspun Corp's business pipeline and adds to its existing project commitments.",
            "Sentiment": "positive",
            "PublishDate": 1753770908165,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Corp Increases US Order Value by Rs 735 Crore, Total Order Book Reaches Rs 19,000 Crore",
            "Summary": "Welspun Corp Limited announced an upsizing of an existing coated spiral pipe order for their Little Rock facility in USA, increasing the order value by Rs 735 Crore. The upsizing involves expanding the pipe diameter from 36 inches to 42 inches. The company's consolidated order book now stands at approximately Rs 19,000 Crore, with execution planned for FY26 and FY27. The company stated these wins reinforce their leading market share in the USA oil and gas transmission space, with a positive outlook for the US market in coming years.",
            "Sentiment": "positive",
            "PublishDate": 1753770861220,
            "Source": "stock"
        },
        {
            "Title": "Welspun Corp Sells 9.9% Stake in Nauyaan Shipyard for ₹547 Million",
            "Summary": "Welspun Corp has divested a 9.9% stake in Nauyaan Shipyard for ₹547 million. The transaction represents a strategic divestment by the infrastructure company in the shipyard business.",
            "Sentiment": "neutral",
            "PublishDate": 1753284151552,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Corp Schedules Q1FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "Welspun Corp Limited has scheduled an earnings conference call to discuss Q1FY26 results on July 30, 2025 at 10:00 AM IST. The call will be hosted by JM Financial Institutional Securities and will feature key company executives including Managing Director and CEO Vipul Mathur, CFO Percy Birdy, Sintex BAPL CEO Ashish Prasad, and other senior management members from investor relations. The conference call will be accessible through multiple dial-in numbers for domestic and international participants across USA, UK, Singapore, and Hong Kong, with participants advised to dial-in 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1753281429499,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp: Multibagger Stock Soars 1000% in Five Years",
            "Summary": "Welspun Corp shares have rallied over 1000% in the last five years. The company recently secured a repeat export order for LSAW Pipes and Bends worth Rs 450 crore. Management projects 25% revenue growth to Rs 17,500 crore for FY2026, with Ebitda expected to grow 18% to Rs 2,200 crore. All six analysts tracked by Bloomberg have a 'buy' rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1750747548000,
            "Source": "normal_news"
        },
        {
            "Title": "Welspun Corp: Secures 50 km Pipe Export Order for Middle East Project",
            "Summary": "Welspun Corp won a repeat export order for 50 km of LSAW pipes and bents for a critical offshore project in the Middle East. The company received additional orders worth ₹450 crore for its India pipes facility, to be executed in FY26 and FY27. Welspun is investing ₹1,000 crore in capacity expansion, particularly for HFIW and LSAW pipe segments. The board recommended a final dividend of ₹1.7 per equity share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1749094621000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Corp Secures New Export Order for LSAW Pipes",
            "Summary": "Welspun Corp has secured an additional export order for 50 kilometers of LSAW pipes and bends for a Middle East offshore initiative. The company has acquired new orders totaling ₹450 crore since May 7.",
            "Sentiment": "positive",
            "PublishDate": 1749092032000,
            "Source": "default"
        },
        {
            "Title": "Welspun Corp: Q4 Profit Soars 143%, Orderbook Exceeds Rs 19,500 Crore",
            "Summary": "Welspun Corp Ltd reported a 143% increase in Q4 net profit to Rs 699.19 crore. The company's orderbook surpassed Rs 19,500 crore. A final dividend of Rs 5 per share was recommended. FY26 revenue guidance set at Rs 17,500 crore, 25% higher than FY25. The company plans investments of Rs 5,482 crore across India, US, and Saudi Arabia.",
            "Sentiment": "positive",
            "PublishDate": 1748492053000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp Announces FY26 Guidance with Projected Revenue and EBITDA Growth",
            "Summary": "Welspun Corp has provided guidance for FY26, projecting revenue of Rs 17,500 crore, which represents a 25% growth. The company also forecasts EBITDA at Rs 2,200 crore, indicating an 18% increase. This information was shared in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1748486117000,
            "Source": "default"
        },
        {
            "Title": "Welspun Corp Reports Q4 Results and Dividend Recommendation",
            "Summary": "Welspun Corp announced its Q4 consolidated net profit of 6.98 billion rupees, compared to 2.68 billion rupees year-over-year and 6.74 billion rupees quarter-over-quarter. Q4 revenue was 39.24 billion rupees, down from 44.61 billion rupees year-over-year. The company recommended a dividend of 5 rupees per equity share. An exceptional item of 4.8 billion rupees was reported. Q4 profit before tax (PBT) was 3.3 billion rupees, up from 2.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748477279000,
            "Source": "default"
        },
        {
            "Title": "Welspun Corp Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Welspun Corp announced its Q4 financial results, showing significant growth. The company reported a consolidated net profit of 6.98 billion rupees, up from 2.68 billion rupees year-over-year. Q4 revenue was 39.24 billion rupees, down from 44.61 billion rupees in the previous year. EBITDA increased to 4.6 billion rupees from 3.3 billion, with the EBITDA margin improving to 11.75% from 7.4%. The company also reported an exceptional item of 4.8 billion rupees and a profit before tax of 3.3 billion rupees. Additionally, Welspun Corp recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748445680000,
            "Source": "result"
        },
        {
            "Title": "Welspun Corp: Secures ₹1,950 Crore in New Pipe Orders",
            "Summary": "Welspun Corp has won additional orders worth ₹1,950 crore for its India pipes facility since February 5, 2025. This includes an export order for coated LSAW line pipes and bends. The company's consolidated global order book now stands at ₹19,300 crore, with execution planned for FY26 and FY27.",
            "Sentiment": "positive",
            "PublishDate": 1746589055000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Corp Secures Export Order for Coated LSAW Line Pipes and Bends",
            "Summary": "Welspun Corp has won a significant export order for the supply of coated LSAW (Longitudinally Submerged Arc Welded) line pipes and bends from India. This order is described as prestigious, indicating its importance to the company's business operations and potential impact on its export performance.",
            "Sentiment": "positive",
            "PublishDate": 1746588233000,
            "Source": "default"
        },
        {
            "Title": "Welspun Corp: Expansion and Diversification Drive Growth Prospects",
            "Summary": "Welspun Corp expands into building materials, plans plastic pipes launch, and announces ₹1,660 crore expansion in Saudi Arabia. The company has a strong order book of ₹20,000 crore, with 60% from the high-margin US market. Management guides for FY2025 EBITDA of ₹1,700 crore, with potential upside. Stock up 22.19% in the past month.",
            "Sentiment": "positive",
            "PublishDate": 1743588068000,
            "Source": "normal_news"
        },
        {
            "Title": "Welspun Corp Approves Delisting from Calcutta Stock Exchange and Completes Transaction with Strategic Investor",
            "Summary": "Welspun Corp's board has approved voluntary delisting from the Calcutta Stock Exchange while maintaining listings on BSE and NSE. The company has also completed a transaction with a strategic investor in NSPL, receiving 4.76 billion rupees from the deal.",
            "Sentiment": "positive",
            "PublishDate": 1742775332000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp Completes Transaction with Strategic Investor in NSPL",
            "Summary": "Welspun Corp has successfully completed a transaction with a strategic investor in NSPL (presumably Nextgen Specialty Pipes Limited). The company has received 4.76 billion rupees (approximately $57.5 million USD) from this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1742566324000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp to Delist from Calcutta Stock Exchange",
            "Summary": "Welspun Corp's board has approved the voluntary delisting of the company from the Calcutta Stock Exchange. The company will continue to remain listed on the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE).",
            "Sentiment": "neutral",
            "PublishDate": 1742564324000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp Secures Major Pipeline Order in USA",
            "Summary": "Welspun Corp has won a significant order worth 2400 crore rupees for supplying coated pipes for natural gas pipeline projects in the United States. This new order has boosted the company's consolidated order book to approximately 20,000 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742181065000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Corp Secures Major Pipe Orders in USA",
            "Summary": "Welspun Corp has secured pipe orders worth ₹3,000 crore in the United States. This new acquisition has boosted the company's consolidated order book to ₹18,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739761798000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Corp's Associate Company to Establish New Production Line",
            "Summary": "East Pipes Integrated Company, an associate of Welspun Corp, has signed contracts to set up a new production line for helical submerged arc welded pipes at its Dammam factory. The project is estimated to cost 113 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739155696000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Corp Reports Strong Demand and Booking Outlook",
            "Summary": "Welspun Corp has announced that demand for their products remains strong for the next 2-3 years. Their India DI (Ductile Iron) plant is fully booked for the next 5 quarters, indicating a robust order book and positive business outlook.",
            "Sentiment": "positive",
            "PublishDate": 1738821567000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Corp Reports Q3 Results and Announces Corporate Actions",
            "Summary": "Welspun Corp reported a significant increase in Q3 consolidated net profit to 6.75 billion rupees, up from 2.9 billion rupees year-over-year. However, revenue decreased to 36.14 billion rupees from 48 billion rupees in the same period. The company approved the sale of its 19% stake in Welassure to Rakshak Securitas. Additionally, Welspun Corp plans to invest 2.50 billion rupees in its subsidiary, Welspun Specialty Solutions.",
            "Sentiment": "positive",
            "PublishDate": 1738801325000,
            "Source": "result"
        }
    ]
}