{
    "Symbol": "WELENT",
    "ISIN": "INE625G01013",
    "News": [
        {
            "Title": "Welspun Enterprises Reconstitutes Disclosure Committee",
            "Summary": "Welspun Enterprises Limited has reconstituted its Disclosure Committee as per SEBI regulations, effective February 04, 2026, comprising four key positions including MD/CEO and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1770212290383,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Enterprises Submits Q3 FY26 Monitoring Report",
            "Summary": "Welspun Enterprises submitted monitoring agency report for Q3 FY26 regarding utilization of Rs 1,000.00 crore preferential issue proceeds, with no utilization during quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770211099356,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Enterprises Q3 Net Profit Drops 65.5%",
            "Summary": "Welspun Enterprises reported consolidated net profit of 267 million rupees in Q3, marking a significant decline from 775 million rupees in the same quarter previous year, representing a 65.5% year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770202097251,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Enterprises Q3FY26 Earnings Call Feb 5",
            "Summary": "Welspun Enterprises has scheduled an earnings call for February 05, 2026 at 12:00 PM IST to discuss Q3FY26 and 9MFY26 unaudited financial results with key management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770039812242,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Enterprises Grants 10 Lakh Stock Options",
            "Summary": "Welspun Enterprises' Nomination & Remuneration Committee approved grant of 10,00,000 stock options to eligible employees under ESOP Scheme 2022 at Rs. 250 per option.",
            "Sentiment": "positive",
            "PublishDate": 1770019634320,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Enterprises Gets Credit Rating Outlook Upgrade",
            "Summary": "CRISIL revises Welspun Enterprises' long-term rating outlook to 'Positive' from 'Stable' while reaffirming AA- rating and A1+ short-term ratings across Rs. 2600 crore facilities.",
            "Sentiment": "positive",
            "PublishDate": 1769593836578,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Group Master Trust Acquires Additional 0.65% Stake in Welspun Enterprises",
            "Summary": "Mr. Balkrishna Goenka, Trustee of Welspun Group Master Trust, acquired 9,00,000 equity shares (0.65%) of Welspun Enterprises Limited from the open market on December 8-9, 2025. The acquisition increases the promoter group's total shareholding from 55.48% to 56.13% in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765342009146,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Allots 1.90 Crore Convertible Warrants Worth Rs. 250 Crores",
            "Summary": "Welspun Enterprises allotted 1,90,47,619 convertible warrants to promoter and non-promoter investors at Rs. 525 per warrant, receiving Rs. 249.99 crores as 25% upfront payment. The warrants can be converted into equity shares within 18 months from December 01, 2025, with the total issue size not exceeding Rs. 1,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1764596550396,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Receives NSE and BSE Approval for New Share Issue",
            "Summary": "Welspun Enterprises has obtained approval from both the National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) for a new share issue. The regulatory clearance allows the company to proceed with its equity fundraising plans through the stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1763563432274,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Maintains FY26 Revenue Target of INR 4,000 Crores with 18% EBITDA Margin Guidance",
            "Summary": "Welspun Enterprises management maintains their EBITDA margin guidance of around 18% despite currently achieving higher margins. The company remains on track to achieve their consolidated revenue target of INR 4,000 crores for FY26. Revenue distribution for FY26 is expected to be back-ended, meaning higher revenues are anticipated in the latter part of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1763005486251,
            "Source": "stock"
        },
        {
            "Title": "Welspun Enterprises Reports 28% EBITDA Growth in Q2FY26 with Strong Order Book of ₹15,600 Crores",
            "Summary": "Welspun Enterprises Limited posted consolidated revenue of ₹784 crores in quarterly results, down 4% from ₹815 crores in the previous year. However, EBITDA surged 28% to ₹192 crores with margins expanding to 23.9% from 17.9%. Profit after tax increased 59% to ₹98 crores. The company maintains a robust order book of ₹15,600 crores, with 68% from water projects and 24% from transport infrastructure. For the half-year period, revenue declined 7% to ₹1,629 crores while EBITDA grew 17% to ₹399 crores. The company operates across water treatment, transport infrastructure, and tunnelling segments through its subsidiary Welspun Michigan Engineers Limited. Key ongoing projects include the Dharavi Wastewater Treatment Facility, Bhandup Water Treatment Complex, and various highway projects under HAM and EPC models.",
            "Sentiment": "positive",
            "PublishDate": 1762915098709,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Enterprises Announces Senior Management Restructuring with New Role Assignments",
            "Summary": "Welspun Enterprises Limited announced changes in senior management roles following a Board meeting on November 11, 2025. Asim Chakraborty will transition from CEO-Transportation Vertical to Executive Director, Senior Managerial Personnel. Abhishek Chaudhary, currently CEO and Key Managerial Personnel, will assume the role of CEO-Transportation Vertical, SMP, continuing to report to the Managing Director. Hardik Dhebar, CFO of subsidiary Welspun Michigan Engineers Limited, will additionally lead Investor Relations and be re-designated as President-Finance Accounts while retaining his CFO role at WMEL. The changes are effective November 11, 2025, and were approved based on recommendations from the Nomination Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1762912661232,
            "Source": "corporate_governance"
        },
        {
            "Title": "Welspun Enterprises Reports 25% Jump in Q2 Net Profit to 879 Million Rupees",
            "Summary": "Welspun Enterprises reported Q2 consolidated net profit of 879 million rupees, up from 701 million rupees in the same period last year. The company's EBITDA decreased to 1.2 billion rupees from 1.3 billion rupees year-over-year. However, EBITDA margin improved significantly to 22% compared to 15.61% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762853966686,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Enterprises Secures ₹3,145 Crore Water Treatment Plant Contract in Maharashtra",
            "Summary": "Welspun Enterprises has been awarded a contract to construct a 910 MLD (Million Litres per Day) water treatment facility in Panjrapur, Maharashtra. The project is valued at approximately ₹3,145 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762441664620,
            "Source": "stock"
        },
        {
            "Title": "Welspun Enterprises Receives ₹9 Crore GST Tax and Penalty Order, Plans Appeal",
            "Summary": "Welspun Enterprises has received a ₹9 crore tax and penalty order from the Tamil Nadu State GST Authority for FY 2018-19. The company plans to appeal this decision.",
            "Sentiment": "negative",
            "PublishDate": 1761230906518,
            "Source": "stock"
        },
        {
            "Title": "Welspun Enterprises Shares Rise 8% After Board Approves ₹1,000 Crore Convertible Warrants Issue",
            "Summary": "Welspun Enterprises shares gained up to 10% after the company approved raising up to ₹1,000 crore through convertible warrants via preferential issue on private placement basis, with each warrant priced at ₹525. The company reported consolidated net profit growth of 30% year-on-year to ₹100.3 crore in the latest quarter. Revenue increased 24% to ₹1,021.5 crore compared to ₹823 crore in the corresponding quarter last year. EBITDA surged 35% to ₹152.62 crore, while operating margins improved to 14.94% from 13.74% a year ago. Finance costs rose to ₹43.6 crore versus ₹28.4 crore in the year-ago quarter. Shares are currently trading 6% higher at ₹559.45, though the stock has declined 7% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760519958363,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Board Approves Rs. 1,000 Crore Fundraising Through Warrant Issue",
            "Summary": "Welspun Enterprises Limited's Board approved raising funds through a preferential issue of warrants convertible to equity shares, totaling Rs. 1,000 crore. The company will issue 1,90,47,619 warrants at Rs. 525 per warrant to 13 proposed allottees, including promoter Balkrishan Goenka (Trustee of Welspun Group Master Trust) who will receive 71,23,809 warrants, and 12 non-promoter public investors. Each warrant can be converted into one equity share with a face value of Rs. 10 within 18 months from allotment date. The proposal requires shareholder approval at an Extraordinary General Meeting scheduled for November 7, 2025. Warrants that remain unconverted after 18 months will lapse and amounts paid will be forfeited.",
            "Sentiment": "positive",
            "PublishDate": 1760513750834,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Schedules Board Meeting for Fund Raising, Discloses L1 Status for Two Maharashtra Infrastructure Projects",
            "Summary": "Welspun Enterprises Limited has scheduled a Board of Directors meeting for October 15, 2025 to consider fund raising through issuance of convertible equity warrants via preferential issue. The company also voluntarily disclosed its L1 bidder status for two major infrastructure projects in Maharashtra. The first project involves construction of a 6-lane partially elevated highway corridor from Pune to Shirur with a total project cost of approximately Rs. 7,300 crore and a 29-year concession period. The second project is development of a 910 MLD water treatment plant at Panjrapur for Brihanmumbai Municipal Corporation, valued at approximately Rs. 3,145 crore including 15 years of operation and maintenance. The company emerged as the lowest bidder for the highway project on October 03, 2025 and for the water treatment plant on October 08, 2025. The trading window for designated persons remains closed from October 01, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760194236184,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Group Master Trust Acquires Additional 40,000 Shares in Welspun Enterprises",
            "Summary": "Welspun Group Master Trust, through trustee Balkrishan Goenka, acquired 40,000 equity shares (0.03%) of Welspun Enterprises Limited from the open market on August 21, 2025. The acquisition increased the trust's shareholding from 49.30% to 49.33% in the company. The total promoter and persons acting in concert (PAC) holding increased from 55.45% to 55.48%. Welspun Enterprises has a paid-up equity share capital of Rs. 138.41 crores with 13.84 crore shares outstanding. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1756122471180,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Reports 9% Revenue Decline in Q1 FY26 Despite 8% EBITDA Growth",
            "Summary": "Welspun Enterprises Limited reported consolidated revenue of INR845 crores in Q1 FY26, marking a 9% year-on-year decline. The company attributed this to early monsoon onset causing 10 operational days loss, back-ended revenue guidance with 40% targeted for H1, and absence of a INR16 crore one-time claim from previous year. Despite revenue decline, EBITDA grew 8% to INR208 crores with margins expanding to 23.8% from 20.1% in Q1 FY25. The company maintains revenue guidance of INR4,000-4,100 crores for FY26. Subsidiary WMEL showed strong performance with 45% revenue growth to INR208 crores. Consolidated order book stands at INR13,665 crores including O&M contracts worth INR4,400 crores. The company received provisional completion certificate for Aunta-Simaria bridge project and completion certificate for Mukarba Chowk-Panipat project. Management expects to pursue new projects worth INR12,000-13,000 crores over next 30-45 days and targets fresh order inflows of INR10,000-11,000 crores for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1755167407958,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Enterprises Targets Long-Term Growth with ₹13,665 Crore Order Book",
            "Summary": "Welspun Enterprises is pursuing long-term growth with an order book valued at ₹13,665 crore. The company is focusing on water and wastewater projects and plans to launch SmartOps technology. The growth strategy includes cost-effective transportation and tunneling expansion. Oil and gas revenue is expected to begin in FY27/28.",
            "Sentiment": "positive",
            "PublishDate": 1754494060414,
            "Source": "stock"
        },
        {
            "Title": "Welspun Enterprises Appoints Deepak Chauhan as Additional Director and Director - Legal & Ethics",
            "Summary": "Welspun Enterprises Limited appointed Mr. Deepak Chauhan as an Additional Director effective August 06, 2025, until the Annual General Meeting scheduled for August 29, 2025. He was also appointed as Director - Legal & Ethics, designated as Key Managerial Personnel, for a five-year term from August 06, 2025 to August 05, 2030, subject to shareholder approval. Chauhan has been associated with the company and other Welspun World entities since 2010 and currently serves as Group Director, Legal and Ethics. He brings 29 years of professional experience across infrastructure, power, and manufacturing sectors. Chauhan holds degrees in Commerce and Law from Government Law College, Mumbai, and a Master's in Law specializing in Corporate and International Business Laws. He previously worked at ThyssenKrupp (India), Gammon Infrastructure, and GVK Power. The appointment was approved by the Board of Directors based on the Nomination & Remuneration Committee's recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1754480750569,
            "Source": "corporate_governance"
        },
        {
            "Title": "Welspun Enterprises Reports Mixed Q1 Results with Revenue Decline and Margin Improvement",
            "Summary": "Welspun Enterprises reported Q1 revenue of 8.5 billion rupees, down from 9.07 billion rupees in the same period last year. The company's EBITDA increased to 1.82 billion rupees from 1.63 billion rupees year-over-year, while EBITDA margin improved significantly to 21.56% from 17.53%. Consolidated net profit remained relatively stable at 1.03 billion rupees compared to 1.04 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754473111281,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Enterprises' Material Subsidiaries Change Statutory Auditors to Align with Parent Company",
            "Summary": "MGB & Co., LLP resigned as statutory auditors of Welspun Michigan Engineers Limited and Welspun EDAC JV Private Limited, both material subsidiaries of Welspun Enterprises Limited, effective August 04, 2025. The resignation was driven by the parent company's decision to change its statutory auditor, prompting the subsidiaries to align for operational efficiency and audit process consistency. Suresh Surana & Associates LLP has been appointed as the new statutory auditors for both subsidiaries, filling the casual vacancy until the conclusion of their respective Annual General Meetings for FY 2024-25, with a recommended 5-year term extension until FY 2029-30 pending shareholder approval. The boards of both subsidiaries noted no material reasons for the resignation beyond those mentioned in the resignation letters. Suresh Surana & Associates LLP is ranked among India's top 7 audit, tax and consulting groups and is a member of RSM International since 1996.",
            "Sentiment": "neutral",
            "PublishDate": 1754322618371,
            "Source": "corporate_governance"
        },
        {
            "Title": "Welspun Enterprises Unit Signs Deal with OSRTC, Claims Compensation Award",
            "Summary": "Welspun Enterprises has reported that its unit has signed a deal with OSRTC (Odisha State Road Transport Corporation) for a bus terminal project. This development follows a court ruling that led to OSRTC ending its agreement with ABTPL (presumably another company involved in the project). Additionally, Welspun Enterprises' unit claims a compensation award of 184.3 million rupees and anticipates receiving 230 million rupees from OSRTC.",
            "Sentiment": "positive",
            "PublishDate": 1751985355000,
            "Source": "default"
        },
        {
            "Title": "Welspun Enterprises Receives PCOD for Aunta-Simaria Project",
            "Summary": "Welspun Enterprises has been granted a provisional certificate for Project Completion and Operationalization Date (PCOD) for their Aunta-Simaria project. This indicates that the project has reached a significant milestone in its development and is now considered operational.",
            "Sentiment": "positive",
            "PublishDate": 1749022380000,
            "Source": "default"
        },
        {
            "Title": "Welspun Enterprises Reports Strong Growth and Ambitious Targets",
            "Summary": "Welspun Enterprises has reported exceeding its FY25 guidance with 25% YoY consolidated revenue growth. The company has a total order book of approximately Rs 2,800 crore for the Uttar Pradesh Jal Jeevan Mission, with an unexecuted portion of around Rs 1,000 crore. For FY26, the company targets 15-20% consolidated revenue growth, with over 90% already secured. Welspun Michigan is expected to grow by around 50% in FY26. The company aims to secure orders upwards of Rs 10,000 crore in the coming year to achieve an unexecuted order book of more than Rs 20,000 crore by the end of FY26. Additionally, Welspun Enterprises targets consolidated EBITDA growth of approximately 20% plus in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747625107000,
            "Source": "default"
        },
        {
            "Title": "Welspun Enterprises: Q4 Profit Jumps 30%, ₹3 Dividend Proposed",
            "Summary": "Welspun Enterprises reported a 30% YoY increase in Q4 net profit to ₹100.3 crore. Revenue grew 24% to ₹1,021.5 crore, while EBITDA surged 35%. The company recommended a final dividend of ₹3 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747305397000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Enterprises Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Welspun Enterprises announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.53 billion rupees from 1.13 billion, with EBITDA margin rising to 14.96% from 13.74%. Revenue grew to 10 billion rupees from 8.2 billion, and consolidated net profit rose to 1 billion rupees from 776 million. Additionally, the company declared a dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747300768000,
            "Source": "result"
        },
        {
            "Title": "Welspun Enterprises to Consider Raising Funds up to 10 Billion Rupees",
            "Summary": "Welspun Enterprises has announced that it will consider raising funds up to 10 billion rupees through private placement of securities. The company's board will meet to discuss and potentially approve this fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1747056834000,
            "Source": "default"
        },
        {
            "Title": "Welspun Enterprises Subsidiary Secures ₹79.29 Crore Drainage Project in Vadodara",
            "Summary": "A subsidiary of Welspun Enterprises has been awarded a contract worth ₹79.29 crore by the Vadodara Municipal Corporation. The project involves rehabilitating a 1800mm diameter drainage line in the West Zone of Vadodara.",
            "Sentiment": "positive",
            "PublishDate": 1743038414000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Enterprise JV Secures ₹328.12 Crore BMC Contract for Storm Water Pumping Station",
            "Summary": "Welspun Enterprise, through a joint venture, has been awarded a contract worth ₹328.12 crore by the Brihanmumbai Municipal Corporation (BMC). The project involves upgrading the Haji Ali Storm Water Pumping Station and includes a 15-year operations and maintenance agreement.",
            "Sentiment": "positive",
            "PublishDate": 1742952852000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Enterprises: Subsidiary Secures ₹291 Crore BMC Contract",
            "Summary": "Welspun Michigan Engineers Ltd, a subsidiary of Welspun Enterprises, has been awarded a ₹290.88 crore contract by the Brihanmumbai Municipal Corporation for the EPC and 7-year O&M of Mogra Storm Water Pumping Station in Mumbai. The project is to be completed in 20 months, excluding monsoon. With this new order, WMEL's outstanding order book reaches ₹2,791.76 crore.",
            "Sentiment": "positive",
            "PublishDate": 1738755318000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Enterprises Secures 290 Crore Order",
            "Summary": "Welspun Enterprises has won a new order worth 290 crore rupees. This significant contract represents a positive development for the company's business operations and potential revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1738749272000,
            "Source": "order&deals"
        },
        {
            "Title": "Welspun Enterprises Reports Q3 Financial Results and Stake Sale",
            "Summary": "Welspun Enterprises announced its Q3 consolidated net profit of 775 million rupees, down from 895 million rupees year-over-year. Revenue increased to 8.67 billion rupees from 7.07 billion rupees. The company also reported the sale of a 19% stake in Welassure for 9.5 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738628041000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Enterprises Sells 19% Stake in Welassure",
            "Summary": "Welspun Enterprises has announced the sale of a 19% stake in Welassure for 9.5 million rupees. This divestment represents a significant corporate action for the company, potentially impacting its business structure and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1738589960000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Reports Q3 Financial Results",
            "Summary": "Welspun Enterprises has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased slightly to 1.29 billion rupees, compared to 1.26 billion rupees in the same quarter of the previous year. However, the EBITDA margin decreased to 14.88% from 17.82% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738589079000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Enterprises Reports Q3 Financial Results",
            "Summary": "Welspun Enterprises has announced its Q3 consolidated financial results. The company reported a net profit of 775 million rupees, down from 895 million rupees in the same quarter last year. However, revenue increased to 8.67 billion rupees from 7.07 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738589072000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun One Launches Rs 2,700-Crore Warehousing & Industrial Park at JNPA SEZ",
            "Summary": "Welspun One has launched a Rs 2,700-crore warehousing and industrial park project at the Jawaharlal Nehru Port Authority (JNPA) Special Economic Zone (SEZ). This development represents a significant investment in logistics infrastructure and is likely to boost warehousing capacity in the region.",
            "Sentiment": "positive",
            "PublishDate": 1732696776000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Projects 16-17% EBITDA Margins",
            "Summary": "During a conference call, Welspun Enterprises announced that it expects to achieve consolidated EBITDA margins in the range of 16% to 17%. This projection provides insight into the company's anticipated financial performance and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730345435000,
            "Source": "result"
        },
        {
            "Title": "Welspun Enterprises Provides Growth Projections for 2025-2026",
            "Summary": "Welspun Enterprises has announced its growth expectations for the fiscal years 2025 and 2026. The company anticipates operating in the 50 to 150 MLD (Million Liters per Day) range during this period, with an upward trajectory. Additionally, Welspun has set a consolidated target of Rs 4,000 crores for the fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1730345428000,
            "Source": "normal_news"
        },
        {
            "Title": "Welspun Enterprises Provides Annual Guidance, Emphasizes Long-Term View",
            "Summary": "Welspun Enterprises has provided guidance for the full year, urging investors to consider quarterly results within the context of their annual projections. The company states that their guidance aligns with their yearly forecasts, despite potential fluctuations in quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1730345418000,
            "Source": "result"
        },
        {
            "Title": "Welspun Enterprises Projects 20-22% Revenue Growth, Aims for $1 Billion Revenue",
            "Summary": "Welspun Enterprises has announced ambitious growth projections during a conference call. The company expects a consolidated revenue growth of 20% to 22% from fiscal year 2025 to 2027. Additionally, Welspun Enterprises has set a long-term goal to achieve $1 billion in consolidated revenue within the next few years.",
            "Sentiment": "positive",
            "PublishDate": 1730345410000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises: Q2 Profit Dips 11%, Acquires Additional Stake in Subsidiary",
            "Summary": "Welspun Enterprises reported a 11% fall in Q2 FY24-25 net profit to Rs 61.56 crore due to higher expenses. Total income rose to Rs 837.92 crore. The company is acquiring an additional 9.99% stake in Welspun Michigan for Rs 100 crore, increasing its total stake to 60.09%. Welspun secured a Rs 1,989 crore tunnel construction contract from BMC. Abhishek Chaudhary appointed as CEO effective Nov. 4, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1730298903000,
            "Source": "result"
        },
        {
            "Title": "Welspun Enterprises Reports Q2 Results and Strategic Partnerships",
            "Summary": "Welspun Enterprises announced its Q2 consolidated net profit of 701 million rupees, up from 651 million rupees year-over-year. Revenue increased to 7.9 billion rupees from 6.4 billion rupees. The company's unit is entering a strategic partnership with SmartOps UK to transform water reclamation in India. Additionally, Welspun Enterprises approved the acquisition of an additional 9.99% stake in Welspun Michigan for 1 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730246084000,
            "Source": "result"
        },
        {
            "Title": "Welspun Enterprises Acquires Additional Stake in Welspun Michigan",
            "Summary": "Welspun Enterprises has approved the acquisition of an additional 9.99% stake in Welspun Michigan for 1 billion rupees. This move indicates an expansion of Welspun Enterprises' ownership in its subsidiary or affiliated company.",
            "Sentiment": "positive",
            "PublishDate": 1730212701000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Unit Partners with SmartOps UK for Water Reclamation",
            "Summary": "Welspun Enterprises has announced that one of its units is entering into a strategic partnership agreement with SmartOps UK. The partnership aims to transform water reclamation efforts in India, potentially bringing innovative solutions to the country's water management challenges.",
            "Sentiment": "positive",
            "PublishDate": 1730212694000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Enterprises Reports Q2 EBITDA Growth",
            "Summary": "Welspun Enterprises announced its Q2 financial results. The company's EBITDA increased to 1 billion rupees from 826 million rupees year-over-year. However, the EBITDA margin decreased to 12.67% from 14.34% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730211436000,
            "Source": "result"
        },
        {
            "Title": "Welspun Enterprises Reports Q2 Financial Results",
            "Summary": "Welspun Enterprises announced its Q2 consolidated net profit of 701 million rupees, showing a year-over-year increase from 651 million rupees. The company's revenue for Q2 reached 7.9 billion rupees, up from 6.4 billion rupees in the same quarter last year. Compared to the previous quarter, net profit decreased from 1.04 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730211396000,
            "Source": "result"
        },
        {
            "Title": "Welspun Enterprises: Secures Rs 1,989 Crore BMC Contract for Water Tunnel",
            "Summary": "<p><span class='positive'>Welspun Enterprises</span> has <span class='positive'>won</span> a <span class='positive'>Rs 1,989.40 crore order</span> from BMC for constructing a <b>tertiary treated water conveyance tunnel</b>. The project involves building <b>two deep shafts</b> and an <b>8.48 km tunnel</b> using TBM, to be completed in <b>93 months</b>. This order <span class='positive'>boosts</span> the company's standalone order book to <span class='positive'>Rs 14,300 crore</span>. Additionally, its subsidiary <span class='positive'>secured</span> a <span class='positive'>Rs 24.60 crore wastewater treatment project</span> in Maharashtra.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728453600000,
            "Source": "normal_news"
        }
    ]
}