{
    "Symbol": "WELINV",
    "ISIN": "INE389K01018",
    "News": [
        {
            "Title": "Welspun Investments Board Meet Set for Feb 4, 2026",
            "Summary": "Welspun Investments and Commercials Limited has scheduled a board meeting on February 04, 2026, to consider Q3FY26 unaudited financial statements. Trading window closed from Jan 1-Feb 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769785930644,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Investments Reports ₹348 Crore Profit for Quarter Ended September 2025",
            "Summary": "Welspun Investments and Commercials Limited reported a profit of ₹348.18 crores for the quarter ended September 30, 2025, compared to a loss of ₹20.24 crores in the same quarter last year. The company's total income reached ₹832.49 crores for the quarter. For the half-year period, profit stood at ₹328.94 crores versus ₹363.62 crores in the previous year. The Board of Directors approved these unaudited financial results in their meeting held on November 5, 2025. Revenue from operations included interest income of ₹3.12 crores, dividend income of ₹400.48 crores, and net gain on fair value changes of ₹11 crores. The company operates primarily in investment activities and is categorized as a non-deposit taking Core Investment Company. Trading window will reopen from November 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762349385623,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Investments Reports Loss But Strong Other Comprehensive Income in Quarterly Results",
            "Summary": "Welspun Investments and Commercials Limited reported a net loss of ₹20.24 crore for the quarter ended June 30, 2025, compared to a profit of ₹2.32 crore in the same quarter last year. However, the company recorded significant other comprehensive income of ₹5,527.44 crore, primarily from fair valuation changes in equity instruments, resulting in total comprehensive income of ₹5,507.20 crore. Total revenue from operations declined to ₹3.96 crore from ₹11.02 crore year-over-year. The company's expenses increased to ₹23.63 crore from ₹7.50 crore in the previous year quarter. The Board authorized Mr. L.T. Hotwani to sign the results in the absence of Executive Director Mr. Gajendra Nahar. The trading window will reopen on August 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755078497987,
            "Source": "earnings"
        }
    ]
}