{
    "Symbol": "WELSPUNLIV",
    "ISIN": "INE192B01031",
    "News": [
        {
            "Title": "Welspun Living Q3FY26 Results Show Revenue Decline",
            "Summary": "Welspun Living reported Q3FY26 revenue of ₹2,277 cr, down 9.9% YoY, with EBITDA at ₹175 cr and margin of 7.7%. Net debt reduced to ₹1,332 cr from ₹1,658 cr last year.",
            "Sentiment": "negative",
            "PublishDate": 1770906046499,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Living Board Meet Set for Feb 12, 2026",
            "Summary": "Welspun Living Limited has scheduled a board meeting on February 12, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770206336239,
            "Source": "co_actions_results"
        },
        {
            "Title": "Welspun Living President Amit Bhandari Resigns",
            "Summary": "Welspun Living Limited announces resignation of Mr. Amit Bhandari, President – Projects and Business Excellence, effective January 15, 2026, citing growth opportunities outside the company.",
            "Sentiment": "neutral",
            "PublishDate": 1768472125004,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Living Senior Executive Resigns",
            "Summary": "Welspun Living announces resignation of Vikram Bector, Director - Group Human Capital & General Affairs, effective December 31, 2025, citing personal reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1767189180858,
            "Source": "stocks"
        },
        {
            "Title": "Avendus Initiates Welspun Living with Reduce Rating",
            "Summary": "Avendus Securities has initiated coverage on Welspun Living with a reduce recommendation and set a price target of Rs 135 per share.",
            "Sentiment": "negative",
            "PublishDate": 1767066279481,
            "Source": "stocks"
        },
        {
            "Title": "Avendus Spark Initiates 'Reduce' Rating on Welspun Living",
            "Summary": "Avendus Spark has initiated coverage on Welspun Living with a 'Reduce' rating and set a price target of ₹135.00 per share for the textile company.",
            "Sentiment": "negative",
            "PublishDate": 1766979925340,
            "Source": "stocks"
        },
        {
            "Title": "Welspun Living Hosts Investor Day, Targets 15-16% EBITDA and Revenue Growth",
            "Summary": "Welspun Living conducted an investor presentation outlining its strategic roadmap and financial targets. The company reported revenue of Rs 1.25 billion with 14-15% EBITDA margins and aims for medium-term EBITDA of 15-16%. The home textiles manufacturer operates across 60 countries with 47 patented technologies and maintains leadership positions in global markets, particularly as the #1 exporter of towels to UK from India. Key growth initiatives include scaling emerging businesses like advanced textiles and flooring, expanding branded business operations targeting Rs 1000 crore in India, and strengthening presence in US, UK/EU, and ROW markets. The company has invested in pillow manufacturing capacity in Ohio ($13 million investment, 10.8 million annual capacity) and Nevada facilities. Welspun Living has returned Rs 550 crores to shareholders over the last 5 years through dividends and buybacks, while targeting medium-term revenue growth of 15-18% ROCE and maintaining its ESG leadership position as top 4 globally in Dow Jones Sustainability Indices.",
            "Sentiment": "positive",
            "PublishDate": 1763011870980,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Living Reports Sharp Decline in Q2 Profitability",
            "Summary": "Welspun Living reported Q2 consolidated net profit of 130 million rupees, down from 2.01 billion rupees in the same period last year. The company's EBITDA fell to 1.68 billion rupees from 4.2 billion rupees year-over-year. EBITDA margin compressed significantly to 6.8% compared to 14.3% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762935681526,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living CEO Says US Tariffs Won't Impact Company Growth Despite 50% Duties",
            "Summary": "Welspun Living CEO Dipali Goenka stated that US tariffs will not hurt the company's growth, speaking at the SBI Banking and Economics Conclave in Mumbai. India faces a 50% tariff on exports to the US since August 27, with textiles among the affected industries. Goenka emphasized that India remains the largest exporter of cotton textiles to the US and maintains strategic partnerships with top US retailers. The company's quarterly results showed net profit increased 53.2% and revenue rose 32.5% for the quarter ended September 30 compared to the same period last year. Welspun produces a million units of towels daily and plans to continue factory operations despite global challenges.",
            "Sentiment": "positive",
            "PublishDate": 1762440028489,
            "Source": "stock"
        },
        {
            "Title": "Welspun Living Shares Jump Over 9% on US-India Trade Deal Optimism",
            "Summary": "Welspun Living shares surged over 9% with trading volumes 12 times the 30-day average following positive signals about US-India trade negotiations. US President Donald Trump mentioned ongoing negotiations to address trade barriers, while Prime Minister Narendra Modi expressed confidence that India-US trade talks would conclude early. The stock gained over 10% for the week, trading at Rs 124.6 on NSE compared to a 0.57% advance in Nifty 50. Despite the recent gains, the stock has declined 33.21% over the last 12 months and 20.43% year-to-date. The company recently announced CFO Sanjay Gupta's resignation effective October 15 for personal reasons. Six of ten analysts have a 'buy' rating with a consensus target price of Rs 161.1, suggesting 31.6% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1757482215165,
            "Source": "stock"
        },
        {
            "Title": "Welspun Living CFO Sanjay Gupta Resigns, Effective October 15, 2025",
            "Summary": "Welspun Living Limited announced that Sanjay Gupta has resigned from his position as Chief Financial Officer, citing personal reasons. The resignation becomes effective from the close of business hours on October 15, 2025. The company disclosed this change in key management personnel through a regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1757071072433,
            "Source": "corporate_governance"
        },
        {
            "Title": "Welspun Living Announces Senior Management Changes: CDO Resigns, IT Head Elevated",
            "Summary": "Welspun Living announced two senior management changes with immediate effect. Puesh Ajmani, Chief Digital Officer, resigned due to personal reasons. The company elevated Subramanyam Gupta G.V. to Head of Information Technology Department, who will report to Managing Director & CEO Dipali Goenka. Gupta holds an MCA and PGDCA, has been with the company since 2018 as Vice President – Information Technology, and brings over three decades of IT experience from organizations including HIL Limited, Greaves Cotton Limited, and Amara Raja Batteries.",
            "Sentiment": "neutral",
            "PublishDate": 1757070641377,
            "Source": "corporate_governance"
        },
        {
            "Title": "Welspun Living's Company Secretary Shashikant Thorat Resigns to Pursue Other Opportunities",
            "Summary": "Shashikant Thorat has resigned from his positions as Company Secretary, Compliance Officer, and Nodal Officer at Welspun Living Limited. His resignation will be effective from the close of business hours on September 16, 2025. Thorat cited pursuing other career opportunities as the reason for his departure. The company has disclosed this information to stock exchanges as required under regulatory obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1753885190649,
            "Source": "corporate_governance"
        },
        {
            "Title": "Welspun Living Reports 11.6% Revenue Decline in Q1, Approves $13 Million Nevada Pillow Plant Investment",
            "Summary": "Welspun Living Limited reported quarterly results with total income declining 11.6% to ₹2,289 crores compared to the same period last year. EBITDA fell 35.4% to ₹254 crores with margins at 11.1%. Net profit after minorities dropped 52.8% to ₹88 crores. The company attributed the revenue decline to tariff overhang and global trade uncertainties, though domestic consumer business grew 9.5%. The Board approved a $13 million capital expenditure to establish a pillow manufacturing unit in Nevada, USA through subsidiary Welspun USA Inc. The facility will have annual capacity of 10.80 million pillows, expected to be operational by January 2026, and generate approximately $50 million in additional revenue at full capacity. The project will be financed 70% through term loans and 30% by the company. Net debt improved to ₹1,401 crores from ₹1,562 crores in the previous year. Home textiles segment revenue declined 11.1% to ₹2,123 crores while flooring business revenue fell 15.1% to ₹194 crores.",
            "Sentiment": "negative",
            "PublishDate": 1753869084777,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living Reports 46% Decline in Quarterly Net Profit",
            "Summary": "Welspun Living's consolidated net profit dropped to 876 million rupees from 1.61 billion rupees in the same quarter of the previous year, representing a year-over-year decline of approximately 46%.",
            "Sentiment": "negative",
            "PublishDate": 1753868100428,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living Schedules Q1 FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "Welspun Living Limited has scheduled a conference call on July 30, 2025, at 4:30 PM IST to discuss their Q1 FY26 earnings results. The call will be hosted by JM Financial Institutional Securities and will feature key company executives including Managing Director and CEO Dipali Goenka, CFO Sanjay Gupta, and Head Group Investor Relations Salil Bawa. The conference call will be accessible through multiple dial-in numbers for domestic and international participants across different time zones including USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753357644295,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living: Q4 Results In Line, Near-Term Headwinds Expected",
            "Summary": "Welspun Living's Q4 results were in line with expectations. The company faces near-term challenges due to tariff uncertainties and geopolitical issues. Management has diversified exports, reducing US exposure from 80% to 60-65%, and expanded into UK, EU, and emerging markets.",
            "Sentiment": "neutral",
            "PublishDate": 1748611890000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living Expands Product Portfolio through Drape Story Acquisition",
            "Summary": "Welspun Living is expanding its product portfolio for domestic markets by acquiring Drape Story, a company that operates in home furnishings. Drape Story's product range includes curtains, clothing, sofas, and chairs. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1748575592000,
            "Source": "default"
        },
        {
            "Title": "Welspun Living Reports Growth and Capex Updates in Concall",
            "Summary": "Welspun Living shared several updates in a recent concall. The company expects 30% growth in the domestic market this year, suggesting positive consumer demand. Their full-year FY25 capex was Rs 701 crores, lower than the guided Rs 860 crores. The company anticipates a 7-8% increase in cotton costs due to government's Minimum Support Price, raising raw material costs to around Rs 62,000 per candy. However, Welspun Living is currently unable to provide firm guidance for the current financial year due to prevailing circumstances.",
            "Sentiment": "neutral",
            "PublishDate": 1748575573000,
            "Source": "default"
        },
        {
            "Title": "Welspun Living Ltd: Q4 Revenue Up, Margins Down; Declares Dividend",
            "Summary": "Welspun Living Ltd reported Q4 revenue of ₹2,646 crore, up 2.7% YoY. Net profit declined 9.7% to ₹131.8 crore. EBITDA fell 12% YoY to ₹316 crore. Operating margins narrowed to 11.94%. Board recommends final dividend of ₹1.70 per share for FY25. FY25 consolidated revenue crossed ₹10,000 crore mark at ₹10,697 crore, up 8.9% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1748516613000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living Reports Q4 Financial Results",
            "Summary": "Welspun Living announced its Q4 consolidated financial results. The company reported a net profit of 1.32 billion rupees, compared to 1.46 billion rupees in the same quarter last year. Revenue for Q4 increased to 26.5 billion rupees from 25.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748513614000,
            "Source": "result"
        },
        {
            "Title": "Welspun Living: Plans US Manufacturing Expansion Amid Tariff Uncertainty",
            "Summary": "Welspun Living is planning to expand its manufacturing footprint in the US, with a new utility bedding plant in Ohio and a pillow plant in Nevada. The company aims to be closer to its largest market and is prepared to navigate potential tariffs. Despite uncertainties, Welspun remains optimistic about India's position in global trade.",
            "Sentiment": "positive",
            "PublishDate": 1739691832000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Living Revises FY25 Margin Guidance Downward",
            "Summary": "Welspun Living has adjusted its financial outlook for the fiscal year 2025. The company has revised its margin guidance downward from the previously announced 15% to 14%. This information was reported by CNBC TV18, suggesting a slight reduction in the company's profitability expectations for the upcoming fiscal year.",
            "Sentiment": "negative",
            "PublishDate": 1738304484000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Welspun Living has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 2.8 billion rupees from 3.39 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 11.24% from 14.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738228126000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living Reports Q3 Financial Results",
            "Summary": "Welspun Living announced its third-quarter financial results. The company reported a consolidated net profit of 1.21 billion rupees, down from 1.8 billion rupees in the same quarter last year. Revenue for the quarter increased to 25 billion rupees from 24.11 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738228060000,
            "Source": "earnings"
        },
        {
            "Title": "Welspun Living: Board Approves Merger of Two Subsidiaries",
            "Summary": "Welspun Living's board has approved the merger of Welspun Home Solutions with Welspun Advanced Materials to streamline business operations. The merger aims to simplify the business structure, reduce operational costs, and enhance shareholder value. No new shares will be issued as both subsidiaries are wholly-owned by Welspun Living.",
            "Sentiment": "positive",
            "PublishDate": 1733404536000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Living Approves Sale of Welspun Home Solutions",
            "Summary": "Welspun Living has approved the sale of 100% equity shares of its subsidiary, Welspun Home Solutions. The deal is valued at 94 million Indian Rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1733270640000,
            "Source": "corporate_action"
        },
        {
            "Title": "Welspun Living: On Track for FY25 Ebitda Target Despite Challenges",
            "Summary": "Welspun Living's CEO Dipali Goenka confirms the company is on course to meet its FY25 Ebitda guidance of 15-15.5% despite geopolitical challenges. Q2 FY2024-25 saw net profit rise to Rs 201 crore, with total income up 15.5% to Rs 2,936 crore. The company is proceeding with a Rs 1,050 crore capex plan for facility integration and expansion.",
            "Sentiment": "positive",
            "PublishDate": 1730258123000,
            "Source": "result"
        },
        {
            "Title": "Welspun Living Reports 16% Revenue Growth in Q2",
            "Summary": "Welspun Living has announced its second-quarter financial results, reporting revenue of 29 billion rupees, up from 25 billion rupees in the same quarter last year. This represents a year-over-year growth of approximately 16%.",
            "Sentiment": "positive",
            "PublishDate": 1730106049000,
            "Source": "result"
        },
        {
            "Title": "Welspun Living Reports Q2 EBITDA Growth",
            "Summary": "Welspun Living announced its Q2 financial results. The company's EBITDA increased to 4.2 billion rupees from 3.9 billion rupees year-over-year. However, the EBITDA margin decreased to 14.3% from 15.40% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730106041000,
            "Source": "result"
        },
        {
            "Title": "Welspun Living Reports Increased Q2 Consolidated Net Profit",
            "Summary": "Welspun Living has announced its financial results for the second quarter. The company's consolidated net profit increased to 2.01 billion rupees, up from 1.96 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730106014000,
            "Source": "result"
        },
        {
            "Title": "Welspun: Aiming for 100% Green Operations by 2030",
            "Summary": "Welspun Living Ltd. CEO Dipali Goenka announced plans to achieve fully sustainable operations by 2027 or 2030. The company is focusing on water recycling in water-scarce regions and empowering women workers through upcycling initiatives. Goenka emphasized the importance of corporate social responsibility and sustainability in business practices.",
            "Sentiment": "positive",
            "PublishDate": 1729605153000,
            "Source": "normal_news"
        }
    ]
}