{
    "Symbol": "WENDT",
    "ISIN": "INE274C01019",
    "News": [
        {
            "Title": "Wendt India Declares ₹20 Interim Dividend Per Share",
            "Summary": "Wendt India has announced an interim dividend of ₹20.00 per share for its shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1768987751677,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wendt India Q3 Revenue Jumps 13.9% to ₹608 Million",
            "Summary": "Wendt India Limited reported strong quarterly performance with revenue rising to ₹608 million in Q3 compared to ₹534 million in the same period last year, marking a 13.9% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1768986616368,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wendt India Appoints Amit Ingale as CEO from Jan 2026",
            "Summary": "Wendt India announces appointment of Amit Ingale as Executive Director & CEO for five years starting January 19, 2026, subject to shareholder approval. Ingale brings over two decades of automotive experience.",
            "Sentiment": "positive",
            "PublishDate": 1768814656649,
            "Source": "stocks"
        },
        {
            "Title": "Wendt India Board Meet Jan 21 for Q3 Results",
            "Summary": "Wendt (India) Limited has scheduled its board meeting for January 21, 2026, to consider Q3FY26 unaudited financial results and interim dividend proposal for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768403933784,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wendt India Invests EUR 1.1M in German Subsidiary",
            "Summary": "Wendt (India) has injected EUR 1.1 million into its German subsidiary Wendt GmbH to provide operational support and strengthen its international operations.",
            "Sentiment": "positive",
            "PublishDate": 1765991498351,
            "Source": "stocks"
        },
        {
            "Title": "Wendt India infuses €1.1M in German subsidiary",
            "Summary": "Wendt (India) Limited announces additional capital infusion of €1.1 million in its wholly owned German subsidiary Wendt GmbH to support operational requirements and meet fixed costs.",
            "Sentiment": "positive",
            "PublishDate": 1765987491371,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wendt India Seeks Shareholder Approval for Director Re-appointment",
            "Summary": "Wendt (India) Limited initiates postal ballot for re-appointment of Mr. Bhagya Chandra Rao as Independent Director for second term. E-voting period scheduled from December 17, 2025 to January 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765885138080,
            "Source": "stocks"
        },
        {
            "Title": "Wendt India Board Recommends Re-appointment of Independent Director for Second Term",
            "Summary": "Wendt India's Board recommended the re-appointment of Mr. Bhagya Chandra Rao as Independent Director for a second three-year term starting January 22, 2026, subject to shareholder approval through postal ballot. The 69-year-old mechanical engineer brings four decades of experience across engineering and automotive sectors, having previously served as Managing Director of Kennametal India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765267364708,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wendt India Reports 57% Drop in Standalone PAT to Rs 455 Lakhs for Q2 FY26",
            "Summary": "Wendt India Limited reported quarterly results with standalone sales of Rs 4,986 lakhs, maintaining similar levels to the previous year. However, standalone profit after tax declined 57% to Rs 455 lakhs compared to the corresponding quarter last year. The company attributed the profit decline to lower machine sales mix and amortization of the Wendt brand. Exports dropped 5% to Rs 1,064 lakhs due to volatile geopolitical conditions and reduced demand from Indonesia, UK, and Eastern Europe. On a consolidated basis, sales increased 2% to Rs 5,617 lakhs, but PAT fell 75% to Rs 270 lakhs. For the half-year period, standalone sales grew 2% to Rs 9,635 lakhs with PAT declining 47% to Rs 950 lakhs. The company operates in three segments: Super Abrasives, Machines and Accessories, and Precision Products.",
            "Sentiment": "negative",
            "PublishDate": 1760693040569,
            "Source": "earnings"
        },
        {
            "Title": "Wendt (India) Limited Receives Exchange Approval for Wendt GmbH Promoter Declassification",
            "Summary": "Wendt (India) Limited announced that both NSE and BSE have granted approval for the declassification of Wendt GmbH from the 'Promoter' category. NSE issued approval letter NSE/LIST/COMP/WENDT/500/2025-2026 and BSE issued approval letter LIST/COMP/AJ/463/2025-26, both dated September 22nd, 2025. This follows the company's earlier correspondence from June and July 2025 regarding the declassification process. The approval represents a change in the company's ownership structure as Wendt GmbH transitions out of its promoter status.",
            "Sentiment": "neutral",
            "PublishDate": 1758545026733,
            "Source": "corporate_action"
        },
        {
            "Title": "Ninad Gadgil Steps Down as Executive Director and CEO of Wendt (India) Limited",
            "Summary": "Ninad Gadgil has stepped down from his positions as Executive Director and Chief Executive Officer of Wendt (India) Limited, effective September 15, 2025. The company had previously made an intimation regarding this matter on July 21, 2025. Wendt (India) Limited is listed on BSE with stock code 505412 and on NSE with stock code WENDT.",
            "Sentiment": "neutral",
            "PublishDate": 1757941022394,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wendt (India) Limited Applies for Declassification of Wendt GmbH from Promoter Category",
            "Summary": "Wendt (India) Limited has applied to the National Stock Exchange of India Limited and BSE Limited for declassification of Wendt GmbH from the 'Promoter' category under Regulation 31A of SEBI Listing Regulations. The outgoing promoter, Wendt GmbH, currently holds no equity shares in the company. The application was made on July 25th, 2025, following earlier correspondence dated June 25th, 2025 and July 21st, 2025 regarding the declassification request.",
            "Sentiment": "neutral",
            "PublishDate": 1753453710045,
            "Source": "corporate_action"
        },
        {
            "Title": "WENDT Reports Mixed Q1 Results with Revenue Growth but Declining Profitability",
            "Summary": "WENDT reported Q1 revenue of 516 million rupees, up from 490 million rupees in the same period last year. However, the company's profitability declined significantly with EBITDA falling to 73 million rupees from 105 million rupees year-over-year. The EBITDA margin compressed to 13.95% compared to 21.5% in the previous year. Consolidated net profit also dropped substantially to 38 million rupees from 77 million rupees in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1753088180760,
            "Source": "earnings"
        },
        {
            "Title": "Mukul Agrawal Acquires 2.5% Stake in Wendt (India)",
            "Summary": "Individual investor Mukul Agrawal has acquired a 2.5% stake in Wendt (India). The investment represents a new shareholding position by Agrawal in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753057637944,
            "Source": "order&deals"
        },
        {
            "Title": "Mukul Agrawal Acquires 2.5% Stake in Wendt (India)",
            "Summary": "Individual investor Mukul Agrawal has acquired a 2.5% stake in Wendt (India) during the first quarter. This represents a new shareholding position by the investor in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1752851290386,
            "Source": "stock"
        },
        {
            "Title": "Wendt (India): Foreign Promoter's Exit Plan Triggers 17% Stock Plunge",
            "Summary": "Wendt (India) shares fell over 17% after foreign promoter WENDT Gmbh announced plans to sell its entire 37.5% stake through an Offer For Sale (OFS). The floor price is set at a 38% discount to Wednesday's closing price. The stock is now down 52% from its 52-week high.",
            "Sentiment": "negative",
            "PublishDate": 1747283899000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wendt GmbH to Sell Up to 30% Stake in Wendt India via Offer for Sale",
            "Summary": "Wendt GmbH has announced plans to sell up to 30% of its stake in Wendt India through an Offer for Sale (OFS). The floor price for the OFS has been set at 6,500 rupees per share. If the base offer is oversubscribed, Wendt GmbH has the option to sell an additional 7.5% stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1747225714000,
            "Source": "default"
        },
        {
            "Title": "Wendt Reports Q4 Results and Declares Final Dividend",
            "Summary": "Wendt announced its Q4 financial results and recommended a final dividend. The company's Q4 revenue increased to 756 million rupees from 700 million rupees year-over-year. However, the consolidated net profit decreased to 128.9 million rupees from 134 million rupees in the same period last year. The EBITDA rose to 183.5 million rupees, but the EBITDA margin slightly declined to 24.27%. Wendt has recommended a final dividend of 20 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745407454000,
            "Source": "result"
        },
        {
            "Title": "Wendt India Finalizes Trademark Acquisition from Wendt GmbH",
            "Summary": "Wendt India Limited has announced the completion of a trademark acquisition from Wendt GmbH. This corporate action involves the transfer of intellectual property rights, specifically a trademark, from the German company Wendt GmbH to the Indian entity Wendt India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1743174497000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wendt India to Establish Wholly Owned Subsidiary in Germany",
            "Summary": "Wendt India Limited has announced plans to incorporate a wholly owned subsidiary in Germany. The company proposes to invest 50 million rupees for the establishment of this new subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1741010137000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wendt India Reports Q3 Revenue of 534 Million Rupees",
            "Summary": "Wendt India Limited has reported its third-quarter revenue at 534 million rupees, compared to 545 million rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1737534613000,
            "Source": "earnings"
        },
        {
            "Title": "Wendt India Reports Q3 Consolidated Net Profit of 82 Million Rupees",
            "Summary": "Wendt India Limited has announced its financial results for the third quarter. The company reported a consolidated net profit of 82 million rupees, which represents a decrease from the 96 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1737534540000,
            "Source": "earnings"
        },
        {
            "Title": "Wendt India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Wendt India's Q3 EBITDA decreased to 110 million rupees from 135 million rupees year-over-year. The company's EBITDA margin also declined to 20.64% from 24.70% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737534539000,
            "Source": "earnings"
        },
        {
            "Title": "Wendt India to Acquire 'Wendt' Brand and Trademarks from Wendt GmbH",
            "Summary": "Wendt India has agreed to pay 3.8 million euros to Wendt GmbH for the transfer of trademark(s) held by the latter. This agreement will give Wendt India absolute ownership of the 'Wendt' brand and associated trademarks.",
            "Sentiment": "positive",
            "PublishDate": 1737469040000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wendt GmbH to Divest Stake in Wendt India, Trademark Agreement Signed",
            "Summary": "Wendt India has announced that Wendt GmbH intends to divest its 37.5% ownership stake in the company. Additionally, Wendt India has entered into a trademark assignment agreement with Wendt GmbH. This move signifies a significant change in the ownership structure and branding rights of Wendt India.",
            "Sentiment": "neutral",
            "PublishDate": 1737469026000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wendt India Reports Q2 EBITDA and Margin",
            "Summary": "Wendt India has announced its Q2 financial results. The company's EBITDA increased slightly to 126.7 million rupees from 124.5 million rupees year-over-year. However, the EBITDA margin decreased to 22.76% from 24.41% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729501098000,
            "Source": "result"
        },
        {
            "Title": "Wendt India Reports Q2 Financial Results",
            "Summary": "Wendt India has announced its Q2 financial results. The company's consolidated net profit increased to 107 million rupees, up from 90 million rupees in the same quarter last year. Revenue also saw growth, reaching 557 million rupees compared to 510 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729501026000,
            "Source": "result"
        }
    ]
}