{
    "Symbol": "WESTLIFE",
    "ISIN": "INE274F01020",
    "News": [
        {
            "Title": "Westlife Foodworld Boosts Operating Margins",
            "Summary": "Westlife Foodworld reports 150 basis points improvement in restaurant operating margin and 70 basis points growth in operating EBITDA margin year-on-year through cost optimization efforts.",
            "Sentiment": "positive",
            "PublishDate": 1770263107726,
            "Source": "co_actions_results"
        },
        {
            "Title": "Westlife Foodworld Announces New Royalty Rate Agreement",
            "Summary": "Westlife Foodworld reports implementation of new royalty rate following partner agreement, with yearly escalation details available on company website and quarterly benefits now taking effect.",
            "Sentiment": "positive",
            "PublishDate": 1770263078515,
            "Source": "stocks"
        },
        {
            "Title": "Westlife Foodworld Plans 20-25 New Store Openings",
            "Summary": "Westlife Foodworld announces expansion plans to open 20-25 new stores in the final quarter, marking significant growth in its retail footprint across India.",
            "Sentiment": "positive",
            "PublishDate": 1770206597222,
            "Source": "stocks"
        },
        {
            "Title": "Westlife Foodworld Files Q3FY26 Governance Report",
            "Summary": "Westlife Foodworld Limited submitted its quarterly Integrated Filling - Governance Report for Q3FY26 ended December 31, 2025, to BSE and NSE in compliance with SEBI circular dated December 31, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1768910845595,
            "Source": "stocks"
        },
        {
            "Title": "Westlife Foodworld Board Meet Set for Feb 4, 2026",
            "Summary": "Westlife Foodworld has scheduled a board meeting on February 4, 2026, to review and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768889926931,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldman Cuts Westlife Foodworld to Neutral at ₹550",
            "Summary": "Goldman Sachs downgrades Westlife Foodworld to Neutral rating with a target price of ₹550, reflecting revised outlook on the McDonald's franchise operator in India.",
            "Sentiment": "negative",
            "PublishDate": 1767930806668,
            "Source": "stocks"
        },
        {
            "Title": "Westlife Foodworld Appoints New CFO",
            "Summary": "Westlife Development Ltd announces the appointment of Mr. Shardul Doshi as Chief Financial Officer, effective December 15, 2025, marking a key leadership change in the quick service restaurant company.",
            "Sentiment": "positive",
            "PublishDate": 1765799636753,
            "Source": "stocks"
        },
        {
            "Title": "Westlife Foodworld Promoter Amit Jatia Acquires Additional 9,000 Shares",
            "Summary": "Promoter Amit Jatia acquired 9,000 equity shares of Westlife Foodworld Limited through open market purchases on November 20th and 21st, 2025. The acquisition increased his individual shareholding from 0.038% to 0.044%, while the total promoter group holding rose marginally from 56.256% to 56.261%.",
            "Sentiment": "neutral",
            "PublishDate": 1763978686189,
            "Source": "corporate_action"
        },
        {
            "Title": "Westlife Foodworld Promoter Amit Jatia Acquires Additional 8,980 Shares Through Open Market",
            "Summary": "Promoter Amit Jatia purchased 8,980 equity shares of Westlife Foodworld Limited on November 13th and 14th, 2025, through open market transactions. The acquisition increased his shareholding from 0.03% to 0.04%, while the promoter group's total holding rose marginally from 56.25% to 56.29%.",
            "Sentiment": "neutral",
            "PublishDate": 1763380572465,
            "Source": "corporate_action"
        },
        {
            "Title": "Westlife Foodworld Partners with Indian Padel Academy to Promote Padel Sports Across India",
            "Summary": "Westlife Foodworld, which operates McDonald's restaurants in West and South India, announced a strategic partnership with the Indian Padel Academy to promote padel across the country. The collaboration focuses on strengthening padel infrastructure, coaching programs, and tournaments nationwide, aiming to make the sport more accessible to children through school programs, certified training, and city leagues. CEO Akshay Jatia stated the partnership extends McDonald's global tradition of supporting sports and hopes to inspire young athletes who could potentially represent India internationally. The Indian Padel Academy, described as India's largest structured padel facility, operates under Game Park Pvt Ltd. Westlife Foodworld operates 450 McDonald's restaurants across 72 cities in West and South India, serving over 200 million customers annually. The company's shares were trading at ₹562.55, up by ₹2.05 or 0.37% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1762851589639,
            "Source": "stock"
        },
        {
            "Title": "Westlife Foodworld Reports 3.8% Revenue Growth Amid Challenging Consumer Environment",
            "Summary": "Westlife Foodworld Limited reported consolidated revenue of Rs. 6.42 billion for the quarter ended September 30, 2025, reflecting 3.8% year-on-year growth despite industry headwinds. The company faced a 4-6% decline in outside home food consumption frequency in August and September in their region, but managed to gain market share with approximately 4% brand growth. On-premise channels delivered 5% growth while off-premise remained stable. Gross margins expanded to 72.4%, marking an all-time high driven by supply chain efficiencies. Restaurant operating margin grew 60 basis points to 19.2%. Cash PAT stood at Rs. 807 million (12.6% of sales), including exceptional gains of Rs. 581 million from a property redevelopment transaction and losses of Rs. 121 million from impairments. Adjusted cash PAT was Rs. 421 million (6.6% of sales). Digital sales contributed around 75% of revenue, growing over 300 basis points year-on-year. The company opened 8 new restaurants, reaching 450 total locations across 72 cities. CFO Hrushit Shah announced his departure to be with family abroad. Management launched new initiatives including Protein Plus Slice and Big Yummy Burgers, while investing in McDelivery platform expansion with a target to double sales over the next 2 years.",
            "Sentiment": "neutral",
            "PublishDate": 1762506369277,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld CFO Hrushit Shah Resigns to Relocate Overseas",
            "Summary": "Westlife Foodworld Limited announced that Hrushit Shah has ceased to be the Chief Financial Officer of the company and its subsidiary with effect from the close of business hours on November 4, 2025. Shah resigned to enable relocation overseas to be with his family. In his resignation letter dated July 1, 2025, Shah expressed gratitude for the support during his tenure and committed to complete all statutory duties necessary for the half year end closure before his departure. The company has informed stock exchanges BSE and NSE about this change in Key Managerial Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1762165254298,
            "Source": "corporate_governance"
        },
        {
            "Title": "Westlife Foodworld Reports Mixed Q2 Results with Revenue Growth and Exceptional Gains",
            "Summary": "Westlife Foodworld Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported total revenue from operations of Rs 657.82 crores for the quarter compared to Rs 611.80 crores in the corresponding previous quarter. For the half year, revenue increased to Rs 1,275.76 crores from Rs 1,245.82 crores. The company recorded a profit after tax of Rs 21.55 crores for the quarter versus Rs 12.78 crores in the previous corresponding quarter. Half-yearly profit after tax stood at Rs 36.72 crores compared to Rs 29.69 crores. The results included exceptional items, notably a gain of Rs 81.66 crores from a redevelopment transaction involving one of its owned store properties, and an impairment of investment of Rs 36.07 crores by its subsidiary HRPL. Basic earnings per share for the quarter was Rs 1.86 compared to Rs 1.10 in the corresponding previous quarter. The company operates McDonald's restaurants across Western and Southern India through its subsidiary Hardcastle Restaurants Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762162386799,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Westlife Foodworld reported Q2 revenue of 6.4 billion rupees, up from 6.2 billion rupees year-over-year. Consolidated net profit increased significantly to 277 million rupees from 3.6 million rupees in the previous year. However, EBITDA declined to 671 million rupees from 760 million rupees, with EBITDA margin dropping to 10.46% from 12.3%. The company recorded an exceptional gain of 582 million rupees. Profit before tax showed a loss of 158 million rupees compared to a profit of 7 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762161268320,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Schedules Earnings Call for November 3, 2025",
            "Summary": "Westlife Foodworld Limited will announce its financial results for the quarter and half year ended September 30, 2025, on November 3, 2025. The company will host an earnings conference call for analysts and investors on the same day at 4:30 pm IST, lasting 60 minutes. The call will include a discussion on the quarter's performance followed by a Q&A session. Multiple dial-in options are available for different regions including India, Hong Kong, Singapore, UK, and USA. Audio recordings and transcripts will be made available on the company's investor relations website within five working days after the call.",
            "Sentiment": "neutral",
            "PublishDate": 1761205512383,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Sets 5% Royalty Fee for FY26 to McDonald's Corporation",
            "Summary": "Westlife Foodworld has established a royalty fee of 5.0% for FY26, which will be paid to McDonald's Corporation. The royalty payment is contingent upon the company achieving specific network growth goals.",
            "Sentiment": "neutral",
            "PublishDate": 1760518203508,
            "Source": "stock"
        },
        {
            "Title": "Westlife Foodworld Schedules Investor Meeting for September 2025",
            "Summary": "Westlife Foodworld Limited announced an investor and analyst interaction titled 'Ashwamedh - Elara India Dialogue' scheduled for September 3, 2025. The meeting will be conducted in-person in a group format. The company noted that the schedule and mode of the meeting are subject to changes due to exigencies, and any presentation materials discussed during the meeting will be available on the company's investor relations webpage.",
            "Sentiment": "neutral",
            "PublishDate": 1753782722766,
            "Source": "stock"
        },
        {
            "Title": "Westlife Foodworld Reports 7% Revenue Growth with Historic High Gross Margins in Q1 FY26",
            "Summary": "Westlife Foodworld Limited reported consolidated revenue of Rs. 6.6 billion for Q1 FY26, reflecting 7% year-over-year growth. The company achieved a historic high gross margin of 71.6%, up 160 basis points sequentially, driven by supply chain efficiencies. Same-store sales growth stood at 0.5% with stable guest count and average check. Operating EBITDA reached Rs. 855 million, up 7% from the previous year. The company opened 9 new restaurants during the quarter, bringing total store count to 444 restaurants across 71 cities. Digital business continues to contribute around 75% of total sales. The Board approved an interim dividend of Rs. 0.75 per equity share. Management highlighted strengthening their regional leadership team in South India to improve performance in that market, where growth has been slower compared to western regions. The company maintains its Vision 2027 target of 580-630 restaurants and expects gradual improvement in momentum through the year despite the soft business environment.",
            "Sentiment": "positive",
            "PublishDate": 1753780707404,
            "Source": "earnings"
        },
        {
            "Title": "McDonald's India Launches Protein Plus Range with Plant-Based Protein Slice",
            "Summary": "McDonald's India (West & South), operated by Westlife Foodworld, launched its 'Protein Plus Range' featuring a 100% vegetarian, plant-based 'Protein Slice' that adds 5 grams of protein to any burger. The slice was developed in collaboration with CSIR-Central Food Technological Research Institute and is made from soy and pea ingredients without artificial colors, flavors, or onion and garlic. Customers can add up to three slices to their burgers, with examples including McSpicy Paneer offering 25.29g protein and McAloo Tikki providing 13.5g protein when enhanced. The range includes both vegetarian and non-vegetarian meal options and is available across McDonald's 444 restaurants in West and South India. This marks McDonald's India's second partnership with CSIR-CFTRI following last year's Multi-Millet Bun launch.",
            "Sentiment": "positive",
            "PublishDate": 1753340167660,
            "Source": "stock"
        },
        {
            "Title": "Westlife Foodworld Targets 7% Same-Store Sales Growth by 2027",
            "Summary": "Westlife Foodworld has set a target to achieve high single-digit same-store sales growth of approximately 7% by 2027. This goal was announced during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1753328215599,
            "Source": "stock"
        },
        {
            "Title": "Westlife Foodworld Declares Rs 0.75 Interim Dividend with August Record Date",
            "Summary": "Westlife Foodworld Ltd announced an interim dividend of Rs 0.75 per equity share of face value Rs 2 each. The Board of Directors made this declaration based on quarterly financial performance ended June 30, 2025. The record date has been set as August 4, 2025, to determine shareholder eligibility for the dividend payment. The interim dividend will be paid to eligible shareholders on or before August 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753262485166,
            "Source": "corporate_action"
        },
        {
            "Title": "Westlife Foodworld Reports Q1 Results and Declares Interim Dividend of Rs 0.75 Per Share",
            "Summary": "Westlife Foodworld Limited submitted its quarterly financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 65,763.71 lakhs compared to Rs 61,632.87 lakhs in the corresponding quarter last year. Profit after tax stood at Rs 122.75 lakhs versus Rs 325.46 lakhs in the same period last year. The Board of Directors declared an interim dividend of Rs 0.75 per equity share of face value Rs 2 each, with August 4, 2025 as the record date. The dividend will be paid by August 22, 2025. The company operates McDonald's restaurants across West and South India through its wholly owned subsidiary Hardcastle Restaurants Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753260838066,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Reports Higher Q1 EBITDA and Margin Growth",
            "Summary": "Westlife Foodworld reported Q1 EBITDA of 853 million rupees, up from 786 million rupees in the same period last year. The company's EBITDA margin improved to 13% compared to 12.8% year-on-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1753260456698,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Westlife Foodworld reported Q1 revenue of 6.5 billion rupees, representing an increase from 6.1 billion rupees in the same period last year. However, the company's consolidated net profit declined significantly to 12 million rupees compared to 32.5 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753260112332,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Trustee Company and Mirae Asset Great Consumer Fund Increase Stakes in Westlife Foodworld",
            "Summary": "HDFC Trustee Company acquired a 1.14% stake in Westlife Foodworld during the first quarter, while Mirae Asset Great Consumer Fund added a 1.01% stake in the company during the same period.",
            "Sentiment": "positive",
            "PublishDate": 1752851608236,
            "Source": "stock"
        },
        {
            "Title": "Westlife Foodworld Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 1,211,994 shares of Westlife Foodworld Ltd. occurred on the National Stock Exchange (NSE) for Rs. 84.42 crores. The trade was executed at a price of Rs. 696.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750407698000,
            "Source": "block_details"
        },
        {
            "Title": "Westlife Foodworld Expands Restaurant Network, Reaffirms 2027 Vision",
            "Summary": "Westlife Foodworld has opened 47 new restaurants in FY '25, aligning with their expansion guidance. The company has also reaffirmed its Vision 2027 guidance, which includes a target of 580 to 630 restaurants by 2027. This information was shared during a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1747280325000,
            "Source": "default"
        },
        {
            "Title": "Westlife FoodWorld: Q4 Net Profit Doubles Despite Margin Contraction",
            "Summary": "Westlife FoodWorld Ltd. reported a 97% increase in consolidated net profit to Rs 1.5 crore for Q4 FY25. Revenue grew 7.3% to Rs 603 crore, while EBITDA rose 2.8% to Rs 77 crore. However, the EBITDA margin contracted to 12.8% from 13.3% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747220962000,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Reports Q4 Financial Results",
            "Summary": "Westlife Foodworld has announced its Q4 financial results. The company reported revenue of 6 billion rupees, up from 5.6 billion rupees in the same quarter last year. EBITDA increased to 825 million rupees from 749 million rupees year-over-year. The EBITDA margin improved slightly to 13.68% from 13.32% in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747213307000,
            "Source": "result"
        },
        {
            "Title": "Westlife Foodworld Reports Q4 Profit Growth",
            "Summary": "Westlife Foodworld has reported a consolidated net profit of 15 million rupees for the fourth quarter, compared to 8 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1747213162000,
            "Source": "result"
        },
        {
            "Title": "Westlife Foodworld to Discuss Q4 Results on May 14",
            "Summary": "Westlife Foodworld has announced that its board of directors will meet on May 14 to discuss and approve the company's financial results for the fourth quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745990313000,
            "Source": "default"
        },
        {
            "Title": "Westlife Foodworld: Stable Demand and Gradual Recovery Expected",
            "Summary": "Westlife Foodworld has seen stable demand over the past six months, with slight improvement in Q4 FY25. Consumer sentiment is expected to improve from late Q1 FY26, driven by potential interest rate cuts and fiscal measures from Budget 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1743479107000,
            "Source": "normal_news"
        },
        {
            "Title": "Westlife Foodworld: HDFC Securities Maintains 'Reduce' Rating Amid Persistent Challenges",
            "Summary": "HDFC Securities maintains a 'Reduce' rating on Westlife Foodworld after Q3 results. The company continues aggressive expansion, opening 15 new stores with 7 in drive-thru format.",
            "Sentiment": "negative",
            "PublishDate": 1738214704000,
            "Source": "result"
        },
        {
            "Title": "Westlife Foodworld Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Westlife Foodworld has reported a decrease in its third-quarter EBITDA, which fell to 881 million rupees from 920 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 13.48% from 15.33% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738143379000,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Reports 8.3% Revenue Growth in Q3",
            "Summary": "Westlife Foodworld has announced its third-quarter financial results, reporting revenue of 6.5 billion rupees. This represents an 8.3% increase compared to the 6 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738143317000,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld Reports Decline in Q3 Net Profit",
            "Summary": "Westlife Foodworld has reported a consolidated net profit of 70 million rupees for the third quarter, down from 172 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738143312000,
            "Source": "earnings"
        },
        {
            "Title": "Westlife Foodworld: McDonald's Franchise Expects Positive Same Store Sales Growth",
            "Summary": "Westlife Foodworld, operator of McDonald's restaurants in West and South Asia, anticipates mid-single digit positive same store sales growth in H2 FY2025. Growth drivers include the McCrispy platform launch, strengthened value offerings, and a low base effect. Goldman Sachs maintains a 'buy' recommendation with a ₹1,045 price target.",
            "Sentiment": "positive",
            "PublishDate": 1733450392000,
            "Source": "normal_news"
        },
        {
            "Title": "Westlife Foodworld Plans Expansion with 45-50 New Stores in FY25",
            "Summary": "Westlife Foodworld has announced plans to open 45-50 new stores in the fiscal year 2025. The company's expansion strategy focuses on South India, smaller towns, and drive-thru locations. This information was shared in an investor presentation, indicating the company's growth ambitions and targeted approach to market expansion.",
            "Sentiment": "positive",
            "PublishDate": 1729771614000,
            "Source": "corporate_action"
        },
        {
            "Title": "Westlife Foodworld Reports Negative Same-Store Sales Growth",
            "Summary": "Westlife Foodworld, a company in the food industry, has reported a negative same-store sales growth (SSSG) of -6.5% compared to the same period last year. This indicates a decline in sales performance for the company's existing stores.",
            "Sentiment": "negative",
            "PublishDate": 1729764053000,
            "Source": "result"
        },
        {
            "Title": "Westlife Foodworld Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Westlife Foodworld's Q2 EBITDA decreased to 760.1 million rupees from 997 million rupees year-over-year. The EBITDA margin also fell to 12.30% from 16.20% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729762990000,
            "Source": "result"
        },
        {
            "Title": "Westlife Foodworld Reports Q2 Revenue Growth",
            "Summary": "Westlife Foodworld, a food service company, has reported its second quarter revenue for the current fiscal year. The company's revenue reached 6.2 billion rupees, showing a slight increase from 6.15 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1729762977000,
            "Source": "result"
        },
        {
            "Title": "Westlife Foodworld Reports Significant Drop in Q2 Profit",
            "Summary": "Westlife Foodworld's consolidated net profit for the second quarter has decreased substantially from 224 million rupees in the previous year to 3.6 million rupees in the current year, marking a significant year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1729762957000,
            "Source": "result"
        },
        {
            "Title": "Westlife Foodworld Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class='neutral'>Westlife Foodworld</span> has announced a <span class='neutral'>board meeting</span> scheduled for <b>October 24</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728465180000,
            "Source": "corporate_action"
        }
    ]
}