{
    "Symbol": "WEWIN",
    "ISIN": "INE082W01014",
    "News": [
        {
            "Title": "WeWin Limited Shareholders Approve Key Resolutions",
            "Summary": "WeWin Limited shareholders unanimously approved material related party transactions for FY2026-27 and Employee Stock Option Plan 2025 through postal ballot conducted on December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766385073555,
            "Source": "co_actions_results"
        },
        {
            "Title": "WeWin Limited Seeks Shareholder Approval for Related Party Transactions and Employee Stock Option Plan",
            "Summary": "WeWin Limited has issued a postal ballot notice seeking shareholder approval for material related party transactions worth Rs. 10 crores with directors for FY 2026-27 and implementation of an Employee Stock Option Plan 2025 offering up to 6 lakh stock options. The remote e-voting period runs from November 20, 2025, to December 19, 2025, with results to be announced within two working days of voting closure.",
            "Sentiment": "neutral",
            "PublishDate": 1763384431555,
            "Source": "corporate_action"
        },
        {
            "Title": "WeWin Limited Reports Strong Q2 Performance with 178% Profit Surge",
            "Summary": "WeWin Limited's Board approved unaudited financial results for the quarter ended September 30, 2025, showing standalone profit of Rs 178.64 lakhs compared to Rs 59.36 lakhs in the previous quarter. The call center services company also approved a postal ballot notice during its Board meeting held on November 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763142364275,
            "Source": "earnings"
        },
        {
            "Title": "We Win Limited Approves Q1 FY26 Financial Results and Sets AGM Date for September 12, 2025",
            "Summary": "We Win Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 2,033.98 lakhs and net profit of Rs. 59.36 lakhs, with basic earnings per share of Rs. 0.49. The company scheduled its 18th Annual General Meeting for September 12, 2025, at its registered office in Bhopal. The Board also appointed M/s S Anjum & Associates as Secretarial Auditors for five consecutive years from FY 2025-26 to 2029-30, and MUFG Intime India Private Limited as e-Voting Agency. Mr. Abhishek Gupta was noted as eligible to retire by rotation at the upcoming AGM. The company operates in call center services and has Surevin Weartech Private Limited as its associate company.",
            "Sentiment": "neutral",
            "PublishDate": 1755092054338,
            "Source": "earnings"
        }
    ]
}