{
    "Symbol": "WEWORK",
    "ISIN": "INE085001019",
    "News": [
        {
            "Title": "Turner International Opens 46,000 Sq Ft Office with WeWork",
            "Summary": "Global construction giant Turner International expands India operations with WeWork India, launching a 46,000 sq. ft. managed office in Airoli, Mumbai that can accommodate over 650 professionals.",
            "Sentiment": "positive",
            "PublishDate": 1770702793257,
            "Source": "stocks"
        },
        {
            "Title": "WeWork India adds 3,300 desks in Hyderabad expansion",
            "Summary": "WeWork India Management Limited announces capacity addition of 3,300 desks in Hyderabad with ₹100 crore investment, expanding total capacity by 2.7% to meet growing demand.",
            "Sentiment": "positive",
            "PublishDate": 1769701956006,
            "Source": "stocks"
        },
        {
            "Title": "WeWork India adds 10,000 desks in Q3, targets 30,000 more",
            "Summary": "WeWork India achieved its highest quarterly desk additions of 10,000 in Q3 FY26, with revenue rising 9.6% to ₹634 crore and EBITDA up 13.7% to ₹134.6 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769510552447,
            "Source": "co_actions_results"
        },
        {
            "Title": "WeWork India Q3 Revenue Jumps 31% to ₹6.4 Billion",
            "Summary": "WeWork India Management reported strong quarterly performance with revenue rising to ₹6.4 billion in Q3 from ₹4.9 billion in the same period last year, marking significant growth in the coworking sector.",
            "Sentiment": "positive",
            "PublishDate": 1769491873356,
            "Source": "co_actions_results"
        },
        {
            "Title": "WeWork India Gets Credit Rating Upgrade to [ICRA]A",
            "Summary": "ICRA upgrades WeWork India's credit rating to [ICRA]A (Stable) from [ICRA]A- (Stable) across ₹800 crore facilities, citing healthy 79% occupancy and 20-25% revenue growth expectations.",
            "Sentiment": "positive",
            "PublishDate": 1769087558070,
            "Source": "stocks"
        },
        {
            "Title": "WeWork India Crosses 100K Members with 33.6% Growth",
            "Summary": "WeWork India achieves milestone of crossing 100,000 members with 33.6% YoY growth. Enterprise clients contribute 76% of revenue while GCC segment grows to 38% contribution from 28% previously.",
            "Sentiment": "positive",
            "PublishDate": 1767762535773,
            "Source": "stocks"
        },
        {
            "Title": "WeWork India Faces Lock-in Expiry, GST Demand Issues",
            "Summary": "WeWork India's 3-month lock-in period ends Jan 6, making ₹638 cr worth shares tradeable. Company also faces ₹14.93 cr GST demand for FY2018-21, plans appeal against tax order.",
            "Sentiment": "negative",
            "PublishDate": 1767627207151,
            "Source": "stocks"
        },
        {
            "Title": "WeWork India Seeks Shareholder Approval for Employee Stock Option Plans and Board Nomination Rights",
            "Summary": "WeWork India Management Limited has issued a postal ballot notice seeking shareholder approval for ratification and amendment of its 2018 and 2021 equity incentive plans covering 65,94,660 and 4,59,195 stock options respectively, along with alteration of Articles of Association to grant 1 Ariel Way Tenant Limited nomination rights for one Non-Executive Director. The remote e-voting period runs from December 10, 2025 to January 8, 2026, affecting employees eligible for stock options and shareholders' governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765280893948,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay High Court Dismisses Petitions Challenging WeWork India's IPO Approval",
            "Summary": "The Bombay High Court dismissed two writ petitions filed by Vinay Bansal and Hemant Kulshrestha that challenged SEBI's approval of WeWork India Management Limited's IPO and alleged inadequate disclosures in offer documents. The court ruled that the company's disclosures were true, fair and adequate, with the IPO undertaken in compliance with applicable regulations, while imposing costs of Rs 21 lakh on one petitioner.",
            "Sentiment": "positive",
            "PublishDate": 1764662588834,
            "Source": "stock"
        },
        {
            "Title": "HDFC Mutual Fund Increases Stake in WeWork India Management to 5.483%",
            "Summary": "HDFC Mutual Fund acquired 10,00,000 shares of WeWork India Management Limited through open market purchases on November 25, 2025, bringing its total holding to 73,49,103 shares representing 5.483% of the company's paid-up equity share capital. The acquisition was disclosed under SEBI regulations for substantial shareholding changes, with the fund's holding increasing from a previous position through various HDFC mutual fund schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1764308655943,
            "Source": "corporate_action"
        },
        {
            "Title": "WeWork India Reports Strong Q2 FY26 Results with First-Ever IndAS PAT Positive Quarter",
            "Summary": "WeWork India delivered record quarterly revenue of INR 585.5 crores (up 17.2% YoY) and achieved its first IndAS PAT positive quarter at INR 6.4 crores, while IGAAP-equivalent EBITDA surged 45% quarter-over-quarter to INR 118.4 crores with margins expanding 530 basis points to 20.3%. The flexible workspace operator operates 70 centers across 8 cities with 1.15 lakh desks at 80.2% occupancy, maintaining strong enterprise client base contributing 75% of business while reducing net debt from INR 529 crores to INR 311 crores year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1763141406578,
            "Source": "earnings"
        },
        {
            "Title": "WeWork India Reports Record Revenue of ₹585.5 Crore, Achieves First IndAS PAT-Positive Quarter",
            "Summary": "WeWork India Management Limited announced strong quarterly results with revenue of ₹585.5 crore, up 17.2% year-on-year and 7.3% sequentially. The company achieved IGAAP equivalent EBITDA of ₹118.4 crore with 20.3% margin, up 45.0% quarter-on-quarter. Under IndAS, the company reported its first-ever PAT-positive quarter at ₹6.4 crore, while EBITDA stood at ₹390.9 crore with 66.8% margin. Free cash flow from operations reached ₹95.4 crore and Return on Capital Employed improved to 22.2%. The company operates 7.7 million sq ft across 70 centres in 8 cities with 1.15 lakh desks under management at 80.2% occupancy. Enterprise clients contributed approximately 73% of revenue. The company has about 11,000 desks under fit-out and plans continued expansion in Tier-1 Grade-A micro-markets.",
            "Sentiment": "positive",
            "PublishDate": 1762785469575,
            "Source": "earnings"
        },
        {
            "Title": "WeWork India Reports Quarterly Profit of Rs 73.87 Million, Completes IPO Listing",
            "Summary": "WeWork India Management Limited reported a profit of Rs 73.87 million for the quarter ended September 30, 2025, compared to a loss of Rs 146.08 million in the previous quarter. Revenue from operations increased to Rs 5,730.30 million from Rs 5,339.54 million in the previous quarter. For the six months ended September 30, 2025, the company reported a loss of Rs 72.21 million compared to a loss of Rs 584.91 million in the same period last year. The company completed its IPO comprising offer for sale of 46,296,296 equity shares aggregating to Rs 29,996.43 million, with shares listed on NSE and BSE on October 10, 2025. The company operates as a managed workspace provider and granted 561,324 employee stock options during the quarter under ESOP 2018.",
            "Sentiment": "positive",
            "PublishDate": 1762758219892,
            "Source": "earnings"
        },
        {
            "Title": "WeWork India Management Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "WeWork India Management reported quarterly results showing revenue increased to 575 million rupees from 469 million rupees year-over-year. However, net profit declined significantly to 63 million rupees compared to 200 million rupees in the same period last year. EBITDA grew to 3.9 billion rupees from 3.1 billion rupees year-over-year, with EBITDA margin improving to 67.93% from 66.1%.",
            "Sentiment": "neutral",
            "PublishDate": 1762757038730,
            "Source": "earnings"
        },
        {
            "Title": "WeWork India CEO Reports Strong Demand Driven by GCC Expansion and Startup Growth",
            "Summary": "WeWork India CEO Karan Virwani reported strong demand for flexible workspaces driven by global capability centres (GCCs) and startup activity. The company currently hosts over 130 active GCC centres, with 50% having fewer than 50 desks as companies start small and scale up. WeWork India has partnered with GCC-as-a-service providers to help global firms from Europe, Japan, and the US set up offices quickly. The company added 20,000 desks and nearly 2 million sq. ft. in the past year, growing slightly faster than industry average. Virwani noted that flex workspaces became the second highest contributor to India's office market after IT in the last 12 months. Bengaluru leads commercial leasing demand with 30-40% of activity, while Mumbai, NCR, Hyderabad, Chennai, and Pune show strong growth. About 98% of workspace demand comes from top metro cities, with the company focusing on these markets in the short to mid-term. WeWork India's current market capitalization is ₹8,262.53 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762504287118,
            "Source": "stock"
        },
        {
            "Title": "WeWork India Management Limited Schedules Q2FY26 Earnings Conference Call",
            "Summary": "WeWork India Management Limited has announced its Q2FY26 earnings conference call scheduled for Monday, November 10, 2025, at 18:00 hours IST. The virtual conference call will run from 18:00-19:00 hours IST and will feature discussions with the company's management. The company has provided multiple international dial-in numbers for participants from Hong Kong, Singapore, UK, and USA. Registration details and investor relations contact information have been shared for interested participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762244808403,
            "Source": "earnings"
        },
        {
            "Title": "WeWork India Addresses Governance Concerns Raised by InGovern in IPO Report",
            "Summary": "WeWork India Management responded to governance concerns raised by proxy advisory firm InGovern regarding its IPO. The company clarified that its 100% Offer for Sale structure is appropriate given sufficient free cash flow and EBITDA generation, with promoter investment of Rs 5,012.81 million made at higher valuation than IPO upper price band. WeWork India filed under SEBI Regulation 6(2) for companies not meeting profitability requirements. The company attributed negative net worth of Rs 4,374.5 million as of March 31, 2024 to lease accounting norms, reporting improved net worth of Rs 1,896.82 million as of June 30, 2025 and adjusted EBITDA of Rs 4,212.55 million in FY25. The company achieved 80.7% occupancy with 21.61% adjusted EBITDA margin and positive operating cash flows since FY2023. WeWork India disclosed criminal proceedings involving promoters Jitendra and Karan Virwani in offer documents. The company confirmed its 99-year WeWork brand license remains valid under promoter control and resolved material weaknesses in internal financial controls by March 2025. IPO proceeds of approximately Rs 1,748 crore were used to retire debt, reducing pledged shares to 15%.",
            "Sentiment": "neutral",
            "PublishDate": 1760954604135,
            "Source": "corporate_governance"
        }
    ]
}