{
    "Symbol": "WHEELS",
    "ISIN": "INE715A01015",
    "News": [
        {
            "Title": "Wheels India Q3 Net Profit Jumps 44% to ₹360M",
            "Summary": "Wheels India reported consolidated net profit of ₹360 million in Q3, marking a significant 44% year-on-year growth from ₹250 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769674806300,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wheels India Board Meet on Jan 29 for Q3 Results",
            "Summary": "Wheels India Limited has scheduled its board meeting for January 29, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769137825075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wheels India Signs Technical Agreement with Topy Industries",
            "Summary": "Wheels India signs technical assistance agreement with Japan's Topy Industries for aluminum alloy wheels, plans capacity expansion to 10 lakh wheels by FY27, and targets Japanese OEMs in India.",
            "Sentiment": "positive",
            "PublishDate": 1765773295946,
            "Source": "stocks"
        },
        {
            "Title": "Wheels India Managing Director Files Trading Plan for Sister's Share Purchase",
            "Summary": "Wheels India Limited notified stock exchanges about a trading plan filed by Managing Director Srivats Ram for his sister Nivedita Ram to purchase company shares. The trading plan covers the period from March 16, 2026 to March 20, 2026, involving the purchase of 100,000 equity shares with an upper price limit of Rs. 1,080 per share through on-market transactions. The plan was approved by the company's Compliance Officer on November 10, 2025. The trading plan includes standard undertakings including a 120-day cool-off period restriction and commitment to execute trades only within the specified price limits.",
            "Sentiment": "neutral",
            "PublishDate": 1762783562264,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wheels India Q2 Net Profit Surges 26.69% to Rs 28 Crore",
            "Summary": "Wheels India reported a 26.69% increase in net profit to Rs 28 crore for Q2 ended September 30, 2025, compared to Rs 22 crore in the same quarter last year. Revenue grew 8.63% to Rs 1,179 crore from Rs 1,085 crore. Export revenues reached Rs 299 crore, marking 15.6% growth. For the half-year period, net profit increased 14.6% to Rs 54 crore while revenues rose 8.85% to Rs 2,366 crore. The company attributed growth to strong demand in Air Suspension and Tractor wheels segments. During the quarter, Wheels India entered a strategic alliance with SHPAC of South Korea for technical assistance and joint business development in the Hydraulic Cylinder business. MD Srivats Ram expressed optimism about export trends continuing in the second half and expects the SHPAC alliance to drive Hydraulics business revenues over the next couple of years.",
            "Sentiment": "positive",
            "PublishDate": 1761903346633,
            "Source": "earnings"
        },
        {
            "Title": "Wheels India Expects Positive Export Growth and Strong Overall Performance",
            "Summary": "Wheels India anticipates continued positive export trends in the second half and expects good overall growth this year. The company's outlook suggests optimism for both export performance and general business growth.",
            "Sentiment": "positive",
            "PublishDate": 1761900321758,
            "Source": "stock"
        },
        {
            "Title": "Wheels India Reports Revenue Growth to 12.6 Billion Rupees in Q2",
            "Summary": "Wheels India reported quarterly revenue of 12.6 billion rupees compared to 11.8 billion rupees in the same period last year. The company's EBITDA increased to 926 million rupees from 834 million rupees year-over-year, with EBITDA margin improving to 7.33% from 7.1%. Consolidated net profit rose to 300 million rupees versus 240 million rupees in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1761899792688,
            "Source": "earnings"
        },
        {
            "Title": "Wheels India Partners With South Korean Company For Hydraulic Cylinder Agreement",
            "Summary": "Wheels India has entered into a partnership agreement with a South Korean firm for hydraulic cylinders. The partnership involves collaboration in the hydraulic cylinder segment, though specific financial terms and operational details of the agreement were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1759117735404,
            "Source": "stock"
        },
        {
            "Title": "Wheels India Hits 52-Week High of Rs 911 on Auto Sector Optimism",
            "Summary": "Wheels India shares surged to a 52-week high of Rs 911, currently trading at Rs 862 with a 6% gain from the previous day's close of Rs 809. The stock has gained over 27% year-to-date, with most gains occurring in the last six months. Technical analyst Kush Bohra attributes the breakout to increased trading volumes, strong accumulation, and the 20-day moving average crossing above the 50-day moving average. The company, which manufactures road wheels and parts for construction and mining industries, has benefited from positive sentiment in the auto ancillary sector following recent government GST cuts. The stock initially surged after the GST reduction announcement on August 15 but underwent profit booking before consolidating in the 730-740 range. Wheels India currently trades at a relative strength index of 64, indicating neutral market sentiment.",
            "Sentiment": "positive",
            "PublishDate": 1758704571575,
            "Source": "stock"
        },
        {
            "Title": "Wheels India Designates S Sridhar as Senior Management Personnel, Withdraws G Muguntha Narayanan's Nomination",
            "Summary": "Wheels India's Board of Directors approved designating S Sridhar, Head-ASD, as Senior Management Personnel effective April 29, 2025, based on the Nomination and Remuneration Committee's recommendation. Simultaneously, the Board withdrew G Muguntha Narayanan's nomination as Senior Management Personnel. Narayanan was originally designated as Senior Management Personnel when he served as Chief Risk Officer in addition to Head of Costing, but he has ceased to be CRO while continuing as head of Costing. Sridhar, a Bachelor of Engineering, brings over three decades of experience with OEMs and State Transport Undertakings, and is responsible for the Air Suspension division, developing new markets and managing PAN India service operations. His previous employment includes positions at Amco Batteries Limited, Bundy India Limited, and Lamba Brothers.",
            "Sentiment": "neutral",
            "PublishDate": 1757135887416,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wheels India Reports Strong Q1 Performance with Revenue Growth to 13 Billion Rupees",
            "Summary": "Wheels India delivered solid quarterly results with revenue increasing to 13 billion rupees from 12 billion rupees year-over-year. The company's consolidated net profit rose to 299 million rupees compared to 236 million rupees in the same period last year. EBITDA improved to 936 million rupees from 795 million rupees, while EBITDA margin expanded to 7.40% from 6.82% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754381810904,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Secures ₹300 Crore Export Orders from European OEMs",
            "Summary": "Steel Strips Wheels Limited secured export nominations worth ₹300 crore from two leading European automotive OEMs for its steel wheel business. The contracts are linked to vehicle programs to be manufactured in the European Union and South America, with execution planned over five years. Series production is expected to begin in early 2027 from the company's Chennai facility. This development supports the company's strategy to diversify its export footprint by reducing dependence on the U.S. market and expanding presence in the EU and South America. The company expects additional international business in coming months as part of this initiative. Steel Strips Wheels designs and manufactures automotive wheels in both steel and alloy categories. Company shares ended at ₹223.05, up ₹5.95 or 2.74% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1754305630241,
            "Source": "stock"
        },
        {
            "Title": "Wheels India Establishes New Unit in Germany",
            "Summary": "Wheels India has established a new unit called 'WIL Europe GmbH' in Germany on July 17. The company has expanded its presence in Europe with this new establishment.",
            "Sentiment": "positive",
            "PublishDate": 1752827714000,
            "Source": "default"
        },
        {
            "Title": "Wheels India: Invests 50,000 Euros in New European Subsidiary",
            "Summary": "Wheels India Ltd has invested 50,000 euros in its newly formed subsidiary, WIL Europe GmbH. The subsidiary, still in formation, aims to expand business activities in Europe. It will focus on automotive and non-automotive related activities, supply chain management, and allied services.",
            "Sentiment": "positive",
            "PublishDate": 1752429096000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wheels India Approves Purchase of Axles India Shares",
            "Summary": "Wheels India has approved the purchase of shares in Axles India for 226.8 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1750852359000,
            "Source": "default"
        },
        {
            "Title": "Wheels India Reports Q4 Results and Declares Dividend",
            "Summary": "Wheels India has reported its Q4 financial results. The company's EBITDA increased to 1.03 billion rupees from 973 million rupees year-over-year. The EBITDA margin improved to 8.09% from 7.66%. Consolidated net profit slightly decreased to 382 million rupees from 385 million rupees. Revenue remained stable at 13 billion rupees. Additionally, the company has declared a dividend of 7.03 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747730481000,
            "Source": "result"
        },
        {
            "Title": "Wheels India Reports Q3 Revenue Decline",
            "Summary": "Wheels India, a manufacturer of automotive components, has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 11.24 billion rupees, down from 12.1 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737964506000,
            "Source": "earnings"
        },
        {
            "Title": "Wheels India Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Wheels India has announced its financial results for the third quarter, reporting a consolidated net profit of 250 million rupees. This marks a substantial increase from the 101 million rupees reported in the same quarter of the previous year, indicating a strong year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737964434000,
            "Source": "earnings"
        },
        {
            "Title": "Wheels India MD Optimistic About Q4 Growth",
            "Summary": "The Managing Director of Wheels India expressed hope for improved performance in the fourth quarter, particularly in the commercial vehicle, tractor, and aluminum wheels segments.",
            "Sentiment": "positive",
            "PublishDate": 1730104244000,
            "Source": "normal_news"
        },
        {
            "Title": "Wheels India Anticipates Export Growth in FY26",
            "Summary": "Wheels India expects new products introduced in fiscal year 2026 to drive growth in their export business for the following year.",
            "Sentiment": "positive",
            "PublishDate": 1730104208000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wheels India Reports Q2 Revenue Decline",
            "Summary": "Wheels India reported a revenue of 11.8 billion rupees for the second quarter, down from 12.11 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730103663000,
            "Source": "result"
        },
        {
            "Title": "Wheels India Reports Significant Profit Increase in Q2",
            "Summary": "Wheels India has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 240 million rupees, up from 44 million rupees in the same period last year, marking a significant year-over-year improvement.",
            "Sentiment": "positive",
            "PublishDate": 1730103653000,
            "Source": "result"
        }
    ]
}