{
    "Symbol": "WHIRLPOOL",
    "ISIN": "INE716A01013",
    "News": [
        {
            "Title": "Whirlpool India Q3FY26 Results & Key Developments",
            "Summary": "Whirlpool of India reported Q3FY26 results with standalone revenue of INR 162,413 lacs. Board approved appointment of Anil Berera as Independent Director and acquisition of additional 3.18% stake in subsidiary for INR 59 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770379859451,
            "Source": "co_actions_results"
        },
        {
            "Title": "Whirlpool India Block Trade Worth Rs. 23.64 Crores",
            "Summary": "Whirlpool of India executed a significant NSE block trade involving 293,247 shares at Rs. 806.05 per share, totaling Rs. 23.64 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1770263749041,
            "Source": "co_actions_results"
        },
        {
            "Title": "Whirlpool India Board Meet Set for Feb 6, 2026",
            "Summary": "Whirlpool of India Limited has scheduled a Board of Directors meeting on February 6, 2026, to consider and approve Q3FY26 financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769764944239,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nippon India MF Boosts Whirlpool Stake to 7.26%",
            "Summary": "Nippon India Mutual Fund acquired 3,99,993 additional shares in Whirlpool of India through open market purchases, increasing its total holding from 6.94% to 7.26% of the company's equity capital.",
            "Sentiment": "positive",
            "PublishDate": 1769076394213,
            "Source": "co_actions_results"
        },
        {
            "Title": "Whirlpool India Block Trade Worth ₹15.66 Crores",
            "Summary": "Whirlpool of India executed a significant NSE block trade involving 172,012 shares at ₹910.25 per share, totaling ₹15.66 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767588038130,
            "Source": "co_actions_results"
        },
        {
            "Title": "Whirlpool India Appoints Ankur Jolly as Head-Legal",
            "Summary": "Whirlpool of India Limited announced the appointment of Mr. Ankur Jolly as Head-Legal effective January 05, 2026. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1767343190972,
            "Source": "stocks"
        },
        {
            "Title": "Advent's $1 Billion Deal Talks for Whirlpool of India Stakes Collapse Over Valuation Disagreement",
            "Summary": "Deal negotiations between Advent and Whirlpool of India worth $1 billion have collapsed due to disagreement on company valuation between both parties. The failed acquisition talks affect Whirlpool of India's potential ownership change and Advent's investment strategy in the Indian home appliances market.",
            "Sentiment": "negative",
            "PublishDate": 1765164679019,
            "Source": "order&deals"
        },
        {
            "Title": "Whirlpool of India Receives GST Orders Totaling INR 10.47 Crores in Demand and Penalties",
            "Summary": "Whirlpool of India received two GST orders dated December 1, 2025, with total demands of INR 7.36 crores, penalties of INR 4.04 crores, and interest of INR 2.75 crores related to Reverse Charge Mechanism liability and disallowed input tax credit for April 2018 to March 2023. The company states there is no material impact on its financial or operational activities and is evaluating the matter to take appropriate action.",
            "Sentiment": "negative",
            "PublishDate": 1764760414381,
            "Source": "stock"
        },
        {
            "Title": "Whirlpool of India Shareholders Approve Articles of Association Amendment",
            "Summary": "Whirlpool of India Limited shareholders approved a special resolution to alter the company's Articles of Association through postal ballot e-voting with 99.995% votes in favor. The amendments include removal of provisions related to Financial and Technical Collaboration Agreements with Whirlpool and deletion of clauses regarding exclusive ownership rights of the Whirlpool trade name.",
            "Sentiment": "positive",
            "PublishDate": 1764585461511,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool Corporation Reduces Stake in Indian Subsidiary Through $166 Million Share Sale",
            "Summary": "Whirlpool Corporation's subsidiary sold 14,255,000 shares of Whirlpool of India Limited through an off-market transaction, reducing ownership from 51% to approximately 40% and generating gross proceeds of $166 million. The company plans to use proceeds for debt reduction and continues evaluating options to further reduce its equity stake in the Indian subsidiary by the first half of 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764331057886,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool of India Sees Major Block Trade Worth Rs 1,614 Crore on BSE",
            "Summary": "Whirlpool of India executed a significant block trade on BSE involving approximately 15.01 million shares at Rs 1,075.2 per share, totaling Rs 1,613.98 crore. The large-scale transaction indicates substantial institutional or bulk investor activity in the home appliances company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764215504655,
            "Source": "order&deals"
        },
        {
            "Title": "Whirlpool of India Sees Rs. 103.62 Crore Block Trade on NSE",
            "Summary": "Whirlpool of India executed a block trade worth Rs. 103.62 crores involving 970,267 shares at Rs. 1,068 per share on the NSE. The transaction represents a significant institutional trading activity for the home appliances manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1764215248068,
            "Source": "order&deals"
        },
        {
            "Title": "Whirlpool Mauritius Plans ₹965 Crore Share Sale in Whirlpool India",
            "Summary": "Promoter Whirlpool Mauritius plans to sell up to 95 lakh shares (7.5% stake) in Whirlpool India through a block deal worth ₹965 crore at a floor price of ₹1,030 per share. The transaction will reduce the promoter's shareholding in the home appliances company and provide liquidity to institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1764164038001,
            "Source": "order&deals"
        },
        {
            "Title": "Advent International Leads Race to Acquire Whirlpool's India Operations",
            "Summary": "Private equity firm Advent International has emerged as the frontrunner to acquire Whirlpool's India business unit in a transaction valued at approximately $1 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1762736239435,
            "Source": "order&deals"
        },
        {
            "Title": "Whirlpool of India Reports Decline in Q2 Financial Performance",
            "Summary": "Whirlpool of India reported quarterly results showing a decline across key financial metrics. Revenue decreased to 16.5 billion rupees from 17.13 billion rupees in the same period last year. Net profit fell to 413 million rupees compared to 520 million rupees year-over-year. EBITDA dropped significantly to 578 million rupees from 870 million rupees, while EBITDA margin compressed to 3.51% from 5.08% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762257780807,
            "Source": "earnings"
        },
        {
            "Title": "Whirlpool of India Seeks Shareholder Approval to Delete Key Articles from Company Constitution",
            "Summary": "Whirlpool of India Limited has announced a postal ballot seeking shareholder approval to delete Articles 4, 4A, and 108A from its Articles of Association. The company's board approved the amendments on October 16, 2025, based on recommendations from the transition and audit committees. The voting period runs from October 30, 2025 (9:00 AM) to November 28, 2025 (5:00 PM) through electronic voting only. The proposed deletions include provisions related to financial and technical collaboration agreements with Whirlpool Corporation, trademark usage rights tied to maintaining 51% shareholding, and nominee director appointment rights for ICICI Bank which have become redundant as borrowings have been repaid. Whirlpool Corporation currently holds approximately 51% of the company's equity through its subsidiary Whirlpool Mauritius Limited. The company has also executed new Brand Licence and Technology Licence Agreements to ensure business continuity and facilitate anticipated changes in shareholding structure.",
            "Sentiment": "neutral",
            "PublishDate": 1761656064650,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool of India Signs Multiple Licensing and Service Agreements with Parent Company",
            "Summary": "Whirlpool of India Limited executed five agreements with Whirlpool Corporation and its affiliates on October 16, 2025. The agreements include a 30-year brand licensing deal with guaranteed minimum royalties starting at USD 6 million annually for the first 10 years, rising to USD 12 million for years 21-30. A technology licensing agreement provides exclusive access to technical intellectual property with royalty rates of 0.60% of net sales until March 2029, then 0.65%. The services agreement runs until March 2029, replacing existing annual arrangements with pre-agreed minimum service charges based on 18% markup over costs. A transitional services agreement facilitates business continuity during ownership changes, with services valued at USD 3 million annually from April 2026. Additionally, Whirlpool Corporation assigned 24 Indian patents and 8 designs to the company for USD 20. The board also approved amendments to the Articles of Association, subject to shareholder approval, removing provisions linked to the 51% shareholding requirement and obsolete ICICI Bank nominee director clauses.",
            "Sentiment": "positive",
            "PublishDate": 1760618637845,
            "Source": "stock"
        },
        {
            "Title": "Bain Capital Exits Whirlpool India Stake Acquisition, EQT Group Remains Sole Bidder",
            "Summary": "Bain Capital has withdrawn its interest in acquiring a stake in Whirlpool of India. EQT Group remains as the only bidder in negotiations for a 31% stake in the company. The negotiations are reportedly proceeding at a much lower valuation than previously expected.",
            "Sentiment": "negative",
            "PublishDate": 1757474803530,
            "Source": "order&deals"
        },
        {
            "Title": "Whirlpool of India Reports Quarterly Financial Results with Revenue of ₹2,317 Crores",
            "Summary": "Whirlpool of India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹2,317.47 crores compared to ₹2,383.70 crores in the same quarter last year. Net profit stood at ₹135.07 crores versus ₹134.03 crores in the previous year quarter. Earnings per share was ₹10.65 compared to ₹10.56 in the corresponding quarter. On a consolidated basis, revenue from operations was ₹2,432.32 crores against ₹2,496.86 crores in the year-ago quarter, with net profit at ₹146.08 crores compared to ₹145.25 crores. The consolidated financial results include subsidiary Elica PB Whirlpool Kitchen Appliances Private Limited. The company operates predominantly in the Home Appliances segment. The results will be published in Financial Express and Loksatta newspapers and made available on stock exchange websites and the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753525382486,
            "Source": "earnings"
        },
        {
            "Title": "Whirlpool of India: Block Trade of Rs. 50.92 Crores on NSE",
            "Summary": "A significant block trade has occurred for Whirlpool of India Ltd. on the National Stock Exchange (NSE). The transaction involved approximately 380,092 shares and was valued at Rs. 50.92 crores. The shares were traded at a price of Rs. 1339.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752033402000,
            "Source": "block_details"
        },
        {
            "Title": "Whirlpool of India Attracts Potential Buyers for Controlling Stake",
            "Summary": "Havells, Reliance Retail, and private equity firms are reportedly seeking a controlling stake in Whirlpool of India. This indicates potential significant changes in ownership and control of the company.",
            "Sentiment": "positive",
            "PublishDate": 1750390048000,
            "Source": "default"
        },
        {
            "Title": "Whirlpool of India Reports Q4 Financial Results and Dividend",
            "Summary": "Whirlpool of India announced its Q4 consolidated net profit of 1.19 billion rupees, up from 776 million rupees year-over-year and 439.6 million rupees quarter-over-quarter. Q4 revenue increased to 20.05 billion rupees from 17.34 billion rupees year-over-year. The company reported an exceptional item of 70 million rupees and a Q4 profit before tax of 1.55 billion rupees, compared to 1.33 billion rupees year-over-year. Additionally, Whirlpool of India recommended a final dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747786946000,
            "Source": "default"
        },
        {
            "Title": "Whirlpool of India: Q4 Profit Surges 54%, Declares ₹5 Dividend",
            "Summary": "Whirlpool of India reported a 54% increase in Q4 net profit to ₹119.2 crore. Revenue rose 15.6% YoY to ₹2,004.7 crore. EBITDA grew 27.45% to ₹183.1 crore with margin expansion. The company declared a final dividend of ₹5 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747745461000,
            "Source": "earnings"
        },
        {
            "Title": "Whirlpool of India Reports Q4 Financial Results and Dividend Recommendation",
            "Summary": "Whirlpool of India has announced its Q4 financial results. The company's revenue increased to 20.05 billion rupees from 17.34 billion rupees year-over-year. EBITDA rose to 1.83 billion rupees from 1.44 billion rupees, with the EBITDA margin improving to 9.13% from 8.29%. Profit before tax (PBT) grew to 1.55 billion rupees from 1.33 billion rupees. The consolidated net profit for Q4 reached 1.19 billion rupees, up from 776 million rupees year-over-year and 439.6 million rupees quarter-on-quarter. The company reported an exceptional item of 70 million rupees. Additionally, Whirlpool of India has recommended a final dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747743739000,
            "Source": "result"
        },
        {
            "Title": "Whirlpool of India Ltd: Share Price Surges on Potential Stake Sale",
            "Summary": "Whirlpool of India's share price jumped nearly 11% to a three-month high following reports of potential stake acquisition by private equity firms. Whirlpool Corp. plans to sell a 31% stake in its Indian unit, aiming to raise $550-600 million while retaining a 20% interest. Multiple private equity funds, including Advent International, Bain Capital, and TPG, have been approached for the deal.",
            "Sentiment": "positive",
            "PublishDate": 1745911211000,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool Corporation Considers Selling Stake in Indian Subsidiary",
            "Summary": "According to a report in the Economic Times, Whirlpool Corporation, the parent company of Whirlpool of India, is exploring the possibility of selling up to 31% of its stake in the Indian unit. This potential divestment could significantly alter the ownership structure of Whirlpool's Indian operations.",
            "Sentiment": "neutral",
            "PublishDate": 1745897608000,
            "Source": "default"
        },
        {
            "Title": "Whirlpool of India: Promoter Plans Significant Stake Reduction",
            "Summary": "Whirlpool Corporation, the parent company, plans to reduce its stake in Whirlpool of India from 51% to around 20% by mid or late-2025. This announcement follows a previous 24% stake sale last year. The company's stock has halved from recent highs due to this news. Whirlpool India's current valuation is lower than historical averages, trading at under 30 times earnings compared to a historical average of 45 times.",
            "Sentiment": "negative",
            "PublishDate": 1742973680000,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool India Forms Committee to Review Impact of Whirlpool Corp Sell-Down",
            "Summary": "Whirlpool India has established a committee to assess the potential impact of a sell-down by its parent company, Whirlpool Corporation. This move suggests that Whirlpool Corporation may be considering reducing its stake in the Indian subsidiary, which could have significant implications for the company's operations and ownership structure in India.",
            "Sentiment": "neutral",
            "PublishDate": 1741056541000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Whirlpool of India Reports Significant Profit Increase in Q3",
            "Summary": "Whirlpool of India has announced its Q3 financial results, showing a substantial year-over-year improvement. The company's consolidated net profit rose to 440 million rupees, up from 280 million rupees in the same quarter last year. Revenue also increased to 17 billion rupees from 15.26 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738714927000,
            "Source": "earnings"
        },
        {
            "Title": "Whirlpool of India Reports Q3 Financial Results",
            "Summary": "Whirlpool of India has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 693 million rupees, up from 627 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 4.06% from 4.08% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738670113000,
            "Source": "earnings"
        },
        {
            "Title": "Whirlpool of India Reports Q3 Financial Results",
            "Summary": "Whirlpool of India has announced its Q3 financial results. The company's consolidated net profit increased to 440 million rupees, up from 280 million rupees in the same period last year. Revenue also saw growth, reaching 17 billion rupees compared to 15.26 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738670105000,
            "Source": "earnings"
        },
        {
            "Title": "Whirlpool of India: Share Price Plummets 33% Amid Stake Reduction Plans",
            "Summary": "Whirlpool share price has fallen for the fifth consecutive session, dropping over 33% in five days. The American parent company, Whirlpool Corporation, plans to reduce its stake in the Indian subsidiary to about 20% by mid to late 2025. In February 2024, Whirlpool Corporation sold 24% of its stake for approximately $468 million. The company is set to announce Q3FY25 results on February 4, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1738305137000,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool Corporation to Reduce Stake in Whirlpool India",
            "Summary": "Whirlpool Corporation, the parent company of Whirlpool India, has announced its intention to reduce its ownership stake in the Indian subsidiary from 51% to 20% by mid-2025. This significant reduction in ownership represents a major shift in the parent company's investment strategy in its Indian operations.",
            "Sentiment": "neutral",
            "PublishDate": 1738208389000,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool Partners with PG Electroplast for Contract Manufacturing",
            "Summary": "Whirlpool has entered into a partnership with PG Electroplast for contract manufacturing of select Whirlpool-branded semi-automatic washing machines. This collaboration aims to leverage PG Electroplast's manufacturing capabilities to produce Whirlpool's washing machine models.",
            "Sentiment": "positive",
            "PublishDate": 1734961186000,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool India: Expansion and Market Share Gains to Drive Growth",
            "Summary": "Yes Securities reports that Whirlpool of India's capacity expansion and continued market share gains are expected to drive growth, according to their Q2 review.",
            "Sentiment": "positive",
            "PublishDate": 1731317581000,
            "Source": "normal_news"
        },
        {
            "Title": "Whirlpool India: Q2 Profit Dips 25%, Plans Refrigerator Production Boost",
            "Summary": "Whirlpool of India reported a 25.4% YoY decline in Q2 net profit to ₹287 crore, while revenue increased 13% to ₹1,582 crore. EBITDA surged 31% to ₹68.4 crore. The company plans to expand refrigerator manufacturing capacity at its Pune facility by 3 lakh units annually, investing ₹270 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1731067680000,
            "Source": "result"
        },
        {
            "Title": "Whirlpool of India Approves Refrigerator Manufacturing Expansion",
            "Summary": "Whirlpool of India has approved an expansion of its refrigerator manufacturing capacity at its Pune factory. The company plans to invest 2.7 billion rupees for this expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1731065534000,
            "Source": "corporate_action"
        },
        {
            "Title": "Whirlpool of India Reports Improved Q2 Financial Performance",
            "Summary": "Whirlpool of India has announced its Q2 financial results, showing improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased to 870 million rupees from 732 million rupees year-over-year. Additionally, the EBITDA margin improved to 5.08% from 4.81% in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731062562000,
            "Source": "result"
        },
        {
            "Title": "Whirlpool of India Reports Q2 Revenue Growth",
            "Summary": "Whirlpool of India has reported a revenue of 17 billion rupees for the second quarter, compared to 15 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731062551000,
            "Source": "result"
        },
        {
            "Title": "Whirlpool of India Reports Q2 Profit Increase",
            "Summary": "Whirlpool of India has reported a consolidated net profit of 520 million rupees for the second quarter, showing a year-over-year increase from 366 million rupees. However, this represents a decrease from the previous quarter's profit of 1.44 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731062540000,
            "Source": "result"
        }
    ]
}