{
    "Symbol": "WINDLAS",
    "ISIN": "INE0H5O01029",
    "News": [
        {
            "Title": "Windlas Biotech Faces Manufacturing Suspension Notice",
            "Summary": "Windlas Biotech receives show cause notice from Uttarakhand FDA for temporary suspension of codeine-containing cough syrup manufacturing. Affected product line contributed Rs. 55.21 crore to revenue.",
            "Sentiment": "negative",
            "PublishDate": 1770725607801,
            "Source": "stocks"
        },
        {
            "Title": "Windlas Biotech Re-appoints Three Key Directors",
            "Summary": "Windlas Biotech Limited announces re-appointment of three directors including Whole-time Director Ashok Kumar Windlass and Independent Directors Vivek Dhariwal and Gaurav Gulati for five-year terms.",
            "Sentiment": "positive",
            "PublishDate": 1770300199751,
            "Source": "stocks"
        },
        {
            "Title": "Windlas Biotech dissolves US subsidiary",
            "Summary": "Windlas Biotech Limited's board approves dissolution of non-operating wholly owned subsidiary Windlas Inc. USA with zero turnover and negative net worth of USD -1923.10.",
            "Sentiment": "neutral",
            "PublishDate": 1770298722887,
            "Source": "stocks"
        },
        {
            "Title": "Windlas Biotech Q3 Revenue Rises 18% to ₹2.3B",
            "Summary": "Windlas Biotech reported Q3 consolidated revenue of ₹2.30 billion, up from ₹1.95 billion year-on-year, though net profit declined slightly to ₹150 million from ₹155 million in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1770296953541,
            "Source": "co_actions_results"
        },
        {
            "Title": "Windlas Biotech Board Meet Set for Feb 5, 2026",
            "Summary": "Windlas Biotech has scheduled a board meeting on February 5, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769594069388,
            "Source": "co_actions_results"
        },
        {
            "Title": "Windlas Biotech Reports 19% Revenue Growth in Q2 FY26, Announces Major ESOP Scheme",
            "Summary": "Windlas Biotech Limited delivered 19% year-on-year revenue growth in both Q2 FY26 and H1 FY26, with revenue from operations at INR 222 crores and INR 432 crores respectively. The company reported earnings per share of INR 16.91 for H1 FY26, reflecting 21% growth. EBITDA stood at INR 29 crores for Q2 and INR 55 crores for H1, with gross margins improving by 68 basis points and 70 basis points respectively. The company announced an ESOP 2025 scheme with a non-cash expenditure impact of INR 12 million in Q2 FY26, covering approximately 100 employees across management levels with an exercise price of INR 5. Growth was driven by all three business verticals: Generic Formulations CDMO (18% growth), Trade Generics Institutional (25% growth in H1, 24% in Q2), and Exports (23% growth in H1, 13% in Q2). The injectable facility gained customer approvals with commercial supplies ramping up, while Plant-6 expansion remains on track for commissioning within FY26. The company paid a dividend of INR 12.2 crores equivalent to INR 5.8 per share and maintained a strong liquidity position of INR 237 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762889136400,
            "Source": "earnings"
        },
        {
            "Title": "Windlas Biotech Targets Export Growth Through FDA-Compliant Facilities and CDMO Partnerships",
            "Summary": "Windlas Biotech is pursuing stronger export growth by leveraging U.S. FDA-compliant facilities and forming partnerships in the Contract Development and Manufacturing Organization (CDMO) segment. The company is expanding its capabilities across nutrition, injectable, and contract manufacturing areas. Windlas Biotech is focusing on margin expansion through a high-value product mix and integration with global pharmaceutical supply chains.",
            "Sentiment": "positive",
            "PublishDate": 1762441154518,
            "Source": "stock"
        },
        {
            "Title": "Windlas Biotech Reports 13.7% Rise in Q2 Net Profit to Rs 178 Million",
            "Summary": "Windlas Biotech Limited reported a net profit of Rs 178 million for the quarter ended September 30, 2025, compared to Rs 156.58 million in the same period last year. Revenue from operations increased to Rs 2,223.92 million from Rs 1,870.01 million year-on-year. For the six-month period, net profit rose to Rs 354.64 million from Rs 301.37 million, while revenue grew to Rs 4,324.88 million from Rs 3,621.50 million. The company's earnings per share for the quarter stood at Rs 8.48 compared to Rs 7.49 in the previous year. The Board approved these unaudited financial results and declared a final dividend of Rs 5.80 per share for FY 2024-25, totaling Rs 121.56 million in dividend payout. The company also allotted 117,928 equity shares under its ESOP scheme and introduced Windlas Plan 2025 to grant up to 590,250 options to eligible employees.",
            "Sentiment": "positive",
            "PublishDate": 1762434995093,
            "Source": "earnings"
        },
        {
            "Title": "Windlas Biotech Amends Employee Stock Option Plan to Clarify Grant Limits",
            "Summary": "Windlas Biotech has amended its employee stock option plan, Windlas Plan 2025, to provide additional clarity on stock unit grants while maintaining shareholder-approved limits. The Nomination and Remuneration Committee approved amendments to align with regulatory requirements for in-principle approval from stock exchanges. The maximum annual grant limit per employee remains at 3,15,000 units, but the committee has set a new per-grant limit of 2,09,590 units per eligible employee per year. The company clarified that grants equal to or exceeding 1% of issued capital will require compliance with additional provisions. No units have been issued under the plan pending regulatory approval, and the amendments are described as clarificatory in nature without prejudicing employee interests.",
            "Sentiment": "neutral",
            "PublishDate": 1756054008570,
            "Source": "corporate_action"
        },
        {
            "Title": "Windlas Biotech Reports Strong Q1 Growth with Revenue Rising to 2.1 Billion Rupees",
            "Summary": "Windlas Biotech delivered robust quarterly performance with revenue increasing to 2.1 billion rupees from 1.75 billion rupees year-over-year. The company's EBITDA grew to 265 million rupees compared to 209 million rupees in the same period last year, while EBITDA margin improved to 12.6% from 11.93%. Consolidated net profit rose to 177 million rupees versus 134.7 million rupees year-over-year, reflecting strong operational performance across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1754992111283,
            "Source": "earnings"
        },
        {
            "Title": "Windlas Biotech Reports Q4 Results and Dividend Recommendation",
            "Summary": "Windlas Biotech has announced its Q4 financial results. The company's revenue increased to 2.03 billion rupees from 1.71 billion rupees year-over-year. EBITDA rose to 255.5 million rupees from 220.05 million rupees, while the EBITDA margin slightly decreased to 12.6% from 12.85%. Consolidated net profit for Q4 was 162.8 million rupees, down from 169.9 million rupees year-over-year but up from 155.8 million rupees quarter-over-quarter. Additionally, the company has recommended a dividend of 5.80 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747923088000,
            "Source": "result"
        },
        {
            "Title": "Windlas Biotech Limited: New Injectable Facility Receives GMP Certification",
            "Summary": "Windlas Biotech's new injectable manufacturing facility has received GMP certification from Uttarakhand's Food Safety & Drugs Administration Authority, confirming compliance with WHO TRS Guidelines. This is the company's fifth GMP-compliant plant, expanding its capabilities in sterile injectable formulations and positioning it for growth in domestic and global markets.",
            "Sentiment": "positive",
            "PublishDate": 1736500020000,
            "Source": "corporate_action"
        }
    ]
}