{
    "Symbol": "WINDMACHIN",
    "ISIN": "INE052A01021",
    "News": [
        {
            "Title": "Windsor Machines Allots 7.38L Shares for Unitech Stake",
            "Summary": "Windsor Machines Limited completed preferential allotment of 7,37,680 equity shares worth Rs. 25.00 crore to acquire 59.52% stake in Unitech Workholding Systems. Board also approved sale of Vatva facility.",
            "Sentiment": "positive",
            "PublishDate": 1770455969107,
            "Source": "co_actions_results"
        },
        {
            "Title": "Windsor Machines Q3FY26 Loss Widens to ₹684.97 Crores",
            "Summary": "Windsor Machines reported a net loss of ₹684.97 crores in Q3FY26 compared to profit of ₹812.72 crores in Q3FY25. Revenue declined 14.77% to ₹9,137.68 crores amid operational challenges.",
            "Sentiment": "negative",
            "PublishDate": 1769768389933,
            "Source": "co_actions_results"
        },
        {
            "Title": "Windsor Machines Gets In-Principle Approval for Equity Issue",
            "Summary": "Windsor Machines Limited receives in-principle approval from NSE and BSE for issuing 737680 equity shares of Rs. 2/- each on preferential basis under share swap arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1769695832890,
            "Source": "co_actions_results"
        },
        {
            "Title": "Windsor Machines Issues EGM Notice Correction",
            "Summary": "Windsor Machines Limited disclosed omission of required regulatory disclosure in its November 2025 Extraordinary General Meeting notice, addressing SEBI compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767763664212,
            "Source": "stocks"
        },
        {
            "Title": "Windsor Machines: Promoter Acquires 26L Shares via Warrants",
            "Summary": "Ramesh Keshubhai Siyani acquired 26.06 lakh equity shares through warrant conversion, increasing his shareholding to 5.99% from 2.99% in Windsor Machines Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1766757844059,
            "Source": "co_actions_results"
        },
        {
            "Title": "Windsor Machines Shareholders Approve Preferential Share Issuance for Unitech Acquisition",
            "Summary": "Windsor Machines Limited shareholders passed a special resolution approving the issuance of up to 7,37,680 equity shares on preferential basis for consideration other than cash to acquire 59.52% stake in Unitech Workholding Systems Private Limited. The resolution was approved with 99.9997% votes in favor during the Extraordinary General Meeting held on December 7, 2025, with 22 members participating in the e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1765201919211,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Files Scheme for Amalgamation with Wholly-Owned Subsidiary Global CNC",
            "Summary": "Windsor Machines Limited has submitted a scheme of amalgamation with its wholly-owned subsidiary Global CNC Private Limited to stock exchanges, with an appointed date of April 1, 2025. The merger aims to streamline corporate structure, consolidate operations, and enhance operational efficiencies through combined resources and simplified compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1764923959183,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Issues Corrigendum for EGM on Preferential Share Allotment",
            "Summary": "Windsor Machines Limited issued a corrigendum updating its Extraordinary General Meeting notice scheduled for December 07, 2025, modifying details of a proposed preferential issue of 7,37,680 equity shares. The changes include updated valuation details and shareholding patterns for the acquisition of 59.52% stake in Unitech Workholding Systems Private Limited, following observations received from NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763987967107,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Completes Chhatral Facility Shift, Begins Vatva Manufacturing Relocation",
            "Summary": "Windsor Machines Limited has completed shifting its injection moulding machines manufacturing facility from Chhatral to its new integrated facility at Chibhda, Rajkot, and commenced relocating its pipe extrusion blown film machines operations from Vatva to the same location. The Vatva facility shifting process is expected to take approximately five months for completion due to the scale and operations involved.",
            "Sentiment": "positive",
            "PublishDate": 1763960203623,
            "Source": "stock"
        },
        {
            "Title": "Windsor Machines to Issue 7.37 Lakh Equity Shares for Unitech Acquisition",
            "Summary": "Windsor Machines Limited has called an Extraordinary General Meeting on December 7, 2025, to approve the preferential allotment of up to 7,37,680 equity shares at Rs. 338.90 per share. The shares will be issued as part consideration for acquiring a 59.52% stake in Unitech Workholding Systems Private Limited for Rs. 24.99 crore. The total acquisition value is Rs. 42 crore, with the remaining Rs. 17 crore to be paid in cash. Unitech manufactures modular clamping elements, dies, tools, fixtures, and CNC machines. The acquisition aims to provide tooled solutions with machines as a package with fixtures and tooling to increase market presence. The allottees include five individuals who are existing shareholders of Unitech and are not promoters of Windsor Machines. The issue price represents a premium of Rs. 336.90 per share over the face value of Rs. 2.",
            "Sentiment": "positive",
            "PublishDate": 1762938914180,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Appoints Four Senior Management Personnel",
            "Summary": "Windsor Machines Limited appointed four individuals to senior management positions effective November 08, 2025. The Board of Directors approved the appointments based on recommendations from the Nomination Remuneration Committee. Subhaschandra Shenoy was appointed as Vice President Manufacturing, overseeing extrusion machine operations and taking additional charge of injection moulding machine manufacturing. Dipeshkumar Mukundbhai Kachhia was named Vice President Human Resources, managing the company's HR department and taking additional charge of Global CNC Private Limited's HR department. Kiran Narayan More was appointed Deputy General Manager for Sales and Marketing, handling pipe extrusion machines in India and taking additional charge of export business. Keyur Dilipbhai Patel was appointed Manager Manufacturing Assembly, overseeing injection moulding machine assembly and taking additional charge of pipe extrusion machine assembly. All appointments are full-time positions.",
            "Sentiment": "positive",
            "PublishDate": 1762638749420,
            "Source": "corporate_governance"
        },
        {
            "Title": "Windsor Machines Approves Preferential Issue of 7.37 Lakh Equity Shares Worth Rs 25 Crore",
            "Summary": "Windsor Machines Limited's Board of Directors approved the issuance of 7,37,680 equity shares at Rs 338.90 per share, totaling Rs 24.99 crore. The shares will be issued on a preferential basis to five non-promoter individuals as consideration for acquiring 59.52% equity stake in Unitech Workholding Systems Private Limited. The allottees include Manishbhai Savjibhai Pipaliya, Rohitkumar Jamanbhai Donga, Punitkumar Dhirajlal Koradia, Chetan Bachubhai Makwana, and Karsan Arjan Maliya, each receiving 1,47,536 shares. The transaction is structured as a share swap arrangement and requires shareholder and regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1762638417270,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Reports Strong Q2 Turnaround with 43M Rupees Net Profit",
            "Summary": "Windsor Machines delivered a significant turnaround in its quarterly results, posting a consolidated net profit of 43 million rupees compared to a loss of 260 million rupees in the same period last year. Revenue more than doubled to 1.37 billion rupees from 594 million rupees year-over-year. The company's EBITDA increased substantially to 85 million rupees from 30 million rupees, while EBITDA margin improved to 6.22% from 5.1% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762626098120,
            "Source": "earnings"
        },
        {
            "Title": "Windsor Machines Reports No Deviation in Preferential Issue Proceeds Utilization for September Quarter",
            "Summary": "Windsor Machines Limited submitted its monitoring agency report for the quarter ended September 30, 2025, prepared by ICRA Limited. The report confirms no deviation from the stated objects of the preferential issue worth INR 725 crore, which included equity shares and warrants. The company utilized INR 462.48 crore of the net proceeds across five main objectives: acquisition of Global CNC Private Limited (INR 342.77 crore utilized out of INR 344 crore allocated), funding capex requirements (INR 81.71 crore utilized out of INR 165 crore), working capital for the company (INR 10 crore utilized out of INR 63.80 crore), working capital for Global CNC (INR 13 crore utilized out of INR 52.20 crore), and general corporate purposes (INR 15 crore utilized out of INR 100 crore). The monitoring agency noted that INR 462.50 crore was credited to net proceeds accounts as only part payment was received against warrants. All statutory approvals including GPCB approval have been obtained, and the implementation timeline remains on schedule across all objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762613470547,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Reports Quarterly Loss, Approves Major Acquisitions and Manufacturing Plant Relocation",
            "Summary": "Windsor Machines Limited reported a net loss of Rs. 305.61 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs. 155.48 lakhs in the same period last year. Revenue from operations increased to Rs. 6,960.46 lakhs from Rs. 5,838.18 lakhs year-over-year. The Board approved several strategic decisions including the acquisition of 100% equity shares of Unitech Workholding Systems Private Limited for Rs. 42 crores through cash and share swap, and a scheme of amalgamation with wholly-owned subsidiary Global CNC Private Limited. The company also approved purchasing non-agriculture land in Gujarat for Rs. 55 crores and relocating its corporate office. Additionally, four senior management personnel were appointed to key positions. The company is shifting both manufacturing plants to a new integrated facility in Chibhda, Rajkot, with injection machinery plant relocation already completed at a cost of Rs. 219 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1762612462834,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Unit Global CNC to Begin Operations at New Rajkot Facility",
            "Summary": "Windsor Machines announced that its unit Global CNC will commence operations at a new facility in Rajkot on September 1, 2025. This represents an expansion of the company's manufacturing capabilities through its subsidiary unit.",
            "Sentiment": "positive",
            "PublishDate": 1756447898179,
            "Source": "stock"
        },
        {
            "Title": "Windsor Machines Reports Rs 1,606 Lakh Net Loss in Q1 FY2026 Amid Plant Relocation Costs",
            "Summary": "Windsor Machines Limited reported a standalone net loss of Rs 1,605.88 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 869.45 lakhs in the previous quarter. Revenue from operations declined to Rs 6,960.46 lakhs from Rs 8,284.19 lakhs in the preceding quarter. The company incurred exceptional charges of Rs 1,161.61 lakhs related to shifting manufacturing plants from Vatva and Chhatral to Rajkot, including worker settlement payments. On a consolidated basis, the net loss was Rs 1,053.77 lakhs. The company completed acquisition of Global CNC Pvt Ltd in February 2025 and received partial payment of Rs 3,000 lakhs on July 31, 2025, from an earlier inter-corporate loan settlement, with balance payment expected by August 14, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754470961831,
            "Source": "earnings"
        },
        {
            "Title": "Windsor Machines Reports Strong Q1 Growth with Revenue Jump to 1.1B Rupees",
            "Summary": "Windsor Machines delivered strong quarterly results with revenue rising to 1.1 billion rupees from 808 million rupees in the same period last year. The company turned profitable with consolidated net profit before exceptional items of 23 million rupees, compared to a loss of 44 million rupees in the previous year. EBITDA improved significantly to 80 million rupees from 12 million rupees, while EBITDA margin expanded to 7.04% from 1.44%. The company recorded an exceptional item of 116 million rupees during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754469931134,
            "Source": "earnings"
        },
        {
            "Title": "Windsor Machines Reports Q4 Financial Results",
            "Summary": "Windsor Machines has reported its latest quarterly financial results. The company's consolidated net loss for Q4 was 41 million rupees, compared to a loss of 75 million rupees in the same quarter of the previous year. Revenue for Q4 increased to 1.2 billion rupees from 1.06 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748252439000,
            "Source": "result"
        },
        {
            "Title": "Windsor Machines Reports Increased Q3 Consolidated Profit",
            "Summary": "Windsor Machines has reported a consolidated profit before exceptional items of 40 million rupees for the third quarter, compared to 28 million rupees in the same period last year. The company also disclosed an exceptional item of 379 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738399891000,
            "Source": "earnings"
        },
        {
            "Title": "Windsor Machines Reports Q3 Revenue Increase",
            "Summary": "Windsor Machines has reported a revenue of 1.07 billion rupees for the third quarter, compared to 870 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738399881000,
            "Source": "earnings"
        },
        {
            "Title": "Windsor Machines Reports Stable Q3 EBITDA, Margin Decline",
            "Summary": "Windsor Machines has reported Q3 EBITDA of 88 million rupees, which remains unchanged compared to the same period last year. However, the company's EBITDA margin has decreased from 10.05% to 8.15% year-over-year, indicating a decline in profitability despite maintaining the same EBITDA level.",
            "Sentiment": "neutral",
            "PublishDate": 1738399857000,
            "Source": "earnings"
        },
        {
            "Title": "Windsor Machines to Divest Stake in RCube Energy Storage Systems",
            "Summary": "Windsor Machines has announced its decision to sell its stake in RCube Energy Storage Systems. The consideration for this divestment is set at 4 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1736514498000,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Allots 6.5 Million Shares to Investor Madhusudan Kela",
            "Summary": "Windsor Machines has issued 6.5 million new shares to investor Madhusudan Kela. This allotment represents a significant corporate action, potentially indicating a strategic investment or capital raising effort by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1736404102000,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines to Acquire Global CNC for 3.43 Billion Rupees",
            "Summary": "Windsor Machines has announced plans to purchase Global CNC for a sum of 3.43 billion rupees. This acquisition represents a significant corporate action for Windsor Machines, potentially expanding its capabilities or market presence in the machinery sector.",
            "Sentiment": "positive",
            "PublishDate": 1731338265000,
            "Source": "corporate_action"
        },
        {
            "Title": "Windsor Machines Reports Q2 Revenue Decline",
            "Summary": "Windsor Machines has reported a revenue of 591 million rupees for the second quarter, which is a decrease from 893 million rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730985855000,
            "Source": "result"
        },
        {
            "Title": "Windsor Machines Reports Q2 Loss",
            "Summary": "Windsor Machines has reported a consolidated net loss of 260 million rupees in Q2, compared to a profit of 15 million rupees in the same quarter last year. The loss has increased from 40.7 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730985843000,
            "Source": "result"
        }
    ]
}