{
    "Symbol": "WINSOME",
    "ISIN": "INE784B01035",
    "News": [
        {
            "Title": "Winsome Yarns Appoints Secretarial Auditor for 5 Years",
            "Summary": "Winsome Yarns Limited has appointed M/s Girish Madan & Associates as Secretarial Auditor for five consecutive financial years from FY 2025-26 to FY 2029-30, subject to Committee of Creditors approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768297526359,
            "Source": "stocks"
        },
        {
            "Title": "Winsome Yarns Independent Director Tenure Ends",
            "Summary": "Winsome Yarns Limited announces completion of Mr. Rajiv Chadha's five-year tenure as Independent Director, effective January 6, 2026, following conclusion of 35th AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1768297280871,
            "Source": "stocks"
        },
        {
            "Title": "Winsome Yarns CoC Meeting Approves Resolutions",
            "Summary": "Winsome Yarns Limited's 24th Committee of Creditors meeting held on November 4, 2025, successfully approved proposed resolutions with requisite majority under CIRP proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1768296897832,
            "Source": "stocks"
        },
        {
            "Title": "Winsome Yarns Delays Financial Results Submission Due to Ongoing Insolvency Process",
            "Summary": "Winsome Yarns Limited failed to submit its unaudited financial results for the quarter and half year ended September 30, 2025, within regulatory timelines due to its ongoing Corporate Insolvency Resolution Process since December 2023. The company is not fully operational, lacks sufficient funds, and has lost most employees since entering CIRP, with powers transferred from the Board of Directors to the Resolution Professional under insolvency regulations.",
            "Sentiment": "negative",
            "PublishDate": 1763650103631,
            "Source": "stock"
        },
        {
            "Title": "Winsome Yarns Limited Schedules 24th Committee of Creditors Meeting",
            "Summary": "Winsome Yarns Limited has announced its 24th Committee of Creditors meeting scheduled for November 4, 2025, at 12:30 PM. The meeting will be conducted by the Resolution Professional through video conferencing at ARCK Resolution Professionals LLP's office in New Delhi. The company is currently under Corporate Insolvency Resolution Process (CIRP). The meeting notification was sent to BSE Limited and National Stock Exchange of India as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762241055759,
            "Source": "corporate_governance"
        },
        {
            "Title": "Winsome Yarns Reports Rs 1,730 Lakh Loss Under Corporate Insolvency Resolution Process",
            "Summary": "Winsome Yarns Limited, operating under Corporate Insolvency Resolution Process since December 2023, reported a net loss of Rs 1,730 lakhs for the year ended March 31, 2025, compared to Rs 1,094 lakhs in the previous year. The company's audited financial results received a qualified opinion from auditors citing material uncertainty about its ability to continue as a going concern due to accumulated losses, negative net worth, and continuous losses. The auditors highlighted non-provisioning of interest expenses of Rs 26,434 lakhs on borrowings and aggregate unprovided interest of Rs 1,53,285 lakhs till March 2025. The Committee of Creditors has approved a resolution plan by Mohini Health Hygiene Limited, with performance security of Rs 20.20 crores deposited. The company's total assets stood at Rs 20,573 lakhs with negative equity of Rs 43,721 lakhs as of March 31, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761914523409,
            "Source": "earnings"
        },
        {
            "Title": "Winsome Yarns Limited Holds 23rd Committee of Creditors Meeting Under Insolvency Process",
            "Summary": "Winsome Yarns Limited conducted its 23rd Committee of Creditors meeting on August 21, 2025, at 3:30 PM through video conferencing. The meeting was organized by the Resolution Professional as part of the ongoing Corporate Insolvency Resolution Process for the company. The session was held at the office of ARCK Resolution Professionals LLP in New Delhi. The company informed stock exchanges BSE and NSE about this development through a regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1755599960258,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajesh Sharma Group Increases Winsome Yarns Stake to 5.064% Through Open Market Purchase",
            "Summary": "Rajesh Sharma and associated persons acquired additional shares of Winsome Yarns Ltd through open market transactions. The group's total holding increased from 3,500,000 shares (4.950%) to 3,580,759 shares (5.064%). The acquisition involved Dnyaneshwar Trading & Investments Pvt. Ltd purchasing 80,759 shares on August 7, 2025. The shareholding group includes Rajesh Sharma (2,800,000 shares), Capri Global Holdings Private Limited (700,000 shares), and Dnyaneshwar Trading & Investments Pvt. Ltd (80,759 shares). The acquisition crossed the 5% threshold, triggering disclosure requirements. Winsome Yarns' equity share capital remains at Rs. 707,072,290.",
            "Sentiment": "neutral",
            "PublishDate": 1754888802429,
            "Source": "corporate_action"
        }
    ]
}