{
    "Symbol": "WINSOL",
    "ISIN": "INE0S3D01016",
    "News": [
        {
            "Title": "Winsol Engineers Receives ₹21 Crore Order",
            "Summary": "Winsol Engineers has secured an order valued at ₹21 crores. The project is scheduled to be completed by December 2025. The company expects this order to boost its annual revenue by 20%.",
            "Sentiment": "positive",
            "PublishDate": 1752482581000,
            "Source": "default"
        },
        {
            "Title": "Winsol Engineers Reports Significant Sales Growth for 2024-25",
            "Summary": "Winsol Engineers has announced a substantial increase in sales for the fiscal year 2024-25. The company's sales have risen to Rs 1105.08 million, marking a remarkable growth rate of 47.03% compared to the previous year's figure of Rs 751.65 million.",
            "Sentiment": "positive",
            "PublishDate": 1744875930000,
            "Source": "default"
        },
        {
            "Title": "Winsol Engineers: Secures ₹2.2 Crore Order from Adani Green Energy",
            "Summary": "Winsol Engineers received a new service order worth over ₹2.2 crore from Adani Green Energy for transmission line work in Khavda, Gujarat. The scope includes material handling, erection, testing, and commissioning of a 400KV transmission line. This order is expected to strengthen the company's customer base and contribute to business growth.",
            "Sentiment": "positive",
            "PublishDate": 1743477881000,
            "Source": "order&deals"
        },
        {
            "Title": "Winsol Engineers: Secures ₹5.83 Crore Order from Gujarat Energy Transmission",
            "Summary": "Winsol Engineers received a ₹5.83 crore order from Gujarat Energy Transmission Corporation for cable laying and commissioning. The project has a 24-month execution timeline. The company's stock price jumped 5.36% to ₹184.50 on NSE SME following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1742372489000,
            "Source": "order&deals"
        },
        {
            "Title": "Winsol Engineers Secures 5.8 Crore Rupee Order",
            "Summary": "Winsol Engineers, a small and medium enterprise (SME) with a market capitalization of 200 crore rupees, has won a new order worth 5.8 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742286825000,
            "Source": "order&deals"
        },
        {
            "Title": "Winsol Engineers Secures Two LOAs for Agricultural Feeder Solarization",
            "Summary": "Winsol Engineers has received two Letters of Award (LOAs) from Paschim Gujarat Vij Company Ltd (PGVCL) for the solarization of 11 kV agricultural feeders under the PM KUSUM scheme. This project aims to promote solar energy use in agriculture.",
            "Sentiment": "positive",
            "PublishDate": 1731073680000,
            "Source": "corporate_action"
        }
    ]
}