{
    "Symbol": "WIPRO",
    "ISIN": "INE075A01022",
    "News": [
        {
            "Title": "Wipro Allots 3.78 Lakh Equity Shares Under ESOP Plans",
            "Summary": "Wipro Limited has allotted 3,78,185 equity shares on February 6, 2026, under two ESOP plans - 1,88,122 shares under ADS Restricted Stock Unit Plan 2004 and 1,90,063 shares under Restricted Stock Unit Plan 2007.",
            "Sentiment": "neutral",
            "PublishDate": 1770392648272,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Joins MIT's Industrial Liaison Program",
            "Summary": "Wipro has joined MIT's Industrial Liaison Program to enhance frontier technology innovation through collaboration with MIT's faculty and startup community across five key areas.",
            "Sentiment": "positive",
            "PublishDate": 1770201195780,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Allots 154,549 Equity Shares Under ESOP Plans",
            "Summary": "Wipro Limited allotted 154,549 equity shares on January 31, 2026, comprising 56,908 shares under ADS Restricted Stock Unit Plan 2004 and 97,641 shares under Restricted Stock Unit Plan 2007.",
            "Sentiment": "neutral",
            "PublishDate": 1769879144405,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Hosts 15th earthian Awards 2025 for Sustainability",
            "Summary": "Wipro Limited hosted the 15th earthian Awards 2025 at Azim Premji University, recognizing 25 winning teams from over 2,000 submissions for excellence in sustainability education across India.",
            "Sentiment": "positive",
            "PublishDate": 1769837618788,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Launches New AI-Powered Operating Model",
            "Summary": "Wipro announces new consulting-led, AI-powered operating model combining advisory, AI, and transformation services across four core enterprise functions to deliver end-to-end accountability.",
            "Sentiment": "positive",
            "PublishDate": 1769693140241,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Partners with Factory for AI-Native Development",
            "Summary": "Wipro Limited announces strategic partnership with Factory to accelerate agent-native software development for enterprises globally, with Wipro Ventures participating in Factory's funding round.",
            "Sentiment": "positive",
            "PublishDate": 1769597100804,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Among 5 Companies Setting Jan 27 Dividend Record Date",
            "Summary": "Five listed companies including Wipro have announced January 27, 2026 as the record date for dividend eligibility in FY26, with Rs 44 dividend declared through exchange filings.",
            "Sentiment": "positive",
            "PublishDate": 1769340709042,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro's AI turnaround faces delays despite deal wins",
            "Summary": "Wipro Executive Chairman Rishad Premji acknowledges bumpy road ahead as client ramp-up delays persist despite 25% YoY order booking growth and 75% jump in large deal order book year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1769014799466,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Incorporates New US Subsidiary for IT Services",
            "Summary": "Wipro Limited announces incorporation of Wipro Business Services LLC as step-down subsidiary in the US on January 20, 2026, to expand global IT operations and digital transformation services.",
            "Sentiment": "positive",
            "PublishDate": 1769004503532,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Securities Maintains Hold on Wipro at ₹256",
            "Summary": "ICICI Securities maintains Hold rating on Wipro with target price of ₹256, citing soft Q3FY26 organic revenue growth of 0.6% QoQ and weak Q4FY26 guidance of -1.6% to 0.5% QoQ amid delayed deal ramp-ups.",
            "Sentiment": "negative",
            "PublishDate": 1768989634742,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Q3FY26 Revenue Grows 1.4% QoQ; Motilal Neutral",
            "Summary": "Wipro reports Q3FY26 IT services revenue of $2.60 billion, up 1.4% QoQ, with adjusted PAT at ₹34.00 billion. Motilal Oswal maintains neutral rating with ₹275 target price.",
            "Sentiment": "neutral",
            "PublishDate": 1768987260883,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEO rallies fade as Wipro, LTIMindtree face IT slump",
            "Summary": "Wipro and LTIMindtree shares plunge despite beating revenue expectations, wiping out most CEO rally gains. AI automation and tariff uncertainty weigh on IT sector outlook.",
            "Sentiment": "negative",
            "PublishDate": 1768901347485,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Gets Hold Rating with ₹260 Target Price",
            "Summary": "Prabhudas Lilladher maintains Hold rating on Wipro with target price of ₹260, citing Q3 revenue growth of 1.4% QoQ but concerns over Q4 organic growth guidance and execution challenges in large deals.",
            "Sentiment": "neutral",
            "PublishDate": 1768895600005,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Q3 Results Beat Revenue Estimates, Margin Pressure",
            "Summary": "Wipro reported Q3 revenue of ₹23,556 crores, beating estimates by 4.1% with 5.5% YoY growth. However, EBITDA margin declined to 18.6% from 19.5% in Q2, impacted by higher employee costs and elevated expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1768890318032,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Salary Hike Decision Coming Soon, Q3 Margins Hit 17.6%",
            "Summary": "Wipro CHRO confirms salary hike decision after Davos return. Company reports 17.6% margins in Q3, plans to onboard 2,000-2,500 freshers in Q4, with attrition declining over 2% in October-December quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768834359511,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro confident on AI-led growth amid cautious spending",
            "Summary": "Wipro management expresses confidence in execution-led growth strategy despite cautious client spending, with Q4 revenue guidance of $2.63-2.68 billion and strong operating margins at 17.6%.",
            "Sentiment": "positive",
            "PublishDate": 1768817577298,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro shares tank 9% on Morgan Stanley downgrade",
            "Summary": "Morgan Stanley downgrades Wipro to underweight, cuts price target to ₹242. Weak Q4 guidance and slower deal conversion trigger analyst concerns across brokerages.",
            "Sentiment": "negative",
            "PublishDate": 1768798029005,
            "Source": "stocks"
        },
        {
            "Title": "Wipro submits Q3FY26 auditor reports with UDIN",
            "Summary": "Wipro Limited filed auditor's reports for Q3FY26 quarter ended December 31, 2025, with Unique Document Identification Numbers for standalone and consolidated financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1768576190732,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro shares crash 9.5%, brokerages see downside",
            "Summary": "Wipro shares fell 9.5% to Rs 241.75 after mixed Q3 results and subdued Q4 guidance. Jefferies cuts target to Rs 220 with underperform rating, citing limited earnings growth prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768576074076,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Evaluates H-1B Visa Policy Changes",
            "Summary": "Wipro executive discusses company's approach to new H-1B visa regulations and confirms no expected impact from recent labor code changes on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768570173769,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Executive: Geopolitics Not Major Concern Now",
            "Summary": "A Wipro company executive has stated that geopolitical factors are not currently considered a major concern for the IT services company's operations and business outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1768568837737,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Q4 FY26 Revenue Guidance & Q3 Bookings Update",
            "Summary": "Wipro provides Q4 FY26 IT services revenue guidance of $2,635-2,688 million and reports Q3 total bookings of $3,335 million, alongside interim dividend of ₹6 per share. Company aims to maintain Q4 margins in recent quarters' range.",
            "Sentiment": "neutral",
            "PublishDate": 1768559166767,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro shares surge 4% ahead of Q3 results",
            "Summary": "Wipro shares rallied 3.7% to ₹269.80 ahead of Q3 earnings. Brokerages expect modest 0.4% YoY profit growth and 4% revenue growth, with sequential growth remaining sluggish amid macro pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1768547362403,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Receives ESG Rating of 74 from Independent Agency",
            "Summary": "Wipro Limited has been assigned an ESG rating of 74 by ESG Risk Assessments & Insights Limited. The rating was assigned voluntarily by the agency without any engagement from Wipro, based on publicly available company data.",
            "Sentiment": "positive",
            "PublishDate": 1768483039045,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Q3 Preview: Revenue may rise 4% YoY; margins under pressure",
            "Summary": "Wipro expected to report modest 4% YoY revenue growth in Q3 with flat profit performance. Margins under pressure from furloughs, deal ramp-up costs and Harman acquisition integration weighing on profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1768457104677,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Grants 24,390 ADS Stock Units to Employee",
            "Summary": "Wipro Limited has granted 24,390 ADS Restricted Stock Units to a subsidiary employee under its Employee Stock Options Scheme 2024, effective January 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768302687084,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro mandates 6-hour office presence 3 days weekly",
            "Summary": "Wipro revises hybrid work policy requiring employees to spend minimum 6 hours in office on designated days from January 2026, with leave deductions for non-compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767790431068,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Q3FY26 Results & Earnings Call on Jan 16, 2026",
            "Summary": "Wipro announces Q3FY26 results on January 16, 2026, followed by earnings conference call at 7:00 PM IST with senior management discussing quarterly performance and answering investor questions.",
            "Sentiment": "neutral",
            "PublishDate": 1767616968968,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Allots 94,813 Equity Shares Under ESOP Plans",
            "Summary": "Wipro Limited has allotted 94,813 equity shares on December 22, 2025, under its ADS Restricted Stock Unit Plan 2004 and Restricted Stock Unit Plan 2007 following ESOP exercises by employees.",
            "Sentiment": "neutral",
            "PublishDate": 1766420794874,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Enhances Google Cloud Partnership",
            "Summary": "Wipro and Google Cloud announce enhanced partnership introducing Gemini Enterprise worldwide, expanding their collaborative technology offerings.",
            "Sentiment": "positive",
            "PublishDate": 1765546145937,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Announces Three-Year Microsoft Partnership",
            "Summary": "Wipro reveals strategic three-year partnership agreement with Microsoft, marking a significant collaboration between the IT services giant and the technology leader.",
            "Sentiment": "positive",
            "PublishDate": 1765536299926,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wipro Partners Microsoft for AI-Powered Enterprise",
            "Summary": "Wipro announces three-year strategic partnership with Microsoft to help enterprises transform into AI-powered Frontier Firms, launching Microsoft Innovation Hub and deploying 50,000+ Copilot licenses.",
            "Sentiment": "positive",
            "PublishDate": 1765534435192,
            "Source": "stocks"
        },
        {
            "Title": "Citi Maintains SELL Rating on Wipro at ₹220 Target",
            "Summary": "Citi continues its SELL recommendation on Wipro with a target price of ₹220, reflecting cautious outlook on the IT services major's near-term prospects.",
            "Sentiment": "negative",
            "PublishDate": 1765424809971,
            "Source": "stocks"
        },
        {
            "Title": "Wipro Allots 5.67 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "Wipro allotted 2,19,846 equity shares under ADS Restricted Stock Unit Plan 2004 and 3,47,932 equity shares under Restricted Stock Unit Plan 2007 on December 9, 2025. The allotment was made pursuant to exercise of ESOPs by employees, increasing the company's total equity share count.",
            "Sentiment": "neutral",
            "PublishDate": 1765283185473,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro Grants 69,597 ADS Restricted Stock Units to Employees",
            "Summary": "Wipro granted 69,597 ADS Restricted Stock Units to identified employees under its Employee Stock Options, Performance Stock Unit and Restricted Stock Unit Scheme 2024, effective December 3, 2025. The units will vest according to the schedule approved by the Nomination and Remuneration Committee and can be exercised over the approved exercise period.",
            "Sentiment": "positive",
            "PublishDate": 1764843157323,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro Completes Acquisition of Harman Connected Services Inc. and Related Assets",
            "Summary": "Wipro has finalized the full purchase of Harman Connected Services Inc. and assets from Harman International on December 1, 2025. The acquisition expands Wipro's capabilities in connected services technology and automotive solutions.",
            "Sentiment": "neutral",
            "PublishDate": 1764646375325,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro Completes Acquisition of Harman's Digital Transformation Solutions Business Unit",
            "Summary": "Wipro has successfully completed the purchase of Harman's Digital Transformation Solutions Business Unit. This acquisition expands Wipro's capabilities in digital transformation services and strengthens its position in the technology solutions market.",
            "Sentiment": "positive",
            "PublishDate": 1764644105875,
            "Source": "order&deals"
        },
        {
            "Title": "Wipro Amends Fair Disclosure Code to Comply with Updated SEBI Insider Trading Regulations",
            "Summary": "Wipro has amended its Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information to incorporate recent amendments to SEBI (Prohibition of Insider Trading) Regulations, 2015, effective December 1, 2025. The updated code establishes frameworks for uniform disclosure of price-sensitive information, defines legitimate purposes for information sharing, and outlines procedures for interactions with analysts and investors to ensure regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1764596817633,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wipro Allots 1.33 Million Equity Shares Under ESOP Plans",
            "Summary": "Wipro allotted 1,278,034 equity shares under ADS Restricted Stock Unit Plan 2004 and 53,274 equity shares under Restricted Stock Unit Plan 2007 on December 1, 2025. The allotment was made pursuant to exercise of ESOPs by eligible employees under the company's stock compensation programs.",
            "Sentiment": "neutral",
            "PublishDate": 1764588008785,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro Secures Multi-Year IT Transformation Contract with Odido Netherlands",
            "Summary": "Wipro announced a multi-year engagement with Odido Netherlands B.V. to transform the company's IT landscape and enhance customer experience. The partnership positions Wipro to provide comprehensive technology services to the Netherlands-based telecommunications company over an extended period.",
            "Sentiment": "positive",
            "PublishDate": 1764288375774,
            "Source": "order&deals"
        },
        {
            "Title": "Wipro Partners with IISc for AI Research Program",
            "Summary": "Wipro announced a strategic alliance with the Indian Institute of Science (IISc) to establish a joint research program focused on artificial intelligence. The partnership aims to advance AI research capabilities through collaboration between the IT services company and the premier academic institution.",
            "Sentiment": "positive",
            "PublishDate": 1764202229980,
            "Source": "stock"
        },
        {
            "Title": "Wipro Allots 108,098 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Wipro Limited allotted 13,916 equity shares under ADS Restricted Stock Unit Plan 2004 and 94,182 equity shares under Restricted Stock Unit Plan 2007 on November 20, 2025. The allotment was made pursuant to exercise of ESOPs and affects the company's share capital structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763640771869,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro Grants Stock Units to Employees Under 2024 Scheme",
            "Summary": "Wipro granted 18,727 ADS Restricted Stock Units and 20,688 Restricted Stock Units to identified employees under its Employee Stock Options, Performance Stock Unit and Restricted Stock Unit Scheme 2024, effective November 12, 2025. The stock units will vest according to the schedule approved by the Nomination and Remuneration Committee and can be exercised over the approved exercise period.",
            "Sentiment": "neutral",
            "PublishDate": 1763046404217,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro Allots 238,522 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Wipro Limited allotted 238,522 equity shares on November 6, 2025, following the exercise of Employee Stock Option Plans (ESOPs). The allotment comprised 139,294 equity shares under the ADS Restricted Stock Unit Plan 2004 and 99,228 equity shares under the Restricted Stock Unit Plan 2007. The company informed BSE and NSE about this share allotment through a regulatory communication signed by Company Secretary M Sanaulla Khan.",
            "Sentiment": "neutral",
            "PublishDate": 1762432556368,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro to Sell Complete Stake in Drivestream India for ₹18.03 Crore",
            "Summary": "Wipro will sell its entire stake in Drivestream India to Drivestream Inc for ₹18.03 crore as part of a restructuring plan. The transaction is expected to be completed by December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762182172603,
            "Source": "order&deals"
        },
        {
            "Title": "Wipro to Ring NYSE Closing Bell Celebrating 25 Years of Listing and AI Platform Launch",
            "Summary": "Wipro Limited will ring the closing bell at the New York Stock Exchange on October 31, 2025, marking 25 years since its NYSE listing and celebrating the launch of its Wipro Intelligence suite of AI-powered platforms. Executive Chairman Rishad Premji and CEO Srini Pallia will lead the ceremony, which will be livestreamed starting 3:56 PM EDT. The company is celebrating dual milestones of 25 years on NYSE and 80 years since its founding in 1945. Wipro Intelligence represents the company's latest AI-powered platforms and solutions designed to help clients build future-forward enterprises. The company operates across over 60 countries with more than 230,000 employees and business partners across 65 countries. Wipro's Founder Chairman Azim H. Premji was named in the 2025 TIME100 Philanthropy list.",
            "Sentiment": "positive",
            "PublishDate": 1761854473963,
            "Source": "stock"
        },
        {
            "Title": "Wipro Signs Long-Term AI-Driven IT Deal With Hanesbrands",
            "Summary": "Wipro has entered into a long-term agreement with Hanesbrands to provide AI-driven IT improvements. The partnership aims to optimize operations and enhance cybersecurity through Wipro's Intelligence™ Wings Platform. The deal focuses on leveraging artificial intelligence capabilities to improve Hanesbrands' technology infrastructure and security systems.",
            "Sentiment": "positive",
            "PublishDate": 1761733787757,
            "Source": "order&deals"
        },
        {
            "Title": "Wipro Allots 42,156 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Wipro Limited has allotted a total of 42,156 equity shares through the exercise of employee stock options. The allotment includes 34,790 shares under the ADS Restricted Stock Unit Plan 2004 and 7,366 shares under the Restricted Stock Unit Plan 2007. The shares were allotted on October 28, 2025, following the exercise of ESOPs by employees.",
            "Sentiment": "neutral",
            "PublishDate": 1761695845998,
            "Source": "corporate_action"
        },
        {
            "Title": "Wipro Shares Drop 4.48% Despite Strong Quarterly Results and $2.9 Billion Deal Bookings",
            "Summary": "Wipro shares declined 4.48% to ₹242.44 despite reporting better-than-expected quarterly results. The IT services company posted revenue of $2,604.3 million, up 0.7% quarter-on-quarter, beating estimates. Large deal bookings surged 90.5% year-on-year to $2.9 billion, with total bookings reaching $4.7 billion. The company provided revenue guidance of $2.5-2.6 billion for the next quarter, indicating -0.5% to +1.5% sequential growth in constant currency terms. Operating margin stood at 16.7%, impacted by a ₹1,165 million provision related to a client bankruptcy, while adjusted margin was 17.2%. Brokerage opinions remain divided - Nomura maintains a Buy rating with ₹280 target citing strong deal wins, while Motilal Oswal retained its Sell rating at ₹200 due to growth concerns. Jefferies kept its Underperform stance at ₹220, noting potential margin pressure from deal ramps and acquisitions despite healthy bookings.",
            "Sentiment": "negative",
            "PublishDate": 1760681612070,
            "Source": "earnings"
        },
        {
            "Title": "Wipro Signs Two Major Deals Worth Over $500 Million Each",
            "Summary": "Wipro announced that it has signed two major deals, each valued at over $500 million, during the second quarter. A company executive made this announcement regarding the significant contract wins.",
            "Sentiment": "positive",
            "PublishDate": 1760615164483,
            "Source": "order&deals"
        }
    ]
}