{
    "Symbol": "WOCKPHARMA",
    "ISIN": "INE049B01025",
    "News": [
        {
            "Title": "Wockhardt Q3FY26 QIP Monitoring Report Shows Progress",
            "Summary": "Wockhardt submitted Q3FY26 monitoring agency report showing Rs 26.60 crores utilization from QIP proceeds with no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1770725033146,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wockhardt's Foviscu Matches Meropenem in Phase 3 Trial",
            "Summary": "Wockhardt's novel antibiotic Foviscu achieved 93.23% clinical cure rate versus 92.31% with meropenem in Phase 3 trial for complicated urinary tract infections, becoming the company's fifth proprietary antibiotic to complete registration-enabling study.",
            "Sentiment": "positive",
            "PublishDate": 1769485049086,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt Plans 5-6 New Antibiotics in Next 4-5 Years",
            "Summary": "Wockhardt chairman announces pipeline of novel antibiotics targeting drug-resistant infections, with Zaynich under USFDA Fast Track review and approval expected by mid-2026.",
            "Sentiment": "positive",
            "PublishDate": 1768838013991,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt shares surge 4% on EMA filing for WCK 5222",
            "Summary": "Wockhardt shares gained nearly 4% after filing marketing authorisation application with European Medicines Agency for novel antibiotic WCK 5222, eligible for accelerated assessment with potential €400-500M market.",
            "Sentiment": "positive",
            "PublishDate": 1767757524317,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt Targets European Approval for Zaynich",
            "Summary": "Wockhardt aims to secure European regulatory approval for its drug Zaynich by July 2026, marking a significant milestone in the pharmaceutical company's international expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1767243172427,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt Gets Upgraded ESG Rating of 73 (Excellent)",
            "Summary": "Wockhardt Limited receives improved ESG rating of 73 (Excellent) for 2025 from ESG Risk Assessments & Insights Limited, marking significant improvement from previous 67.3 rating.",
            "Sentiment": "positive",
            "PublishDate": 1767185835127,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt Receives ₹90.23 Lakh GST Demand Notice",
            "Summary": "Wockhardt Limited received a GST demand order of ₹90.23 lakhs from Central GST authorities for FY 2019-20, including penalty. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1767180081069,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt Gets EU Accelerated Assessment for WCK 5222",
            "Summary": "European Medicines Agency grants accelerated assessment to Wockhardt's WCK 5222 antibiotic, marking India's first New Chemical Entity for pan-European marketing authorization targeting multi-drug resistant infections.",
            "Sentiment": "positive",
            "PublishDate": 1767164721812,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt Sets Up Three New Subsidiaries Abroad",
            "Summary": "Wockhardt establishes three new step-down subsidiaries in Switzerland and the USA to expand its international operations and strengthen global presence in pharmaceutical markets.",
            "Sentiment": "positive",
            "PublishDate": 1765891616323,
            "Source": "stocks"
        },
        {
            "Title": "Wockhardt Appoints Om Prakash Bhatt as Independent Director",
            "Summary": "Wockhardt Limited shareholders approve appointment of Om Prakash Bhatt as Non-Executive Independent Director for 5-year term through postal ballot with 99.99% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1765802430520,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wockhardt Achieves Historic Milestone as USFDA Accepts First-Ever Indian NDA for Breakthrough Antibiotic Zaynich",
            "Summary": "The USFDA has formally accepted Wockhardt's New Drug Application for its novel antibiotic Zaynich, marking the first time an Indian pharmaceutical company has achieved NDA acceptance for a New Chemical Entity. Zaynich, granted Fast Track designation, targets highly resistant Gram-negative pathogens and represents a transformative moment for both Wockhardt and the entire Indian pharmaceutical industry.",
            "Sentiment": "positive",
            "PublishDate": 1764569746908,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Seeks Shareholder Approval for Om Prakash Bhatt's Independent Director Appointment",
            "Summary": "Wockhardt Limited has initiated a postal ballot process for shareholders to approve the appointment of Om Prakash Bhatt as Non-Executive Independent Director for a five-year term from November 3, 2025 to November 2, 2030. The company also seeks approval for his continuation as director despite attaining 75 years of age on March 7, 2026, with e-voting scheduled from November 15 to December 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763142421162,
            "Source": "corporate_action"
        },
        {
            "Title": "Wockhardt Reports Positive Profit Before Tax of INR 91 Crore in Q2 FY26",
            "Summary": "Wockhardt Limited reported a profit before tax of INR 91 crore for Q2 FY26, compared to a loss of INR 109 crore in the previous quarter. Revenue for Q2 FY26 was INR 782 crore versus INR 738 crore in the earlier quarter. EBITDA grew 58% quarter-on-quarter to INR 160 crore from INR 101 crore. The company completed its New Drug Application submission to the US FDA for its novel antibacterial agent WCK 5222 (ZAYNICH) for treating complicated urinary tract infections. This marks the first-ever NDA submission to the US FDA for a drug fully discovered and developed by an Indian pharmaceutical company. The biotech business recorded 42% growth with operations at INR 154 crores. India business stood at Rs. 172 crore with 3% growth, UK business at Rs. 313 crore with 4% growth, and Irish business at Rs. 59 crore with 40% growth compared to the previous year. The company filed 7 patents during the quarter and was granted 5 patents, bringing total patents held to 858.",
            "Sentiment": "positive",
            "PublishDate": 1762207232696,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Reports Strong Growth in Domestic Biotech Business",
            "Summary": "Wockhardt's domestic biotech business has demonstrated strong growth performance. The company expects this business segment to continue thriving in the future.",
            "Sentiment": "positive",
            "PublishDate": 1762182163122,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Reports No Deviation in QIP Fund Utilization for September Quarter",
            "Summary": "Wockhardt Limited submitted its monitoring agency report for the quarter ended September 30, 2025, confirming no deviation in the utilization of proceeds from its Qualified Institutional Placement (QIP). The pharmaceutical company raised Rs 977.79 crores net proceeds from the QIP conducted in November 2024. Out of the total proceeds, Rs 740.69 crores have been utilized across three objectives: Rs 491.31 crores for repayment of borrowings, Rs 52.50 crores for capital expenditure and R&D investments, and Rs 196.88 crores for general corporate purposes. The remaining Rs 237.10 crores are unutilized, with Rs 50.29 crores invested in mutual funds and Rs 14.00 crores in current accounts. CRISIL Ratings Limited, serving as the monitoring agency, confirmed that all fund utilization aligns with the stated objectives in the placement document.",
            "Sentiment": "neutral",
            "PublishDate": 1762174787240,
            "Source": "corporate_action"
        },
        {
            "Title": "Wockhardt Appoints Former SBI Chairman Om Prakash Bhatt as Independent Director",
            "Summary": "Wockhardt Limited's Board approved the appointment of Om Prakash Bhatt as Additional Non-Executive Independent Director with immediate effect. Bhatt, who served as Chairman and CEO of State Bank of India for 5 years, brings extensive experience across strategic and operational roles. The Board recommended his appointment as Independent Director for a five-year term until November 2, 2030, subject to shareholder approval. He currently serves as Independent Director on boards including Coforge Limited, Tata Motors Passenger Vehicles Limited, and Greenko Energy Holdings. The company also approved its unaudited financial results for the quarter and half-year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762163176914,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Reports Q2 Net Profit of 780M Rupees, Reversing Previous Year Loss",
            "Summary": "Wockhardt reported quarterly net profit of 780 million rupees compared to a loss of 220 million rupees in the same period last year. Revenue declined to 7.82 billion rupees from 8.1 billion rupees year-over-year. EBITDA increased to 1.78 billion rupees from 1.28 billion rupees, with EBITDA margin improving significantly to 22.76% from 13.60% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762161989990,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Files New Drug Application with U.S. FDA for Zidebactam-Cefepime",
            "Summary": "Wockhardt has filed a New Drug Application with the U.S. FDA for Zidebactam-Cefepime, a treatment intended for serious Gram-negative infections. The filing represents a regulatory milestone for the pharmaceutical company's drug development pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1759290241203,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Stock Surges 9% on US Tariff Exemption Clarification",
            "Summary": "Wockhardt shares jumped over 9% to reach an intraday high of Rs 1,458, recovering from Friday's 10.2% decline. The rally followed White House clarification that countries with existing US trade deals will be exempted from pharma tariffs, facing only 15% duties instead of the announced 100% tariff on foreign-made branded drugs. This development benefits Wockhardt as its flagship antibiotic Zaynich will be produced in Europe, preserving the drug's launch economics. Zaynich targets a $7 billion market in the US and Europe, with a Rs 17,000 crore addressable market in India. The stock has gained almost 50% over the past 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1759124883446,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Says US Tariffs Won't Impact Zaynich Antibiotic Launch Plans",
            "Summary": "Wockhardt stated that President Donald Trump's 100% tariff order on branded drugs will not disrupt its plans to launch antibiotic Zaynich in the United States. Chairman Habil F Khorakiwala explained that Zaynich is manufactured in Europe, not India, making it exempt from Indian tariffs. The company plans to file an FDA application for Zaynich next week. Khorakiwala noted that most of Wockhardt's new molecules are discovered in India but manufactured in Europe, reducing exposure to Indian-origin tariffs. He highlighted that 40% of medicines used in America come from India, suggesting major restrictions could raise US drug prices. Wockhardt expects to improve margins by at least 200 basis points and achieve double-digit revenue growth this year. The company has a market capitalization of ₹22,780 crore, with shares trading at ₹1,400 and gaining 40% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1758863728170,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt States US Tariffs Will Not Significantly Impact Business Operations",
            "Summary": "Wockhardt has stated that US tariffs will not significantly affect its business operations. The pharmaceutical company made this assessment regarding the potential impact of US trade policies on its operations.",
            "Sentiment": "positive",
            "PublishDate": 1758859762439,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt's Antibiotic Miqnaf Published in THE LANCET Regional Health Journal",
            "Summary": "Wockhardt Limited announced the publication of its pivotal Phase 3 clinical study on antibiotic Miqnaf (Nafithromycin) in THE LANCET Regional Health Southeast Asia journal. This represents the first publication in a LANCET journal for a novel drug discovered and developed in India. Miqnaf is the first new macrolide antibiotic in over three decades, designed to treat community-acquired bacterial pneumonia (CABP) with a once-daily, three-day oral treatment regimen. The Phase 3 study involving nearly 500 patients demonstrated non-inferior efficacy compared to moxifloxacin, with clinical improvement observed in over 90% of patients within 3-4 days. The drug addresses multi-drug resistant CABP, particularly relevant as resistance to macrolides in India has reached nearly 75% according to the 2023 ICMR report. Miqnaf is the third novel antibiotic from Wockhardt's discovery program and has received Qualified Infectious Disease Product designation from the US FDA. Wockhardt operates globally with around 2,900 employees across 27 nationalities, generating approximately 77% of revenues from international businesses.",
            "Sentiment": "positive",
            "PublishDate": 1758797669127,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Targets Healthy Profits After US Business Exit Despite Rising Losses",
            "Summary": "Wockhardt reported a consolidated net loss of Rs 108 crore in Q1FY26, significantly higher than Rs 16 crore loss in Q1FY25. Founder Chairman Habil Khorakiwala attributed the increased loss to a one-time goodwill write-off from exiting the loss-making US generics business and upfront costs for new drug Miqnaf. The company expects a healthy bottom line in coming quarters following the US exit. Wockhardt's flagship antibiotic Zaynich, manufactured in Europe, will remain unaffected by potential US-India trade tariffs. The company plans to file a New Drug Application with USFDA for Zaynich in September 2025, expecting approval by mid-2026, while anticipating commercial launch in India by early 2026. Clinical trials for another antibiotic Foviscu are expected to conclude by October 2025. Khorakiwala believes US tariffs will have limited impact on Indian pharma sector due to manufacturing complexities and potential drug shortages. Wockhardt shares traded 0.69% lower at Rs 1,462.1 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754962680886,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Reports No Deviation in ₹1,000 Crore QIP Fund Utilization for June Quarter",
            "Summary": "Wockhardt Limited submitted its monitoring agency report for the quarter ended June 30, 2025, confirming no deviation from stated objectives in utilizing proceeds from its Qualified Institutions Placement of approximately ₹1,000 crore. The report was issued by CRISIL Ratings Limited and shows total utilization of ₹583.08 crore out of net proceeds of ₹977.79 crore, leaving ₹394.71 crore unutilized. The funds were allocated across three objectives: ₹500 crore for debt repayment (₹416.31 crore utilized), ₹250 crore for capital expenditure and R&D (₹32.77 crore utilized), and ₹227.79 crore for general corporate purposes (₹134 crore utilized). Unutilized proceeds of ₹394.71 crore are invested in various mutual funds earning ₹13.20 crore in returns. The QIP was conducted from November 6-11, 2024, with net proceeds revised upward by ₹3.82 crore due to lower actual issue expenses than estimated.",
            "Sentiment": "neutral",
            "PublishDate": 1754662602792,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Completes Pre-NDA Meetings with US FDA, Targets September 2025 Filing",
            "Summary": "Wockhardt has completed two pre-New Drug Application (NDA) meetings with the US Food and Drug Administration. The pharmaceutical company aims to file its New Drug Application by September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754645681085,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Reports Strong Standalone Q1 Results with 69% Revenue Growth, Takes $97 Crore Impairment on US Exit",
            "Summary": "Wockhardt Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 413 crore, up from Rs 352 crore in the same quarter last year. Net profit surged to Rs 69 crore compared to Rs 6 crore in the previous year quarter, with earnings per share of Rs 4.25. However, consolidated results showed a net loss of Rs 108 crore, primarily due to a Rs 97 crore exceptional charge related to goodwill impairment. The company has decided to exit the US generic pharmaceutical segment and filed for voluntary liquidation of its US subsidiaries Morton Grove Pharmaceuticals Inc and Wockhardt USA LLC under Chapter 7 of the US Bankruptcy Code on July 11, 2025. Consolidated revenue remained flat at Rs 738 crore versus Rs 739 crore in the year-ago quarter. The company operates exclusively in the pharmaceutical business segment with 28 subsidiaries globally.",
            "Sentiment": "neutral",
            "PublishDate": 1754643662217,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Reports Flat Q1 Revenue Growth But Net Loss Widens Significantly",
            "Summary": "Wockhardt reported Q1 revenue of 7.4 billion rupees, marginally higher than 7.39 billion rupees in the same period last year. However, the company's consolidated net loss expanded substantially to 900 million rupees from 140 million rupees year-over-year. EBITDA declined to 720 million rupees from 910 million rupees, while EBITDA margin compressed to 9.8% from 12.31% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754642022239,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt's Zaynich Successfully Treats Drug-Resistant Infection in U.S. Liver Transplant Patient",
            "Summary": "A U.K. medical journal reported the successful treatment of a severe drug-resistant infection in a U.S. liver transplant patient using Wockhardt's drug Zaynich. The case demonstrates the effectiveness of Zaynich against challenging antibiotic-resistant infections in critical patient populations.",
            "Sentiment": "positive",
            "PublishDate": 1753674126680,
            "Source": "stock"
        },
        {
            "Title": "Wockhardt Ltd: Exits US Generics to Focus on Drug Discovery and Biologics",
            "Summary": "Wockhardt Ltd is exiting the US generics business to focus on drug discovery and biologics. The company has filed for voluntary liquidation under Chapter 7 of the US Bankruptcy Code. This strategic move aims to stop financial losses and redirect resources towards antibiotics and biologics for diabetes and obesity. Wockhardt plans to re-enter the US market with new drugs, particularly Miqnaf and Zaynich.",
            "Sentiment": "positive",
            "PublishDate": 1752569891000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wockhardt Expects Profitability Growth with 18-20% Margins",
            "Summary": "Wockhardt has stated that it is positioned to achieve profitability growth in the coming years. The company anticipates margins to reach 18-20% in the future.",
            "Sentiment": "positive",
            "PublishDate": 1752477617000,
            "Source": "default"
        },
        {
            "Title": "Wockhardt Plans Exit from US Generic Drug Market",
            "Summary": "Wockhardt, a pharmaceutical company, has announced plans to exit the US generic drugs market. The company aims to improve its profit margins by leaving this sector, as its US business has been creating pressure on the company's performance. This strategic move suggests a significant shift in Wockhardt's business focus.",
            "Sentiment": "neutral",
            "PublishDate": 1752477462000,
            "Source": "default"
        },
        {
            "Title": "Wockhardt Ltd: Exits Loss-Making US Generics Business",
            "Summary": "Wockhardt Ltd has exited its US generics business, filing for voluntary liquidation under Chapter 7 of the US Bankruptcy Code. This affects two wholly-owned US subsidiaries: Morton Grove Pharma and Wockhardt USA LLC. The exit aligns with the company's long-term vision to focus on new antibiotic drug discovery and biologics portfolio in insulin. The move frees up capital and management bandwidth for innovation-led segments.",
            "Sentiment": "positive",
            "PublishDate": 1752458597000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wockhardt to Shift Focus from US Generic Drugs to Innovation-Focused Products",
            "Summary": "Wockhardt, a pharmaceutical company, has announced plans to change its strategic direction. The company intends to move away from its focus on generic drugs for the US market and instead strengthen its portfolio of innovation-focused products. This shift suggests a significant change in the company's business model and product development strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1752232874000,
            "Source": "default"
        },
        {
            "Title": "Wockhardt Launches Zaynich Initiative for Global Licensing",
            "Summary": "Wockhardt has introduced the Zaynich Initiative, which aims to establish worldwide licensing agreements. The initiative's specific details and objectives are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751341536000,
            "Source": "default"
        },
        {
            "Title": "Wockhardt: Shares Hit 52-Week High on Positive Outlook",
            "Summary": "Wockhardt shares surged 17% to a 52-week high of Rs 1,809 on NSE. The company filed for Zaynich drug approval with DCGI, expecting launch in H2 FY25-26. Q4FY25 results show revenue at Rs 743 crore, EBITDA growth of 13% QoQ, and narrowed net losses. The company reported new product filings and launches across markets.",
            "Sentiment": "positive",
            "PublishDate": 1749635750000,
            "Source": "normal_news"
        },
        {
            "Title": "Wockhardt's Novel Antibiotic Zaynich Has $7 Billion Market Opportunity",
            "Summary": "Wockhardt has announced that its novel antibiotic, Zaynich, has an addressable market opportunity of $7 billion in the United States and Europe. The company sees significant potential for this new drug in these key markets.",
            "Sentiment": "positive",
            "PublishDate": 1749184151000,
            "Source": "default"
        },
        {
            "Title": "Wockhardt: Novel Antibiotic Zaynich Targets $7 Billion Market in US and Europe",
            "Summary": "Wockhardt's new antibiotic Zaynich has a $7 billion market opportunity in the US and Europe. The company completed a pre-NDA meeting with the USFDA in May 2025 and plans to file for approval in Q2 of the current fiscal year. Potential US launch is expected in FY2026-27, with European and emerging market approvals planned for H2 of the current fiscal year. Zaynich is also awaiting DCGI approval for the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1749127368000,
            "Source": "normal_news"
        },
        {
            "Title": "Wockhardt Ltd.: Ambitious Revenue Target and Margin Improvement Plans",
            "Summary": "Wockhardt aims to reach Rs 5,000 crore revenue in three years, up from current Rs 3,000 crore. Margins expected to improve significantly due to new high-margin molecules. Company plans fundraising through debt and equity within 6-12 months to support growth and R&D.",
            "Sentiment": "positive",
            "PublishDate": 1748998480000,
            "Source": "normal_news"
        },
        {
            "Title": "Wockhardt Ltd: Q4 Loss Narrows, Revenue Grows 6% YoY",
            "Summary": "Wockhardt Ltd reported a narrowed Q4 FY25 net loss of ₹45 crore, compared to ₹177 crore loss last year. Revenue increased 6% YoY to ₹743 crore. EBITDA turned positive at ₹64 crore. The company reappointed Akhilesh Krishna Gupta as Independent Director for a second five-year term.",
            "Sentiment": "positive",
            "PublishDate": 1748514360000,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Reports Reduced Q4 Loss and Increased Revenue",
            "Summary": "Wockhardt, a pharmaceutical company, has reported its quarterly financial results. For the fourth quarter, the company posted a consolidated net loss of 250 million rupees, which is significantly lower than the loss of 1.69 billion rupees in the same quarter of the previous year. The company's revenue for the quarter increased to 7.4 billion rupees, up from 7 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748513232000,
            "Source": "result"
        },
        {
            "Title": "Wockhardt Establishes New Subsidiary in Ireland",
            "Summary": "Wockhardt Bio AG, a unit of Wockhardt, has incorporated a new wholly owned subsidiary in Ireland named Wockhardt Antibiotics (Ireland) Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1744119821000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wockhardt's US Generics Business Contributes 5% to Overall Revenue",
            "Summary": "Wockhardt, a pharmaceutical company, has reported that its US generics business currently accounts for 5% of the company's overall revenue, according to NDTV Profit.",
            "Sentiment": "neutral",
            "PublishDate": 1744000999000,
            "Source": "normal_news"
        },
        {
            "Title": "Wockhardt Plans to Exit US Generics Business",
            "Summary": "Wockhardt, a pharmaceutical company, has announced plans to exit its US generics business. Additionally, the news mentions that US consumers will have to bear the burden of tariffs, according to NDTV Profit.",
            "Sentiment": "negative",
            "PublishDate": 1744000894000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wockhardt's Zaynich™ Successfully Treats Pediatric Cancer Patient with Severe Infection",
            "Summary": "A pediatric cancer patient in the US with a persistent blood and liver infection has been successfully treated using Wockhardt's antibiotic Zaynich™. This case demonstrates the effectiveness of the drug in treating complex infections in immunocompromised patients.",
            "Sentiment": "positive",
            "PublishDate": 1743479434000,
            "Source": "normal_news"
        },
        {
            "Title": "Wockhardt: US Tariffs on Indian Pharma Will Increase Costs for American Consumers",
            "Summary": "Wockhardt's founder chairman Habil Khorakiwala states that any US tariffs on Indian pharmaceutical products will be passed on to US consumers. He highlights India's significant role in global pharma supply, providing 40% of US medicines and 60% of global vaccines. Khorakiwala emphasizes the need for research and innovation to establish India as a pharmaceutical powerhouse.",
            "Sentiment": "neutral",
            "PublishDate": 1739867703000,
            "Source": "normal_news"
        },
        {
            "Title": "Wockhardt Reports Q3 Revenue Increase",
            "Summary": "Wockhardt, a pharmaceutical company, has reported its third quarter revenue of 7.2 billion rupees, showing an increase from 7 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738916021000,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Reports Significant Improvement in Q3 EBITDA",
            "Summary": "Wockhardt, a pharmaceutical company, has reported a substantial increase in its Q3 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA rose to 1.28 billion rupees, up from 370 million rupees in the same quarter of the previous year. Additionally, Wockhardt's EBITDA margin improved significantly, reaching 17.75% compared to 5.28% in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738916007000,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Reports Profit in Q3 FY2024",
            "Summary": "Wockhardt Limited, an Indian pharmaceutical and biotechnology company, has reported a consolidated net profit of 140 million rupees for the third quarter of the fiscal year. This marks a significant turnaround from the loss of 830 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738915914000,
            "Source": "earnings"
        },
        {
            "Title": "Wockhardt Ltd: Antibiotic Zaynich Achieves 96% Efficacy in Phase III Trial",
            "Summary": "Wockhardt's antibiotic Zaynich showed 96.8% clinical cure rate in Phase III trial for complicated urinary tract infections. The drug demonstrated superiority over meropenem with 89.0% combined clinical and microbiologic cure rate. Wockhardt plans to file for FDA and EMA approvals.",
            "Sentiment": "positive",
            "PublishDate": 1738303475000,
            "Source": "normal_news"
        },
        {
            "Title": "Wockhardt's Zaynich Shows High Efficacy in Phase III Study for Urinary Tract Infection",
            "Summary": "Wockhardt's antibiotic Zaynich (zidebactam/cefepime) has demonstrated exceptional efficacy in a global Phase III clinical trial for complicated urinary tract infection (cUTI). The study achieved superiority with a 96.8% clinical cure rate, marking a significant milestone in the development of this novel antibiotic combination.",
            "Sentiment": "positive",
            "PublishDate": 1738294924000,
            "Source": "result"
        }
    ]
}