{
    "Symbol": "WONDERLA",
    "ISIN": "INE066O01014",
    "News": [
        {
            "Title": "Wonderla Holidays Reports No Fund Deviation in Q3FY26",
            "Summary": "Wonderla Holidays Limited confirms no deviation in utilization of Rs.540 crore QIP funds for Q3FY26, with Rs.447.05 crore utilized across Chennai park development and other projects.",
            "Sentiment": "neutral",
            "PublishDate": 1770199684833,
            "Source": "stocks"
        },
        {
            "Title": "Wonderla Holidays Q3 Net Profit Drops 28.6% YoY",
            "Summary": "Wonderla Holidays reported a net profit of ₹145 million in Q3, marking a significant decline from ₹203 million in the same quarter of the previous year, representing a 28.6% year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770194879168,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wonderla Holidays Q3FY26 Earnings Call on Feb 5",
            "Summary": "Wonderla Holidays has scheduled an analyst and investor conference call on February 5, 2026, at 2:30 PM IST to discuss Q3 and nine-month FY26 financial results ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769067324999,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wonderla Holidays Board Meet Set for Feb 4, 2026",
            "Summary": "Wonderla Holidays Limited has scheduled a board meeting on February 4, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768382210270,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wonderla vs Imagicaa: Amusement Park Business Models",
            "Summary": "Analysis of how Indian amusement parks like Wonderla and Imagicaa generate revenue through ticket sales, in-park spending, and allied services while managing seasonality and high fixed costs.",
            "Sentiment": "neutral",
            "PublishDate": 1768038465008,
            "Source": "stocks"
        },
        {
            "Title": "Wonderla Holidays Opens Fifth Amusement Park in Chennai with INR 611 Crore Investment",
            "Summary": "Wonderla Holidays launched its fifth and most ambitious amusement park, Wonderla Chennai, spanning 64.30 acres with an investment of over INR 611 crores, featuring 43 world-class rides and capacity for 6,500 daily visitors. The park officially opens to the public on December 2, 2025, expanding Wonderla's presence across South India and projected to create over 1,000 direct and indirect jobs while supporting local tourism and livelihoods.",
            "Sentiment": "positive",
            "PublishDate": 1763457714159,
            "Source": "stock"
        },
        {
            "Title": "Wonderla Holidays Reports Best-Ever Q2 Performance with 25% Revenue Growth and 8x EBITDA Jump",
            "Summary": "Wonderla Holidays Limited achieved its strongest Q2 performance with revenue from operations rising 25% year-on-year to INR 80.15 crores and EBITDA jumping 8x to INR 7.48 crores. The company recorded 12% footfall growth in Q2 FY26, with digital channels now driving almost half of all bookings. The Chennai park is set to commence commercial operations in December 2025, marking the company's fifth location. For H1 FY26, revenue grew 3% to INR 248.4 crores with EBITDA at INR 84.16 crores. The Bangalore resort business delivered its best-ever Q2 with revenue upside of about INR 2 crores. Management highlighted sustained double-digit growth in non-ticketing revenue and confirmed plans for additional park locations, though specific timelines remain dependent on government approvals and land acquisition processes.",
            "Sentiment": "positive",
            "PublishDate": 1763010016233,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Reports Record Q2 Performance with 24% Revenue Growth and 8X EBITDA Jump",
            "Summary": "Wonderla Holidays Ltd. delivered its best-ever second quarter performance with total income rising 24% year-on-year to Rs. 8,852 lakhs and EBITDA surging 8 times to Rs. 748 lakhs. The amusement park chain recorded footfalls of 5.05 lakhs during the quarter, with Bengaluru park leading at 1.96 lakhs visitors, followed by Kochi at 1.92 lakhs, Hyderabad at 0.93 lakhs, and Bhubaneshwar at 0.24 lakhs. For the six-month period, total income grew 8% to Rs. 26,758 lakhs with footfalls reaching 14.22 lakhs, though EBITDA declined 7% to Rs. 8,416 lakhs. The company's new resort offering 'Isle by Wonderla' in Bangalore commenced operations from May 9, 2025. Digital channels now drive half of the company's bookings. Wonderla's Chennai Park launch is scheduled for December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762486350988,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Reports Progress on Rs 540 Crore QIP Fund Utilization",
            "Summary": "Wonderla Holidays Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of Rs 540 crore raised through qualified institutional placement. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from stated objectives. The company has utilized Rs 358 crore of the total proceeds, with Rs 182 crore remaining unutilized and parked in fixed deposits. Major allocations include Rs 226.68 crore for Wonderla Chennai Park development, Rs 25 crore for Glamping Pods expansion in Bengaluru, and Rs 78 crore for general corporate purposes. The QIP was conducted from December 3-6, 2024. All projects are progressing as planned with completion targeted by March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762463048992,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays Approves Quarterly Results and Employee Stock Options",
            "Summary": "Wonderla Holidays Limited's Board of Directors approved the unaudited financial results for the quarter and half year ended September 30, 2025. The company granted 15,766 stock options under its Employee Stock Option Scheme and allotted 6,321 shares to employees. The board meeting was held and concluded within approximately 1 hour and 45 minutes.",
            "Sentiment": "neutral",
            "PublishDate": 1762459600240,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays Reports Strong Q2 Performance with Revenue Growth and EBITDA Turnaround",
            "Summary": "Wonderla Holidays reported Q2 revenue of 801 million rupees, representing an increase from 674 million rupees in the same quarter last year. The company achieved a significant turnaround in profitability, posting an EBITDA gain of 75 million rupees compared to a loss of 11 million rupees in the previous year's corresponding quarter. The EBITDA margin for the quarter stood at 9.34%.",
            "Sentiment": "positive",
            "PublishDate": 1762418158332,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Reports Net Loss in Q2 After Previous Year Profit",
            "Summary": "Wonderla Holidays recorded a net loss of 18 million rupees in Q2, compared to a profit of 147 million rupees in the same quarter of the previous year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1762417702581,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Schedules Earnings Call for November 7, 2025",
            "Summary": "Wonderla Holidays Limited has scheduled a group investors and analysts conference call for November 7, 2025, at 2:30 PM IST. The call will be moderated by Ambit Capital and will feature company representatives including Managing Director Arun K. Chittilappilly, Chief Financial Officer Saji K Louiz, and Chief Operating Officer Dheeran Choudhary. Management will discuss the company's financial results for the quarter and six months ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760439122008,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Appoints Syed Sameer Mumtaz Ali as Bhubaneswar Park Head",
            "Summary": "Wonderla Holidays Limited appointed Mr. Syed Sameer Mumtaz Ali as the Bhubaneswar Park Head, effective from September 8, 2025. Ali brings over two decades of experience in strategic business management, hotel operations, and P&L management. He previously served as Director and Chief Operating Officer at Magnum Group of Companies, where he increased the seafood export vertical turnover from Rs 190 crore to Rs 360 crore. His background includes leadership roles in the hospitality industry across the USA and UAE, and he holds an MBA in Marketing from the University of Scranton.",
            "Sentiment": "positive",
            "PublishDate": 1757336595743,
            "Source": "corporate_governance"
        },
        {
            "Title": "Wonderla Holidays Reports Mixed Q1 Results with Revenue Decline but Higher Guest Spending",
            "Summary": "Wonderla Holidays reported revenue from operations of Rs. 16,824 lakhs for the quarter, down from Rs. 17,290 lakhs in the previous year. EBITDA declined 9% year-on-year to Rs. 8,750 lakhs, while PAT dropped 17% to Rs. 5,257 lakhs. Despite lower overall revenue, the company saw positive trends in guest spending with ARPU increasing 6% to Rs. 1,775 and spending per head growing 11% to Rs. 493. Total footfalls across parks decreased 8% to 9.17 lakhs visitors. The company launched new Glamping Pods called THE ISLE at its Bengaluru Park during the quarter. Park-wise performance showed mixed results, with Bengaluru generating the highest footfall at 3.22 lakhs, followed by Hyderabad at 2.62 lakhs, Kochi at 2.37 lakhs, and Bhubaneshwar at 0.96 lakhs. The company continues expansion with Chennai Park construction in progress and maintains focus on enhancing guest experience through curated events and themed offerings.",
            "Sentiment": "neutral",
            "PublishDate": 1754028518530,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Reports Strong Quarterly Growth and Launches Premium Hospitality Initiative",
            "Summary": "Wonderla Holidays celebrated its 25th anniversary while reporting robust quarterly growth and increased Average Revenue Per User (ARPU). The amusement park operator launched 'The Isle', a new premium hospitality initiative, marking its expansion into the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1753974448077,
            "Source": "stock"
        },
        {
            "Title": "Wonderla Holidays Reports No Deviation in Rs 540 Crore QIP Fund Utilization",
            "Summary": "Wonderla Holidays Limited confirmed no deviation or variation in the utilization of Rs 540 crore raised through qualified institutions placement for the quarter ended June 30, 2025. The company raised the funds on December 6, 2024, with net proceeds of Rs 525 crore after Rs 15 crore issue expenses. Out of the total allocation, Rs 278 crore has been utilized across various projects including Rs 158.24 crore for Wonderla Chennai Park development, Rs 25 crore for Glamping Pods expansion at Wonderla Bengaluru, Rs 1.76 crore for Wonderla Resort Bangalore refurbishment, Rs 78 crore for general corporate purposes, and Rs 15 crore for issue expenses. The fund utilization is being monitored by CARE Ratings Limited, with no comments from the audit committee or auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1753951653300,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays Reports Decline in Q1 Financial Performance",
            "Summary": "Wonderla Holidays reported quarterly results showing a decline across key financial metrics. Net profit decreased to 526 million rupees from 632 million rupees in the same period last year. Revenue dropped slightly to 1.7 billion rupees compared to 1.73 billion rupees previously. EBITDA fell to 767 million rupees from 914 million rupees, with the EBITDA margin contracting to 45.58% from 52.85% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753949624984,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays: Diversifies into Resort Business with 'The Isle' Launch",
            "Summary": "Wonderla Holidays Ltd. has launched a boutique resort 'The Isle' in Bengaluru, investing Rs 39 crore. The 39-room resort aims to offer Disney-like experiences with rooms priced from Rs 10,000 per day. The company expects the resort's returns to align with or exceed existing operations. Wonderla plans to open a new amusement park in Chennai in December, impacting FY26 projections.",
            "Sentiment": "positive",
            "PublishDate": 1750207490000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays Launches 'The Isle By Wonderla' in Bangalore",
            "Summary": "Wonderla Holidays has unveiled a new boutique aqua-retreat called 'The Isle By Wonderla' in Bangalore. This development represents an expansion of Wonderla's offerings in the leisure and hospitality sector, adding a water-themed retreat to their portfolio in the city.",
            "Sentiment": "positive",
            "PublishDate": 1749804703000,
            "Source": "default"
        },
        {
            "Title": "Wonderla Holidays: Projecting 5-10% Footfall Growth and 6% ARPU Increase for FY26",
            "Summary": "Wonderla Holidays expects 5-10% footfall growth in FY26, driven by new park openings and attraction additions. The company projects a 6% rise in Average Revenue Per User (ARPU). A large park in Chennai is set to open in December. Margin pressure is anticipated in FY26 due to new park openings and increased expenses.",
            "Sentiment": "positive",
            "PublishDate": 1746926434000,
            "Source": "normal_news"
        },
        {
            "Title": "Wonderla Holidays Q4 Results: Revenue and EBITDA Decline, Dividend Declared",
            "Summary": "Wonderla Holidays reported Q4 revenue of 968 million rupees, down from 1 billion rupees year-over-year. Q4 EBITDA decreased to 197 million rupees from 354 million rupees, with EBITDA margin falling to 20.40% from 35.54%. The company declared a dividend of 2 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1746606659000,
            "Source": "result"
        },
        {
            "Title": "Wonderla Holidays Reports Q4 Net Profit Decline",
            "Summary": "Wonderla Holidays has reported a net profit of 110 million rupees for the fourth quarter, down from 226 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1746606566000,
            "Source": "result"
        },
        {
            "Title": "Wonderla Holidays: Chennai Park Opening in December, Expects 5-10% Footfall Increase",
            "Summary": "Wonderla Holidays plans to open its Chennai amusement park on December 15, 2025. The company expects a 5-10% increase in footfalls for FY-26. Wonderla is expanding its resort business, adding 40 premium rooms to its Bangalore property. The company raised Rs 540 crore through QIP, with plans to double its amusement parks over the next six years.",
            "Sentiment": "positive",
            "PublishDate": 1743752618000,
            "Source": "normal_news"
        },
        {
            "Title": "Wonderla Holidays: Anticipates 5-10% Footfall Growth in Summer Season",
            "Summary": "Wonderla Holidays expects a 5-10% increase in footfall this summer due to milder temperatures. The company's Bhubaneswar Park will experience its first full summer season. Wonderla aims to expand to 10 cities by 2030-32, with a new park in Chennai by December 2025. The company recently raised Rs 540 crore through a QIP for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1742568594000,
            "Source": "normal_news"
        },
        {
            "Title": "Wonderla Holidays Anticipates Footfall Growth and Positive Summer Season",
            "Summary": "Wonderla Holidays has expressed optimism about its future performance. The company expects to see an increase in footfall by 5-10%. Additionally, they are anticipating a positive summer season, which is typically a crucial period for amusement park businesses.",
            "Sentiment": "positive",
            "PublishDate": 1742366678000,
            "Source": "normal_news"
        },
        {
            "Title": "Wonderla Holidays Receives 200 Million Rupee Subsidy from Odisha Government",
            "Summary": "Wonderla Holidays Ltd has been granted a subsidy of 200 million rupees by the government of Odisha. This financial support is likely related to the company's operations or expansion plans in the state.",
            "Sentiment": "positive",
            "PublishDate": 1741851120000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays: Margin Contraction Expected Due to New Park Investments",
            "Summary": "Wonderla Holidays anticipates a 5-10% margin contraction over the long term due to capital expenditure on new amusement parks. The company recently opened a park in Bhubaneswar and plans to open another in Chennai next year. Despite this, Wonderla aims for a 15-20% CAGR over the next decade.",
            "Sentiment": "neutral",
            "PublishDate": 1738140827000,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays: Q3 Profit Plunges 45.66% YoY Amid Rising Costs",
            "Summary": "Wonderla Holidays reported Q3 FY25 results with profit falling 45.66% YoY to ₹20.3 crore. Revenue decreased 1.66% YoY to ₹121.51 crore. EPS dropped to ₹3.43. Despite QoQ improvements, rising operational costs and YoY declines in key metrics signal challenges.",
            "Sentiment": "negative",
            "PublishDate": 1738045196000,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays: Q3 Profit Plunges 45.6%, Revenue Dips",
            "Summary": "Wonderla Holidays reported a 45.6% drop in Q3 FY25 net profit to Rs 20.3 crore, with revenue falling 1.7% to Rs 122 crore. EBITDA decreased 32% to Rs 37 crore, and margins contracted to 30.6%. The company announced leadership changes, with Arun K Chittilappilly becoming Managing Director and Executive Chairman, and Aprameya Radhakrishna appointed as an independent director.",
            "Sentiment": "negative",
            "PublishDate": 1737973208000,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Wonderla Holidays experienced a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 372 million rupees from 545 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 30.58% from 44.00% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737969912000,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Reports Q3 Revenue of 1.21 Billion Rupees",
            "Summary": "Wonderla Holidays, an amusement park operator in India, has reported its third-quarter revenue. The company's revenue for Q3 stood at 1.21 billion rupees, compared to 1.23 billion rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1737969906000,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Reports Profit in Q3",
            "Summary": "Wonderla Holidays has reported a profit for the third quarter. The company's net profit for Q3 stands at rupees, compared to 374 million in the same period last year. This indicates a year-over-year change in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1737969886000,
            "Source": "earnings"
        },
        {
            "Title": "Wonderla Holidays Raises ₹540 Crore Through QIP",
            "Summary": "Wonderla Holidays has approved the allotment of 68 lakh equity shares at ₹790 each, successfully raising ₹540 crore through a Qualified Institutional Placement (QIP).",
            "Sentiment": "positive",
            "PublishDate": 1733711944000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays: Chennai Amusement Park to Open by FY26 End",
            "Summary": "Wonderla Holidays plans to use funds from a recent QIP to build a Rs 500-crore amusement park in Chennai, expected to be operational by the end of FY26. The company aims to expand to 10 cities and projects 8-10 lakh footfalls in the first two years for the Chennai park, with Ebitda breakeven in the first year.",
            "Sentiment": "positive",
            "PublishDate": 1733544086000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays: Plans ₹500-600 Crore QIP for Expansion",
            "Summary": "Wonderla Holidays is preparing for its next growth phase by planning a Qualified Institutional Placement (QIP) to raise ₹500-600 crore. This funding will likely be used for expansion purposes.",
            "Sentiment": "positive",
            "PublishDate": 1733394780000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays Opens Qualified Institutional Placement",
            "Summary": "Wonderla Holidays has initiated a Qualified Institutional Placement (QIP) with a floor price set at ₹829.74 per share. This move indicates the company's intention to raise capital from qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1733277732000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wonderla Holidays Optimistic About Growth Prospects",
            "Summary": "Wonderla Holidays has expressed a positive outlook for future growth during a recent conference call. The company's optimism is based on strategic investments aimed at enhancing guest experiences, embracing innovation, and expanding their offerings. These initiatives are expected to drive the company's growth in the coming period.",
            "Sentiment": "positive",
            "PublishDate": 1730950863000,
            "Source": "normal_news"
        },
        {
            "Title": "Wonderla Holidays Reports Q2 Revenue Decline",
            "Summary": "Wonderla Holidays announced its second quarter revenue of 674 million rupees, down from 752 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730796474000,
            "Source": "result"
        },
        {
            "Title": "Wonderla Holidays Reports Q2 Net Profit Increase",
            "Summary": "Wonderla Holidays has reported a net profit of 147 million rupees for the second quarter, compared to 135 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730796450000,
            "Source": "result"
        },
        {
            "Title": "Wonderla Holidays Approves 800 Crore Rupee Fundraising",
            "Summary": "<p><span class='positive'>Wonderla Holidays</span> has <span class='positive'>approved</span> a plan to <span class='positive'>raise funds</span> amounting to <b>800 crore rupees</b>. This decision indicates a <span class='positive'>significant financial move</span> for the company, potentially aimed at <span class='positive'>expansion</span>, <span class='positive'>debt reduction</span>, or other <span class='positive'>strategic initiatives</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728025435000,
            "Source": "corporate_action"
        }
    ]
}