{
    "Symbol": "WSI",
    "ISIN": "INE100D01014",
    "News": [
        {
            "Title": "W.S. Industries Board Meet Set for Feb 14, 2025",
            "Summary": "W.S. Industries (India) Limited announces board meeting on February 14, 2025 to consider Q3 FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770370655956,
            "Source": "co_actions_results"
        },
        {
            "Title": "W.S. Industries Board Approves Fund Revision & EGM",
            "Summary": "W.S. Industries (India) Limited board approved fund utilisation revision from preferential issue and timeline extension, while convening EGM on February 20, 2026 for shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768981922150,
            "Source": "stocks"
        },
        {
            "Title": "W.S. Industries Promoter S. Aravindan Increases Stake Through Open Market Purchase",
            "Summary": "Promoter S. Aravindan acquired 13,000 equity shares of W.S. Industries (India) Limited through open market purchase on December 8, 2025. Following the acquisition, Aravindan's total shareholding increased to 4,569,018 shares representing 6.931% of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765270996915,
            "Source": "corporate_action"
        },
        {
            "Title": "WS Industries Promoter Group Member Acquires Additional Equity Shares",
            "Summary": "Dhanu Adhav Arvindan, a promoter group member of WS Industries (India) Limited, acquired 12,000 equity shares through open market purchase on December 1, 2025. The acquisition increased the promoter's total holding to 1,012,000 shares, representing 0.01% of the company's total voting capital of Rs 659,187,490 divided into 65,918,749 equity shares of Rs 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764759593440,
            "Source": "corporate_action"
        },
        {
            "Title": "WS Industries Promoter S. Aravindan Increases Stake Through Open Market Purchase",
            "Summary": "S. Aravindan, a promoter of WS Industries (India) Limited, acquired 50,716 equity shares through open market transactions on November 21, 2025. His shareholding increased from 6.83% to 6.910%, with total holdings including warrants/convertible securities reaching 5,056,018 shares representing 6.910% of the company's equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763985726513,
            "Source": "corporate_action"
        },
        {
            "Title": "W.S. Industries Schedules EGM for Fund Utilization Variation and Fresh Preferential Issues Worth ₹195 Crore",
            "Summary": "W.S. Industries has scheduled an EGM on December 12, 2025, to seek approval for varying utilization of previously raised ₹245 crore and issuing fresh ₹145 crore equity shares plus ₹50 crore convertible warrants to non-promoter investors including FPIs. The company proposes to use funds for land acquisition, debt repayment, working capital needs, and general corporate purposes with revised timelines extending to March 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1763545866417,
            "Source": "corporate_action"
        },
        {
            "Title": "WSS Industries Board Approves Rs 195 Crore Preferential Issue and Quarterly Results",
            "Summary": "WSS Industries' board approved issuing 1.45 crore equity shares at Rs 100 each and 50 lakh convertible warrants to non-promoter entities including FPIs, raising Rs 195 crores subject to shareholder approval at EGM on December 12, 2025. The company also approved standalone and consolidated unaudited financial results for quarter and half year ended September 30, 2025, and appointed India Ratings as monitoring agency for the preferential issue.",
            "Sentiment": "positive",
            "PublishDate": 1763182867959,
            "Source": "corporate_action"
        },
        {
            "Title": "W.S. Industries Receives Partial Relief in EPF Penalty Case, Tribunal Reduces Damages by 35%",
            "Summary": "The Central Government Industrial Tribunal-cum-Labour Court in Chennai partially allowed W.S. Industries' appeal regarding EPF damages of ₹63.15 lakhs imposed under Section 14B of the Employees Provident Funds Act, 1952. The tribunal directed recovery of only 65% of the assessed damages, granting a 35% waiver of the penalty. The original order was issued by the Regional Provident Fund Commissioner-II, Tambaram on December 26, 2017. The violations related to delays in remittance of employees' Provident Fund contributions from a period prior to the current management's takeover, attributed to severe financial distress and operational disruptions. The company stated there is no material impact on current financials, operations, or business activities and is complying with the order in consultation with legal counsel.",
            "Sentiment": "positive",
            "PublishDate": 1762799626417,
            "Source": "stock"
        },
        {
            "Title": "WSI Ltd Revises Valuation Report for Preferential Issue Following NSE Directions",
            "Summary": "WSI Ltd has issued further revised disclosures for its preferential issue of equity shares and convertible warrants after receiving clarification from NSE. The exchange directed the company to include a Discounted Cash Flow (DCF) method in its valuation report, which was previously excluded due to unavailability of profitability projections. The registered valuer has now issued an addendum valuation report dated August 26, 2025, incorporating the DCF method under the Income Approach. The fair value per equity share has been determined at ₹71.88 using the DCF method, while the minimum price for the preferential issue remains ₹80.32, which is the higher value under SEBI ICDR Regulations. The company was taken over by new promoters in June 2022 and is undergoing operational revamp in the infrastructure sector. All other contents of the EGM notice and previous disclosures remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1756213300718,
            "Source": "corporate_action"
        },
        {
            "Title": "WSI Ltd Revises Preferential Issue Disclosures Following NSE Regulatory Advice",
            "Summary": "WSI Ltd has announced revisions to its previously approved preferential issue of equity shares and convertible warrants, following regulatory advice from the National Stock Exchange of India Limited. The company's board approved changes to Object No. 5 regarding the repayment of outstanding security deposits. The revision removes the phrase 'either in part or in full' from both the object description and explanation, while maintaining the proposed utilization of proceeds towards repaying Rs. 53.70 crores in outstanding security deposits as reflected in the books as of March 31, 2025. The changes align with SEBI regulations and follow NSE's clarification letter dated August 18, 2025. All other contents of the original EGM notice and previous disclosures remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1755942680891,
            "Source": "corporate_action"
        },
        {
            "Title": "WSI Ltd Appoints New Statutory Auditors and Schedules 62nd AGM for September 2025",
            "Summary": "WSI Ltd's Board of Directors approved the appointment of M/s.P.Chandrasekar LLP as new Statutory Auditors to fill a casual vacancy caused by the resignation of existing auditors. The firm, established in 1988 and converted to LLP in 2017, comprises 11 partners and approximately 80 professionals across Chennai, Bangalore, Mumbai, and Hyderabad offices. The Board also approved director remuneration for the period from July 1, 2025 to September 30, 2026, subject to shareholder approval. Additionally, the company approved alterations to its Memorandum of Association to align with the Companies Act 2013, consideration of related party transactions, and the Board's Report for financial year 2024-2025. The 62nd Annual General Meeting has been scheduled for September 23, 2025 at 2:30 PM via video conference.",
            "Sentiment": "neutral",
            "PublishDate": 1755939752640,
            "Source": "corporate_governance"
        },
        {
            "Title": "WSI Ltd Approves Q1 FY2026 Results, Preference Share Rollovers, and Cost Auditor Appointment; Statutory Auditors Resign",
            "Summary": "WSI Ltd's board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 26.05 crores and a net loss of Rs 15.27 crores on standalone basis. The company also approved rollover of 3.5 lakh preference shares held by Vensunar Private Limited until March 2027, and 9.25 lakh preference shares held by Trala Electromech Systems Private Limited until September 2026. P. Raju Iyer was appointed as Cost Auditor for FY2026. Brahmayya & Co. resigned as statutory auditors citing pre-occupation with other professional commitments and difficulty in devoting necessary time due to the company's increased operations level. The auditors confirmed no other material reasons for resignation and completed the quarterly review before stepping down.",
            "Sentiment": "negative",
            "PublishDate": 1754576288962,
            "Source": "earnings"
        },
        {
            "Title": "W.S. Industries Conducts EGM to Approve Share Capital Increase and Preferential Allotments",
            "Summary": "W.S. Industries (India) Limited held its first Extra-Ordinary General Meeting for financial year 2025-2026 on July 25, 2025, via video conferencing. The meeting was attended by the company's directors, key executives, and 40 shareholders, including 8 from the promoter group and 32 from the public. Three key resolutions were presented: approval for increase in authorized share capital and amendment to the Memorandum of Association, issuance of 1.65 crore equity shares on preferential basis to identified non-promoter persons including Foreign Portfolio Investors, and issue of 2.75 crore convertible warrants on preferential basis to non-promoter entities and promoter group. Remote e-voting was conducted from July 22-24, 2025, with M/s. Lakshmmi Subramanian & Associates appointed as scrutinizer. The consolidated voting results and scrutinizer's report will be submitted to stock exchanges by July 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753444119808,
            "Source": "corporate_action"
        },
        {
            "Title": "W S Industries Approves Share and Warrant Issuance",
            "Summary": "W S Industries (India) has approved the issuance of 16.5 million shares and 27.5 million convertible warrants, both priced at 100 rupees each.",
            "Sentiment": "positive",
            "PublishDate": 1751026309000,
            "Source": "default"
        },
        {
            "Title": "W.S. Industries (India) Announces Property Purchase for 466.6 Million Rupees",
            "Summary": "W.S. Industries (India) has disclosed that the purchase consideration for an unspecified property amounts to 466.6 million rupees. No further details about the property or the purpose of the acquisition were provided in the brief news statement.",
            "Sentiment": "neutral",
            "PublishDate": 1741681288000,
            "Source": "corporate_action"
        },
        {
            "Title": "W.S. Industries (India) Unit Enters Agreement for Property Acquisition",
            "Summary": "W.S. Industries (India) has announced that one of its units has entered into an agreement with Arni Associates for the acquisition of property. This move suggests a potential expansion or strategic asset acquisition by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1741681250000,
            "Source": "corporate_action"
        },
        {
            "Title": "W.S. Industries (India) Reports Q3 Net Loss of 237 Million Rupees",
            "Summary": "W.S. Industries (India) has reported a net loss of 237 million rupees in the third quarter, compared to a profit of 139 million rupees in the same period last year. The company's revenue also decreased to 656 million rupees from 1.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739405833000,
            "Source": "earnings"
        },
        {
            "Title": "W.S. Industries (India) Reports Q3 Net Loss of 237 Million Rupees",
            "Summary": "W.S. Industries (India) has reported a net loss of 237 million rupees for the third quarter, compared to a profit of 139 million rupees in the same period last year. The company's revenue also decreased to 656 million rupees from 1.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739368399000,
            "Source": "earnings"
        },
        {
            "Title": "W S Industries Subsidiary Acquires Land for Logistics Park Development",
            "Summary": "A subsidiary of W S Industries has purchased 75 acres of land valued at 54 crore rupees. The company plans to develop this land into a logistics park with a minimum area of 20 million square feet.",
            "Sentiment": "positive",
            "PublishDate": 1736499470000,
            "Source": "corporate_action"
        },
        {
            "Title": "W.S. Industries (India) Secures 86 Crore Rupee Order",
            "Summary": "W.S. Industries (India) has won a significant order valued at 86 crore rupees (approximately $10.3 million USD). This order represents a substantial business opportunity for the company and may positively impact its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1735624248000,
            "Source": "order&deals"
        },
        {
            "Title": "W.S. Industries (India) Reports Decline in Q2 EBITDA and Margin",
            "Summary": "W.S. Industries (India) has reported a decrease in its Q2 EBITDA to 63 million rupees, down from 127 million rupees in the same quarter last year. The company's EBITDA margin also declined to 10.17% from 15.74% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731483186000,
            "Source": "result"
        },
        {
            "Title": "W.S. Industries (India) Reports Decline in Q2 Profit and Revenue",
            "Summary": "W.S. Industries (India) has reported a significant decrease in both net profit and revenue for the second quarter. Net profit fell to 37 million rupees from 114 million rupees in the same quarter last year. Revenue also declined to 621 million rupees from 810 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731482940000,
            "Source": "result"
        }
    ]
}