{
    "Symbol": "WSTCSTPAPR",
    "ISIN": "INE976A01021",
    "News": [
        {
            "Title": "West Coast Paper Mills Q3FY26 Results Show Mixed Performance",
            "Summary": "West Coast Paper Mills reported Q3FY26 consolidated revenue of ₹1,049.78 crores with net profit of ₹29.58 crores. Standalone revenue declined 8% QoQ to ₹590.77 crores amid pricing pressures from rising paper imports.",
            "Sentiment": "neutral",
            "PublishDate": 1770889473422,
            "Source": "co_actions_results"
        },
        {
            "Title": "West Coast Paper Mills Board Meet on Feb 12",
            "Summary": "West Coast Paper Mills Ltd. announces board meeting scheduled for February 12, 2026, to consider and approve Q3FY26 unaudited financial results under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769768665469,
            "Source": "co_actions_results"
        },
        {
            "Title": "West Coast Paper Mills Gets Credit Rating Reaffirmation from ICRA",
            "Summary": "ICRA Limited reaffirmed West Coast Paper Mills Limited's credit ratings with Long-term Fund-based Term loan at ICRA [AA] (Stable), Long-term/Short-term Unallocated limits at ICRA [AA] (Stable)/ICRA [A1+], and Commercial Paper at ICRA [A1+]. The reaffirmation covers total facilities worth Rs. 400 crore, indicating stable creditworthiness and maintaining the company's borrowing capacity across various debt instruments.",
            "Sentiment": "positive",
            "PublishDate": 1764221803250,
            "Source": "stock"
        },
        {
            "Title": "West Coast Paper Mills Reports Related Party Transactions Worth Rs 559.40 Lakhs for Half Year Ended September 2025",
            "Summary": "West Coast Paper Mills Limited disclosed related party transactions totaling Rs 559.40 lakhs for the half year ended September 30, 2025, in compliance with SEBI regulations. The transactions primarily involved rent payments and reimbursement of expenses to promoter entities including Veer Enterprises, Shree Satyanarayan Investment Company, and Siddhi Trade & Holdings. Key management personnel compensation included payments to Chairman and Managing Director Shree Kumar Bangur (Rs 479.66 lakhs), Joint Managing Director Virendra Bangur, Executive Director Rajendra Jain (Rs 147.77 lakhs), and CFO Rajesh Bothra (Rs 32.76 lakhs). The company also paid directors' sitting fees to various independent and non-executive directors. All transactions were approved by the Audit Committee and Board of Directors as required under regulatory guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1762940275498,
            "Source": "corporate_action"
        },
        {
            "Title": "West Coast Paper Mills Reports Q2 FY26 Results Amid Industry Pricing Pressures",
            "Summary": "West Coast Paper Mills Limited announced its unaudited financial results for the quarter ended September 30, 2025. The domestic paper industry faced pricing pressure during Q2 FY26 as imports remained elevated. Input costs, particularly wood, continued to remain high, moderating the pace of margin recovery. The consolidated performance was impacted during the quarter due to a brief workers' strike and a subsequent 14-day planned annual maintenance shutdown at the Rajahmundry plant of subsidiary Andhra Paper Limited, resulting in a one-time loss of production and earnings. The company remains focused on strengthening its product mix, securing raw material supply, and driving cost efficiencies to sustain profitability. The Board of Directors meeting commenced at 11:30 AM and concluded at 1:00 PM on November 12, 2025, to approve the results.",
            "Sentiment": "negative",
            "PublishDate": 1762935209112,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports 80% Drop in Q2 Net Profit",
            "Summary": "West Coast Paper Mills reported consolidated net profit of 175 million rupees in Q2, down from 891 million rupees in the same quarter last year. The company's EBITDA fell to 680 million rupees from 1.42 billion rupees year-over-year. EBITDA margin compressed significantly to 6.5% compared to 13.6% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762934608427,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Imposes Anti-Dumping Duties on Virgin Multi-Layer Paperboards from Chile and China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on virgin multi-layer paperboards imported from Chile and China. This development affects West Coast Paper Mills and the broader paperboard import market.",
            "Sentiment": "neutral",
            "PublishDate": 1759202471019,
            "Source": "stock"
        },
        {
            "Title": "West Coast Paper Mills Reports Mixed Q1 Results with Revenue Decline but Margin Improvement",
            "Summary": "West Coast Paper Mills Limited announced its quarterly results for the quarter ended June 30, 2025. Consolidated revenue decreased 8% quarter-on-quarter to ₹954.65 crores from ₹1,041.29 crores. However, consolidated EBITDA increased 24% to ₹155.11 crores and PAT grew 31% to ₹60.26 crores. PAT margin improved to 6.3% from 4.4% in the previous quarter. Standalone revenue declined 12% to ₹555.86 crores while standalone PAT remained flat at ₹41.05 crores. The Paper & Paperboard segment saw revenue decrease to ₹880.67 crores but segment profit increased to ₹85.29 crores. Chairman S.K. Bangur noted that the domestic paper industry faces intense price pressure from rising imports and elevated input costs, with imports hitting record levels affecting volumes and sales realization. High wood costs continue to impact performance, while the company focuses on operational efficiencies and product-mix improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1754902472411,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports 52% Drop in Q1 Net Profit",
            "Summary": "West Coast Paper Mills reported Q1 revenue of 9.5 billion rupees, slightly down from 9.6 billion rupees in the same period last year. The company's EBITDA declined significantly to 1.10 billion rupees from 1.76 billion rupees year-over-year, with EBITDA margin contracting to 11.6% from 18.3%. Consolidated net profit fell to 544 million rupees compared to 1.14 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754901847052,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills: Q4 Net Profit Plunges 63%, Revenue Dips 3%",
            "Summary": "West Coast Paper Mills reported Q4 net profit of ₹44 crore, down 63% YoY. Revenue fell 3% to ₹1,041 crore. EBITDA decreased 52.4% to ₹80.8 crore. Margins contracted by 810 bps to 7.8%. Board recommended a dividend of ₹5 per share, subject to shareholder approval.",
            "Sentiment": "negative",
            "PublishDate": 1747993877000,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports Q4 Net Profit of 440M Rupees",
            "Summary": "West Coast Paper Mills announced its consolidated net profit for the fourth quarter at 440 million rupees, compared to 1.20 billion rupees in the same period last year. This represents a significant year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1747992217000,
            "Source": "result"
        },
        {
            "Title": "West Coast Paper Mills Unit Launches Optical Fiber Manufacturing Plant",
            "Summary": "West Coast Paper Mills has announced that its subsidiary has launched a new manufacturing plant for optical fiber production. This expansion into the optical fiber industry represents a significant development for the company, potentially diversifying its product portfolio and entering a high-tech market segment.",
            "Sentiment": "positive",
            "PublishDate": 1746006821000,
            "Source": "default"
        },
        {
            "Title": "West Coast Paper Mills Reports Challenging Q3 Due to Rising Costs and Market Conditions",
            "Summary": "The Managing Director of West Coast Paper Mills has stated that the company's third quarter performance was negatively impacted by two main factors: a significant increase in wood prices and a decrease in realization due to sluggish market conditions. These challenges have affected the company's financial results for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739440168000,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports Other Income of 694 Million Rupees",
            "Summary": "West Coast Paper Mills has announced other income amounting to 694 million rupees. This income is separate from the company's main operational revenue and could include sources such as interest income, dividends from investments, or gains from asset sales.",
            "Sentiment": "positive",
            "PublishDate": 1739438380000,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports Decline in Q3 EBITDA and Margin",
            "Summary": "West Coast Paper Mills has reported a significant decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 1.52 billion rupees from 2.18 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped sharply to 8.13% from 20.82% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739438244000,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports Q3 Revenue Decline",
            "Summary": "West Coast Paper Mills has reported a revenue of 10.1 billion rupees for the third quarter, compared to 10.4 billion rupees in the same period last year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739438211000,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "West Coast Paper Mills has reported a consolidated net profit of 642 million rupees for the third quarter, compared to 1.36 billion rupees in the same period last year. This represents a significant year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739438137000,
            "Source": "earnings"
        },
        {
            "Title": "West Coast Paper Mills Reports Q2 Revenue Decline",
            "Summary": "West Coast Paper Mills has reported a revenue of 10.4 billion rupees for the second quarter, down from 11.9 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731572008000,
            "Source": "result"
        },
        {
            "Title": "West Coast Paper Mills Reports Q2 Financial Results",
            "Summary": "West Coast Paper Mills has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 1.42 billion rupees, down from 3.1 billion rupees in the same quarter last year. The EBITDA margin has also decreased to 13.60% from 25.98% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731571974000,
            "Source": "result"
        },
        {
            "Title": "West Coast Paper Mills Reports Decline in Q2 Profit",
            "Summary": "West Coast Paper Mills has reported a consolidated net profit of 891 million rupees for the second quarter, down from 1.9 billion rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1731571857000,
            "Source": "result"
        }
    ]
}