{
    "Symbol": "XCHANGING",
    "ISIN": "INE692G01013",
    "News": [
        {
            "Title": "Xchanging Solutions Q3 Net Profit Drops 9% YoY",
            "Summary": "Xchanging Solutions reports consolidated net profit of 132 million rupees in Q3, down from 145 million rupees in the same quarter last year, marking a year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1770275396337,
            "Source": "co_actions_results"
        },
        {
            "Title": "Xchanging Solutions Gets IT Order on Transfer Pricing",
            "Summary": "Xchanging Solutions receives Income Tax order under Section 92CA(3) for AY 2023-24 with transfer pricing adjustments of INR 23.88 crores on Associated Enterprise transactions.",
            "Sentiment": "negative",
            "PublishDate": 1769177542732,
            "Source": "stocks"
        },
        {
            "Title": "Xchanging Solutions Independent Director Resigns",
            "Summary": "Mrs. Janaki Ashwin Patwardhan resigned as Independent Director of Xchanging Solutions Limited effective January 14, 2026, citing personal reasons and professional restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1768395939893,
            "Source": "stocks"
        },
        {
            "Title": "Xchanging Solutions tax demand rises to ₹113.05 cr",
            "Summary": "Xchanging Solutions revises total tax demand to ₹113.05 crores from earlier ₹105.56 crores due to additional interest costs of ₹7.50 crores accumulated since 2023 disclosure.",
            "Sentiment": "negative",
            "PublishDate": 1766574501479,
            "Source": "stocks"
        },
        {
            "Title": "Xchanging Solutions Reports Strong Q2 Growth with Revenue Rising to 528M Rupees",
            "Summary": "Xchanging Solutions reported quarterly revenue of 528 million rupees compared to 444 million rupees in the same period last year. The company's consolidated net profit increased to 163 million rupees from 98 million rupees year-over-year. EBITDA grew to 170 million rupees from 108.8 million rupees, while EBITDA margin improved to 32.21% from 24.47% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761810652900,
            "Source": "earnings"
        },
        {
            "Title": "Xchanging Solutions' Singapore Subsidiary Declares SGD 2.5 Million Interim Dividend",
            "Summary": "Xchanging Solutions (Singapore) Pte Limited, a wholly owned subsidiary of Xchanging Solutions Limited, declared an interim dividend of SGD 2,500,000 for financial year 2024-25. The dividend declaration was made on August 26, 2025. Xchanging Solutions Limited is identified as a DXC Technology Company with shares listed on BSE and NSE under script codes 532616 and XCHANGING respectively.",
            "Sentiment": "positive",
            "PublishDate": 1756198160031,
            "Source": "corporate_action"
        },
        {
            "Title": "Xchanging Solutions Reports Quarterly Financial Results with Profit Growth",
            "Summary": "Xchanging Solutions Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 1,075 lakhs and profit of Rs 471 lakhs, with earnings per share of Rs 0.42. On a consolidated basis, revenue from operations reached Rs 4,999 lakhs with profit of Rs 1,377 lakhs, delivering earnings per share of Rs 1.24. The consolidated results include subsidiaries Xchanging Solutions (Singapore) Pte Ltd, Xchanging Solutions USA Inc, and Nexplicit Infotech India Private Limited. The company operates in a single segment of Information Technology services. The Board had previously recommended a final dividend of Rs 2 per equity share for the financial year ended March 31, 2025, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754641716632,
            "Source": "earnings"
        },
        {
            "Title": "Xchanging Solutions Reports Strong Q1 Growth with 30% Jump in Net Profit",
            "Summary": "Xchanging Solutions reported consolidated net profit of 138 million rupees in Q1, up from 106.3 million rupees year-over-year. Revenue increased to 500 million rupees from 440.6 million rupees in the same period last year. The company's EBITDA rose to 163 million rupees compared to 106 million rupees year-over-year, while EBITDA margin expanded to 32.7% from 24.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754640486064,
            "Source": "earnings"
        },
        {
            "Title": "Xchanging Solutions Reports Q4 Financial Results",
            "Summary": "Xchanging Solutions has announced its Q4 financial results. The company's EBITDA increased to 173.5 million rupees from 98.6 million rupees year-over-year. The EBITDA margin improved to 34.19% from 22.18% in the same period. Revenue rose to 507.4 million rupees from 445 million rupees year-over-year. Consolidated net profit for Q4 was 146.5 million rupees, up from 124 million rupees year-over-year and 144.8 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747839176000,
            "Source": "result"
        },
        {
            "Title": "Xchanging Solutions Reports Q3 Revenue Increase",
            "Summary": "Xchanging Solutions has reported a revenue of 456 million rupees for the third quarter, compared to 425 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738313951000,
            "Source": "earnings"
        },
        {
            "Title": "Xchanging Solutions Reports Improved Q3 EBITDA and Margin",
            "Summary": "Xchanging Solutions has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 142 million rupees, up from 113 million rupees in the same period last year. Additionally, the EBITDA margin expanded to 31%, compared to 26.62% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738313928000,
            "Source": "earnings"
        },
        {
            "Title": "Xchanging Solutions Reports Profit in Q3 FY2024",
            "Summary": "Xchanging Solutions Limited has reported a consolidated net profit of 145 million rupees in the third quarter, compared to a loss of 35 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738313912000,
            "Source": "earnings"
        },
        {
            "Title": "Xchanging Solution Reports Q2 EBITDA Decline",
            "Summary": "Xchanging Solution's Q2 EBITDA decreased to 109 million rupees from 116 million rupees year-over-year. The company's EBITDA margin also declined to 24.5% from 26.86% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730274695000,
            "Source": "result"
        },
        {
            "Title": "Xchanging Solution Reports Q2 Revenue Growth",
            "Summary": "Xchanging Solution has reported a revenue of 445 million rupees for the second quarter, compared to 433 million rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730274685000,
            "Source": "result"
        },
        {
            "Title": "Xchanging Solution Reports Q2 Consolidated Net Profit Decline",
            "Summary": "Xchanging Solution's Q2 consolidated net profit decreased to 98 million rupees from 138 million rupees in the same quarter last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730274656000,
            "Source": "result"
        }
    ]
}