{
    "Symbol": "XELPMOC",
    "ISIN": "INE01P501012",
    "News": [
        {
            "Title": "Xelpmoc Design & Tech Q3FY26 Results & Portfolio Update",
            "Summary": "Xelpmoc Design & Tech reports Q3FY26 revenue of Rs 11.2 million, up 34.5% YoY. Portfolio companies show strong performance with Mihup securing multi-million dollar contracts and Woovly achieving $3.3 million ARR.",
            "Sentiment": "positive",
            "PublishDate": 1770901571850,
            "Source": "co_actions_results"
        },
        {
            "Title": "Xelpmoc Design & Tech Receives GST Demand of ₹66.94L",
            "Summary": "Xelpmoc Design & Tech Limited receives GST demand order worth ₹66.93 lakh from Karnataka tax authorities for FY 2021-22, alleging incorrect classification and short payment issues.",
            "Sentiment": "negative",
            "PublishDate": 1767107280367,
            "Source": "stocks"
        },
        {
            "Title": "Xelpmoc Promoters Reduce Stake by 2.20% in Dec 2025",
            "Summary": "Xelpmoc Design & Tech promoters sold 3.24 lakh shares through open market transactions from September to December 2025, reducing collective holding from 51.93% to 49.73%.",
            "Sentiment": "neutral",
            "PublishDate": 1766747177363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Xelpmoc Design and Tech Reports Q2 FY26 Results with Revenue Drop and Product Development Focus",
            "Summary": "Xelpmoc Design and Tech recorded consolidated operating revenue of INR 7.6 million in Q2 FY26, down from INR 16.3 million in Q2 FY25, with operating EBITDA loss of INR 16.1 million as the company transitions from start-up segment to corporate clients. The company is developing AI-powered products RELY for eldercare and DocuXray framework for document processing, with pilot projects expected to monetize by Q3-Q4 FY26 and aims to achieve EBITDA profitability within the next couple of quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1763553872137,
            "Source": "earnings"
        },
        {
            "Title": "Xelpmoc Design and Tech Reports Q2FY26 Results with Revenue Decline and Portfolio Valued at Rs 703.4 Million",
            "Summary": "Xelpmoc Design and Tech Limited announced quarterly results showing consolidated operating revenue of Rs 7.6 million, down from Rs 16.3 million in Q2FY25, with adjusted operating EBITDA loss of Rs 16.1 million. The AI and data science consulting company's investment portfolio fair value stands at Rs 703.4 million as of September 30, 2025, while the company focuses on maximizing profitability through proprietary products and Agetech pilot projects expected to monetize by Q3FY26 end.",
            "Sentiment": "neutral",
            "PublishDate": 1763067353920,
            "Source": "earnings"
        },
        {
            "Title": "Xelpmoc Design and Tech Schedules Earnings Call for Q2 and H1 FY26 Results",
            "Summary": "Xelpmoc Design and Tech Limited will announce its second quarter and half year FY26 results on November 13, 2025. The company has scheduled an earnings call with investors and shareholders on November 14, 2025, at 4:00 p.m. IST to discuss operational and financial performance. The call will be hosted by management representatives including Managing Director CEO Sandipan Chattopadhyay, Whole-Time Director CFO Srinivas Koora, and Whole-Time Director Jaison Jose. Xelpmoc is a provider of professional and technical consulting services, offering technology services and end-to-end technology solutions to clients ranging from entrepreneurs and start-ups to established companies across various industries including e-commerce, transportation, logistics, financial services, and social networking.",
            "Sentiment": "neutral",
            "PublishDate": 1762899154418,
            "Source": "earnings"
        },
        {
            "Title": "Xelpmoc Design and Tech Limited Reports Q1 FY26 Financial Results with Revenue Growth",
            "Summary": "Xelpmoc Design and Tech Limited's Board approved unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The company reported revenue from operations of Rs 7.85 crore, up 11.2% quarter-on-quarter from Rs 7.06 crore. Total income reached Rs 9.26 crore compared to Rs 8.19 crore in the previous quarter. However, the company posted a net loss of Rs 18.82 crore for the quarter. The company issued 39,500 equity shares upon conversion of stock options and granted 181,531 new options to employees. During the quarter, Xelpmoc sold part of its equity investment on May 30, 2025, resulting in a reversal of cumulative fair value gain of Rs 99.99 crore. The company's UK subsidiary was dissolved on May 13, 2025. Fair value of investments in portfolio companies stands at approximately Rs 531.8 crore as of June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755008352844,
            "Source": "earnings"
        },
        {
            "Title": "Xelpmoc Design Board Approves Partial Sale of Investment in Mihup",
            "Summary": "The board of Xelpmoc Design has approved the partial sale or disposal of its investment in Mihup for Rs. 100 million. This decision represents a significant corporate action that may impact the company's financial position and investment portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1745063863000,
            "Source": "default"
        }
    ]
}