{
    "Symbol": "XPROINDIA",
    "ISIN": "INE445C01015",
    "News": [
        {
            "Title": "Xpro India Q3 FY26 Results: Net Profit Drops 9.78%",
            "Summary": "Xpro India Limited reported Q3 FY26 net profit of ₹873.31 lacs, down 9.78% YoY. Revenue grew 1.68% to ₹10,631.38 lacs. Board approved Chairman re-appointment for three years.",
            "Sentiment": "neutral",
            "PublishDate": 1770202468560,
            "Source": "co_actions_results"
        },
        {
            "Title": "Xpro India: Strong Moat Despite Recent Decline",
            "Summary": "Xpro India delivers 3,334% five-year returns through specialized polymer products and long-term client relationships with LG, CEAT, despite 42% annual decline and Q2FY26 revenue drop.",
            "Sentiment": "neutral",
            "PublishDate": 1769431579539,
            "Source": "stocks"
        },
        {
            "Title": "Xpro India Gets IND A-/Stable Credit Rating Update",
            "Summary": "India Ratings assigns IND A-/Stable/IND A1 rating to ₹65 crore bank facilities and affirms same rating for ₹130 crore existing facilities of Xpro India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1768376384513,
            "Source": "stocks"
        },
        {
            "Title": "Xpro India Reports Mixed Performance with Foreign Exchange Losses Impacting Profitability",
            "Summary": "Xpro India Limited reported quarterly results with revenue from operations declining to INR 11,990.94 lacs compared to INR 13,398.42 lacs in the same quarter last year. Net profit for the quarter stood at INR 586.44 lacs versus INR 1,082.59 lacs in the previous year. The company faced significant foreign exchange losses of INR 349.63 lacs during the quarter due to Euro-denominated borrowings being impacted by a 13.04% rise in EUR/INR exchange rates. For the six-month period, revenue increased to INR 26,481.14 lacs from INR 27,251.64 lacs, while net profit reached INR 1,016.64 lacs compared to INR 2,484.59 lacs last year. The company issued 1,170,000 equity shares during the quarter at a premium of INR 965 per share to various investors. The Board approved a tripartite agreement for the subsidiary XDF to raise AED 33,087,600 from Oasis Investment Holding Limited. Earnings per share for the quarter was INR 2.52 compared to INR 4.91 in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1762428255902,
            "Source": "earnings"
        },
        {
            "Title": "Xpro India Nears Completion of New Dielectric Film Production Line",
            "Summary": "Xpro India has nearly completed the installation of a new dielectric film production line, with dry runs currently underway. The company expects to begin production from this new facility between November and December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758273842536,
            "Source": "stock"
        },
        {
            "Title": "Xpro India Conducts Dry-Runs at Barjora Plant, UAE Project Remains Unaffected",
            "Summary": "Xpro India provided an update on its Barjora plant commissioning process, stating that dry-runs are currently underway. The company confirmed that the commissioning activities at the Barjora plant will not impact its UAE project operations.",
            "Sentiment": "neutral",
            "PublishDate": 1758108267506,
            "Source": "stock"
        },
        {
            "Title": "Xpro India Limited Reports Potential Delays in Dielectric Films Production Line Due to Supplier Financial Issues",
            "Summary": "Xpro India Limited disclosed that its Dielectric Films production line installation at Barjora, currently in final stages of completion, may face delays due to financial difficulties encountered by a key foreign supplier. The supplier's financial troubles could slow down final-stage activities and acceptance tests. The company is implementing mitigating measures and engaging with the supplier and qualified third-parties. Xpro India does not expect fundamental impediments to completion, intended performance, or business plans. The company issued this disclosure for transparency purposes, noting that actual outcomes may vary based on future events and the supplier's stabilization progress.",
            "Sentiment": "negative",
            "PublishDate": 1758099722581,
            "Source": "stock"
        },
        {
            "Title": "Xpro India Limited Corrects Column Heading in Quarterly Financial Results",
            "Summary": "Xpro India Limited submitted a correction to their quarterly financial results for the quarter ended June 30, 2025. The company clarified that a column heading incorrectly stated 'Year ended June 30, 2024' instead of 'Quarter ended June 30, 2024'. The correction was purely administrative with no changes made to the actual financial figures. The company confirmed that all financial data remains unchanged from their original submission dated July 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753877537474,
            "Source": "earnings"
        },
        {
            "Title": "Xpro India Limited Announces Senior Management Restructuring with New CEO Appointment",
            "Summary": "Xpro India Limited announced senior management changes effective August 27, 2025. C. Bhaskar will be re-designated from Managing Director & Chief Executive Officer to Managing Director, continuing as the senior-most executive on the Board. H. Bakshi will be re-designated from Senior President & Chief Operating Officer to Senior President, and will become Senior President & Group Technical Counsel effective January 15, 2026. Girish Behal will be appointed as President & Chief Executive Officer, transitioning from his role as President (Corporate) & Chief Strategy Officer. Behal joined the company in October 2024 and brings 23 years of experience in chemical and polymer industries, having previously served as Business Head at Ester Industries Ltd and worked with companies like AkzoNobel and Nippon Paint. All individuals remain Key Management Personnel following the restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1753714921457,
            "Source": "corporate_governance"
        },
        {
            "Title": "XPRO India Reports 69% Decline in Q1 Net Profit Despite Revenue Growth",
            "Summary": "XPRO India reported a net profit of 43 million rupees in Q1, representing a significant decline from 140.2 million rupees in the same period last year. However, the company's revenue increased to 1.45 billion rupees compared to 1.39 billion rupees year-over-year, showing growth in the top line despite the drop in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1753713765231,
            "Source": "earnings"
        },
        {
            "Title": "Xpro India Limited Chairman Outlines Expansion Plans for 5 Dielectric Production Lines at Annual Meeting",
            "Summary": "Xpro India Limited's Chairman addressed shareholders at the 28th Annual General Meeting, reporting healthy volume growth despite margin pressure from market conditions. The company's results were described as respectable but behind the previous year's performance. The Chairman outlined strategic expansion plans including a Barjora production line currently under test runs, which faced delays due to supplier issues. The UAE plant is progressing well, with year-end combined dielectric films capacity expected to reach 13,000 MT. The company announced plans for a 4th advanced dielectric line to be executed via the UAE subsidiary and is considering a 5th dielectric line in India. These expansions could potentially increase total dielectric capacity to around 6 times 2024 levels over the next 3-4 years. The company is also exploring Composite Current Collector films for next-generation batteries. The founding coextruded sheets and films business remains stable and profitable, with growth anticipated alongside domestic white goods sector customers.",
            "Sentiment": "positive",
            "PublishDate": 1753452449949,
            "Source": "corporate_action"
        },
        {
            "Title": "Xpro India Limited Schedules Board Meeting for July 28, 2025 to Approve Quarterly Financial Results",
            "Summary": "Xpro India Limited has scheduled a Board of Directors meeting for July 28, 2025 to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter ended June 30, 2025. The company notified the National Stock Exchange of India and BSE Limited about the board meeting. Xpro India Limited trades under the stock symbol XPROINDIA(EQ) with stock code 590013.",
            "Sentiment": "neutral",
            "PublishDate": 1753160669323,
            "Source": "corporate_action"
        },
        {
            "Title": "XPRO INDIA Recommends Dividend of 2 Rupees per Share",
            "Summary": "XPRO INDIA has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748526781000,
            "Source": "result"
        },
        {
            "Title": "XPRO INDIA Reports Q4 Financial Results",
            "Summary": "XPRO INDIA has released its Q4 financial results. The company's EBITDA for Q4 was 135 million rupees, down from 168 million rupees in the same quarter last year. The EBITDA margin decreased to 8.56% from 13.07% year-over-year. Net profit for Q4 was 93 million rupees, compared to 124 million rupees in the previous year and 97 million rupees in the previous quarter. Revenue for Q4 increased to 1.6 billion rupees from 1.28 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748526750000,
            "Source": "result"
        },
        {
            "Title": "XPRO India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "XPRO India's third-quarter financial results show a decrease in EBITDA from 152 million rupees to 107 million rupees year-over-year. The company's EBITDA margin also declined from 15.79% to 10.26% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739016516000,
            "Source": "earnings"
        },
        {
            "Title": "XPRO INDIA Reports Q3 Financial Results",
            "Summary": "XPRO INDIA has announced its financial results for the third quarter. The company reported a net profit of 97 million rupees, down from 107 million rupees in the same quarter last year. However, revenue increased to 1.05 billion rupees from 961 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739016511000,
            "Source": "earnings"
        },
        {
            "Title": "Ashish Kacholia Increases Stake in XPRO India",
            "Summary": "Investor Ashish Kacholia has increased his shareholding in XPRO India by 0.5% during the third quarter. Following this addition, Kacholia's total stake in the company now stands at 4.13%.",
            "Sentiment": "positive",
            "PublishDate": 1737106122000,
            "Source": "corporate_governance"
        },
        {
            "Title": "XPRO INDIA Reports Q2 Financial Results",
            "Summary": "XPRO INDIA has released its Q2 financial results. The company's EBITDA for the quarter was 133 million rupees, compared to 149 million rupees in the same quarter last year. The EBITDA margin decreased to 9.92% from 13.52% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730798019000,
            "Source": "result"
        },
        {
            "Title": "XPRO India Reports Q2 Revenue Growth",
            "Summary": "XPRO India has announced its Q2 revenue of 1.34 billion rupees, compared to 1.1 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730797989000,
            "Source": "result"
        },
        {
            "Title": "XPRO India Reports Q2 Net Profit Increase",
            "Summary": "XPRO India has reported a net profit of 108 million rupees for the second quarter, up from 95 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730797953000,
            "Source": "result"
        }
    ]
}