{
    "Symbol": "XTGLOBAL",
    "ISIN": "INE547B01028",
    "News": [
        {
            "Title": "Xtglobal Infotech Signs US Acquisition Term Sheet",
            "Summary": "Xtglobal Infotech Ltd has signed a term sheet for acquiring a US-based IT/ITES company to support strategic growth and expansion, with completion expected within three months.",
            "Sentiment": "positive",
            "PublishDate": 1768550656387,
            "Source": "co_actions_results"
        },
        {
            "Title": "XT Global Infotech Reports 93.7% YoY Revenue Growth, Expands to Australia Market",
            "Summary": "XT Global Infotech delivered consolidated revenue of ₹94.41 crores in Q2 FY26, marking 93.7% year-on-year growth, while launching operations in Australia with two anchor projects and announcing interim dividend of 5 paise per share. The IT services company targets 20-25% revenue growth for FY27 with EBITDA margins of 15%, driven by offshore delivery models and reduced dependency on H-1B visas.",
            "Sentiment": "positive",
            "PublishDate": 1763627448272,
            "Source": "earnings"
        },
        {
            "Title": "XT Global Infotech Reports Strong Q2 FY26 Performance with 14.2% QoQ EBITDA Growth",
            "Summary": "XT Global Infotech delivered steady quarterly results with standalone EBITDA growing 14.2% QoQ and PAT increasing 16% QoQ, while consolidated revenue grew 2.3% QoQ and EBIT rose 5.4%. The company strengthened its portfolio with 11 new client engagements, declared an interim dividend of ₹0.05 per share, and expanded operations into the Australian market with two anchor projects in finance and accounts outsourcing services.",
            "Sentiment": "positive",
            "PublishDate": 1763373047165,
            "Source": "earnings"
        },
        {
            "Title": "XT Global Infotech Declares Interim Dividend of ₹0.05 Per Share",
            "Summary": "XT Global Infotech Limited's Board declared an interim dividend of ₹0.05 per equity share for financial year 2025-26, with record date fixed as November 21, 2025. The dividend will be paid within 30 days to eligible shareholders whose names appear in the register of members or depositories records on the record date.",
            "Sentiment": "positive",
            "PublishDate": 1763064079994,
            "Source": "earnings"
        },
        {
            "Title": "XT Global Infotech Schedules Q2H1 FY26 Earnings Conference Call for November 18, 2025",
            "Summary": "XT Global Infotech Limited has announced an earnings conference call scheduled for Tuesday, November 18, 2025, at 10:00 AM IST. The call will discuss the company's unaudited standalone and consolidated financial results for the Q2H1 FY26 period, which ended on September 30, 2025. The management team will provide insights into the company's financial performance and address queries during the interactive session. The company has provided dial-in numbers for various countries including India, USA, Hong Kong, UK, and Singapore, along with pre-registration options to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1762970230417,
            "Source": "earnings"
        },
        {
            "Title": "XT Global Infotech Schedules Board Meeting for Financial Results and Interim Dividend Decision",
            "Summary": "XT Global Infotech Limited has announced a board meeting scheduled for November 13, 2025, at 10:00 AM via video conferencing. The board will consider and approve the unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The meeting will also review the Limited Review Report for the same period and consider declaring an interim dividend for financial year 2025-26. The company has implemented a trading window closure for its equity shares from October 1, 2025, until 48 hours after the financial results are made public, in accordance with insider trading prevention regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762384904392,
            "Source": "corporate_action"
        },
        {
            "Title": "XTGlobal Infotech Secures USD 50,000-80,000 Deal for AP Automation Solution",
            "Summary": "XTGlobal Infotech announced a deal with a major U.S. construction company for its Circulus AP Automation Solution. The initial rollout is valued between USD 50,000 to USD 80,000 and is projected to generate approximately USD 113,000 in annual recurring revenue.",
            "Sentiment": "positive",
            "PublishDate": 1761900326746,
            "Source": "order&deals"
        },
        {
            "Title": "XTGLOBAL Infotech Secures First Australian Contract Worth AUD $5,350 Monthly",
            "Summary": "XTGLOBAL Infotech has secured its first contract from Australia for accounting services. The contract has an initial 3-month term with automatic renewal provisions for up to 3 years. The company expects to generate monthly revenue of AUD $5,350 from this contract.",
            "Sentiment": "positive",
            "PublishDate": 1758874202277,
            "Source": "stock"
        },
        {
            "Title": "XTGlobal Infotech Approves 37th AGM, Board Changes, and Foreign Investment Limit Enhancement",
            "Summary": "XTGlobal Infotech Limited's Board of Directors approved convening the 37th Annual General Meeting on September 29, 2025, through video conferencing. The company approved its Annual Report for FY 2024-25 and made several board composition changes, including re-appointment of Mr. Srinivasa Raju Kosuri as Director and Mr. Jagannatha Prasad Malireddy as Non-Executive Director. The Board noted the cessation of Independent Director Mr. Srinivasa Pendyala effective September 22, 2025, upon completion of his tenure. The company appointed M/s. VCSR & Associates as scrutinizer for the e-voting process and KFin Technologies Limited as the authorized agency for e-voting and video conferencing facilities. The Board recommended enhancing foreign investment limits up to 100% of paid-up equity share capital under the automatic route for the IT/ITES sector and approved related party transactions for FY 2025-26 with subsidiaries XTGlobal, Inc., USA and Network Objects, Inc., USA. The Secretarial Audit Report for FY 2024-25 contained no qualifications, reservations, or adverse remarks.",
            "Sentiment": "neutral",
            "PublishDate": 1757050338348,
            "Source": "corporate_action"
        },
        {
            "Title": "XTGlobal Infotech Reports 87% Revenue Growth in Q1 FY26, Driven by Network Objects Subsidiary Addition",
            "Summary": "XTGlobal Infotech Limited reported consolidated revenue of ₹92.30 crores in Q1 FY26, representing 87.2% year-on-year growth from ₹49.30 crores and 6% quarter-on-quarter growth from ₹87.04 crores. The significant revenue increase was primarily driven by Network Objects becoming a subsidiary from an associated company, contributing $22 million in annual revenue. Consolidated EBITDA rose 61.1% quarter-on-quarter to ₹6.61 crores with 7.2% margin improvement. Net PAT reached ₹3.73 crores, nearly triple the previous quarter and 72.4% higher year-on-year. The company added 10 new client accounts during the quarter and won a $7-10 million, 5-year IT modernization project with the Texas Department of Transportation. Employee costs increased to ₹46.52 crores due to ESOP expenses and talent investments. The company is expanding into AI services, government contracts, and exploring acquisitions in Europe, Australia, and India. Management expects the IT services sector recovery to continue, driven by digital transformation and cloud adoption.",
            "Sentiment": "positive",
            "PublishDate": 1755522467094,
            "Source": "earnings"
        },
        {
            "Title": "XTGlobal Infotech Reports Strong Q1 FY26 Results with Revenue Growth and Margin Expansion",
            "Summary": "XTGlobal Infotech Limited reported revenue of ₹1,777 lakhs for Q1 FY26, marking a 2.0% quarter-on-quarter increase. The company secured 10 new client accounts during the quarter. EBITDA grew significantly to ₹252 lakhs, representing a 2.9x QoQ growth, while EBIT reached ₹175 lakhs with 20.9x QoQ growth. PAT increased substantially to ₹152 lakhs, showing 27.3x QoQ growth. The company's EBIT margin improved to 9.9% and PAT margin reached 8.6%. On a consolidated basis, revenue was ₹9,231 lakhs with 6.0% QoQ growth and 87.2% year-on-year growth. Consolidated EBITDA stood at ₹661 lakhs with 61.1% QoQ growth, while consolidated PAT reached ₹374 lakhs with 2.8x QoQ growth. The company is focusing on digital transformation, cloud computing, automation solutions, and expanding its Finance & Accounts Outsourcing division. XTGlobal operates its Circulus AP automation platform and maintains partnerships with Oracle, Microsoft, and other technology providers.",
            "Sentiment": "positive",
            "PublishDate": 1755097703997,
            "Source": "earnings"
        },
        {
            "Title": "XTGLOBAL Secures Major IT Upgrade Contract from U.S. State Agency",
            "Summary": "XTGLOBAL has won a major IT upgrade contract from a U.S. state agency following a competitive bidding process. The contract involves technology infrastructure upgrades for the state agency.",
            "Sentiment": "positive",
            "PublishDate": 1754466255478,
            "Source": "order&deals"
        },
        {
            "Title": "XTGlobal Infotech Reports Strong Q1 Performance with 175% Jump in Consolidated Net Profit",
            "Summary": "XTGlobal Infotech Limited reported its quarterly results for the period ended June 30, 2025. On a standalone basis, the company posted net profit of Rs 152.14 lakhs compared to Rs 199.05 lakhs in the same quarter last year, while revenue from operations stood at Rs 1,777.35 lakhs versus Rs 1,842.12 lakhs year-on-year. The consolidated results showed stronger performance with net profit after tax of Rs 373.54 lakhs compared to Rs 216.67 lakhs in the previous year quarter, representing a significant increase. Consolidated revenue from operations grew substantially to Rs 9,230.56 lakhs from Rs 4,930.67 lakhs year-on-year. The company increased its stake in Network Objects Inc from 44.33% to 51.33% in December 2024, making it a subsidiary and contributing to the consolidated revenue growth. Employee costs included Rs 60.23 lakhs for ESOP/RSU expenses under the company's stock benefit scheme. The company operates in the IT/ITES segment and maintains promoter shareholding of 62.81% with public shareholding at 37.19%.",
            "Sentiment": "positive",
            "PublishDate": 1754374829082,
            "Source": "earnings"
        },
        {
            "Title": "XTGlobal Infotech Launches AI Practice to Expand Digital Transformation Services",
            "Summary": "XTGlobal Infotech Limited announced the launch of its Artificial Intelligence Practice as a strategic initiative to expand revenue opportunities and enhance service capabilities. The company appointed Bharat Rampally as Vice President and Head of AI Practice to lead this division. The AI Practice will offer end-to-end services including AI strategy and roadmapping, ML model development, enterprise integration with platforms like Oracle and Azure, AI governance frameworks, and generative AI solutions. XTGlobal positions this launch to target the global AI market projected to exceed $500 billion by 2030, aiming to create diversified revenue streams beyond its existing Oracle, Microsoft, and RPA offerings. The company expects AI services to enable cross-selling opportunities with existing clients and improve margin profiles through premium pricing. XTGlobal operates with over 600 professionals across India and the US, serving Fortune 1000 companies across retail, healthcare, finance, and manufacturing sectors.",
            "Sentiment": "positive",
            "PublishDate": 1754034807898,
            "Source": "stock"
        }
    ]
}