{
    "Symbol": "YASHO",
    "ISIN": "INE616Z01012",
    "News": [
        {
            "Title": "Yasho Industries Q3FY26 Revenue Jumps 31% to ₹19,814 Lakhs",
            "Summary": "Yasho Industries reported strong Q3FY26 results with revenue rising 31% YoY to ₹19,814 lakhs and returning to profitability with net profit of ₹349.51 lakhs against loss of ₹94.32 lakhs in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770894407919,
            "Source": "co_actions_results"
        },
        {
            "Title": "Yasho Industries Gets Shareholder Nod for Promoter Reclassification",
            "Summary": "Yasho Industries Limited shareholders approve reclassification of three promoter group members to public shareholders category through postal ballot, reducing promoter group holdings by 0.08%.",
            "Sentiment": "neutral",
            "PublishDate": 1770726849983,
            "Source": "stocks"
        },
        {
            "Title": "Yasho Industries Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Yasho Industries Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770265440671,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solidarity Advisors crosses 5% stake in Yasho Industries",
            "Summary": "Solidarity Advisors Private Limited acquired 3,676 shares of Yasho Industries Limited on January 16, 2026, increasing its total holding to 5.02% of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1768886149313,
            "Source": "co_actions_results"
        },
        {
            "Title": "Yasho Industries clarifies volume surge to BSE",
            "Summary": "Yasho Industries responds to BSE inquiry about unusual trading volume, stating no material information withheld and attributing movement to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1768202661764,
            "Source": "stocks"
        },
        {
            "Title": "Yasho Industries Reports 9.6% Revenue Growth Despite Tariff Challenges, Revises FY26 Guidance",
            "Summary": "Yasho Industries Limited reported revenue of INR 183.6 crores for Q2 FY26, marking 9.6% year-on-year growth, with EBITDA margins at 18.2% and PAT margins at 2.65%. Half-year revenue stood at INR 382.6 crores with 11.8% growth, supported by 30% volume growth. The company faced challenges from tariff pressures and slow demand in key markets, particularly affecting US sales which constitute 25% of business, with 40% of US operations impacted by tariffs. Pakhajan facility operated below optimal 50% utilization due to trade restrictions. The company signed a 15-year supply agreement with a global MNC for lubricant derivatives, expected to contribute approximately INR 150 crores annually from FY27. A new R&D laboratory was commissioned with INR 23 crores investment. Due to tariff impacts, management revised full-year revenue guidance from INR 900-1,000 crores to INR 800-850 crores. Working capital and debt levels increased temporarily due to inventory buildup from tariff-related export delays, with plans to normalize inventory from current 210 days to 160-175 days by March. The company maintains EBITDA margin guidance of 17-19% and expects debt-to-EBITDA ratio to improve to 3-3.5x by FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1762897790054,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Seeks Reclassification of Promoter Group Members to Public Category",
            "Summary": "Yasho Industries Limited has applied to BSE and NSE for reclassification of three promoter group members to public shareholder category. The application covers Mr. Rajanikant Desai holding 2,930 shares, Mrs. Kalpana Desai with 2,200 shares, and Rajanikant Desai HUF with 0.08% shareholding. The company submitted the reclassification request under SEBI LODR Regulations and informed both stock exchanges through a regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1762836102903,
            "Source": "corporate_action"
        },
        {
            "Title": "Yasho Industries Reports 10% Revenue Growth Despite Pricing Pressures in Q2 Results",
            "Summary": "Yasho Industries Limited, a specialty chemicals manufacturer, announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue of ₹183 crores for Q2 and ₹383 crores for H1, representing 10% year-over-year growth despite sharp pricing corrections. Volume growth reached 26% year-over-year. EBITDA margin improved to 18.20% and PAT margin to 2.65%, driven by optimized product mix, cost discipline, and operational efficiencies. The industrial business accounted for 86% of total revenue, while exports contributed 65% despite challenging global conditions. The company signed a 15-year supply agreement for lubricant additives with estimated revenues of ₹150 crores from FY27. A new R&D laboratory was inaugurated in October 2025 at Pakhajan. Managing Director CEO Parag Jhaveri stated that demand softness has bottomed out and expressed confidence in achieving strong growth in FY26, citing increasing order visibility and operational ramp-up.",
            "Sentiment": "positive",
            "PublishDate": 1762450760492,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Plans Capacity Expansion to 26,000 TPA by FY27",
            "Summary": "Yasho Industries is focusing on niche specialty chemicals for rubber, lubricant, and aroma segments. The company is expanding its production capacity to 26,000 tonnes per annum by FY27. Yasho is strengthening its global distribution network and investing in R&D-driven product innovation to increase its export share. The company aims to maintain EBITDA margins above 18%.",
            "Sentiment": "positive",
            "PublishDate": 1762439939103,
            "Source": "stock"
        },
        {
            "Title": "Yasho Industries Reports Quarterly Results and Approves Promoter Group Reclassification",
            "Summary": "Yasho Industries Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue of ₹176.18 crores for the quarter, with net profit of ₹286.92 lakhs. Consolidated revenue stood at ₹183.30 crores with net profit of ₹486.74 lakhs for the quarter. The Board also approved a request from Mr. Rajanikant Desai, Mrs. Kalpana Desai, and Rajanikant Desai HUF to reclassify their status from Promoter Group Shareholders to Public Shareholders, subject to stock exchange and shareholder approvals. The reclassification is pursuant to a Family Settlement Agreement and requires compliance with SEBI regulations including maintaining shareholding below 10% and relinquishing control over company affairs.",
            "Sentiment": "neutral",
            "PublishDate": 1762420558578,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports Q2 Revenue Growth to Rs 1.7 Billion",
            "Summary": "Yasho Industries reported quarterly revenue of Rs 1.7 billion compared to Rs 1.6 billion in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1762416804692,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports 36.7% Jump in Quarterly Net Profit to Rs 28.7 Million",
            "Summary": "Yasho Industries posted a net profit of Rs 28.7 million in its latest quarterly results, marking a significant increase from Rs 21 million in the same period last year. This represents a year-on-year growth of approximately 36.7% in the company's bottom line performance.",
            "Sentiment": "positive",
            "PublishDate": 1762416382195,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Receives Reclassification Requests from Promoter Group Members",
            "Summary": "Yasho Industries Limited received requests from three promoter group entities seeking reclassification from 'Promoter Group' to 'Public' category. Mr. Rajanikant Desai holds 2,930 shares (0.02%), Mrs. Kalpana Desai holds 2,200 shares (0.02%), and Rajanikant Desai HUF holds 4,900 shares (0.04%), totaling 0.08% shareholding. The requests cite compliance with regulatory conditions including holding less than 10% voting rights, no control over company affairs, no special rights, no board representation, and not acting as key managerial personnel. The reclassification requests will be presented to the Board of Directors at their upcoming meeting for consideration and necessary regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1761634625155,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yasho Industries Shareholders Approve All Resolutions at 39th AGM Including Executive Reappointments",
            "Summary": "Yasho Industries Limited conducted its 39th Annual General Meeting on September 9, 2025, via video conferencing with 33 shareholders attending (11 promoters and 22 public shareholders). All eight resolutions were passed with required majority votes. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, declaration of final dividend of ₹0.50 per equity share of ₹10 each, and reappointment of Mr. Vinod Jhaveri as director. The meeting also approved reappointments and remuneration fixation for three executive positions: Mr. Parag Jhaveri as Managing Director & CEO, Mr. Yayesh Jhaveri as Whole-time Director, and Mr. Vinod Jhaveri as Executive Director and Chairman. Additionally, shareholders ratified cost auditor remuneration and appointed Dhrumil M. Shah & Co. LLP as Secretarial Auditors for five consecutive years. The company has 26,642 total shareholders as of the cut-off date of September 2, 2025, with voting participation of 70.13% of outstanding shares.",
            "Sentiment": "positive",
            "PublishDate": 1757591042013,
            "Source": "corporate_action"
        },
        {
            "Title": "Yasho Industries Secures ₹150 Crore Annual Supply Deal with Global MNC",
            "Summary": "Yasho Industries has secured a 15-year supply agreement with a global multinational corporation. The deal is valued at approximately ₹150 crore annually, providing the company with a long-term revenue stream over the contract period.",
            "Sentiment": "positive",
            "PublishDate": 1756987666482,
            "Source": "stock"
        },
        {
            "Title": "Yasho Industries Sets Record Date for Final Dividend of Rs. 0.50 Per Share",
            "Summary": "Yasho Industries Limited announced September 2, 2025 as the record date for final dividend of Rs. 0.50 per share for FY 2024-2025. The Board of Directors recommended this dividend on May 2, 2025, subject to shareholder approval at the AGM. Once approved, the dividend will be paid within 30 days from approval date. The company will deduct tax at source as per Income Tax Act requirements for dividends paid after April 1, 2020.",
            "Sentiment": "positive",
            "PublishDate": 1755528434439,
            "Source": "corporate_action"
        },
        {
            "Title": "Yasho Industries Reports Record Quarterly Revenue of INR 198.6 Crores, Targets 40% Growth for FY26",
            "Summary": "Yasho Industries delivered its highest ever quarterly revenue of INR 198.6 crores in Q1 FY26, marking 14% year-on-year growth driven by 33% volume growth despite challenging pricing environment. Industrial Chemicals contributed 87% of revenue while Consumer Chemicals accounted for 13%. The company maintained EBITDA margins of 18.01% on standalone basis and 17.02% on consolidated basis. Pakhajan facility operated at over 50% utilization during the quarter. The company has incurred INR 30 crores of its planned INR 100 crores annual capex, with INR 75 crores allocated for capacity expansion and INR 25 crores for R&D facility completion by October 2025. Management expects to achieve over 40% revenue growth in FY26 while maintaining EBITDA margins between 17-19%. The company aims to reduce working capital from 190 days to below 150 days and targets debt-to-EBITDA ratio below 3 by FY27. Export markets are expected to contribute 70% of total revenue going forward, with US market currently representing 25% of revenue. The chemical industry faces policy uncertainty regarding tariffs and trade, particularly affecting auto ancillary segments, though management expects stabilization by Q3.",
            "Sentiment": "positive",
            "PublishDate": 1754386063271,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports Record Quarterly Revenue of ₹199 Crore in Q1 FY26",
            "Summary": "Yasho Industries Limited, a specialty chemicals manufacturer, reported its highest-ever quarterly revenue of ₹199.02 crore for Q1 FY26, representing a 13.75% year-on-year increase. The company achieved strong volume growth of 33% year-on-year, though revenue growth was impacted by pricing corrections over the past year. EBITDA increased 42.13% to ₹33.87 crore with margins improving to 17.02% from 13.62% in the previous year. The company returned to profitability with PAT of ₹3.64 crore compared to a loss of ₹2.46 crore in Q1 FY25. Industrial business accounted for 87% of total revenue, while exports contributed 67% despite challenging global conditions. The Pakhajan plant operated at over 50% utilization during the quarter. Managing Director Parag Jhaveri expressed confidence in achieving over 40% growth in FY26, with the company's new R&D laboratory expected to commence operations from October 2025. The company has incurred ₹30 crore towards planned annual capex and targets reducing debt-to-EBITDA ratio below 4x by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1753894014377,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Targets Over 40% Growth in FY26 with New R&D Lab Launch",
            "Summary": "Yasho Industries is targeting over 40% growth in FY26 despite facing global headwinds. The company plans to launch an R&D lab in October to support its innovation-led expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1753893320289,
            "Source": "stock"
        },
        {
            "Title": "Yasho Industries Reports Strong Q2 2025 Results, Reappoints Executive Directors for 5-Year Terms",
            "Summary": "Yasho Industries Limited's Board approved unaudited financial results for Q2 2025, showing revenue from operations of ₹19,787.87 lakhs compared to ₹17,610.43 lakhs in the same quarter last year. Net profit increased to ₹562.97 lakhs from ₹64.39 lakhs year-over-year. The company reappointed three executive directors - Parag Jhaveri as Managing Director & CEO, Yayesh Jhaveri as Whole Time Director, and Vinod Jhaveri as Chairman and Executive Director - each for 5-year terms starting February 20, 2026, subject to shareholder approval. The Board also appointed Dhrumil M. Shah & Co. LLP as secretarial auditors for five years from FY 2025-26 to 2029-30. Export sales contributed ₹13,514.67 lakhs while domestic sales were ₹6,273.20 lakhs during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753879124445,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports Strong Q1 Performance with 43% EBITDA Growth",
            "Summary": "Yasho Industries delivered robust quarterly results with EBITDA rising to 353 million rupees from 246.7 million rupees year-over-year. The company's EBITDA margin expanded to 17.82% compared to 14.14% in the same period last year. Net profit surged significantly to 56 million rupees from 6.4 million rupees year-over-year. Revenue grew to 1.98 billion rupees from 1.75 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753878676502,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports Strong Q1 FY2026 Results, Re-appoints Key Directors for 5-Year Terms",
            "Summary": "Yasho Industries Limited approved unaudited financial results for Q1 FY2026 at its board meeting on July 30, 2025. The company reported standalone revenue from operations of ₹19,787.87 lakhs for the quarter ended June 30, 2025, compared to ₹17,610.43 lakhs in the same quarter last year. Net profit increased significantly to ₹562.97 lakhs from ₹64.39 lakhs year-over-year. The board approved re-appointment of three key directors - Parag Jhaveri as Managing Director & CEO, Yayesh Jhaveri as Whole Time Director, and Vinod Jhaveri as Chairman & Executive Director - each for 5-year terms starting February 20, 2026, subject to shareholder approval. The company also appointed Dhrumil M. Shah & Co. LLP as secretarial auditors for five consecutive years from FY 2025-26 to FY 2029-30. Export sales contributed ₹13,514.67 lakhs while domestic sales were ₹6,273.20 lakhs during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753878625472,
            "Source": "corporate_action"
        },
        {
            "Title": "Yasho Industries Schedules Q1 FY26 Results Conference Call for July 31, 2025",
            "Summary": "Yasho Industries Limited has scheduled a conference call on July 31, 2025, at 3:30 PM IST to discuss Q1 FY26 results. The call will feature company participants including Managing Director & CEO Parag Jhaveri and CFO Chirag Shah. Multiple access numbers are provided for domestic and international participants, including toll-free numbers for Hong Kong, Singapore, USA, and UK. Pre-registration is required for the call, and MUFG-IR will handle investor relations coordination.",
            "Sentiment": "neutral",
            "PublishDate": 1753349844547,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports Q4 Financial Results",
            "Summary": "Yasho Industries has announced its Q4 financial results. The company's revenue increased to 1.88 billion rupees, up from 1.76 billion rupees in the same quarter last year. EBITDA also saw growth, reaching 317 million rupees compared to 294 million rupees year-over-year. The EBITDA margin improved slightly to 16.86% from 16.73% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1746179249000,
            "Source": "result"
        },
        {
            "Title": "Yasho Industries Reports Q4 Net Profit Decline",
            "Summary": "Yasho Industries has reported a net profit of 43 million rupees for the fourth quarter, down from 158 million rupees in the same period last year, representing a significant year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1746179082000,
            "Source": "result"
        },
        {
            "Title": "Yasho Industries Reports Q3 Net Loss",
            "Summary": "Yasho Industries has reported a net loss of 9 million rupees in the third quarter, compared to a profit of 148 million rupees in the same period last year. However, the company's revenue increased to 1.51 billion rupees from 1.29 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739320550000,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports Q3 EBITDA Growth",
            "Summary": "Yasho Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 266 million rupees, up from 235 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 17.66% from 18.17% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739273016000,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Reports Q3 Net Loss",
            "Summary": "Yasho Industries experienced a significant financial downturn in Q3, reporting a net loss of 9 million rupees compared to a profit of 148 million rupees in the same quarter last year. Despite the loss, the company's revenue increased to 1.51 billion rupees from 1.29 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739273013000,
            "Source": "earnings"
        },
        {
            "Title": "Yasho Industries Approves Preferential Share Issuance",
            "Summary": "Yasho Industries has approved the issuance of shares on a preferential basis. The company plans to issue shares worth up to 1.25 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734522666000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yasho Industries Board Meeting to Consider Fund Raising",
            "Summary": "Yasho Industries has announced a board meeting scheduled for December 18 to discuss and consider potential fund raising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1734095058000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yasho Industries Reports Improved Q2 EBITDA and Margin",
            "Summary": "Yasho Industries has announced its Q2 financial results. The company's EBITDA increased to 254 million rupees from 208 million rupees year-over-year. Additionally, the EBITDA margin improved to 15.97% from 15.03% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731491300000,
            "Source": "result"
        },
        {
            "Title": "Yasho Industries Reports Q2 Financial Results",
            "Summary": "Yasho Industries has announced its Q2 financial results. The company's net profit decreased to 21 million rupees from 119 million rupees year-over-year. However, revenue increased to 1.6 billion rupees from 1.38 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731491263000,
            "Source": "result"
        }
    ]
}