{
    "Symbol": "YATHARTH",
    "ISIN": "INE0JO301016",
    "News": [
        {
            "Title": "Yatharth Hospital Q3FY26 Earnings Call on Feb 6",
            "Summary": "Yatharth Hospital & Trauma Care Services Limited has scheduled its Q3FY26 earnings conference call for February 6, 2026, at 1:00 PM IST to discuss quarterly results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770019944786,
            "Source": "co_actions_results"
        },
        {
            "Title": "Yatharth Hospital Completes Agra Acquisition Deal",
            "Summary": "Yatharth Hospital executes Share Purchase Agreement for 100% acquisition of Shantived Institute of Medical Sciences in Agra, with commercial operations set to begin February 1st, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769674243656,
            "Source": "co_actions_results"
        },
        {
            "Title": "Yatharth Hospital Auditor Firm Converts to LLP",
            "Summary": "Yatharth Hospital & Trauma Care Services Limited announces that its statutory auditor M S K A & Associates has converted to Limited Liability Partnership effective January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768886828036,
            "Source": "stocks"
        },
        {
            "Title": "Yatharth Hospital Promoter Releases Share Pledge",
            "Summary": "Dr. Kapil Kumar releases pledge on 25.75 lakh equity shares of Yatharth Hospital on December 5 and 9, 2025, reducing his encumbered shareholding from 8.85% to 6.18% of total share capital.",
            "Sentiment": "positive",
            "PublishDate": 1765384165592,
            "Source": "stocks"
        },
        {
            "Title": "Yatharth Hospital Promoter Kapil Kumar Releases Pledge on 25.75 Lakh Equity Shares",
            "Summary": "Dr. Kapil Kumar, Managing Director and promoter of Yatharth Hospital Trauma Care Services Limited, released pledge on 25,75,000 equity shares on December 5 and 9, 2025. The pledge release was in favor of Jio Finance Ltd and IFL Capital Services, reducing his encumbered shareholding from 85.25 lakh shares to 59.50 lakh shares.",
            "Sentiment": "positive",
            "PublishDate": 1765365822444,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Neena Tyagi Sells 5.63 Million Yatharth Hospital Shares, Reduces Stake to 0.62%",
            "Summary": "Dr. Neena Tyagi disposed of 5,633,800 equity shares of Yatharth Hospital Trauma Care Services Limited through open market transactions on November 28, 2025. The sale reduced her shareholding from 6.47% to 0.62% of the company's total share capital, representing a significant stake reduction by the promoter group member.",
            "Sentiment": "neutral",
            "PublishDate": 1764327712278,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospitals Reports Record Revenue Growth of 28% YoY in Q2 FY26",
            "Summary": "Yatharth Hospitals delivered highest-ever revenue of INR 2,794 million with 28% year-over-year growth and record EBITDA of INR 645 million, driven by operationalization of 700 new beds across Delhi and Faridabad facilities. The company achieved significant milestones including income tax authorities unfreezing attached properties, CRISIL credit rating upgrade to A/Stable, and acquisition of 250-bed Shantived Hospital in Agra expected to contribute from Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763637188251,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospital Submits QIP Monitoring Report for Quarter Ended September 30, 2025",
            "Summary": "Yatharth Hospital & Trauma Care Services Limited submitted its monitoring agency report from Crisil Ratings for the quarter ended September 30, 2025, covering utilization of Rs 6,039.07 million net proceeds from its December 2024 QIP. The company has utilized funds across debt repayment (Rs 956.80 million), hospital acquisitions (Rs 2,173.19 million), medical equipment purchases (Rs 836.39 million), and general corporate purposes (Rs 1,252.27 million), with Rs 819.69 million remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1763119443021,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospital Reports Strong Q2FY26 Performance with 28% Revenue Growth and Strategic Expansion",
            "Summary": "Yatharth Hospital delivered robust Q2FY26 results with revenue rising 28% YoY to Rs 2,794 million and PAT growing 33% to Rs 413 million, while expanding bed capacity to 2,550 beds across nine hospitals. The company strengthened its governance framework with new auditor appointments, received favorable income tax resolution, gained MSCI India Small Cap Index inclusion, and completed the acquisition of Agra Hospital for Rs 260 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763061427262,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospital Receives Order to Unfreeze Assets from Income Tax Authorities",
            "Summary": "Yatharth Hospital and Trauma Care Services Limited received orders from the Deputy Commissioner of Income Tax, Delhi, directing the release of all provisionally attached properties. The Income Tax authorities also ordered the unfreezing of all fixed deposits that were previously attached, permitting their free usage by the company. The company stated it has actively cooperated with authorities and provided all required information. Yatharth Hospital will inform exchanges when the tax department concludes its findings and communicates them. The company emphasized its commitment to maintaining high standards of corporate governance.",
            "Sentiment": "positive",
            "PublishDate": 1763003955391,
            "Source": "stock"
        },
        {
            "Title": "Yatharth Hospital Schedules Q2 FY26 Earnings Conference Call for November 14",
            "Summary": "Yatharth Hospital and Trauma Care Services Limited has announced an earnings conference call scheduled for November 14, 2025, at 12:30 PM IST. The call will discuss the company's unaudited financial results for the second quarter and half year ended September 30, 2025. The conference call will be hosted by Elara Securities and will feature key executives including Whole Time Director Yatharth Tyagi, Group CEO Amit Kumar Singh, President-Finance & Group COO Nitin Gupta, Group CFO Pankaj Prabhakar, Group Chief-Strategy, M&A & IR Ashutosh Kumar Jha, and Group Chief Finance Controller Sonu Goyal. Dial-in numbers have been provided for various regions including India, US, UK, Singapore, Hong Kong, and Australia.",
            "Sentiment": "neutral",
            "PublishDate": 1762898013860,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospital's Credit Rating Upgraded to CRISIL A/Stable",
            "Summary": "CRISIL Ratings Limited has upgraded Yatharth Hospital Trauma Care Services Limited's corporate credit rating to CRISIL A/Stable from the previous rating of CRISIL A-/Stable. The rating upgrade was communicated through a letter dated November 6, 2025. The company operates multiple hospitals across locations including Noida, Greater Noida, Faridabad, New Delhi, and Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1762416330950,
            "Source": "stock"
        },
        {
            "Title": "Yatharth Hospital Appoints Ramesh Krishnan as Additional Independent Director",
            "Summary": "Yatharth Hospital and Trauma Care Services Limited has appointed Mr. Ramesh Krishnan as an Additional Director (Non-Executive Independent) for a five-year term from November 05, 2025 to November 04, 2030, subject to shareholder approval. The appointment was made based on the recommendation of the Nomination and Remuneration Committee. Krishnan brings over 30 years of healthcare experience, having served as Executive Director at Relia Institute and Medical Centre, Operating Partner at Everstone Capital, CEO-South Asia at Parkway Pantai (IHH Healthcare), and Vice President at Fortis Healthcare Singapore. He is not related to any existing directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762312690214,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatharth Hospital Subsidiary Commences Operations at New Faridabad Facility",
            "Summary": "Yatharth Hospital & Trauma Care Services Limited announced that its subsidiary MGS Infotech Research and Solutions Private Limited has commenced business operations of a hospital located at Sector 20, Faridabad, Haryana with effect from November 01, 2025. The company stated this strategic move aligns with their growth plans and is expected to contribute to expanding their portfolio and market presence. The commencement of operations is anticipated to strengthen their position in the healthcare sector, provide additional revenue generation avenues, and contribute to long-term business goals while enhancing stakeholder value.",
            "Sentiment": "positive",
            "PublishDate": 1761999996397,
            "Source": "stock"
        },
        {
            "Title": "Kedia Securities Acquires 1% Stake in Yatharth Hospital",
            "Summary": "Kedia Securities Private Limited has acquired a 1% stake in Yatharth Hospital during the second quarter. The acquisition represents an investment by the securities firm in the healthcare company.",
            "Sentiment": "positive",
            "PublishDate": 1760435429862,
            "Source": "stock"
        },
        {
            "Title": "Yatharth Hospital Stock Hits Record High on Revised Government Healthcare Rates",
            "Summary": "Yatharth Hospital & Trauma Care Services shares surged over 10% to reach an all-time high of ₹839, following the Union Health Ministry's announcement of revised rates for nearly 2,000 medical procedures under the Central Government Health Services (CGHS) scheme. The new multi-layered rate structure, effective October 13, provides different compensation based on hospital accreditation and type - with super-specialty hospitals with over 200 beds earning 15% above base rates, while non-accredited facilities receive 15% lower rates. CGHS covers 4.6 million beneficiaries across 80 cities and last underwent major rate revisions in 2014. Yatharth Hospital reported strong financial performance with net profit jumping 40% to ₹42 crore and revenue rising 22% to ₹258 crore. The stock has gained over 55% in the past year, trading above all major moving averages.",
            "Sentiment": "positive",
            "PublishDate": 1759913914567,
            "Source": "stock"
        },
        {
            "Title": "Yatharth Hospital Acquires 150-Bed Agra Hospital for Rs. 260 Crores",
            "Summary": "Yatharth Hospital and Trauma Care Services Limited's board approved the acquisition of 100% interest in Shantived Institute of Medical Sciences for an enterprise value of Rs. 260 crores. The target hospital is a 150-bed super specialty facility in Agra, Uttar Pradesh, expandable to 250 beds and spread across 1,65,000 square feet. The acquisition will be completed through cash consideration within 3 months and aims to expand Yatharth's presence and strengthen its positioning in the healthcare sector. The transaction is not a related party deal and requires no government or regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1757765767643,
            "Source": "order&deals"
        },
        {
            "Title": "Yatharth Hospital Reports 22% Revenue Growth and 38% Net Profit Surge in Q1 FY26",
            "Summary": "Yatharth Hospital & Trauma Care Services achieved revenue of Rs. 2,578 million in Q1 FY26, marking 22% year-on-year growth and 11% quarter-over-quarter increase. Net profit surged 38% year-on-year to Rs. 420 million. The Greater Faridabad facility turned net profit positive within one year of operations, contributing Rs. 234 million in revenue (9% of total). EBITDA grew 20% year-on-year to Rs. 645 million with a 25% margin. The company inaugurated its New Delhi facility in July 2025 and plans to launch the Faridabad facility in late August 2025, adding ~700 beds combined. ARPOB increased 6% year-on-year to Rs. 32,395. Oncology now contributes 17% of Noida Extension's revenue and 10% of group revenue, showing 49% year-on-year growth. The company resolved the Jhansi land ownership issue and is transitioning to MSKA & Associates as statutory auditors. Management expects to maintain revenue growth around 30% and EBITDA margins similar to Q4 FY25 levels.",
            "Sentiment": "positive",
            "PublishDate": 1755019526992,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospital Reports QIP Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Yatharth Hospital & Trauma Care Services Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of Rs 6,039 million in net proceeds from its Qualified Institutional Placement (QIP). The company has utilized Rs 4,593.37 million of the total proceeds, with Rs 1,445.64 million remaining unutilized. Key utilizations include complete repayment of borrowings (Rs 956.80 million), hospital acquisition costs (Rs 2,163.17 million with Rs 10.68 million remaining), medical equipment purchases (Rs 400.56 million with Rs 1,116.80 million remaining), and general corporate purposes (Rs 1,072.83 million with Rs 318.16 million remaining). The monitoring agency Crisil Ratings Limited reported no deviations from the disclosed objects and confirmed all utilization was as per the offer document. The hospital at Model Town, Delhi was inaugurated on July 14, 2025. Unutilized funds are deployed in fixed deposits, mutual funds, and bank accounts earning returns between 5-6.4%.",
            "Sentiment": "neutral",
            "PublishDate": 1754987345849,
            "Source": "stock"
        },
        {
            "Title": "Yatharth Hospital to be Included in MSCI India Small Cap Index",
            "Summary": "Yatharth Hospital and Trauma Care Services Ltd will be included as a constituent of the MSCI India Small Cap Index effective August 26, 2025. The company operates seven super speciality hospitals across North India with a total capacity of 2,300+ beds, located in Noida, Greater Noida, Noida Extension, Greater Faridabad, Model Town facility, and Jhansi-Orchha. Over the past four years, the company has delivered a revenue CAGR of 40% and PAT CAGR of 61%. Whole Time Director Yatharth Tyagi stated that the inclusion represents a testament to strong operational performance and consistent financial growth, and will enhance visibility among global investors. The MSCI India Small Cap Index measures the performance of small cap segment of the Indian equity market and is widely tracked by international institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1754885911261,
            "Source": "stock"
        },
        {
            "Title": "Yatharth Hospital's Statutory Auditors Resign Over Remuneration Dispute",
            "Summary": "Two statutory auditing firms have resigned from Yatharth Hospital & Trauma Care Services Limited and its material subsidiary AKS Medical & Research Centre Private Limited, effective August 5, 2025. M/s. R Nagpal Associates resigned as statutory auditor of Yatharth Hospital, while M/s. MAPPS & Company resigned as auditor of the subsidiary AKS Medical. Both firms cited the same reason for resignation: the proposed remuneration would not be commensurate with the efforts required to conduct audits in accordance with Standards on Auditing issued by the Institute of Chartered Accountants of India. The resignations took effect after both firms completed their limited review for the quarter ended June 30, 2025. R Nagpal Associates had been appointed at the 14th Annual General Meeting in August 2021 and was scheduled to serve until the 19th AGM in 2026. MAPPS & Company was appointed in August 2022 and was scheduled to serve until the 17th AGM in 2026.",
            "Sentiment": "negative",
            "PublishDate": 1754417068830,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatharth Healthcare Reports Strong Q1 Results, Makes Key Auditor Appointments",
            "Summary": "Yatharth Hospital & Trauma Care Services Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs. 2,577.71 million and net profit after tax of Rs. 303.84 million. On standalone basis, revenue was Rs. 1,119.92 million with net profit of Rs. 218.96 million. The Board appointed M/s MKP & Associates as Secretarial Auditor for a five-year term from April 1, 2025 to March 31, 2030, subject to shareholder approval. M/s Subodh Kumar & Co. was re-appointed as Cost Auditor for FY 2025-26. The company also appointed M/s Saurav Upadhyay & Associates as Scrutinizer for the upcoming Annual General Meeting. The company recently inaugurated its Delhi facility on July 14, 2025 and commenced commercial operations there.",
            "Sentiment": "positive",
            "PublishDate": 1754384708416,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospital Reports 38% Jump in Q1 Net Profit to 420 Million Rupees",
            "Summary": "Yatharth Hospital & Trauma Care Services reported consolidated net profit of 420 million rupees in Q1, up from 303.8 million rupees in the same period last year. Revenue increased to 2.6 billion rupees from 2.1 billion rupees year-over-year. EBITDA rose to 644 million rupees from 546 million rupees, though EBITDA margin declined slightly to 25.02% from 25.78% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754383785709,
            "Source": "earnings"
        },
        {
            "Title": "Mukul Agrawal Discloses 1.14% Stake in Yatharth Hospital",
            "Summary": "Investor Mukul Agrawal has reported a 1.14% shareholding in Yatharth Hospital during the first quarter. This information was disclosed as part of the company's shareholding pattern report.",
            "Sentiment": "neutral",
            "PublishDate": 1752726882000,
            "Source": "default"
        },
        {
            "Title": "Yatharth Hospitals Opens New Super-Specialty Facility in New Delhi",
            "Summary": "Yatharth Hospitals has opened a new super-specialty facility in Model Town, New Delhi. This expansion represents a significant development for the company's healthcare services in the capital city.",
            "Sentiment": "positive",
            "PublishDate": 1752484343000,
            "Source": "default"
        },
        {
            "Title": "Yatharth Hospitals Appoints New Group Chief for Strategy, M&A, and Investor Relations",
            "Summary": "Yatharth Hospitals has appointed Ashutosh Kumar Jha as their new Group Chief for Strategy, M&A, and Investor Relations. Jha brings significant experience to the role, having previously worked as Director and Head of Growth at Max Healthcare. His background also includes notable experience with the Bosch Group and Maruti Suzuki.",
            "Sentiment": "positive",
            "PublishDate": 1751547904000,
            "Source": "default"
        },
        {
            "Title": "Yatharth Hospital Expansion Plans and Financial Outlook",
            "Summary": "Yatharth Hospital announced plans to spend Rs 310 crores on capex this year, similar to the previous year. The company will use part of this for brownfield expansion, adding 200 beds to Greater Noida and 250 beds to Noida Extension hospitals. They are in partnership discussions with health ministries in Iraq and Congo. The company expects their Delhi hospital to perform similarly to Greater Faridabad in its first year. For the Jhansi facility, they anticipate an ARPOB of Rs 13,000 to Rs 15,000. New hospitals are expected to face EBITDA losses for 12-15 months before reaching breakeven.",
            "Sentiment": "positive",
            "PublishDate": 1748402540000,
            "Source": "default"
        },
        {
            "Title": "Yatharth Hospital Acquires Two New Hospitals",
            "Summary": "Yatharth Hospital & Trauma Care Services has announced that it has received possession of two newly acquired hospitals. These acquisitions will add approximately 300-400 beds to the company's capacity. The company plans to operationalize these new facilities in the first quarter of fiscal year 2026 (Q1FY26).",
            "Sentiment": "positive",
            "PublishDate": 1748251833000,
            "Source": "default"
        },
        {
            "Title": "Yatharth Hospital Q4 Results: Revenue Up, EBITDA Margin Down",
            "Summary": "Yatharth Hospital & Trauma Care Services reported its Q4 results. Revenue increased to 2.3 billion rupees from 1.77 billion rupees year-over-year. EBITDA rose to 570 million rupees from 465 million rupees. However, EBITDA margin decreased to 24.1% from 26.18%. Consolidated net profit slightly increased to 387 million rupees from 383 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748250349000,
            "Source": "result"
        },
        {
            "Title": "Yatharth Hospital Q3 EBITDA Rises, Margin Declines",
            "Summary": "Yatharth Hospital & Trauma Care Services reported Q3 EBITDA of 505 million rupees, up from 464 million rupees in the same quarter last year. However, the EBITDA margin decreased to 25.10% from 27.83% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737961647000,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospital Reports Q3 Revenue Growth",
            "Summary": "Yatharth Hospital & Trauma Care Services has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 reached 2.2 billion rupees, compared to 1.67 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737961636000,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospital Reports Increased Q3 Profit",
            "Summary": "Yatharth Hospital & Trauma Care Services has reported a consolidated net profit of 305 million rupees for the third quarter, showing a year-over-year increase from 295 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737961625000,
            "Source": "earnings"
        },
        {
            "Title": "Yatharth Hospitals & Trauma Care Services Ltd.: Shares Plummet 30% Below QIP Issue Price",
            "Summary": "Yatharth Hospitals shares have fallen for 14 consecutive sessions in January, now trading 30% below the QIP issue price of ₹595. The stock is down 5% today at ₹416.8. Ambit has dropped coverage citing ongoing Income Tax proceedings as a concern.",
            "Sentiment": "negative",
            "PublishDate": 1737444023000,
            "Source": "normal_news"
        },
        {
            "Title": "Yatharth Hospital Clarifies on Income Tax Department Issue",
            "Summary": "Yatharth Hospital has issued a clarification regarding reports of provisional attachment of equity shares and properties by the Income Tax Department. The company states that there is no new development in this matter. They had previously disclosed that ₹6.23 crore was utilized by the Income Tax Department from a pledged amount.",
            "Sentiment": "neutral",
            "PublishDate": 1737073221000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatharth Hospital Clarifies on Income Tax Department Issue",
            "Summary": "Yatharth Hospital has issued a clarification regarding reports about the provisional attachment of equity shares and properties by the Income Tax Department. The company states that there is no new development concerning this issue. They had previously disclosed that ₹6.23 crore was utilized by the Income Tax Department from a pledged amount.",
            "Sentiment": "neutral",
            "PublishDate": 1737033369000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Analysts Raise Concerns Over Yatharth Hospital's QIP Disclosure",
            "Summary": "Analysts have expressed concerns regarding Yatharth Hospital's recent Qualified Institutional Placement (QIP). The company allegedly failed to disclose information about a 700 crore QIP to investors during a previous QIP on December 19. This omission has raised questions about the company's transparency and disclosure practices.",
            "Sentiment": "negative",
            "PublishDate": 1737013814000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ambit Drops Coverage on Yatharth Hospital Stock Due to Tax Concerns",
            "Summary": "Ambit, a financial services firm, has discontinued its coverage of Yatharth Hospital's stock. This decision was made due to concerns regarding ongoing income tax proceedings against the company. The development is considered a negative update for Yatharth Hospital, as it may impact investor confidence and the stock's market perception.",
            "Sentiment": "negative",
            "PublishDate": 1737013756000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatharth Hospital Wins Bid for Super Specialty Hospital in Delhi",
            "Summary": "Yatharth Hospital & Trauma Care Services has been declared the successful bidder for a super specialty hospital located in Delhi. This development represents a significant expansion opportunity for the company in the national capital region.",
            "Sentiment": "positive",
            "PublishDate": 1735989073000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospital Achieves JCI Accreditation",
            "Summary": "Yatharth Hospital has become the first hospital in Uttar Pradesh to receive Joint Commission International (JCI) accreditation. This prestigious recognition marks a significant milestone for the healthcare institution, highlighting its commitment to maintaining high standards of patient care and safety.",
            "Sentiment": "positive",
            "PublishDate": 1734956454000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospital & Trauma Care Services Ltd: Board Approves QIP for Fund Raising",
            "Summary": "Yatharth Hospital's board approved raising funds via qualified institutional placement (QIP). The floor price is set at Rs 626.18 per share with a potential 5% discount. The QIP aims to raise Rs 700 crore for debt repayment, hospital acquisitions in Delhi and Faridabad, and equipment purchases.",
            "Sentiment": "positive",
            "PublishDate": 1734585456000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospital Authorizes QIP with Floor Price of 626.18 Rupees/Share",
            "Summary": "Yatharth Hospital's board has authorized the opening of a Qualified Institutional Placement (QIP). The floor price for the QIP issue has been set at 626.18 rupees per share. This move suggests the company is looking to raise capital through institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1734526623000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospital Approves Fund Raising of 7 Billion Rupees",
            "Summary": "Yatharth Hospital & Trauma Care Services has approved a plan to raise funds up to 7 billion rupees. This decision indicates a significant financial move for the company, potentially aimed at expansion, debt reduction, or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1730985422000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospital Q2 Financial Results",
            "Summary": "Yatharth Hospital & Trauma Care Services reported Q2 EBITDA of 546 million rupees, up from 456 million rupees year-over-year. However, the EBITDA margin decreased to 25.09% from 26.60% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730982988000,
            "Source": "result"
        },
        {
            "Title": "Yatharth Hospital Reports Q2 Revenue Growth",
            "Summary": "Yatharth Hospital & Trauma Care Services has reported a revenue of 2.18 billion rupees for the second quarter, compared to 1.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730982978000,
            "Source": "result"
        },
        {
            "Title": "Yatharth Hospital Reports Q2 Profit Increase",
            "Summary": "Yatharth Hospital & Trauma Care Services has reported a consolidated net profit of 309 million rupees for the second quarter, showing an increase from 276 million rupees year-over-year and 303.8 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730982968000,
            "Source": "result"
        },
        {
            "Title": "Yatharth Hospital to Acquire 60% Stake in MGS Infotech Research",
            "Summary": "Yatharth Hospital has announced plans to acquire a 60% stake in MGS Infotech Research and Solutions. The acquisition is valued at an enterprise value of 1.52 billion rupees, with Yatharth Hospital set to pay 912 million rupees for the 60% stake.",
            "Sentiment": "positive",
            "PublishDate": 1730294743000,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatharth Hospital Wins Bid for Delhi Super Specialty Hospital",
            "Summary": "Yatharth Hospital has been declared the successful bidder for a super specialty hospital project in Delhi. The hospital has an expandable capacity of over 300 beds and is strategically located to serve a large residential and institutional client base.",
            "Sentiment": "positive",
            "PublishDate": 1730207289000,
            "Source": "corporate_action"
        }
    ]
}