{
    "Symbol": "YATRA",
    "ISIN": "INE0JR601024",
    "News": [
        {
            "Title": "Yatra Online Gets Approval to Shift Base to Delhi",
            "Summary": "Yatra Online Limited receives regulatory approval to relocate its registered office from Maharashtra to Delhi, following shareholder approval through postal ballot in July 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767099794227,
            "Source": "stocks"
        },
        {
            "Title": "Yatra Online's Subsidiary TSI Settles Insolvency Dispute with Ezeego for INR 5 Crore",
            "Summary": "TSI Yatra Private Limited, a wholly owned subsidiary of Yatra Online, settled its insolvency dispute with Ezeego Travels Tours Ltd. by paying INR 5 crore plus INR 6.25 lakh in CIRP costs on November 19, 2025. The NCLAT has disposed the appeal and directed the refund of INR 4.03 crore deposited under the stay order, while the IRP must file for withdrawal of the Corporate Insolvency Resolution Process.",
            "Sentiment": "positive",
            "PublishDate": 1764689850175,
            "Source": "stock"
        },
        {
            "Title": "Yatra Online Fined Rs 5.13 Lakh by NSE and BSE for Board Composition Non-Compliance",
            "Summary": "Yatra Online received fines totaling Rs 5.13 lakh from NSE and BSE for non-compliance with board composition requirements under Regulation 17(1) for the quarter ended September 30, 2025. The company has paid the fines within the prescribed timeline and achieved compliance after appointing Mr. Roshan Chanaka Nirmal Mendis as Director effective September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764568646576,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatra Online Completes Amalgamation of Six Subsidiary Companies",
            "Summary": "Yatra Online Limited has completed the amalgamation of six wholly-owned subsidiaries including Yatra TG Stays, Yatra Hotel Solutions, and four other companies, with the scheme becoming effective from December 01, 2025. The amalgamating companies have been dissolved without winding up and cease to be subsidiaries, while the company's authorized share capital has been revised to Rs. 46,58,00,000 divided into equity and preference shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764565066685,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatra Online Elevates Co-Founder Dhruv Shringi to Executive Chairman, Appoints Siddhartha Gupta as CEO",
            "Summary": "Yatra Online announced a strategic leadership transition with co-founder Dhruv Shringi moving to Executive Chairman and Siddhartha Gupta taking over as CEO effective November 25, 2025. The company has onboarded 148 new corporate clients representing Rs 700 crores in annual potential business over the past 12 months, positioning for its next phase of growth and global expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1764040452726,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatra Online Settles Dispute with Ezeego for 50 Million Rupees",
            "Summary": "Yatra Online has paid 50 million rupees to Ezeego as part of a settlement agreement between the two companies. The payment resolves an ongoing dispute, though specific details of the underlying issues were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1763645315877,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatra Online Reports Strong Q2 FY26 Results with 48% Revenue Growth and Raised EBITDA Guidance",
            "Summary": "Yatra Online delivered robust quarterly results with revenue growing 48% year-over-year to INR 3,509 million, driven by strong performance in corporate travel, hotels, packages and MICE segments. The company raised its adjusted EBITDA growth guidance from 30% to 35-40% for the year, with PAT increasing 96% year-over-year to INR 143 million and onboarding 34 new corporate clients with INR 2.6 billion annual billing potential.",
            "Sentiment": "neutral",
            "PublishDate": 1763477931276,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatra Online Reports No Deviation in IPO Proceeds Utilization for September 2025 Quarter",
            "Summary": "Yatra Online Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from the stated objects of its Initial Public Offering. The company raised INR 775 crore through its IPO in September 2023, with net proceeds of INR 570.097 crore. Out of the total proceeds, INR 500.631 crore has been utilized across three main objectives: strategic investments and acquisitions (INR 128.980 crore utilized out of INR 150 crore allocated), customer acquisition and technology initiatives (INR 353.251 crore utilized out of INR 392 crore allocated), and general corporate purposes (INR 18.400 crore utilized out of INR 28.097 crore allocated). The remaining unutilized proceeds of INR 71.061 crore are deployed in fixed deposits with various banks earning returns between 7.25% to 8.00%. ICRA Limited, serving as the monitoring agency, confirmed that the utilization is in line with the objects of the issue and observed no material deviations.",
            "Sentiment": "neutral",
            "PublishDate": 1762909318853,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatra Online Reports Quarterly Profit of INR 190.57 Million, Revenue Up 73% Year-on-Year",
            "Summary": "Yatra Online Limited reported a net profit of INR 190.57 million for the quarter ended September 30, 2025, compared to a loss of INR 73.01 million in the same quarter last year. Total revenue from operations increased 73% to INR 2,804.37 million from INR 1,623.04 million year-on-year. For the six-month period, the company posted a profit of INR 302.73 million versus INR 73.43 million in the previous year, with revenue growing to INR 5,349.87 million from INR 3,093.29 million. The company's air ticketing segment generated INR 3,231.69 million in revenue for the six-month period, while hotels and packages contributed INR 1,959.47 million. The auditors noted ongoing regulatory queries from NSE and SEBI regarding INR 3,391.44 million in deposits/advances from IPO proceeds, which the company has responded to based on legal opinions confirming compliance with offer document objectives.",
            "Sentiment": "positive",
            "PublishDate": 1762874755327,
            "Source": "earnings"
        },
        {
            "Title": "Yatra Online Reports Strong Q2 Performance with 94% Jump in Net Profit",
            "Summary": "Yatra Online reported net profit of 142 million rupees in Q2, nearly doubling from 73 million rupees in the same period last year. The company's revenue grew 45.83% year-over-year. EBITDA increased significantly to 239 million rupees from 92 million rupees, while EBITDA margin improved to 6.8% from 3.9% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762853517120,
            "Source": "earnings"
        },
        {
            "Title": "Yatra Online Schedules Q2FY26 Earnings Conference Call for November 12, 2025",
            "Summary": "Yatra Online Limited has announced an earnings conference call to discuss its quarterly results ended September 30, 2025. The call is scheduled for Wednesday, November 12, 2025 at 11:00 A.M. IST. The session will be represented by CEO and Whole-Time Director Dhruv Shringi and Chief Financial Officer Anuj Kumar Sethi. ICICI Securities is coordinating the call, which will provide universal access numbers and toll-free numbers for participants from Singapore, Hong Kong, UK, and USA. The company has notified stock exchanges NSE and BSE about this earnings discussion as part of regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1762414096968,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Yatra Online's Composite Scheme of Amalgamation with Six Subsidiaries",
            "Summary": "The National Company Law Tribunal (NCLT) Mumbai Bench has approved and sanctioned the Composite Scheme of Amalgamation involving Yatra Online Limited and six subsidiary companies: Yatra TG Stays Private Limited, Yatra Hotel Solutions Private Limited, Yatra For Business Private Limited, Yatra Corporate Hotel Solutions Private Limited, Travel.Co.In Private Limited, and Yatra Online Freight Services Private Limited. The scheme will become effective upon filing the certified copy of the order with the Registrar of Companies, Mumbai. The appointed date for the scheme is April 1, 2024. All six companies are wholly owned subsidiaries of Yatra Online Limited and are engaged in travel-related businesses including hotel bookings, corporate travel services, and freight forwarding. The amalgamation aims to simplify management and operational structures, increase efficiencies, reduce compliance requirements, and create synergies. Since the subsidiaries are wholly owned, no new securities will be issued by Yatra Online Limited. The Regional Director, Official Liquidator, and other regulatory authorities have provided satisfactory reports with no adverse comments on the scheme.",
            "Sentiment": "positive",
            "PublishDate": 1760515360792,
            "Source": "corporate_action"
        },
        {
            "Title": "Yatra Launches Festive Shareholder Rewards Program with Flight and Hotel Discounts",
            "Summary": "Yatra has introduced a festive shareholder rewards program offering exclusive discounts on flights and hotels. The discount offers are valid until November 30.",
            "Sentiment": "positive",
            "PublishDate": 1758883657151,
            "Source": "stock"
        },
        {
            "Title": "Yatra Online Appoints New Non-Executive Director, Achieves Board Compliance After Fine Payment",
            "Summary": "Yatra Online has approved the appointment of Roshan Chanaka Nirmal Mendis as a new Non-Executive Director, effective September 26, 2025. The company now meets board composition requirements following the payment of fines for previous violations of these rules.",
            "Sentiment": "positive",
            "PublishDate": 1758705787600,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatra Online's Company Secretary Darpan Batra Resigns After 14-Year Tenure",
            "Summary": "Yatra Online Limited announced that Darpan Batra has resigned from his positions as Company Secretary, Compliance Officer, and Key Managerial Personnel, effective September 22, 2025. Batra submitted his resignation due to personal reasons and to pursue other growth opportunities outside the company. He served with Yatra Online for approximately 14 years. The company has accepted his resignation and expressed appreciation for his contributions during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1758623381855,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatra Online Reports Strong Q1 FY26 Results with 108% Revenue Growth and 247% EBITDA Jump",
            "Summary": "Yatra Online delivered robust quarterly results with revenue growing 108% year-over-year to INR 209 million and revenue less service cost rising 44% to INR 115.6 crores. EBITDA surged 247% year-over-year to INR 24.2 crores, while profit after tax increased almost 3x to INR 16 crores. The company onboarded 34 new corporate clients with annual billing potential of approximately INR 200 crores. Air ticketing passenger volumes declined 9% but gross bookings grew 4% with improved margins from 3.10% to 4.60%. Hotels & Packages segment saw gross bookings increase 43% with margins expanding from 7.46% to 9.05%. The company reduced gross debt significantly from INR 546 million to INR 29 million. Management maintains guidance of 20% growth in gross margin and 30% growth for adjusted EBITDA. The company launched AI assistant DIYA and expects to optimize 70-100 employee positions by fiscal year end through automation.",
            "Sentiment": "positive",
            "PublishDate": 1755521233622,
            "Source": "earnings"
        },
        {
            "Title": "Statutory Auditors of Yatra's Material Subsidiary Globe All India Services Resign for Group Alignment",
            "Summary": "M/s J K V S & CO resigned as statutory auditors of Globe All India Services Limited, a material subsidiary of Yatra Online Limited, effective August 13, 2025. The auditors were originally appointed for a five-year term from 2022-23 to 2026-27 during the Annual General Meeting held on September 16, 2022. The resignation follows Yatra's acquisition of Globe, with management seeking to align statutory auditors across the group to ensure consistency in the audit process and create synergies at the group level. The auditors completed their review of Globe's financial results for the period ended June 30, 2025, with their review report dated August 7, 2025. No concerns were raised prior to resignation, and the auditors confirmed there were no other material reasons beyond those stated in their resignation notice.",
            "Sentiment": "neutral",
            "PublishDate": 1755107479347,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatra Online Shares Jump 19.58% to Seven-Month High as Quarterly Profit Quadruples",
            "Summary": "Yatra Online's share price surged to Rs 114.50, its highest level since January 6, after reporting strong quarterly results. The company's net profit jumped 296% year-on-year to Rs 16 crore from Rs 4.04 crore. Revenue increased 108.1% to Rs 209.81 crore from Rs 100.81 crore, while profit margin rose 640 basis points to 11.0% from 4.6%. EBITDA jumped 403% to Rs 23.07 crore from Rs 4.59 crore. The company signed 34 new corporate customers with annual billing potential of Rs 200 crore. Strong performance was driven by corporate business and higher margins in hotels and packages due to continued momentum in meetings, incentives, conferences, and exhibitions. Trading volume reached 59 times the 30-day average, with the stock showing overbought conditions at RSI of 70.87. Five analysts maintain buy ratings with average price target implying 16.2% upside.",
            "Sentiment": "positive",
            "PublishDate": 1754886712830,
            "Source": "earnings"
        },
        {
            "Title": "Yatra Online Targets Growth Through Corporate Expansion and Technology Enhancement",
            "Summary": "Yatra Online is pursuing growth through multiple strategic initiatives including expanding its corporate client base, enhancing its B2C platform, and utilizing technology in travel solutions. The company is focusing on India's travel demand surge and plans to leverage strategic partnerships and cross-selling opportunities to boost revenue and profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1754669493387,
            "Source": "stock"
        },
        {
            "Title": "Yatra Online Reports Strong Q1 Performance with 147% Profit Growth, Reappoints Auditors",
            "Summary": "Yatra Online Limited reported quarterly results for the period ended June 30, 2025, showing consolidated profit of INR 159.97 million compared to INR 40.42 million in the same quarter last year. Revenue from operations increased to INR 2,098.14 million from INR 1,008.07 million year-over-year. The company's standalone profit reached INR 52.99 million versus INR 21.38 million in the previous quarter. The board reappointed Ernst & Young LLP as Internal Auditors for FY 2025-26 and appointed Chandrasekaran Associates as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company utilized INR 20.85 million from IPO proceeds during the quarter, with INR 708.62 million remaining unutilized. SEBI had raised queries regarding INR 3,391.44 million in deposits/advances given from IPO proceeds till June 30, 2024, which the company has responded to based on legal opinions supporting their classification under customer acquisition initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754667662867,
            "Source": "earnings"
        },
        {
            "Title": "Yatra Online Receives NCLT Approval for Amalgamation Plan",
            "Summary": "Yatra Online has received approval from the National Company Law Tribunal (NCLT) for its amalgamation plan. The next hearing regarding this matter is scheduled for August 13. No further details about the amalgamation plan or its implications were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752221653000,
            "Source": "default"
        },
        {
            "Title": "Yatra Online Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Yatra Online announced its Q4 financial results. The company's consolidated net profit increased to 152 million rupees, up from 56 million rupees year-over-year and 100 million rupees quarter-over-quarter. Revenue for Q4 rose to 2.2 billion rupees, compared to 1.1 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748559755000,
            "Source": "default"
        },
        {
            "Title": "Yatra Online Reports Strong Q4 Financial Results",
            "Summary": "Yatra Online announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 171 million rupees from 36 million rupees in the previous year. EBITDA margin improved to 7.81% from 3.34%. Consolidated net profit rose to 152 million rupees, up from 56 million rupees year-over-year and 100 million rupees quarter-over-quarter. Revenue for Q4 reached 2.2 billion rupees, doubling from 1.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748533675000,
            "Source": "result"
        },
        {
            "Title": "Yatra Online Ltd: Interim CFO Appointed as Share Price Rises",
            "Summary": "Yatra Online Ltd. appointed Anuj Kumar Sethi as interim CFO following Rohan Purshottamdas Mittal's resignation. The company's share price rose 2.23% to Rs 80.34 in early trade. Sethi, a former CFO of the company, has experience with Airfreight Ltd. and is qualified from the Institute of Cost and Works Accountants of India.",
            "Sentiment": "positive",
            "PublishDate": 1744694127000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yatra Online Reports Profitable Q2 FY2024 Results",
            "Summary": "Yatra Online has reported a significant turnaround in its Q2 financial results. The company posted a consolidated net profit of 73 million rupees, compared to a loss of 171 million rupees in the same quarter last year and a profit of 40 million rupees in the previous quarter. Revenue increased substantially to 2.4 billion rupees from 941 million rupees year-over-year. The company also achieved an EBITDA gain of 93 million rupees, reversing a loss of 84 million rupees in the previous year, with an EBITDA margin of 3.93%.",
            "Sentiment": "positive",
            "PublishDate": 1731455853000,
            "Source": "result"
        }
    ]
}