{
    "Symbol": "YESBANK",
    "ISIN": "INE528G01035",
    "News": [
        {
            "Title": "YES Bank Conducts Nuvama India Investor Conference",
            "Summary": "YES Bank participated in Nuvama India Investor Conference on February 09, 2026, conducting multiple group meetings with institutional investors and fund managers in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1770660818995,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank Receives INR 282 Crores from NPA Settlement",
            "Summary": "YES Bank disclosed receipt of INR 282 crores from One Time Settlement of Non Performing Advance under OTS agreement dated November 27, 2025, with balance amount expected shortly.",
            "Sentiment": "positive",
            "PublishDate": 1770347964373,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank Allots 3.45 Lakh Equity Shares via ESOS",
            "Summary": "YES Bank allotted 3,45,283 equity shares on January 23, 2026, through stock option exercises under ESOS 2020 and RSU Plan 2024, raising Rs. 42.18 lakh and increasing paid-up capital to Rs. 6,275.86 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769178789794,
            "Source": "co_actions_results"
        },
        {
            "Title": "YES Bank Re-appoints Dr. Rajan Pental as Executive Director",
            "Summary": "YES Bank receives RBI approval to re-appoint Dr. Rajan Pental as Executive Director for six months from February 2, 2026 to July 31, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769016545715,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank CRO Tushar Patankar Resigns Effective Jan 21",
            "Summary": "YES Bank announces resignation of Chief Risk Officer Tushar Patankar effective January 21, 2026, citing career aspirations. Patankar tendered resignation on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769004270095,
            "Source": "stocks"
        },
        {
            "Title": "Yes Bank Plans to Cut Legacy RIDF Balances by FY27",
            "Summary": "Yes Bank announces strategic guidance to reduce legacy Rural Infrastructure and Development Fund balances to below 5% of total assets by FY27, signaling improved asset quality focus.",
            "Sentiment": "positive",
            "PublishDate": 1768797859500,
            "Source": "stocks"
        },
        {
            "Title": "Yes Bank guides net credit cost below 50 bps for FY",
            "Summary": "Yes Bank expects net credit cost to remain below 50 basis points for full year, maintaining consistent guidance on non-tax provisions to assets during concall update.",
            "Sentiment": "positive",
            "PublishDate": 1768797630312,
            "Source": "co_actions_results"
        },
        {
            "Title": "Yes Bank MF holding hits pre-crisis high, retail dips",
            "Summary": "Mutual fund shareholding in Yes Bank reaches 3.58% in Q3, highest since Dec 2019 crisis. Retail shareholding drops to 20.7% from 22.5%, marking two-year low despite 60+ lakh investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768795097188,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank Q3 results preview: Mixed profit projections",
            "Summary": "YES Bank to announce Q3FY26 results on Jan 17. Brokerages expect NII growth of 9-12% YoY with PAT estimates ranging from 2% to 27% growth amid cautious outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1768544009518,
            "Source": "co_actions_results"
        },
        {
            "Title": "YES Bank Gets NSDL Approval for Demat Business Transfer",
            "Summary": "YES Bank receives NSDL approval on January 5 to transfer retail demat operations to subsidiary YES Securities (India), enabling strategic business restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1767705577994,
            "Source": "stocks"
        },
        {
            "Title": "Yes Bank Q3 Results on Jan 17",
            "Summary": "Yes Bank has announced that its board will meet on January 17 to consider and approve the company's third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1767685196760,
            "Source": "co_actions_results"
        },
        {
            "Title": "YES BANK Q3FY26 Loans & Advances Rise 5.2% YoY to ₹257,508 Cr",
            "Summary": "YES BANK reports provisional Q3FY26 financials with Loans & Advances at ₹257,508 crores, up 5.2% YoY. Deposits reach ₹292,484 crores with CASA ratio improving to 34.0%. Management expresses optimism for FY26 outlook.",
            "Sentiment": "positive",
            "PublishDate": 1767445390578,
            "Source": "co_actions_results"
        },
        {
            "Title": "YES Bank Awaits NSDL Approval for Demat Transfer",
            "Summary": "YES Bank continues to await NSDL approval for transferring its retail demat undertaking to subsidiary YES Securities, with no changes to earlier disclosed information except completion timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1767287953144,
            "Source": "stocks"
        },
        {
            "Title": "Yes Bank to Announce Q3 Results on January 17",
            "Summary": "Yes Bank has scheduled the announcement of its third quarter financial results for January 17, marking an important milestone for stakeholders awaiting the bank's performance update.",
            "Sentiment": "neutral",
            "PublishDate": 1767256301427,
            "Source": "co_actions_results"
        },
        {
            "Title": "YES Bank Receives ₹189 Cr from Security Receipts Trust",
            "Summary": "YES Bank disclosed receipt of ₹189 crores from Security Receipts Portfolio trust related to NPA portfolio sold to JC Flower ARC in December 2022, exceeding materiality threshold.",
            "Sentiment": "positive",
            "PublishDate": 1767237667314,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank Gets Relief in ₹292.29 Cr Tax Demand Case",
            "Summary": "YES Bank receives substantial reduction in additional tax demand of ₹292.29 crores for AY 2017-18 following rectification order from Jurisdictional Assessing Officer on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767236989483,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank Receives ₹345 Crore Income Tax Refund",
            "Summary": "YES Bank receives consolidated income tax refund of approximately ₹345 crores including interest following appellate authority orders for assessment year 2016-17 dispute resolution.",
            "Sentiment": "positive",
            "PublishDate": 1767236236648,
            "Source": "stocks"
        },
        {
            "Title": "Yes Bank Faces ₹3.30 Cr GST Penalty from UP Dept",
            "Summary": "Yes Bank received a ₹3.30 crore GST penalty from Uttar Pradesh tax department for FY2021-22. The bank plans to appeal the order and expects no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1766726603764,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank Receives ESG Rating of 78 for FY25",
            "Summary": "NSE Sustainability Ratings Analytics assigned YES Bank an ESG rating of 78 and core rating of 74 for FY25, while upgrading its FY24 ESG rating from 72 to 76.",
            "Sentiment": "positive",
            "PublishDate": 1765877779635,
            "Source": "stocks"
        },
        {
            "Title": "YES Bank Allots 11.03 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "YES Bank's Nomination Remuneration Committee approved allotment of 11,03,638 equity shares of Rs. 2 face value each following exercise of stock options under YBLESOS2020 Scheme and YBLRSU Plan 2024, generating Rs. 1.34 crore for the bank. The bank's paid-up share capital increased from Rs. 62,752.89 crore to Rs. 62,755.10 crore, with total equity shares rising to 31,377,549,600.",
            "Sentiment": "positive",
            "PublishDate": 1764924753951,
            "Source": "corporate_action"
        },
        {
            "Title": "YES Bank Allots 10.58 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "YES Bank's Nomination Remuneration Committee approved allotment of 10,58,752 equity shares of Rs. 2 face value each following exercise of stock options under YBLESOS2020 Scheme and YBLRSU Plan 2024, generating Rs. 1.30 crore for the bank. The bank's paid-up share capital increased from Rs. 62,750,774,420 to Rs. 62,752,891,924, with total equity shares rising to 31,376,445,962.",
            "Sentiment": "positive",
            "PublishDate": 1764067806218,
            "Source": "corporate_action"
        },
        {
            "Title": "SMBC Considers Increasing Yes Bank Stake Beyond 25%, Evaluates Wholly Owned Subsidiary in India",
            "Summary": "Sumitomo Mitsui Banking Corporation, which holds a 25% stake in Yes Bank as part of its $7 billion India investment, is open to raising its stake further and actively evaluating setting up a wholly owned subsidiary in the country. SMBC aims to support Yes Bank's return to the top-five private sector banks position, viewing it as a turnaround story with strong wholesale banking business that complements their existing operations.",
            "Sentiment": "positive",
            "PublishDate": 1763340965430,
            "Source": "stock"
        },
        {
            "Title": "YES Bank Allots 5.53 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "YES Bank has allotted 5,53,703 equity shares of face value Rs. 2 each following the exercise of stock options under its YBLPESOP 2020 plan, YBLESOS 2020 Scheme, and YBLRSU Plan 2024. The bank realized Rs. 46,94,395.50 from the exercise of these stock options. Following this allotment, the bank's paid-up share capital increased from Rs. 62,749,667,014 consisting of 31,374,833,507 equity shares to Rs. 62,750,774,420 consisting of 31,375,387,210 equity shares. The Nomination Remuneration Committee approved the allotment on November 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762593034195,
            "Source": "corporate_action"
        },
        {
            "Title": "Yes Bank Lost Rs 2,700 Crore in Investments with Anil Ambani Companies, CBI Alleges",
            "Summary": "Yes Bank suffered a loss of over Rs 2,700 crore due to investments in Anil Ambani-led financial companies between 2017 and 2019, according to a CBI charge sheet. The bank invested Rs 5,010 crore total - Rs 2,965 crore in non-convertible debentures of Reliance Home Finance Limited and Rs 2,045 crore in commercial papers of Reliance Commercial Finance Limited. Of this amount, Rs 3,337.5 crore became Non Performing Investment by December 2019. The CBI filed charges against 13 people including Ambani, Yes Bank co-founder Rana Kapoor and his family members, alleging criminal conspiracy, cheating and corruption. The agency claims Kapoor made unilateral investment decisions knowing the NCDs had no secondary market demand. The CBI alleges a quid-pro-quo arrangement where Kapoor's family companies received Rs 570 crore in credit facilities from Ambani's firms at lower interest rates, while Kapoor failed to disclose these loans as required. Some ADA Group entities were allegedly shell companies used to route funds to discharge existing liabilities.",
            "Sentiment": "negative",
            "PublishDate": 1761754441270,
            "Source": "corporate_governance"
        },
        {
            "Title": "SMBC to Share Global Learning with Yes Bank to Raise Standards",
            "Summary": "SMBC plans to share its global learning and expertise with Yes Bank to help improve the bank's standards and operations. The CEO indicated this collaboration aims to raise the bar for Yes Bank's performance.",
            "Sentiment": "positive",
            "PublishDate": 1761523154225,
            "Source": "stock"
        },
        {
            "Title": "Yes Bank Reports Growth in Deposits and Advances, Targets Double-Digit Loan Expansion",
            "Summary": "Yes Bank reported 4% quarter-on-quarter growth in advances and 7% increase in deposits. CEO Prashant Kumar highlighted that CASA growth exceeded total deposit growth by more than double, while cost of deposits decreased by 20 basis points. The bank targets double-digit loan growth in FY25, with corporate loans growing 7% sequentially and commercial banking delivering 16% year-on-year growth. Kumar projects 15-16% annual loan growth over the next three to four years. Sumitomo Mitsui Banking Corporation holds a 24.2% stake alongside SBI's 10.8% holding, expected to enhance transaction banking and cross-selling opportunities. Asset quality showed improvement with gross slippages declining from 2.4% to 2%, credit costs stable at 40 basis points, and restructured book reduced to ₹200 crore. The bank continues focusing on retail and digital-led strategy for customer acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1761215500435,
            "Source": "stock"
        },
        {
            "Title": "Yes Bank Reports 18% YoY Jump in Net Profit Despite Sequential Decline",
            "Summary": "Yes Bank reported an 18.3% year-on-year increase in profit after tax to Rs 654.47 crore for the quarter ended September 30, 2025, compared to Rs 553.04 crore in the same quarter last year. However, profit declined 18.3% sequentially from Rs 801.06 crore in the June 2025 quarter. Net interest income rose 4.5% YoY to Rs 2,300.88 crore, while total income dipped 1.24% to Rs 9,023.15 crore. Net advances crossed Rs 2.5 lakh crore milestone, reaching Rs 2,50,212 crore with 6.4% YoY and 3.8% QoQ growth. Asset quality showed mixed results with gross NPAs rising to Rs 4,055.31 crore from Rs 3,889.43 crore YoY, though GNPA ratio remained stable at 1.6%. Net NPAs improved to Rs 770.84 crore from Rs 1,168.02 crore, with Net NPA ratio declining to 0.3% from 0.5%. Net Interest Margin remained steady at 2.5% QoQ with 10 basis points YoY improvement, supported by a 40 basis points YoY decline in cost of deposits to 5.7%.",
            "Sentiment": "positive",
            "PublishDate": 1760933843645,
            "Source": "earnings"
        },
        {
            "Title": "YES Bank Transfers Demat Operations to Subsidiary for ₹64.76 Lakh",
            "Summary": "YES Bank's board approved transferring its Demat Undertaking under the Retail Division to subsidiary YES Securities (India) Limited for ₹64.76 lakh, effective January 1, 2026. The transferred business represents less than 0.05% of the bank's total income. YES Securities is a SEBI-registered entity providing stockbroking, depository services, investment advisory, and mutual fund distribution. The transaction is structured as a related party deal executed at arm's length. YES Bank reported turnover of ₹36,752 crores and total assets of ₹4.23 lakh crores, while YES Securities recorded revenue of ₹342 crores and assets of ₹1,272 crores. The bank stated the transfer aligns with strategic objectives to enhance customer service.",
            "Sentiment": "neutral",
            "PublishDate": 1760784571691,
            "Source": "corporate_action"
        },
        {
            "Title": "YES Bank Reports 50% Increase in Quarterly Provisions to 4.2 Billion Rupees",
            "Summary": "YES Bank's provisions (excluding tax expenses) and contingencies rose to 4.2 billion rupees in Q2, marking an increase from 2.8 billion rupees in the previous quarter. This represents a quarter-on-quarter growth in the bank's provisioning requirements.",
            "Sentiment": "negative",
            "PublishDate": 1760773127954,
            "Source": "earnings"
        },
        {
            "Title": "YES Bank Reports Q2 Net Profit of ₹654 Crores, SMBC Completes 24.22% Stake Acquisition",
            "Summary": "YES Bank Limited reported a net profit of ₹654.47 crores for Q2 ended September 30, 2025, compared to ₹553.04 crores in the same quarter last year. For the half-year period, net profit reached ₹1,455.55 crores versus ₹1,055.47 crores in the previous year. The bank's total income for Q2 stood at ₹9,023.15 crores. Gross NPA ratio remained stable at 1.6%, while Net NPA ratio improved to 0.3% from 0.5% year-on-year. Capital adequacy ratio was maintained at 15.0%. During the quarter, the bank allotted 66.77 lakh equity shares under employee stock option schemes. Sumitomo Mitsui Banking Corporation completed its acquisition of a 24.22% stake in YES Bank, with the transaction finalized on September 17, 2025, following regulatory approvals from RBI and CCI. The bank confirmed full utilization of non-convertible debt securities proceeds and redeemed ₹315 crores worth of Green Infrastructure Bonds that matured in August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760772315924,
            "Source": "earnings"
        },
        {
            "Title": "Yes Bank Shares Drop Nearly 5% as SMBC Rules Out Stake Increase Beyond 24.99%",
            "Summary": "Yes Bank shares fell nearly 5% to Rs 22.05 after Sumitomo Mitsui Banking Corporation (SMBC) clarified it has no immediate plans to increase its stake beyond 24.99%. SMBC executive Rajeev Kannan stated the bank is focused on contributing to Yes Bank's board as its largest shareholder and does not intend to take an executive role. SMBC currently holds 24.2% in Yes Bank. The Japanese lender received RBI approval in August to buy up to 24.99% stake from State Bank of India and other shareholders, following a May deal to purchase 20% for $1.6 billion. Under Indian regulations, acquiring 25% or more triggers a mandatory open offer for an additional 26% from public shareholders. Analysts had expected SMBC might raise its stake further. The stock saw heavy trading with over 17 crore shares changing hands, valued at Rs 386.06 crore.",
            "Sentiment": "negative",
            "PublishDate": 1760696036792,
            "Source": "stock"
        },
        {
            "Title": "Yes Bank Expected to Report Strong 41% Profit Growth in Quarterly Results",
            "Summary": "Yes Bank is set to announce quarterly earnings with analysts projecting profit after tax to rise 16-41% year-on-year, reaching Rs 640-783 crore. Net Interest Income is expected to grow modestly by 4-7% to Rs 2,295-2,350 crore. However, sequential performance may soften due to weaker treasury income and margin pressure. Net interest margins are estimated at 2.4%, stable year-on-year but down 6-8 basis points sequentially. Pre-Provision Operating Profit is projected at Rs 1,128-1,294 crore, up 15-33% year-on-year. Loan growth is expected to expand 7% year-on-year and 4% quarter-on-quarter to Rs 2.50 lakh crore, while deposits are likely to grow 7% year-on-year and 8% quarter-on-quarter to Rs 2.97 lakh crore. Credit costs are expected to remain contained at 0.5%. The growth is supported by healthy loan and deposit expansion and controlled credit costs, though treasury gains are weakening.",
            "Sentiment": "positive",
            "PublishDate": 1760681654516,
            "Source": "earnings"
        },
        {
            "Title": "SMBC Decides Not to Increase Stake in Yes Bank",
            "Summary": "Sumitomo Mitsui Banking Corporation (SMBC) has decided not to raise its stake in Yes Bank beyond its current holdings. The decision means SMBC will maintain its existing ownership level in the Indian private sector bank without further investment.",
            "Sentiment": "neutral",
            "PublishDate": 1760681559682,
            "Source": "stock"
        },
        {
            "Title": "YES Bank Shares Rally 10% in 3 Days, Hit 52-Week High Ahead of Earnings",
            "Summary": "YES Bank shares surged 10% over three trading sessions, reaching a fresh 52-week high of Rs 24.30. The rally follows SMBC's acquisition of a 24.22% stake in September 2025, purchasing 759.51 crore shares at Rs 21.5 per share from a consortium including State Bank of India, HDFC Bank, Federal Bank, Bandhan Bank, and CA Basque Investments. The stock has gained in nine of the last ten trading sessions, with last week marking its best weekly performance since May. Investor focus centers on quarterly results scheduled for October 18. In the September quarter, loans and advances rose 3.9% quarter-on-quarter to Rs 2,50,586 crore, while deposits climbed 7.9% year-on-year to Rs 2,96,831 crore. Technical indicators show the stock trading above all key moving averages, with RSI at 83.1 indicating overbought conditions. YES Bank shares have gained 16% in the past month and 23% year-to-date, recovering from a 9% decline in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1760339725961,
            "Source": "stock"
        },
        {
            "Title": "Yes Bank Shares Rise 0.42% Ahead of Quarterly Results Announcement",
            "Summary": "Yes Bank shares traded at ₹24.10 on the National Stock Exchange, gaining ₹0.10 or 0.42% from the previous close of ₹24.00. The stock opened at ₹24.20 and reached an intraday high of ₹24.29, with a day's low of ₹23.82. Trading volume was robust with 1,627.37 lakh shares traded, valued at ₹391.38 crore. The stock faced sell pressure with 3.58 crore shares in sell quantity versus 1.85 crore shares in buy quantity. Yes Bank is scheduled to announce its unaudited financial results for the second quarter and half year ended September 30, 2025, on October 18, 2025. A conference call with analysts and investors will be held at 2:30 pm IST the same day. The stock recently hit its 52-week high of ₹24.30 on October 10, 2025, with a market capitalization of ₹75,607.25 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1760338075809,
            "Source": "stock"
        },
        {
            "Title": "YES Bank Shares Surge 8% to 52-Week High Following SMBC Stake Acquisition",
            "Summary": "YES Bank shares jumped 8.4% to reach a 52-week high of Rs 24.30, extending weekly gains to 11%. The rally was driven by heavy trading volumes of 18 crore shares, significantly above the 20-day average of 3.2 crore. The surge follows Sumitomo Mitsui Banking Corporation's acquisition of a 24.22% stake in September 2025, purchasing 759.51 crore shares from lenders including SBI, HDFC Bank, Federal Bank, Bandhan Bank, and CA Basque Investments. YES Bank reported strong quarterly results with loans and advances rising 3.9% quarter-on-quarter to Rs 2,50,586 crore and total deposits increasing 7.9% year-on-year to Rs 2,96,831 crore. The stock has gained 15% in the last month and 22% year-to-date. Technical indicators show the stock trading above all key moving averages with RSI at 73.3 indicating overbought conditions.",
            "Sentiment": "positive",
            "PublishDate": 1760080032779,
            "Source": "stock"
        },
        {
            "Title": "SMBC Completes Deal with Yes Bank, Directors Join Board",
            "Summary": "SMBC has completed its deal with Yes Bank, with SMBC directors joining the bank's board. As part of the agreement, SMBC has secured rights to participate in any future capital raising activities by Yes Bank.",
            "Sentiment": "positive",
            "PublishDate": 1759900411690,
            "Source": "order&deals"
        },
        {
            "Title": "Razorpay and YES BANK Launch India's First RBI-Compliant Biometric Card Authentication System",
            "Summary": "Razorpay and YES BANK have introduced India's first biometric card authentication system that complies with Reserve Bank of India guidelines. The system uses facial recognition to verify online card payments, replacing traditional two-factor authentication methods like PINs and SMS OTPs. The Access Control Server integrates biometric verification with AI-powered risk checks and can process up to 10,000 transactions per second. The launch addresses significant payment challenges, as OTP-related issues account for approximately 35% of transaction failures and digital payment fraud resulted in losses exceeding ₹520 crore. The system aims to provide enhanced security while offering real-time fraud monitoring and faster transaction approvals.",
            "Sentiment": "positive",
            "PublishDate": 1759749475017,
            "Source": "stock"
        },
        {
            "Title": "Yes Bank Reports Growth in Loans and Deposits for September",
            "Summary": "Yes Bank's loan and advances reached 2.5 trillion, compared to 2.35 trillion in the previous year. The bank's deposits stood at 2.96 trillion versus 2.8 trillion year-over-year for September.",
            "Sentiment": "positive",
            "PublishDate": 1759709558574,
            "Source": "stock"
        },
        {
            "Title": "YES BANK Reports Growth in Loans, Deposits and CASA Ratio for Quarter Ended September 2025",
            "Summary": "YES BANK reported provisional financial metrics for the quarter ended September 30, 2025. Loans and advances grew 3.9% quarter-over-quarter to INR 250,468 crores and 6.5% year-over-year from INR 235,117 crores. Deposits increased 7.6% quarterly to INR 296,831 crores and 7.1% annually from INR 277,214 crores. CASA deposits rose 11.0% quarterly to INR 100,263 crores and 13.2% year-over-year from INR 88,601 crores, with CASA ratio improving to 33.8% from 32.8% in the previous quarter and 32.0% in the year-ago period. Credit to deposit ratio decreased to 84.4% from 87.4% in the previous quarter. Liquidity coverage ratio stood at 125.1% compared to 135.8% in the prior quarter. The figures are provisional and subject to approval by the Audit Committee, Board of Directors and statutory auditor review.",
            "Sentiment": "positive",
            "PublishDate": 1759492455943,
            "Source": "earnings"
        },
        {
            "Title": "YES Bank Seeks Shareholder Approval for Six Resolutions Including Chairman Reappointment and Executive Remuneration",
            "Summary": "YES Bank has issued a postal ballot notice seeking shareholder approval for six ordinary resolutions. The resolutions include reappointment of Rama Subramaniam Gandhi as Non-Executive Part-Time Chairman from September 20, 2025 to May 13, 2027 at ₹35 lakh annual remuneration. The bank also seeks approval for appointment of two nominee directors from Sumitomo Mitsui Banking Corporation - Shinichiro Nishino and Rajeev Veeravalli Kannan. Additionally, revised remuneration packages are proposed for MD & CEO Prashant Kumar (₹4.2 crore fixed pay for FY2025-26 and ₹4.82 crore variable pay for FY2024-25), Executive Director Rajan Pental (₹3.54 crore fixed pay and ₹3.58 crore variable pay), and Executive Director Manish Jain (₹3.67 crore fixed pay and ₹1.02 crore variable pay). The e-voting period runs from September 25 to October 24, 2025, with results to be announced by October 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758715615407,
            "Source": "corporate_action"
        },
        {
            "Title": "Yes Bank Releases Pledge on 4.22% Stake in CA Basque Investments",
            "Summary": "Yes Bank has released a pledge on its 4.22% stake in CA Basque Investments. This action frees up the pledged shares, potentially providing the bank with more financial flexibility regarding this investment holding.",
            "Sentiment": "positive",
            "PublishDate": 1758690009862,
            "Source": "corporate_action"
        },
        {
            "Title": "SMBC Becomes Yes Bank's Largest Shareholder with 24.22% Stake After Rs 8,889 Crore Acquisition",
            "Summary": "Japan's Sumitomo Mitsui Banking Corporation (SMBC) acquired an additional 4.22% stake in Yes Bank for Rs 8,888.97 crore through an off-market transaction, increasing its total holding from 20% to 24.22%. This makes SMBC the largest shareholder, overtaking State Bank of India (SBI). SMBC purchased 132.39 crore shares from CA Basque Investments, a Carlyle Group affiliate. SBI reduced its stake from 24% to approximately 10% through a partial divestment. Yes Bank plans to utilize SMBC's global network to enhance corporate banking, treasury services, and cross-border banking capabilities for Japan-India trade flows. Four domestic credit rating agencies assigned Yes Bank AA- ratings, the highest since March 2020, reflecting improved capital position, governance, and business performance. Yes Bank shares closed 0.8% higher at Rs 21.38.",
            "Sentiment": "positive",
            "PublishDate": 1758682951230,
            "Source": "stock"
        },
        {
            "Title": "YES Bank Shares Rally 10% as Sumitomo Raises Stake to 25%, Analysts Target Rs 25",
            "Summary": "YES Bank shares have surged approximately 10% over the past month following Japan's Sumitomo Mitsui Banking Corp (SMBC) increasing its stake to nearly 25%. The stock is trading above all key technical levels with analysts setting near-term targets around Rs 25. Technical indicators show the Relative Strength Index at 68.7 and MACD in bullish territory, though some analysts caution the stock is approaching overbought territory. YES Bank is leveraging SMBC's backing to explore India's $1 trillion wealth management market. The bank reported net profit of Rs 801 crore, up 60% year-over-year, with gross NPAs steady at 1.6%. CEO Prashant Kumar indicated SMBC's investment creates possibilities for a rating upgrade. The partnership is expected to support the bank's 10-12% loan growth guidance and plans to add 400 new branches over five years.",
            "Sentiment": "positive",
            "PublishDate": 1758600772423,
            "Source": "stock"
        },
        {
            "Title": "CBI Files Chargesheets Against Anil Ambani and Rana Kapoor in Yes Bank Fraud Case",
            "Summary": "The Central Bureau of Investigation filed chargesheets in two cases involving alleged fraudulent transactions between Anil Ambani-led ADA Group companies and Yes Bank. The investigation revealed that Yes Bank invested ₹2,045 crore in Reliance Commercial Finance Ltd and ₹2,965 crore in Reliance Home Finance Ltd in 2017, despite Care Ratings placing ADA Group Financial Companies 'under watch'. The CBI alleges the funds were systematically diverted through multiple layers. In exchange, Anil Ambani received credit facilities at concessional rates for loss-making family entities of Rana Kapoor. The chargesheet names Anil Ambani, Rana Kapoor, his wife Bindu Kapoor, and daughters Radha Kapoor and Roshni Kapoor for conspiring to divert funds. The CBI estimates wrongful loss to Yes Bank at ₹2,796.77 crore. The investigation also found that Reliance Nippon Mutual Fund invested ₹1,160 crore in debentures of Morgan Credits Pvt Ltd, purchased ₹249.8 crore of ADA group debentures from Yes Bank, and invested ₹1,750 crore in high-risk AT1 bonds of Yes Bank.",
            "Sentiment": "negative",
            "PublishDate": 1758208148603,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yes Bank Appoints Shinichiro Nishino As Additional Director",
            "Summary": "Yes Bank has appointed Shinichiro Nishino as an Additional Director to its board.",
            "Sentiment": "neutral",
            "PublishDate": 1758177237660,
            "Source": "corporate_governance"
        },
        {
            "Title": "SMBC Acquires Additional 4.2% Yes Bank Stake from Carlyle for Rs 2,850 Crore",
            "Summary": "Sumitomo Mitsui Banking Corporation (SMBC) will acquire an additional 4.2% stake in Yes Bank from Carlyle Group affiliate CA Basque Investments for Rs 2,850 crore. This follows SMBC's completion of a 13.18% stake purchase from State Bank of India for Rs 9,000 crore. The deal will increase SMBC's total holding in Yes Bank to 24.2%, with RBI approval already secured for stakes up to 24.99%. Two SMBC-nominated directors will join Yes Bank's board. SBI and seven other private banks originally sold a combined 20% stake to SMBC at Rs 21.50 per share, having initially subscribed at Rs 10 per share in 2020. SBI will retain a 10% stake in Yes Bank. SMBC is also in discussions to infuse Rs 16,000 crore into Yes Bank through a combination of debt and equity funding.",
            "Sentiment": "positive",
            "PublishDate": 1758154912796,
            "Source": "order&deals"
        },
        {
            "Title": "Bandhan Bank and Federal Bank Sell Yes Bank Stakes to Sumitomo Mitsui for ₹6,900 Crore",
            "Summary": "Bandhan Bank and Federal Bank sold a combined 32 crore shares in Yes Bank to Japan's Sumitomo Mitsui Banking Corporation for ₹6,900 crore. Bandhan Bank sold 15.39 crore shares at ₹21.50 per share, reducing its stake from 0.70% to 0.21%. Federal Bank offloaded 16.62 crore shares at the same price under a previously signed agreement. The transactions are part of SMBC's commitment to increase its exposure to the Indian banking sector through equity participation in Yes Bank. Both sales were completed after obtaining regulatory approvals. The deals represent an ongoing ownership reshuffle at Yes Bank, with global strategic investors replacing smaller shareholders as the bank continues stabilizing its balance sheet.",
            "Sentiment": "neutral",
            "PublishDate": 1758113208291,
            "Source": "order&deals"
        },
        {
            "Title": "Federal Bank Sells 16.62 Crore Yes Bank Shares to Sumitomo Mitsui Banking Corporation",
            "Summary": "Federal Bank has sold 16.62 crore shares of Yes Bank to Sumitomo Mitsui Banking Corporation at Rs. 21.50 per share. The transaction involves a significant stake transfer between the banking entities.",
            "Sentiment": "neutral",
            "PublishDate": 1758110260525,
            "Source": "order&deals"
        },
        {
            "Title": "SMFG Acquires 4.2% Stake in Yes Bank from Carlyle Basque for ₹28,050 Crores",
            "Summary": "SMFG is purchasing a 4.2% stake in Yes Bank from Carlyle Basque. The transaction is valued at 51 billion yen, equivalent to ₹28,050 crores. This represents a significant stake acquisition in the Indian private sector bank.",
            "Sentiment": "positive",
            "PublishDate": 1758101172577,
            "Source": "order&deals"
        }
    ]
}