{
    "Symbol": "YUKEN",
    "ISIN": "INE384C01016",
    "News": [
        {
            "Title": "Yuken India Reports Decline in Q2 Profit and Revenue",
            "Summary": "Yuken India reported consolidated net profit of 51 million rupees in Q2, down from 70 million rupees in the same period last year. The company's revenue also declined to 1.12 billion rupees compared to 1.16 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1763024628088,
            "Source": "earnings"
        },
        {
            "Title": "Yuken India Re-appoints Ms. Indra Prem Menon as Independent Director for Second Term",
            "Summary": "Yuken India Limited's Board of Directors approved the re-appointment of Ms. Indra Prem Menon as Non-Executive Independent Women Director for a second term of 5 years, effective September 25, 2025. The decision was made based on the recommendation of the Nomination and Remuneration Committee during a board meeting held on August 13, 2025. The re-appointment is subject to shareholder approval at the upcoming Annual General Meeting. Ms. Menon holds a Bachelor's degree in Liberal Arts from Mount Carmel College and a Law degree from Madras Law College. She serves as Chairperson and Managing Director of Senapathy Whiteley Pvt. Ltd., which specializes in manufacturing pressboards and press paper for electrical insulation, as well as filter paper for automotive and industrial applications.",
            "Sentiment": "neutral",
            "PublishDate": 1755073117827,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yuken India Reports Decline in Q1 Net Profit and Revenue",
            "Summary": "Yuken India reported consolidated net profit of 41 million rupees in Q1, down from 53 million rupees in the same period last year. Revenue decreased to 1 billion rupees from 1.10 billion rupees year-over-year. EBITDA fell to 125 million rupees from 132 million rupees, while EBITDA margin remained relatively stable at 11.95% compared to 11.94% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755071211237,
            "Source": "earnings"
        },
        {
            "Title": "Yuken India Allots 584,000 Equity Shares to Promoter Yuken Kogyo on Preferential Basis",
            "Summary": "Yuken India Limited has allotted 584,000 equity shares on a preferential basis to Yuken Kogyo Company Limited, one of its promoters. The allotment was disclosed on August 1, 2025, under SEBI regulations governing substantial acquisition of shares and takeovers. The disclosure was submitted to both NSE and BSE exchanges by the company's Chief Financial Officer H M Narasinga Rao.",
            "Sentiment": "neutral",
            "PublishDate": 1754041195966,
            "Source": "corporate_action"
        },
        {
            "Title": "Yuken India Appoints New Company Secretary and Allots 584,000 Equity Shares to Promoter",
            "Summary": "Yuken India Limited appointed Mr. Suhas H M as Company Secretary & Compliance Officer effective July 31, 2025. Mr. Suhas H M is an Associate Member of the Institute of Company Secretaries of India and holds a bachelor's degree in commerce. The Board also approved allotment of 584,000 equity shares on preferential basis to promoter Yuken Kogyo Company Limited at ₹1,026 per share, including a premium of ₹1,016 per share. The allotment increases the company's paid-up capital from ₹13 crore to ₹13.58 crore. Post-allotment, the promoter's shareholding increases from 56.16% to 58.04%. The company received shareholder approval on June 27, 2025, and in-principle approval from BSE and NSE on July 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753941016596,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yuken India Reports Q4 Results and Recommends Dividend",
            "Summary": "Yuken India has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit was 78.4 million rupees, compared to 79 million rupees year-over-year and 45.1 million rupees quarter-over-quarter. Q4 revenue increased to 1.25 billion rupees from 1.2 billion rupees in the previous year. EBITDA for Q4 rose to 166.3 million rupees from 152.9 million rupees year-over-year, with the EBITDA margin improving to 13.34% from 12.82%. The company has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748447742000,
            "Source": "result"
        },
        {
            "Title": "Yuken India Reports Slight Increase in Q3 EBITDA and Margin",
            "Summary": "Yuken India has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased marginally from 126 million rupees to 128 million rupees year-over-year. The EBITDA margin also saw a slight improvement, rising from 11.72% to 12.02% compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739434799000,
            "Source": "earnings"
        },
        {
            "Title": "Yuken India Reports Q3 Financial Results",
            "Summary": "Yuken India has announced its financial results for the third quarter. The company reported a consolidated net profit of 45 million rupees, down from 55 million rupees in the same period last year. However, revenue increased to 1.1 billion rupees from 1.07 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739434783000,
            "Source": "earnings"
        },
        {
            "Title": "Yuken India: Ashish Kacholia Acquires Stake, Stock Surges 14%",
            "Summary": "Ashish Kacholia's Bengal Finance and Investment acquired a stake in small-cap company Yuken India during Q3 FY25. Following this disclosure, Yuken India's stock price increased by 14% on the BSE on January 9.",
            "Sentiment": "positive",
            "PublishDate": 1736400992000,
            "Source": "block_deals"
        },
        {
            "Title": "Yuken India Reports Improved Q2 EBITDA and Margin",
            "Summary": "Yuken India has reported its Q2 financial results. The company's EBITDA increased to 76 million rupees, up from 53.5 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 7.71% from 6.18% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731495226000,
            "Source": "result"
        },
        {
            "Title": "Yuken India Reports Q2 Revenue Growth",
            "Summary": "Yuken India has reported a revenue of 985.8 million rupees for the second quarter, compared to 866 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731495202000,
            "Source": "result"
        },
        {
            "Title": "Yuken India Reports Q2 Net Profit Increase",
            "Summary": "Yuken India's second quarter net profit has risen to 30.5 million rupees, up from 22.2 million rupees year-over-year. This represents a 37.4% increase. The company also saw a sequential increase from 32.7 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731495172000,
            "Source": "result"
        }
    ]
}