{
    "Symbol": "ZAGGLE",
    "ISIN": "INE07K301024",
    "News": [
        {
            "Title": "Zaggle Wins Dual Awards at Bharat Fintech Summit 2026",
            "Summary": "Zaggle Prepaid Ocean Services Limited receives recognition as 1st Runner Up for Fintech Company of the Year and 2nd Runner Up for Best Payment Fintech at Bharat Fintech Summit 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770908302698,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Grants 1,27,623 ESOPs to Employees",
            "Summary": "Zaggle Prepaid Ocean Services grants 1,27,623 stock options under ESOP 2022 scheme to eligible employees at exercise price of ₹223 per option with 25% discount to market price.",
            "Sentiment": "positive",
            "PublishDate": 1770885289295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Signs Agreement with Rebel Foods",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a one-year domestic agreement with Rebel Foods Private Limited to provide the Zaggle Zoyer Platform services.",
            "Sentiment": "positive",
            "PublishDate": 1770871478098,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Signs 3-Year Deal with Hindware Limited",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a 3-year agreement with Hindware Limited to provide its Zaggle Propel reward platform services under a domestic contract arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1770727098261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Partners with Euronet for Prepaid Cards",
            "Summary": "Zaggle Prepaid Ocean Services announces 5-year co-branding partnership with Euronet Services India to launch prepaid card solutions for corporates, enhancing spend management platform capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1770704952404,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Signs Deal With Dr Batra's Health Clinic",
            "Summary": "Zaggle Prepaid Ocean Services enters partnership agreement with Dr Batra's Positive Health Clinic for its Zaggle Zoyer platform services with indefinite duration until terminated.",
            "Sentiment": "positive",
            "PublishDate": 1770096118467,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Signs Agreement with Hexalog Technologies",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a 3-year agreement with Hexalog Technologies Private Limited to provide mobile phone procurement and leasing services under its Employee Purchase Programme.",
            "Sentiment": "positive",
            "PublishDate": 1769669992813,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Prepaid & 3 Stocks Secure Major Orders Worth ₹9 Cr",
            "Summary": "Four companies including Zaggle Prepaid Ocean Services announced new order wins, with AXISCADES securing international contract worth over ₹9 crores and hitting upper circuit.",
            "Sentiment": "positive",
            "PublishDate": 1769163601683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle's Auditor Firm Converts to LLP Structure",
            "Summary": "Zaggle Prepaid Ocean Services announces conversion of statutory auditor M S K A & Associates into LLP format effective January 12, 2026, with no change in audit responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1769150176883,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Partners with Honda India for Employee Benefits",
            "Summary": "Zaggle Prepaid Ocean Services has secured a 2-year agreement with Honda India Power Products Limited to provide employee expense management and benefits solutions through its Zaggle Save platform.",
            "Sentiment": "positive",
            "PublishDate": 1769149354757,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Signs 3-Year Deal with HDFC Ergo General",
            "Summary": "Zaggle Prepaid Ocean Services has entered into a strategic 3-year partnership with HDFC Ergo General Insurance for its Propul reward platform, with no related party transactions involved in the agreement.",
            "Sentiment": "positive",
            "PublishDate": 1769139372020,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Signs 5-Year Fleet Program Deal with IRM Energy",
            "Summary": "Zaggle Prepaid Ocean Services Limited has executed a domestic agreement with IRM Energy Limited to provide Fleet Program services for a period of 5 years, as disclosed under Regulation 30.",
            "Sentiment": "positive",
            "PublishDate": 1769135433971,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Signs 10-Year Mobile Phone Leasing Deal",
            "Summary": "Zaggle Prepaid Ocean Services enters into a 10-year agreement with Forever New Apparels to provide mobile phone procurement and leasing services under its Employee Purchase Programme.",
            "Sentiment": "positive",
            "PublishDate": 1768913809362,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Partners with Jio Credit for Device Leasing",
            "Summary": "Zaggle Prepaid Ocean Services enters referral agreement with Jio Credit Limited to offer device leasing solutions to corporate customers under one-year partnership deal.",
            "Sentiment": "positive",
            "PublishDate": 1768393958166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Signs Amendment Deal With AGP City Gas",
            "Summary": "Zaggle Prepaid Ocean Services has entered into an amendment agreement with AGP City Gas, marking a significant business development for the IT software company.",
            "Sentiment": "positive",
            "PublishDate": 1767877083278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Signs Agreement with Cubastion Consulting",
            "Summary": "Zaggle Prepaid Ocean Services has entered into a strategic agreement with Cubastion Consulting Private Limited, marking a new business development for the fintech company.",
            "Sentiment": "positive",
            "PublishDate": 1767833813976,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Partners with Cubastion Consulting",
            "Summary": "Zaggle Prepaid Ocean Services announces strategic partnership deal with Cubastion Consulting Private Limited, marking new business collaboration for the fintech company.",
            "Sentiment": "positive",
            "PublishDate": 1767803782040,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle signs 7-year Visa pact for co-branded cards",
            "Summary": "Zaggle Prepaid Ocean Services executes growth agreement with Visa for co-branded domestic prepaid cards launch. Seven-year contract follows recent Mastercard partnership for credit card solutions.",
            "Sentiment": "positive",
            "PublishDate": 1767188440620,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Partners With Visa for Co-Branded Prepaid Cards",
            "Summary": "Zaggle Prepaid Ocean Services announces Visa will encourage launch of co-branded domestic prepaid cards on Visa network, expanding their strategic partnership beyond global payment solutions.",
            "Sentiment": "positive",
            "PublishDate": 1767178820348,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Partners with Visa for Co-branded Prepaid Cards",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a 7-year growth agreement with Visa Worldwide Pte. Ltd to launch and promote co-branded domestic prepaid cards on the Visa network.",
            "Sentiment": "positive",
            "PublishDate": 1767176275111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Approves New Subsidiary in GIFT City",
            "Summary": "Zaggle Prepaid Ocean Services board approves incorporation of wholly owned subsidiary Zaggle Payments IFSC Limited in Gujarat International Finance Tec-City with ₹15.00 lakh authorized capital.",
            "Sentiment": "positive",
            "PublishDate": 1765871619044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Partners With Bennett Coleman For Advertising",
            "Summary": "Zaggle Prepaid Ocean Services announces strategic partnership with Bennett Coleman to advertise its products, services, and brands through the media company's platforms.",
            "Sentiment": "positive",
            "PublishDate": 1765850655583,
            "Source": "stocks"
        },
        {
            "Title": "Zaggle Signs Dual Agreement with Bennett Coleman",
            "Summary": "Zaggle Prepaid Ocean Services enters warrant subscription and advertisement agreements with Bennett Coleman, including 7.05 lakh warrants worth ₹39.99 crores at ₹567 per warrant.",
            "Sentiment": "positive",
            "PublishDate": 1765818762551,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Partners with Mastercard for Credit Cards",
            "Summary": "Zaggle Prepaid Ocean Services announces five-year strategic partnership with Mastercard Asia/Pacific to offer Mastercard credit cards and related financial services to customers.",
            "Sentiment": "positive",
            "PublishDate": 1765375410220,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zaggle Partners With Mastercard Asia/Pacific for Five-Year Credit Card Services Deal",
            "Summary": "Zaggle has entered into a five-year partnership agreement with Mastercard Asia/Pacific to offer Mastercard credit cards and related services to its customer base. The strategic alliance expands Zaggle's financial service offerings through Mastercard's payment solutions platform across the Asia/Pacific region.",
            "Sentiment": "positive",
            "PublishDate": 1765334443225,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Completes 100% Acquisition of Greenedge Enterprises",
            "Summary": "Zaggle Prepaid Ocean Services Limited acquired 100% equity stake in Greenedge Enterprises Private Limited on December 5, 2025, making GEPL a wholly owned subsidiary. The acquisition was disclosed to stock exchanges NSE and BSE under regulatory compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1765275872852,
            "Source": "corporate_action"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services to Acquire Fintech Firm Rivpe Technology for Rs 97 Crores",
            "Summary": "Zaggle Prepaid Ocean Services' board approved the acquisition of 100% stake in Rivpe Technology Private Limited for up to Rs 22 crores, along with an additional investment of up to Rs 75 crores in the fintech company. The acquisition will make Rivpe a wholly owned subsidiary and expand Zaggle's offerings into UPI payments and consumer credit cards market, with completion expected within 120 days.",
            "Sentiment": "positive",
            "PublishDate": 1764840795200,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Signs Addendum with Pernod Ricard India",
            "Summary": "Zaggle Prepaid Ocean Services Limited entered into Addendum 1 to its existing agreement with Pernod Ricard India Private Limited on December 01, 2025. The addendum enhances the scope of their original September 04, 2025 agreement and incorporates additional safeguards for regulatory and operational compliance.",
            "Sentiment": "positive",
            "PublishDate": 1764669605353,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Signs Agreement with BIBA Fashion Limited",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into an agreement with BIBA Fashion Limited to provide the Zaggle Zoyer Platform services. The contract is structured as a domestic arrangement with a 36-month execution period, expanding Zaggle's platform reach in the fashion retail sector.",
            "Sentiment": "positive",
            "PublishDate": 1763648380612,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Reports Record Q2 Performance with 42% Revenue Growth, Expands Retail Credit Card Business",
            "Summary": "Zaggle Prepaid Ocean Services delivered its best-ever quarterly performance with revenue of INR 431 crores (42% Y-o-Y growth) and PAT of INR 33 crores (79% Y-o-Y growth) for Q2FY26. The company entered retail co-branded credit card partnerships with AU Bank and raised guidance to 40-45% revenue growth, targeting INR 500-600 crores revenue from this new business line over the next four to five years.",
            "Sentiment": "positive",
            "PublishDate": 1763461296985,
            "Source": "earnings"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Reports Fund Utilization Progress for IPO and QIP Proceeds",
            "Summary": "Zaggle Prepaid Ocean Services submitted monitoring agency reports showing utilization of Rs. 338.60 crores from its Rs. 392 crore IPO and Rs. 165.38 crores from its Rs. 594.84 crore QIP for the quarter ended September 30, 2025. The company deployed funds toward customer acquisition, technology development, debt repayment, and strategic investments including a Rs. 25 crore advance for acquiring stake in Greenedge Enterprises Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763136129862,
            "Source": "corporate_action"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Allots 1,97,945 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Zaggle Prepaid Ocean Services Limited's Board of Directors approved the allotment of 1,97,945 equity shares with a face value of INR 1 each to eligible employees under the Zaggle Employee Stock Option Scheme 2022. The shares were allotted upon exercise of vested options by employees. Following this allotment, the company's issued, subscribed and paid-up equity share capital increased from INR 13,42,54,022 to INR 13,44,51,967. The newly allotted shares will rank equally with existing equity shares of the company. The company has received in-principle approval from both BSE Limited and National Stock Exchange of India Limited for the employee stock option scheme. The Board meeting was held on November 11, 2025, and the share allotment date is November 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762897130194,
            "Source": "corporate_action"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Sets FY26 Targets of ₹843Cr Revenue and ₹84Cr Net Profit",
            "Summary": "Zaggle Prepaid Ocean Services has announced multi-year fintech growth targets, projecting FY26 revenue of ₹843 crores (41% year-on-year growth) and net profit of ₹84 crores (39% year-on-year growth). The company is expanding its expense management and gift card solutions for corporate clients while strengthening its SaaS platform Zoyer's integration with BFSI clients. Strategic initiatives include global expansion into Middle East markets, implementation of AI-led customer insights, development of new partnerships, and margin expansion through high-value digital solutions.",
            "Sentiment": "positive",
            "PublishDate": 1762874988203,
            "Source": "stock"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Reports 79% Jump in Quarterly Revenue to ₹4,310 Million",
            "Summary": "Zaggle Prepaid Ocean Services Limited reported revenue from operations of ₹4,309.84 million for the quarter ended September 30, 2025, representing a 79% increase from ₹2,405.57 million in the same quarter last year. Net profit rose to ₹332.42 million compared to ₹185.59 million in the previous year quarter. For the half-year period, revenue reached ₹7,624.73 million, up from ₹5,547.63 million. The company acquired 55.56% shareholding in Greenedge Enterprises Private Limited on September 30, 2025. The Board approved a proposal to issue 10,58,201 convertible warrants at ₹567 per warrant, aggregating approximately ₹600 million, which was subsequently approved by shareholders. The company allotted shares under its Employee Stock Options Scheme during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762858361407,
            "Source": "earnings"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Schedules Earnings Call for Q2 H1 FY26 Results",
            "Summary": "Zaggle Prepaid Ocean Services Limited has announced an earnings conference call scheduled for November 11, 2025, at 5:30 PM IST. The call will discuss the company's operational and financial performance for the quarter and half year ended September 30, 2025. Key participants include Dr. Raj P Narayanam (Founder Executive Chairman), Mr. Avinash Ramesh Godkhindi (Managing Director CEO), and Mr. Venkata Aditya Kumar Grandhi (CFO). The company has provided pre-registration details and dial-in numbers for interested participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762335717642,
            "Source": "earnings"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Signs 36-Month Deal with V-Mart Retail for Zoyer Platform",
            "Summary": "Zaggle Prepaid Ocean Services Ltd has entered into a 36-month agreement with V-Mart Retail Ltd for its Zaggle Zoyer platform. The company confirmed that no related party transactions are involved in this deal.",
            "Sentiment": "positive",
            "PublishDate": 1762245330035,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Shareholders Approve Convertible Warrants Issuance",
            "Summary": "Zaggle Prepaid Ocean Services Limited held an Extraordinary General Meeting on October 31, 2025, where shareholders approved a special resolution for the issuance of convertible warrants on a preferential basis. The meeting was conducted through video conferencing at 10:30 AM IST and concluded at 11:10 AM. The voting process included both remote e-voting (October 28-30, 2025) and e-voting during the meeting. The resolution was passed with requisite majority, with 2 members casting votes in favor and no votes against. The company has 1,17,505 total shareholders on record. S.S. Reddy Associates served as the scrutinizer for the voting process, and the results were made available on the company's website and KFin Technologies Limited's platform.",
            "Sentiment": "positive",
            "PublishDate": 1762172801440,
            "Source": "corporate_action"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Signs 3-Year Agreement with Hitachi Cash Management Services",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a services agreement with Hitachi Cash Management Services Private Limited. Under the agreement, Zaggle will provide its Zaggle Propel service to Hitachi Cash Management Services. The domestic services agreement has a duration of 3 years. The agreement was signed by Avinash Ramesh Godkhindi, Managing Director and Chief Executive Officer of Zaggle.",
            "Sentiment": "positive",
            "PublishDate": 1761978433013,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Holds EGM for Rs. 59.99 Crore Fundraising Through Convertible Warrants",
            "Summary": "Zaggle Prepaid Ocean Services Limited conducted an Extraordinary General Meeting on October 31, 2025, attended by 48 members through video conferencing. The meeting addressed the issuance of convertible warrants on a preferential basis to raise up to Rs. 59.99 crores. The funds will be utilized for brand building and marketing initiatives, working capital, and general corporate purposes. The EGM was chaired by Dr. Raj P Narayanam, Executive Chairman, with key directors and officials in attendance. Remote e-voting was available from October 28-30, 2025, with voting rights proportional to shareholding as of the cut-off date of October 24, 2025. The consolidated voting results will be declared within two working days and submitted to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1761911457220,
            "Source": "corporate_action"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Wins ₹9.84 Crore Contract from General Insurance Corporation",
            "Summary": "Zaggle Prepaid Ocean Services has secured a ₹9.84 crore contract from General Insurance Corporation of India for employee expense management services. The contract is scheduled to run for three years, from November 5, 2025, to November 5, 2028.",
            "Sentiment": "positive",
            "PublishDate": 1761809128587,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Partners with Birlasoft Limited",
            "Summary": "Zaggle Prepaid Ocean Services has formed a partnership with Birlasoft Limited.",
            "Sentiment": "positive",
            "PublishDate": 1761630753364,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Signs 5-Year Fleet Program Agreement with Megha City Gas Distribution",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a 5-year agreement with Megha City Gas Distribution Private Limited to provide Zaggle Fleet Program services. The domestic agreement was disclosed by Zaggle's Managing Director and CEO Avinash Ramesh Godkhindi. The company confirmed that its promoter group has no interest in the contracting entity and the agreement does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761127449118,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Amends Master Service Agreement with BOBCARD Limited for Additional Commission Structure",
            "Summary": "Zaggle Prepaid Ocean Services Limited entered into an Amendment Agreement with BOBCARD Limited on October 15, 2025, modifying their original Master Service Agreement from October 5, 2023. The amendment enables Zaggle to receive additional commissions as a percentage of spends for providing BOBCARD's Commercial Cards along with Zaggle's Spend Management platform. The agreement involves BOBCARD Limited, formerly known as BOB Financial Solutions Limited.",
            "Sentiment": "positive",
            "PublishDate": 1760614510602,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle and GlobalPay Launch Co-Branded Forex Card for Corporate Travel",
            "Summary": "Zaggle and WSFx Global Pay launched a co-branded Forex Card in India targeting international travel expenses and corporate spend management. The card combines Zaggle's enterprise expense management solutions with GlobalPay's foreign exchange expertise on a single platform for cross-border payments. Features include airport lounges, transit hotels, visa assistance, global SIM cards, and travel insurance access. Corporate users can utilize real-time expense tracking, OCR-based receipt capture, automated approvals, and reconciliation tools. Optional lifestyle privileges such as golf club access, airport spas, and valet facilities are available on pay-per-use basis. The solution integrates Zaggle's network of over 3,500 corporate clients with GlobalPay's forex infrastructure. GlobalPay is a BSE-listed RBI-authorised forex dealer, while Zaggle operates as a B2B SaaS fintech company.",
            "Sentiment": "positive",
            "PublishDate": 1760099386353,
            "Source": "stock"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Partners With SMC Global Securities Limited",
            "Summary": "Zaggle Prepaid Ocean Services has entered into a partnership with SMC Global Securities Limited. The partnership details and specific terms of the collaboration were not disclosed in the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1759739271825,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Board Approves Warrant Issue to Raise ₹59.99 Crores",
            "Summary": "Zaggle Prepaid Ocean Services board has approved the issuance of up to 10,58,201 warrants priced at ₹567 each to raise ₹59.99 crores. The company has scheduled an Extra-Ordinary General Meeting for October 31, 2025 in connection with this fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1759473291285,
            "Source": "corporate_action"
        },
        {
            "Title": "Zaggle Board Approves ₹25 Crore Acquisition of Greenedge Enterprises",
            "Summary": "Zaggle's board has approved the 100% acquisition of Greenedge Enterprises with an investment of up to ₹25 crore. The acquisition is aimed at strengthening the company's loyalty and rewards offerings.",
            "Sentiment": "positive",
            "PublishDate": 1759141748730,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Partners with IDFC First Bank for Forex Solutions",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a 3-year Referral Partnership Agreement with IDFC First Bank Limited. Under this domestic partnership, Zaggle will offer IDFC First Bank's Forex Solutions to its corporate customers. The agreement does not involve any promoter or group company interests, and it does not constitute a related party transaction. The partnership was signed by Avinash Ramesh Godkhindi, Managing Director and CEO of Zaggle.",
            "Sentiment": "positive",
            "PublishDate": 1758973851709,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Prepaid Ocean Services Partners with IDFC First Bank for SaaS Solutions",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a SaaS Partnership Agreement with IDFC First Bank Limited. Under this domestic partnership, Zaggle will offer its SaaS Solutions to IDFC First Bank's corporate customers. The agreement commenced on September 26, 2025, and will continue until terminated. The partnership does not involve any promoter group interest in the awarding entity and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758973073678,
            "Source": "order&deals"
        },
        {
            "Title": "Zaggle Partners with Mastercard for Co-Branded Prepaid Cards Launch",
            "Summary": "Zaggle Prepaid Ocean Services Limited has entered into a Customer Business Agreement with Mastercard Asia/Pacific Pte. Ltd. Under the agreement, Mastercard will incentivize Zaggle to launch and promote co-branded domestic prepaid cards on the Mastercard network. The partnership agreement is effective from September 22, 2025, and will expire on September 30, 2030. The deal involves domestic transactions with an international entity, and there are no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1758598421045,
            "Source": "order&deals"
        }
    ]
}