{
    "Symbol": "ZEELEARN",
    "ISIN": "INE565L01011",
    "News": [
        {
            "Title": "Zee Learn Q3FY26 Results: Net Profit Surges to ₹420.22 Cr",
            "Summary": "Zee Learn Limited reported strong Q3FY26 standalone results with net profit of ₹420.22 lakhs, up from ₹216.25 lakhs YoY. Revenue grew to ₹4,567.21 lakhs while consolidated operations showed mixed performance.",
            "Sentiment": "positive",
            "PublishDate": 1770730250294,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zee Learn Launches Ivy Grove Early Years Preschool",
            "Summary": "Zee Learn Limited has launched Ivy Grove Early Years, a premium preschool brand targeting early years education in the domestic market, along with its dedicated website.",
            "Sentiment": "positive",
            "PublishDate": 1769246900815,
            "Source": "stocks"
        },
        {
            "Title": "Zee Learn Appoints Shiv Kumar Gupta as Independent Director",
            "Summary": "Zee Learn Limited has appointed Mr. Shiv Kumar Gupta as Additional Director in the category of Non-Executive Independent Director effective January 22, 2026, for a three-year term subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769089574230,
            "Source": "stocks"
        },
        {
            "Title": "Zee Learn Appoints Dattatraya Kelkar as Director",
            "Summary": "Zee Learn Limited's board approved the appointment of Mr. Dattatraya Kelkar as Additional Non-Executive Non-Independent Director on December 30, 2025, following Nomination Committee recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1767093666255,
            "Source": "stocks"
        },
        {
            "Title": "Zee Learn Independent Director Completes Tenure",
            "Summary": "Zee Learn Limited announces completion of Mr. Dattatraya Kelkar's second term as Independent Director effective December 29, 2025, following regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767020976018,
            "Source": "stocks"
        },
        {
            "Title": "Zee Learn Appoints Rakesh Chaturvedi as Chief Financial Officer",
            "Summary": "Zee Learn Limited appointed Rakesh Chaturvedi as Chief Financial Officer, effective November 7, 2025. The appointment was approved by the Board of Directors following recommendations from the Nomination and Remuneration Committee and Audit Committee. Chaturvedi brings nearly 30 years of experience in finance and risk management across media and technology sectors. He previously served as Executive Vice President-Risk, Internal Audit and Financial Controls at Zee Entertainment Enterprises Limited, where he managed internal audit strategy and risk management frameworks. He also worked as Chief Financial Officer at India Web portal Private Limited and held senior positions at BT Global Communication India and Allsec Technologies. Chaturvedi holds dual master's degrees in Commerce and MBA (Finance), along with a Bachelor of Laws and a Doctorate. The company has designated him as Key Managerial Personnel authorized to determine materiality of events for stock exchange disclosures.",
            "Sentiment": "positive",
            "PublishDate": 1762477903520,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zee Learn CFO Anish Shah Resigns with Immediate Effect",
            "Summary": "Anish Shah has resigned from his position as Chief Financial Officer and Key Managerial Personnel of Zee Learn Limited with immediate effect from November 6, 2025. Shah cited his decision to pursue opportunities outside the company for professional growth and development. In his resignation letter, he confirmed there are no other material reasons for his departure beyond those stated. Shah expressed gratitude to the Board and organization for their support during his tenure and stated he will serve his full notice period to help with the transition.",
            "Sentiment": "neutral",
            "PublishDate": 1762415742089,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zee Learn Reports Mixed Quarterly Results Amid Ongoing Corporate Guarantee Obligations",
            "Summary": "Zee Learn Limited announced its quarterly results for the period ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 3,927.02 lakhs and net profit after tax of Rs 47.82 lakhs. On a consolidated basis, revenue reached Rs 7,425.28 lakhs but the company recorded a net loss of Rs 614.08 lakhs. The company continues to face significant financial challenges related to corporate guarantee obligations totaling Rs 65,339.49 lakhs owed to Assets Care Reconstruction Enterprise Limited (ACRE). The auditors issued qualified opinions on both standalone and consolidated results, citing concerns about impairment assessments of receivables worth Rs 73,487.04 lakhs from four trusts and the company's investments in subsidiary Digital Ventures Private Limited worth Rs 34,332.98 lakhs. The subsidiary DVPL remains under Corporate Insolvency Resolution Process proceedings, though an application for withdrawal has been filed. Despite these challenges, management believes the amounts will be recovered through asset monetization and has prepared the financial statements on a going concern basis.",
            "Sentiment": "negative",
            "PublishDate": 1762364639847,
            "Source": "earnings"
        },
        {
            "Title": "ZEE LEARN LIMITED Shareholders Approve Re-appointment of Statutory Auditors and New Board Appointments",
            "Summary": "ZEE LEARN LIMITED shareholders approved three key appointments at their 15th Annual General Meeting held on September 26, 2025. The company re-appointed Ford Rhodes Parks & Co LLP as statutory auditors for a second five-year term from the conclusion of the 15th AGM until the AGM for financial year 2029-30. Ford Rhodes Parks & Co LLP is a chartered accountancy firm established in 1919 with over 105 years of experience and serves over 200 companies. Shareholders also appointed M P Sanghavi & Associates LLP as secretarial auditors for their first five-year term covering financial years 2025-26 to 2029-30. The Mumbai-based firm specializes in corporate law compliance and was founded in 2004. Additionally, Parag Agarawal was appointed as an independent director for five consecutive years until August 4, 2030. Agarawal brings 22 years of experience across e-commerce, media, FMCG, healthcare and education industries, holding degrees from IIT BHU and IIM Ahmedabad.",
            "Sentiment": "neutral",
            "PublishDate": 1758982798470,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zee Learn Limited Approves Q1 FY2026 Results and Key Board Decisions",
            "Summary": "Zee Learn Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue of Rs. 7,371.49 lakhs and net profit of Rs. 1,305.87 lakhs. The company scheduled its 15th Annual General Meeting for September 26, 2025, and approved the re-appointment of Ford Rhodes Parks & Co LLP as statutory auditors for five years (2025-30). The Board also recommended re-appointment of Non-Executive Director Mr. Surender Singh and approved seeking shareholder approval for commission payments to Non-Executive Directors for five years starting FY2025-26. The auditor's report highlighted qualified conclusions regarding Rs. 71,369.66 lakhs recoverable from four trusts/entities and ongoing corporate insolvency resolution processes affecting subsidiary Digital Ventures Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755012352801,
            "Source": "earnings"
        },
        {
            "Title": "Zee Learn Receives Supreme Court Order on Withdrawal of CIRP Appeal by J.C. Flowers Asset Reconstruction",
            "Summary": "Zee Learn Limited informed stock exchanges that J.C. Flowers Asset Reconstruction Private Limited has withdrawn its appeal before the Supreme Court in a Corporate Insolvency Resolution Process (CIRP) matter against the company. The Supreme Court dismissed the appeal as withdrawn on August 5, 2025, in the case J.C. Flowers Asset Reconstruction Pvt. Ltd. vs. Surender Singh & Others (Civil Appeal No. 2821 of 2023). The court granted permission for the withdrawal after the appellant's counsel sought to withdraw the appeal. Zee Learn has made the Supreme Court order available and attached it to their exchange filing.",
            "Sentiment": "positive",
            "PublishDate": 1754637923567,
            "Source": "stock"
        },
        {
            "Title": "J.C. Flowers Withdraws Supreme Court Appeal Against Zee Learn, Ending Insolvency Proceedings",
            "Summary": "J.C. Flowers Asset Reconstruction Private Limited has withdrawn its appeal before the Supreme Court of India against the NCLAT order that had set aside the initiation of CIRP for Zee Learn Limited. This effectively concludes the insolvency proceedings against the company. The NCLAT had previously allowed an appeal by a suspended director of Zee Learn and set aside the NCLT's order for admission and initiation of Corporate Insolvency Resolution Process. Yes Bank Limited had initially challenged the NCLAT order before the Supreme Court, but later assigned the credit facilities and associated security interests to J.C. Flowers. During the hearing, J.C. Flowers informed the Supreme Court that it no longer wished to pursue the matter, leading to the dismissal of the appeal as withdrawn.",
            "Sentiment": "positive",
            "PublishDate": 1754490278932,
            "Source": "stock"
        },
        {
            "Title": "Zee Learn Appoints Parag Agarawal as Non-Executive Independent Director",
            "Summary": "Zee Learn Limited appointed Mr. Parag Agarawal as a Non-Executive Independent Director effective August 5, 2025. The appointment was approved by the Board of Directors upon recommendation from the Nomination and Remuneration Committee. Agarawal's appointment is for a five-year term and will not be subject to retirement by rotation. He brings over 22 years of experience across E-commerce, Media, FMCG, Healthcare and Education sectors. He has worked with companies including Heinz India, HT Media Group, Aakash Education Services, Indiamart Intermesh, and Shalby Limited. He holds a B.Tech from IIT BHU and PGDM from IIM Ahmedabad. Agarawal is not related to any existing director on the company's board. Shareholder approval will be sought for the appointment as per regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1754396115302,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zee Learn Files Application to Withdraw Subsidiary's Insolvency Process",
            "Summary": "Zee Learn Limited has filed an application with the National Company Law Tribunal (NCLT) Mumbai to withdraw the Corporate Insolvency Resolution Process (CIRP) for its subsidiary Digital Ventures Private Limited. The application was filed on August 2, 2025, by the Interim Resolution Professional following an earlier order from the National Company Law Appellate Tribunal (NCLAT) that granted liberty to file for withdrawal within 2 weeks. The company has committed to inform stock exchanges of any further developments in this matter.",
            "Sentiment": "positive",
            "PublishDate": 1754245033984,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLAT Permits Withdrawal of Insolvency Appeal Against Digital Venture Private Limited",
            "Summary": "The National Company Law Appellate Tribunal has allowed the withdrawal of an appeal related to the Corporate Insolvency Resolution Process against Digital Venture Private Limited, based on a settlement with financial creditor Assets Care and Reconstruction Enterprise Limited. The NCLAT granted liberty to file an application for CIRP withdrawal at NCLT Mumbai within two weeks. The tribunal has requested NCLT Mumbai to decide the withdrawal application within one month from its listing date. The stay order dated December 2, 2024 on the CIRP will remain in effect until NCLT Mumbai decides the application. The original insolvency proceedings involved a debt amount of Rs. 10,63,54,26,47.20. Digital Venture Private Limited operates schools with six units across various locations serving over 5,000 students.",
            "Sentiment": "positive",
            "PublishDate": 1753798848254,
            "Source": "stock"
        },
        {
            "Title": "Zee Learn Reports Cyber Incident, Systems Restored",
            "Summary": "Zee Learn has detected a cyber incident that affected a few of their systems. The company has already restored the impacted systems and reports that the incident did not result in a breach of confidential information.",
            "Sentiment": "neutral",
            "PublishDate": 1734611728000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Orders CIRP for Digital Ventures of Zee Learn",
            "Summary": "The National Company Law Tribunal (NCLT) Mumbai bench has issued an order for the admission of Digital Ventures, a subsidiary of Zee Learn, into Corporate Insolvency Resolution Process (CIRP). This legal action suggests financial difficulties or debt issues within the Zee Learn group.",
            "Sentiment": "negative",
            "PublishDate": 1732026971000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zee Learn Approves Agreement to Repay Outstanding Loans",
            "Summary": "Zee Learn's board has approved a supplemental facilities agreement with Assets Care & Reconstruction Enterprises. This agreement is aimed at repaying outstanding loans by certain entities and involves a corporate guarantee issued by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1731942180000,
            "Source": "corporate_action"
        }
    ]
}