{
    "Symbol": "ZENITHEXPO",
    "ISIN": "INE058B01018",
    "News": [
        {
            "Title": "Zenith Exports Reports Net Loss of Rs 196 Lakhs for Half-Year Ended September 2025",
            "Summary": "Zenith Exports Limited posted a net loss of Rs 196 lakhs for the six months ended September 30, 2025, compared to a loss of Rs 252 lakhs in the same period last year. The company's Board approved these unaudited standalone financial results at their meeting on November 14, 2025, with statutory auditors completing their limited review.",
            "Sentiment": "negative",
            "PublishDate": 1763105752279,
            "Source": "earnings"
        },
        {
            "Title": "Zenith Exports Reports Strong Q1 FY2026 Results with 10x Jump in Net Profit",
            "Summary": "Zenith Exports Limited reported significant improvement in its quarterly results for the quarter ended June 30, 2025. Total income from operations increased 8.9% to Rs. 1,892 lakhs compared to Rs. 1,738 lakhs in the same quarter last year. Net profit after tax surged dramatically to Rs. 140 lakhs from Rs. 14 lakhs in the previous year quarter. Earnings per share improved substantially to Rs. 2.59 versus Rs. 0.26 in the corresponding period. The Industrial Leather Hand Gloves/Made-ups segment remained the largest revenue contributor at Rs. 1,239 lakhs, representing 69.2% of total revenue. The company's board approved these unaudited financial results and announced its 43rd Annual General Meeting scheduled for September 24, 2025 via video conferencing. The board also appointed Mr. Vivek Mishra as scrutinizer for the AGM and Mr. Rajkumar Loyalka as a consultant to the company.",
            "Sentiment": "positive",
            "PublishDate": 1754984069611,
            "Source": "earnings"
        },
        {
            "Title": "Zenith Exports Limited's Additional Director Abhishek Bafna Resigns",
            "Summary": "Zenith Exports Limited announced that Mr. Abhishek Bafna (DIN: 10064801) has resigned from his position as Additional Director with immediate effect on July 26, 2025. In his resignation letter, Bafna cited personal reasons for his departure and confirmed there are no other material reasons for his resignation. The company has notified stock exchanges BSE and NSE about the resignation. Company Secretary Anita Kumari Gupta signed the regulatory disclosure documents.",
            "Sentiment": "neutral",
            "PublishDate": 1753520564941,
            "Source": "corporate_governance"
        }
    ]
}