{
    "Symbol": "ZENITHSTL",
    "ISIN": "INE318D01020",
    "News": [
        {
            "Title": "Zenith Steel Pipes Reports Q3 FY26 Turnaround",
            "Summary": "Zenith Steel Pipes & Industries posted profit of ₹122.39 lakhs in Q3 FY26 vs loss of ₹16.82 lakhs in Q3 FY25, marking significant operational recovery despite ongoing challenges.",
            "Sentiment": "positive",
            "PublishDate": 1770739407569,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zenith Steel Company Secretary Resigns",
            "Summary": "Zenith Steel Pipes & Industries announces resignation of Company Secretary and Compliance Officer Prakhar Agarwal effective February 06, 2026, citing pursuit of external opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1770464395173,
            "Source": "stocks"
        },
        {
            "Title": "Zenith Steel Pipes Signs Non-Binding MoU with Lloyds Realty for Land Development",
            "Summary": "Zenith Steel Pipes & Industries Limited has executed a non-binding Memorandum of Understanding with Lloyds Realty Developers Limited for the development of land owned by Zenith Steel Pipes. The agreement establishes that Zenith will collaborate with Lloyds for land development in a manner and on terms to be agreed between the parties. The companies are not related parties, and Lloyds Realty has no shareholding in Zenith Steel Pipes. The transaction does not fall under related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1760797089448,
            "Source": "order&deals"
        },
        {
            "Title": "Zenith Steel Pipes Reports Profitable Quarter with Rs. 97.94 Lakhs Net Profit",
            "Summary": "Zenith Steel Pipes & Industries Limited reported total income from operations of Rs. 2544.76 lakhs for the quarter ended June 30, 2025. The company posted net profit before tax and after tax of Rs. 97.94 lakhs each. Basic and diluted earnings per share for continuing operations stood at Rs. 0.07. The unaudited standalone and consolidated financial results were approved by the Board of Directors on August 13, 2025 and published in newspapers on August 15, 2025. The consolidated results showed similar figures to the standalone results. The results underwent limited review by statutory auditors and show the company was profitable during the quarter with improved performance compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755338689187,
            "Source": "earnings"
        },
        {
            "Title": "Zenith Steel Pipes Reports Q1 Results Amid Financial Challenges and Auditor Changes",
            "Summary": "Zenith Steel Pipes & Industries Limited approved its unaudited Q1 financial results for the quarter ended June 30, 2025. The company appointed M/s. Varun Kabra & Associates as Secretarial Auditor for five years, replacing M/s. Anil Somani & Associates, and adopted updated codes of conduct for trading and fair disclosures. The auditor's review revealed significant concerns including non-compliance with deposit regulations, unconfirmed balances requiring reconciliation, frozen bank accounts with Rs. 41.07 lakhs provision, and fully eroded net worth raising going concern doubts. The company has a Memorandum of Understanding with Tribus Real Estate for taking over secured bank loans of Rs. 16,884.92 lakhs. Banks have taken symbolic possession of the Khopoli unit properties for outstanding dues of Rs. 19,319.00 lakhs, with the matter pending before Debt Recovery Tribunal. The company wrote back provisions totaling Rs. 622.17 lakhs during the quarter, recognized as other income.",
            "Sentiment": "negative",
            "PublishDate": 1755109434185,
            "Source": "earnings"
        },
        {
            "Title": "Zenith Steel Pipes & Industries Schedules Board Meeting for August 13 to Review Quarterly Results and Auditor Changes",
            "Summary": "Zenith Steel Pipes & Industries Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider several key matters. The board will review unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The meeting will also address changes in the company's secretarial auditor position, including the appointment of M/s. Varun Kabra & Associates as the new Secretarial Auditor for five consecutive financial years starting April 1, 2025, subject to shareholder approval. The board will also consider the resignation of the current Secretarial Auditor, M/s. Anil Somani & Associates. Additionally, the company will adopt new codes of conduct for trading regulation and fair disclosure of unpublished price-sensitive information. The trading window for company securities remains closed from July 1, 2025, and will reopen 48 hours after the results are made public.",
            "Sentiment": "neutral",
            "PublishDate": 1754554678467,
            "Source": "corporate_action"
        }
    ]
}