{
    "Symbol": "ZENSARTECH",
    "ISIN": "INE520A01027",
    "News": [
        {
            "Title": "Zensar Wins $210M Framework Deal with Financial Firm",
            "Summary": "Zensar Technologies secured a 5.5-year framework deal worth $210 million with a major financial industry player, focusing on AI-led automation and digital transformation services.",
            "Sentiment": "positive",
            "PublishDate": 1770919845747,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zensar Denies Mastek Acquisition Talks",
            "Summary": "Zensar Technologies clarifies no discussions underway for Mastek acquisition despite media reports, states no material impact on company operations currently.",
            "Sentiment": "neutral",
            "PublishDate": 1770109428272,
            "Source": "stocks"
        },
        {
            "Title": "Zensar Technologies Q3 FY26 Earnings Call Transcript",
            "Summary": "Zensar Technologies has made available the transcript of its Q3 FY26 earnings call held on January 23, 2026, discussing financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769951102712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zensar Tech Faces Revenue Impact from Cisco Cutbacks",
            "Summary": "Zensar Technologies is expected to receive reduced business from Cisco Systems, one of its top 5 clients, as the US tech giant reduces its vendor base and tightens discretionary spending amid cost optimization efforts.",
            "Sentiment": "negative",
            "PublishDate": 1769570135862,
            "Source": "stocks"
        },
        {
            "Title": "Zensar faces pressure as Cisco reduces vendor base",
            "Summary": "Zensar Technologies becomes fifth Indian IT firm to face top-client pressure as Cisco rationalizes vendors, potentially impacting $40 million annual revenue stream representing 6% of total business.",
            "Sentiment": "negative",
            "PublishDate": 1769499574979,
            "Source": "stocks"
        },
        {
            "Title": "Zensar Technologies Q3FY26 Results & Interim Dividend",
            "Summary": "Zensar Technologies reported strong Q3FY26 performance with consolidated revenue of ₹14,307 million and net profit of ₹1,998 million. Board declared interim dividend of ₹2.40 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769097687719,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zensar Board Meet on Jan 22 for Q3 Results & Dividend",
            "Summary": "Zensar Technologies has scheduled a board meeting on January 22, 2026, to approve Q3FY26 unaudited financial results and consider interim dividend declaration with record date set for January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768483073528,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zensar Allots 35,480 Equity Shares Under ESOP",
            "Summary": "Zensar Technologies' board committee approved allotment of 35,480 equity shares to employees under ESOP exercise, increasing total share capital to ₹45.48 crores with 22.74 crore shares outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1766409552818,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zensar Technologies Allots 29,896 Equity Shares Under ESOP Exercise",
            "Summary": "Zensar Technologies' Nomination and Remuneration Committee approved the allotment of 29,896 fully paid equity shares of Rs. 2 each to employees against ESOP exercise. The company's issued and subscribed share capital increased to Rs. 454,745,084 divided into 227,372,542 equity shares of Rs. 2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764152822701,
            "Source": "corporate_action"
        },
        {
            "Title": "Zensar Technologies Reports 4.2% Revenue Growth in Q2 FY26 Despite TMT Sector Challenges",
            "Summary": "Zensar Technologies reported revenues of $162.8 million for Q2 FY26, marking a 4.2% year-over-year growth in reported currency and 3.4% in constant currency. The company achieved sequential quarter-on-quarter growth of 0.5% in reported currency. Banking and Financial Services grew 5.6%, Healthcare and Life Sciences increased 3.9%, while Manufacturing and Consumer Services rose 0.1%. However, Telecommunication, Media, and Technology declined 9.9%. The company maintained strong margins with gross profit improving to 31.0% and EBITDA at 15.4%, despite absorbing annual salary hikes and one-time bonuses. Zensar launched ZenseAI, its next-generation AI platform, with 28% of order bookings being AI-influenced compared to 21% in the previous quarter. The company's utilization rate reached 84.8%, up 200 basis points year-over-year, while voluntary attrition remained at 9.8%. Cash including investments stood at $293.0 million, with diluted EPS growing 16.2% to INR 7.9 per share. Management attributed TMT sector weakness to clients shifting spending from operational expenses to capital expenditure for AI and GPU investments.",
            "Sentiment": "neutral",
            "PublishDate": 1762799640415,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Zensar Technologies' Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company's consolidated revenue from operations was ₹2,350 crores for the quarter, compared to ₹2,265 crores in the previous quarter. Net profit after tax for the quarter stood at ₹244 crores versus ₹190 crores in the prior quarter. For the half year, revenue from operations reached ₹4,615 crores with net profit after tax of ₹434 crores. The company operates through two main segments: Digital and Application Services, and Cloud Infrastructure and Security. Cash and cash equivalents stood at ₹3,741 crores. The results were reviewed by statutory auditors SRBC & CO LLP, who provided clean review reports for both standalone and consolidated financials.",
            "Sentiment": "positive",
            "PublishDate": 1761925804362,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Targets Growth Through AI Platforms and Vertical Expansion",
            "Summary": "Zensar Technologies is targeting steady growth through AI-driven platforms including ZenseAI. The company is scaling its BFSI and healthcare verticals while focusing on Europe and Africa markets. Zensar aims for utilization gains and mid-teen margin sustainability as it expands its Gen AI-led digital engineering solutions.",
            "Sentiment": "positive",
            "PublishDate": 1761922507501,
            "Source": "stock"
        },
        {
            "Title": "Zensar Technologies Establishes New Subsidiary in Brazil",
            "Summary": "Zensar Technologies has formed a new company in Brazil. The IT services company is expanding its operations into the Brazilian market through this new entity establishment.",
            "Sentiment": "positive",
            "PublishDate": 1761920046141,
            "Source": "stock"
        },
        {
            "Title": "Zensar Technologies Reports $162.8M Revenue with 4.2% YoY Growth",
            "Summary": "Zensar Technologies reported quarterly revenue of $162.8 million, achieving year-over-year growth of 4.2% in reported currency and 3.4% in constant currency terms.",
            "Sentiment": "positive",
            "PublishDate": 1761919570310,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Reports Steady Q2 Performance with Marginal Revenue Growth",
            "Summary": "Zensar Technologies reported quarterly results showing net profit remained flat at 1.8 billion rupees compared to the previous quarter. Revenue increased to 14 billion rupees from 13.85 billion rupees quarter-on-quarter. EBIT rose to 1.95 billion rupees from 1.9 billion rupees, while EBIT margin improved to 13.71% from 13.54% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761918747756,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Notifies Shareholders About Unclaimed Shares and Dividends Under IEPF Campaign",
            "Summary": "Zensar Technologies Limited has notified shareholders about unclaimed shares and unpaid dividends that may be transferred to the Investor Education and Protection Fund (IEPF). The company is participating in IEPF's 100-day campaign called 'Saksham Niveshak' running from July 28, 2025 to November 6, 2025. Shareholders are requested to claim unclaimed dividends for financial years 2018-19 to 2023-24, update KYC details, and resolve concerns related to unclaimed dividends or shares. The company has provided detailed procedures for shareholders holding shares in both physical and demat form to update their KYC details including PAN, postal address, contact details, nominee details and bank mandates. KFin Technologies Limited serves as the Registrar & Share Transfer Agent. From April 01, 2024, dividend payments will only be made electronically to members whose KYC details are not updated.",
            "Sentiment": "neutral",
            "PublishDate": 1760090542259,
            "Source": "corporate_action"
        },
        {
            "Title": "Zensar Technologies Says H-1B Visa Restrictions Won't Significantly Impact Operations",
            "Summary": "Zensar Technologies announced that the recent U.S. Executive Order on H-1B visa restrictions dated September 19, 2025, and subsequent memorandum from September 20, 2025, is not expected to significantly impact their financials or operations due to their lower dependency on H-1B visas. The company stated it will continue monitoring developments and providing updates as appropriate. Zensar emphasized its ongoing focus on local hiring and nearshoring strategies, while leveraging artificial intelligence and next-generation technologies to strengthen their delivery model, enhance client value, and build a sustainable foundation for the future.",
            "Sentiment": "neutral",
            "PublishDate": 1758556021578,
            "Source": "stock"
        },
        {
            "Title": "Zensar Technologies Reports 3.3% Sequential Growth in Q1 FY26, AI Drives 30% of Pipeline",
            "Summary": "Zensar Technologies reported revenues of $162 million for Q1 FY26, marking a sequential growth of 3.3% in reported currency and 1.9% in constant currency. The company highlighted that artificial intelligence has become central to its strategy, driving 30% of its active pipeline and contributing to 20% of order bookings through AI-influenced wins. Over half of the company's talent has been upskilled in AI and GenAI technologies. The company announced salary hikes for all employees effective July 1st, unlike some industry peers. Gross profit stood at 30.5% with sequential growth of 20 basis points, while EBITDA was 15.2%, down 40 basis points quarter-on-quarter due to investments in sales and marketing. The company added an order book of $172 million, representing 11.7% year-over-year growth. Attrition improved to 9.8% from 9.9% in the previous quarter. On a sectoral basis, Telecommunication, Media & Technology grew 5.5%, BFSI grew 2.9%, Healthcare grew 5.2%, while Manufacturing & Consumer Services declined 4.1% on a constant currency basis. Management cited macro-driven variability in client budgets but expressed confidence in their diversified portfolio and AI-focused offerings.",
            "Sentiment": "positive",
            "PublishDate": 1753707039916,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Expects Modest Sequential Growth in Q2 Despite Global Market Challenges",
            "Summary": "Zensar Technologies reported revenue of Rs 1,385 crore in Q1, up 1.9% sequentially, with EBITDA at Rs 210.6 crore and profit after tax rising 3.2% to Rs 182 crore. MD and CEO Manish Tandon expressed cautious optimism for continued sequential growth in Q2 despite challenging market conditions. The company achieved 3.3% sequential growth in reported currency while maintaining EBITDA margins at 15.2%. Zensar continues to see momentum in deal wins within BFSI and healthcare segments, though Manufacturing and Consumer Services and TMT segments remain flat. The CEO noted that global trade tensions and tariff uncertainties are affecting all markets, leading companies to focus primarily on mandatory and non-discretionary spending projects. Large-scale projects have taken a backseat while consolidation deals continue. Zensar shares closed 0.58% higher at Rs 816 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753335625100,
            "Source": "stock"
        },
        {
            "Title": "Zensar Tech Executive Expresses Optimism for Year-End Performance",
            "Summary": "A Zensar Tech executive has expressed optimism about the company's year-end performance despite facing political turmoil and economic uncertainties. The executive remains hopeful about achieving positive results by the end of the year.",
            "Sentiment": "positive",
            "PublishDate": 1753196387913,
            "Source": "stock"
        },
        {
            "Title": "Zensar Technologies Approves Establishment of New Entity in Serbia",
            "Summary": "Zensar Technologies has approved the establishment of a new entity in Serbia. The IT services company has given approval for this expansion into the Serbian market.",
            "Sentiment": "positive",
            "PublishDate": 1753185768621,
            "Source": "stock"
        },
        {
            "Title": "Zensar Technologies Gets Board Approval to Establish New Entity in Serbia",
            "Summary": "Zensar Technologies Limited received board approval to establish a new entity in the Republic of Serbia, tentatively named Zensar Technologies Serbia. The entity will be set up either directly through a subsidiary or via a joint venture partnership and will operate in the software and allied services industry. The subsidiary will initially subscribe to the minimum capital required at face value. The new entity will be considered a related party as a step-down subsidiary, though promoters and promoter groups have no direct interest in it. The board meeting was held on July 22, 2025, lasting from 12:00 PM to 03:40 PM IST.",
            "Sentiment": "positive",
            "PublishDate": 1753182993043,
            "Source": "corporate_action"
        },
        {
            "Title": "Zensar Technologies Reports Quarterly Results for June 2025 Quarter",
            "Summary": "Zensar Technologies announced its unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹13,850 million compared to ₹13,589 million in the previous quarter and ₹12,881 million in the same quarter last year. Net profit after tax stood at ₹1,820 million versus ₹1,764 million in the previous quarter and ₹1,579 million in the corresponding quarter of the previous year. Consolidated earnings per share (basic) was ₹8.01 compared to ₹7.77 in the previous quarter and ₹6.96 in the same quarter last year. The company operates through two main segments: Digital and Application Services (₹10,929 million revenue) and Cloud Infrastructure and Security (₹2,921 million revenue). The Board also approved a revision to the policy for determination of materiality of events in accordance with amended SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1753180681374,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Reports Q4 Financial Results and Dividend",
            "Summary": "Zensar Technologies announced its Q4 financial results, showing a consolidated net profit of 1.76 billion rupees, up from 1.6 billion rupees in the previous quarter. The company's revenue increased to 13.6 billion rupees from 13.26 billion rupees quarter-over-quarter. Additionally, Zensar Tech has recommended a final dividend of 11 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745799413000,
            "Source": "default"
        },
        {
            "Title": "Zensar Technologies: Q4 Net Profit Up 2%, Revenue Grows 11%",
            "Summary": "Zensar Technologies reported Q4 FY25 net profit of ₹176.4 crore, up 1.8% YoY. Revenue increased 10.5% to ₹1,359 crore. EBITDA grew 4.7% to ₹212.7 crore. US market grew 0.3% QoQ, Europe 2.5% QoQ. The company achieved its highest-ever order book.",
            "Sentiment": "positive",
            "PublishDate": 1745605369000,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Reports Consistent Growth Across Geographies",
            "Summary": "Zensar Technologies has announced consistent growth across all geographical regions in constant currency terms. This positive performance indicates the company's successful expansion and strong market presence in various international markets.",
            "Sentiment": "positive",
            "PublishDate": 1745595238000,
            "Source": "default"
        },
        {
            "Title": "Zensar Technologies Reports Q4 Results and Announces Dividend",
            "Summary": "Zensar Technologies has released its Q4 financial results, showing improvements across key metrics. The company's consolidated net profit increased to 1.76 billion rupees from 1.6 billion rupees in the previous quarter. Revenue rose to 13.6 billion rupees from 13.26 billion rupees. EBIT (Earnings Before Interest and Taxes) grew to 1.9 billion rupees, with the EBIT margin slightly improving to 13.89%. Additionally, the company has recommended a final dividend of 11 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745593152000,
            "Source": "result"
        },
        {
            "Title": "Zensar Technologies to Consider Q4 Results on April 25",
            "Summary": "Zensar Technologies has announced that it will consider its fourth quarter (Q4) financial results on April 25. This announcement indicates the company's scheduled date for reviewing and potentially approving its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1744892932000,
            "Source": "default"
        },
        {
            "Title": "Zensar Technologies Selected to Transform Tesco Insurance and Money Services",
            "Summary": "Zensar Technologies has been chosen to implement a cloud-first strategy for Tesco's Insurance and Money Services. This partnership aims to transform Tesco's financial services operations, leveraging cloud technology to enhance efficiency and service delivery.",
            "Sentiment": "positive",
            "PublishDate": 1743120840000,
            "Source": "order&deals"
        },
        {
            "Title": "Zensar Technologies Selected to Transform Tesco Insurance and Money Services",
            "Summary": "Zensar Technologies has been chosen to implement a cloud-first strategy for Tesco's Insurance and Money Services division. This partnership aims to modernize and enhance Tesco's financial services offerings through cloud technology.",
            "Sentiment": "positive",
            "PublishDate": 1743075256000,
            "Source": "order&deals"
        },
        {
            "Title": "Zensar Technologies: Q3 Revenue Surges 10.1% YoY, Stock Jumps 13%",
            "Summary": "Zensar Technologies reported Q3FY25 revenue of Rs 1,325.6 crore, up 10.1% YoY. Operating revenue reached $157 million, an 8.6% YoY increase. EBITDA stood at Rs 207 crore, and EBIT at Rs 183.3 crore. PAT declined 2.7% YoY to Rs 159.8 crore. The stock price surged nearly 13% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1737609632000,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies: Q3 Profit Dips 1%, Revenue Up 10%",
            "Summary": "Zensar Technologies reported Q3 FY25 net profit of ₹159.8 crore, down 1.2% YoY. Revenue increased 10% to ₹1,325.6 crore. EBITDA margin decreased to 15.6% from 17.2% YoY. Manufacturing and Consumer Services segments showed strong growth, while Telecommunication, Media, and Technology segment faced challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1737542910000,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Reports Improved Q3 Financial Performance",
            "Summary": "Zensar Technologies has announced its Q3 financial results, showing improvements in key metrics. The company's EBIT (Earnings Before Interest and Taxes) increased to 1.83 billion rupees, up from 1.7 billion rupees in the previous quarter. Additionally, the EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) margin rose to 13.83% from 13.10% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737540044000,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Reports Q3 Revenue Growth",
            "Summary": "Zensar Technologies announced its Q3 revenue, which increased to 13.26 billion rupees from 13.08 billion rupees in the previous quarter, representing a quarter-over-quarter growth.",
            "Sentiment": "positive",
            "PublishDate": 1737540005000,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies Reports Stable Q3 Consolidated Net Profit",
            "Summary": "Zensar Technologies has reported a consolidated net profit of 1.6 billion rupees for the third quarter, which remains unchanged compared to the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1737539916000,
            "Source": "earnings"
        },
        {
            "Title": "Zensar Technologies: Board to Consider Interim Dividend for FY 2024-25",
            "Summary": "Zensar Technologies will hold a board meeting on January 22, 2025, to consider declaring an interim dividend for FY 2024-25. The board will also review Q3 FY2024-25 financial results. January 24, 2025, is set as the record date for the potential dividend. The trading window for company securities is closed from January 1, 2025, until 48 hours after the Q3 results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1736431150000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zensar Technologies: Targets Mid-Teen Margins, Builds Deal Pipeline",
            "Summary": "Zensar Technologies aims to maintain steady mid-teen profit margins and is focusing on building a strong pipeline of deals.",
            "Sentiment": "positive",
            "PublishDate": 1729662560000,
            "Source": "normal_news"
        },
        {
            "Title": "Zensar: Q2 Results Beat Expectations Despite TMT Weakness",
            "Summary": "Zensar's Q2 results exceeded expectations, showing strong performance despite challenges in the Telecom, Media, and Technology (TMT) vertical. Motilal Oswal provided a positive review of the results.",
            "Sentiment": "positive",
            "PublishDate": 1729653149000,
            "Source": "result"
        },
        {
            "Title": "Zensar Technologies Q2 Financial Results",
            "Summary": "Zensar Technologies reported its Q2 financial results. The company's EBIT (Earnings Before Interest and Taxes) remained stable at 1.7 billion rupees compared to the previous quarter. However, the EBIT margin slightly decreased from 13.31% to 13.10% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729592168000,
            "Source": "result"
        },
        {
            "Title": "Zensar Technologies Reports Q2 Revenue Growth",
            "Summary": "Zensar Technologies has reported a quarterly revenue of 13.08 billion rupees for Q2, showing an increase from 12.9 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729592158000,
            "Source": "result"
        },
        {
            "Title": "Zensar Technologies Reports Stable Q2 Profit",
            "Summary": "Zensar Technologies has announced its Q2 consolidated net profit of 1.6 billion rupees, which remains unchanged compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729592141000,
            "Source": "result"
        }
    ]
}