{
    "Symbol": "ZENTEC",
    "ISIN": "INE251B01027",
    "News": [
        {
            "Title": "Zen Technologies Transfers 2,250 Shares Under ESOP",
            "Summary": "Zen Technologies Limited transferred 2,250 equity shares to employees under its Employee Stock Option Plan-2021 at ₹100 per share with ₹99 premium, maintaining total share capital at 9,02,90,356 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770812285984,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zen Technologies Achieves ESG Score of 67 in S&P Assessment",
            "Summary": "Zen Technologies Limited secured an ESG score of 67 in S&P Global's Corporate Sustainability Assessment for FY25, with strong performance across environmental, social, and governance dimensions.",
            "Sentiment": "positive",
            "PublishDate": 1769872221258,
            "Source": "stocks"
        },
        {
            "Title": "Zen Technologies Q3FY26 Earnings Call on Feb 2",
            "Summary": "Zen Technologies Limited has scheduled an earnings conference call on February 02, 2026 at 4:00 p.m. IST to discuss Q3FY26 performance with management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769606478693,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zen Technologies Rallies 9% on ₹404 Cr Defence Orders",
            "Summary": "Zen Technologies shares surged 9.10% to ₹1,340 following announcement of ₹404 crore defence orders from Ministry of Defence for Anti-Drone Systems and Training Simulators.",
            "Sentiment": "positive",
            "PublishDate": 1768484929759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zen Technologies Transfers 3,800 Shares via ESOP",
            "Summary": "Zen Technologies Limited completed transfer of 3,800 equity shares to employees under its Employee Stock Option Plan-2021 on January 06, 2026, with no change in paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1767699884434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zen Technologies Secures Patent for 60mm Mortar Simulator",
            "Summary": "Zen Technologies receives Indian patent for 60mm Mortar Simulator, expanding portfolio to 57 Indian patents and 85 patents worldwide. This marks the 8th patent granted in 2025, enhancing global competitiveness.",
            "Sentiment": "positive",
            "PublishDate": 1766428076125,
            "Source": "stocks"
        },
        {
            "Title": "Zen Technologies Secures ₹1.2 Billion Defense Contract for India's First Combat Training Node",
            "Summary": "Zen Technologies has won a ₹1.2 billion contract from the Ministry of Defence to establish India's first Combat Training Node (CTN) at the Infantry School in Mhow, Madhya Pradesh. This significant defense contract positions the company to deliver advanced military training infrastructure for the Indian Armed Forces.",
            "Sentiment": "positive",
            "PublishDate": 1765151607458,
            "Source": "stock"
        },
        {
            "Title": "Zen Technologies Wins 1.2 Billion Rupee Contract for India's First Combat Training Node",
            "Summary": "Zen Technologies secured a 1.2 billion rupee contract to establish India's first combat training node at the Infantry School in Mhow, Madhya Pradesh. This milestone contract positions the company to deliver specialized military training infrastructure for the Indian armed forces.",
            "Sentiment": "positive",
            "PublishDate": 1764947693102,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies Secures 1.20 Billion Rupees Order",
            "Summary": "Zen Technologies has received an order worth 1.20 billion rupees. This significant contract award will impact the company's revenue and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1764893206464,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies CFO Afzal Harunbhai Malkani Resigns",
            "Summary": "Afzal Harunbhai Malkani ceased to be the Chief Financial Officer and Key Managerial Personnel of Zen Technologies Limited with effect from close of business hours on November 30, 2025. The company had previously intimated the stock exchanges about this resignation on November 02, 2025, fulfilling regulatory disclosure requirements under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764566878373,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zen Technologies Transfers 1,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Zen Technologies Limited transferred 1,000 equity shares of face value ₹1 each to eligible employees under its Employee Stock Option Plan-2021 from the company's Employee Welfare Trust upon completion of vesting periods. The transferred shares rank pari-passu with existing equity shares and do not change the company's paid-up share capital of ₹9,02,90,356.",
            "Sentiment": "neutral",
            "PublishDate": 1764260003720,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Wins ₹108 Crore Defense Contract for Tank Simulator Systems",
            "Summary": "Zen Technologies secured a ₹108 crore contract from India's Ministry of Defence to supply tank crew gunnery training simulators, marking a significant milestone over a decade after delivering their first tank simulators to the Indian Army. The order validates the company's indigenous R&D capabilities and represents the initial phase of a larger requirement under the government's simulation-based training framework, with potential for substantial future demand across all three armed services.",
            "Sentiment": "positive",
            "PublishDate": 1764075645595,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies Completes 76% Acquisition of Anawave Systems Solutions",
            "Summary": "Zen Technologies Limited has completed the acquisition of 76% equity stake in Anawave Systems Solutions Private Limited (ASSPL), making it a subsidiary of the company. The acquisition was disclosed to stock exchanges NSE and BSE in compliance with SEBI listing regulations, with detailed disclosures provided in their earlier communication dated November 05, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763747417247,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Transfers 1,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Zen Technologies Limited transferred 1,000 equity shares with face value of ₹1 each to eligible employees under its Employee Stock Option Plan-2021. The shares were transferred from Zen Technologies Limited Employees Welfare Trust upon completion of respective vesting periods. The allotted shares rank pari-passu with existing equity shares and there is no change in the company's paid-up share capital following this transfer. The total issued share capital after this transfer remains at 9,02,90,356 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762878119963,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Transfers 5,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Zen Technologies Limited transferred 5,000 equity shares with face value of ₹1 each to eligible employees under its Employee Stock Option Plan-2021. The shares were transferred from Zen Technologies Limited Employees Welfare Trust upon completion of respective vesting periods. The allotted shares rank pari-passu with existing equity shares and there is no change in the company's paid-up share capital following this transfer. The transfer was completed on November 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762815959179,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Acquires 76% Stake in Anawave Systems Solutions for Rs 7 Crores",
            "Summary": "Zen Technologies Limited's Board of Directors approved an investment of up to Rs 7 crores to acquire 76% equity stake in Anawave Systems Solutions Private Limited (ASSPL). The acquisition will be completed through share purchase and subscription agreements signed on November 5, 2025. ASSPL, incorporated in September 2016, specializes in naval simulators and designs scenario-based training systems for naval forces. The company reported a turnover of Rs 2.60 crores for FY2024-25, showing growth from Rs 0.51 crores in FY2022-23 and Rs 1.67 crores in FY2023-24. The acquisition enhances Zen Technologies' defense simulation portfolio by adding advanced tactical and combat training simulation technologies for naval forces, complementing its existing land and naval simulation capabilities. ASSPL will become a subsidiary upon completion of the transaction, which is expected by March 2026 subject to regulatory approvals and closing formalities.",
            "Sentiment": "positive",
            "PublishDate": 1762349399158,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies Secures ₹289 Crore Order for Anti-Drone System Enhancements",
            "Summary": "Zen Technologies has received a ₹289 crore order for quick anti-drone system improvements. The order focuses on enhancing the company's anti-drone technology capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1762137335895,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies CFO Afzal Malkani Resigns to Pursue Better Career Opportunities",
            "Summary": "Zen Technologies Limited announced the resignation of Chief Financial Officer Afzal Harunbhai Malkani. Malkani submitted his resignation letter on November 2, 2025, citing pursuit of better opportunity and career prospects as the reason for his departure. He will cease to be the CFO and Key Managerial Personnel of the company effective from the close of business hours on November 30, 2025. The company stated there is no other material reason for his resignation beyond the stated career advancement goals. Malkani expressed gratitude to the Managing Director and Board of Directors for the opportunity and guidance received during his tenure, and confirmed he will complete handover formalities by his last service day.",
            "Sentiment": "neutral",
            "PublishDate": 1762071685655,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zen Technologies Independent Director Dr. Ajay Kumar Singh Completes Tenure",
            "Summary": "Zen Technologies Limited announced that Dr. Ajay Kumar Singh (DIN: 08532830) ceased to be an Independent Director effective November 2, 2025, following the completion of his second consecutive term on November 1, 2025. The Board of Directors and Management acknowledged his valuable contributions and guidance during his association with the company. The company has provided the required regulatory disclosures to stock exchanges NSE and BSE regarding this directorial change.",
            "Sentiment": "neutral",
            "PublishDate": 1762051251933,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zen Tech Secures Anti-Drone System Upgrade Contracts Worth 2.89 Billion Rupees",
            "Summary": "Zen Tech has secured two contracts for upgrading anti-drone systems with a combined value of 2.89 billion rupees. The contracts involve system upgrades in the anti-drone technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1761911510327,
            "Source": "stock"
        },
        {
            "Title": "Zen Technologies Reports 48% Revenue Decline in Q2 FY2026, Maintains Strong Margins Despite Order Delays",
            "Summary": "Zen Technologies reported standalone revenue of Rs. 124.65 crores in Q2 FY2026, down from Rs. 241.69 crores in Q2 FY2025. Despite the revenue decline, the company maintained healthy margins with EBITDA at 52% and profit after tax at 37%. The company attributed delayed orders to government focus on emergency procurement post-Operation Sindoor, which affected regular procurement of training equipment and simulators. Management expects the delayed Rs. 650 crores simulator orders to materialize in H2 FY2026. The company holds a strong net cash position of Rs. 1,103 crores and remains debt-free. Zen continues to target cumulative revenue guidance of Rs. 6,000 crores by FY2028, with expected acceleration in orders during 2027-2028. The company's anti-drone systems and simulators are seeing strong pipeline demand, with management confident about long-term growth prospects despite current delays.",
            "Sentiment": "neutral",
            "PublishDate": 1761831517943,
            "Source": "earnings"
        },
        {
            "Title": "Zen Technologies Shares Drop 7% on Weak Q2 Performance Due to Procurement Delays",
            "Summary": "Zen Technologies shares fell 7% following weaker quarterly results. Revenue declined 28% year-on-year while EBITDA dropped 19.5%, primarily due to procurement delays caused by military priorities under Operation Sindoor. Adjusted profit after tax decreased 4% to ₹61 crore, though the company beat analyst estimates on revenue, EBITDA, and PAT. The order backlog stands at ₹675 crore with new orders of only ₹94 crore secured during the quarter. Domestic orders, representing 82% of total orders, fell 5% while export orders dropped 68%. Management indicated that national emergency priorities delayed RFPs but maintained strong long-term revenue visibility. The company will hold a conference call on October 27 to discuss revised guidance and order book details.",
            "Sentiment": "negative",
            "PublishDate": 1761543812900,
            "Source": "earnings"
        },
        {
            "Title": "Zen Technologies Grants 37,750 Employee Stock Options Under 2021 ESOP Scheme",
            "Summary": "Zen Technologies Limited's Nomination and Remuneration Committee granted 37,750 Employee Stock Options to eligible employees under the company's Employee Stock Option Plan 2021. The options are priced at ₹250 per option, which is above the face value of ₹1 per share but below the prevailing market price. The options will vest after one to two years from the grant date and can be exercised within two years of vesting. The ESOP scheme is administered through Zen Technologies Limited Employees Welfare Trust and complies with SEBI regulations for share-based employee benefits.",
            "Sentiment": "positive",
            "PublishDate": 1761386901047,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Reports Strong Q2 Performance with 49% Revenue Growth and Rs 484 Crore Order Book",
            "Summary": "Zen Technologies Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs 12,465.34 lakhs for Q2 2025, compared to Rs 8,345.74 lakhs in Q2 2024. Net profit for Q2 2025 reached Rs 4,616.16 lakhs versus Rs 6,224.74 lakhs in the previous year quarter. For the half year period, standalone revenue grew to Rs 23,571.13 lakhs from Rs 24,168.79 lakhs in the corresponding period last year, with net profit of Rs 8,328.05 lakhs compared to Rs 13,922.29 lakhs previously. On a consolidated basis, Q2 2025 revenue was Rs 17,357.31 lakhs against Rs 24,184.37 lakhs in Q2 2024, with net profit of Rs 6,190.47 lakhs versus Rs 6,303.57 lakhs. The company maintains a strong order book valued at Rs 484.51 crores at the standalone level and Rs 675.04 crores at the group level. During the quarter, the company transferred 12,500 equity shares to employees under its ESOP scheme. Additionally, Zen Technologies' shareholding in AI-Turing Technologies reduced from 51% to 49% due to fresh share issuance to new investors, resulting in deconsolidation and a gain of Rs 94.24 lakhs recognized as an exceptional item.",
            "Sentiment": "positive",
            "PublishDate": 1761383136052,
            "Source": "earnings"
        },
        {
            "Title": "Zen Technologies Acquires Remaining 24% Stake in Applied Research International, Making It Fully Owned Subsidiary",
            "Summary": "Zen Technologies has completed the purchase of the remaining 24% stake in Applied Research International Private Limited (ARIPL). Following this acquisition, ARIPL has become a fully owned subsidiary of Zen Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1760679322195,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies Secures ₹37 Crore Defense Contract for Anti-Drone Systems",
            "Summary": "Zen Technologies has been awarded a ₹37 crore contract by the Ministry of Defense to provide advanced anti-drone systems with kill capability. The contract involves supplying defense technology solutions to the Indian defense establishment.",
            "Sentiment": "positive",
            "PublishDate": 1760089206143,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies Receives Stock Exchange Approval for Promoter Reclassification",
            "Summary": "Zen Technologies Limited received no-objection letters from both NSE and BSE on September 26, 2025, approving the reclassification of Mr. Ravi Kumar Midathala from promoter category to public category shareholder. The company had initially received the reclassification request from Midathala on July 24, 2025, obtained board approval on July 26, 2025, and submitted the application to stock exchanges on July 30, 2025. Both exchanges granted approval under Regulation 31A of SEBI Listing Regulations, with the company required to ensure compliance with subsequent relevant disclosures related to this reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1758956247568,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies' Subsidiary Aituring Technologies Becomes Associate Company After Shareholding Dilution",
            "Summary": "Zen Technologies Limited announced that Aituring Technologies Private Limited has ceased to be its subsidiary and is now an associate company. This change occurred after ATPL conducted a private placement of equity shares, which diluted Zen's shareholding to 49% of ATPL's total paid-up capital. Zen clarified that the number of equity shares it holds in ATPL remains unchanged, but the percentage ownership was reduced due to the new share allotment. ATPL contributed a net worth of ₹183.10 lakhs, representing 0.11% of Zen's consolidated net worth as of March 31, 2025, with no income contribution reported.",
            "Sentiment": "neutral",
            "PublishDate": 1758287806555,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Wins Patent Revocation Case Against MAG5 Innovations",
            "Summary": "Zen Technologies Limited successfully secured the revocation of an Indian patent that was originally granted to individuals associated with MAG5 Innovations Private Limited in April 2023. The patent was revoked on August 6, 2025, following a post-grant opposition filed by Zen in October 2023. The revoked patent was filed under a similar category to Zen's pre-existing intellectual property in combat training simulation technology. Zen's IP team stated this decision affirms the company's pioneering work in simulation-based defence training. The company has applied for over 172 patents and operates with a dedicated R&D facility in Hyderabad, having shipped more than 1,000 training systems globally over 30 years of operations.",
            "Sentiment": "positive",
            "PublishDate": 1754591657090,
            "Source": "stock"
        },
        {
            "Title": "Zen Technologies Reports 55% Revenue Decline in Q1 FY2026 Due to Order Execution Delays",
            "Summary": "Zen Technologies reported disappointing quarterly results with standalone revenue falling 55% to Rs. 111 crores compared to Rs. 253 crores in the same period last year. The company attributed the decline to approximately Rs. 60-70 crores in deferred revenue due to design changes requested by end users, which pushed execution into Q2. Chairman Ashok Atluri noted that regular procurements slowed due to emergency procurement following Operation Sindoor. Despite the revenue decline, operational EBITDA margin remained at 34.26% and profit after tax margin improved to 33.44%. The company expects Rs. 650 crores in simulator orders by September and maintains confidence in achieving its three-year target of Rs. 6,000+ crores revenue through FY2028. Subsidiaries ARI and UTS provided strong support, with consolidated revenue declining 38% to Rs. 158 crores. The company highlighted its dominant position in anti-drone systems and expects significant order inflow in H2, particularly from emergency procurement for anti-drone systems with hard kill capabilities.",
            "Sentiment": "negative",
            "PublishDate": 1754031215760,
            "Source": "earnings"
        },
        {
            "Title": "Zen Technologies Files Promoter Reclassification Application and Submits QIP Monitoring Report",
            "Summary": "Zen Technologies Limited filed an application on July 30, 2025, to reclassify Mr. Ravi Kumar Midathala from promoter to public shareholder category following board approval. The company also submitted its QIP monitoring report for the quarter ended June 30, 2025, prepared by CRISIL Ratings Limited. The QIP raised Rs 1,000 crores with net proceeds of Rs 979.51 crores. During the quarter, the company utilized Rs 57.11 crores of proceeds, primarily for working capital requirements (Rs 37.72 crores) and inorganic growth initiatives (Rs 15.36 crores). The company acquired controlling stakes in TISA Aerospace Private Limited and Vector Technics Private Limited as part of its inorganic growth strategy. Unutilized proceeds of Rs 352.29 crores are deployed in fixed deposits with ICICI Bank and Axis Bank earning returns between 7.61% to 7.83%. The monitoring agency reported no deviations from the stated objects of the QIP issue.",
            "Sentiment": "neutral",
            "PublishDate": 1753895078301,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zen Technologies Shares Fall 9% Following Weak Q1 Results and Order Backlog Decline",
            "Summary": "Zen Technologies shares dropped nearly 9% over two days to Rs 1,603 following quarterly results that showed muted performance and slower order inflows. The company's consolidated order backlog declined to Rs 7.54 billion from Rs 11.6 billion in June 2024, raising concerns about future growth visibility. Quarterly revenue was Rs 158.22 crore with PAT of Rs 47.75 crore. Management expects Rs 6.5 billion in order inflows and remains confident about achieving Rs 800 crore order inflow guidance for the first half, with Rs 150 crore already secured. The company maintains a debt-free balance sheet and targets cumulative revenue of Rs 6,000 crore over the next three financial years. Brokerage firms have mixed ratings: Nuvama downgraded to 'HOLD' with target price of Rs 1,800, ICICI Securities downgraded to 'HOLD' with Rs 1,700 target, while Elara Capital maintains 'BUY' rating with Rs 2,225 target price.",
            "Sentiment": "negative",
            "PublishDate": 1753772116904,
            "Source": "stock"
        },
        {
            "Title": "Zen Technologies Shares Drop 5% Following Quarterly Results Decline",
            "Summary": "Zen Technologies Ltd., a defence training and anti-drone solutions provider, saw its shares fall 5% to Rs 1,690.70 following its quarterly results. The company reported a 38% decline in net profit to Rs 47.75 crore compared to Rs 76.81 crore in the same quarter of the previous fiscal. Revenue decreased 37.9% year-on-year to Rs 158.22 crore for the three months ended June. Operating income fell 42% to Rs 64.70 crore, with EBITDA margin contracting 208 basis points to 40.9%. The stock has gained 10.33% over the last 12 months but fallen 30.87% year-to-date. Among 14 analysts tracking the company, seven maintain a 'buy' rating, four recommend 'hold' and three suggest 'sell', with the average 12-month consensus price target implying an 11.8% upside.",
            "Sentiment": "negative",
            "PublishDate": 1753677607661,
            "Source": "earnings"
        },
        {
            "Title": "Zen Technologies Board Approves Promoter Ravi Kumar Midathala's Reclassification to Public Shareholder",
            "Summary": "Zen Technologies Limited's Board of Directors has approved the reclassification of Mr. Ravi Kumar Midathala from 'Promoter' category to 'Public' category shareholder, following his request. The reclassification is subject to stock exchange approvals. Mr. Midathala confirmed that he and his immediate relatives hold less than 10% voting rights, do not exercise control over company affairs, have no special rights or board positions, and are not key managerial personnel. He also confirmed no regulatory issues and provided undertakings to comply with listing regulations. The approval requires clearance from BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753546695924,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zen Technologies Reports 50% Drop in Q1 Net Profit to Rs 37.12 Crores",
            "Summary": "Zen Technologies Limited reported a net profit of Rs 37.12 crores for the first quarter ended June 30, 2025, down from Rs 74.18 crores in the same period last year. Total income declined to Rs 130.95 crores from Rs 257.00 crores year-over-year. Revenue from operations fell to Rs 111.06 crores compared to Rs 253.96 crores in Q1 FY24. On a consolidated basis, net profit attributable to shareholders was Rs 47.75 crores versus Rs 76.81 crores in the previous year. The company maintains orders worth Rs 605.97 crores at standalone level and Rs 754.56 crores at group level. During the quarter, Zen Technologies acquired 76% stake in TISA Aerospace Private Limited for Rs 6.56 crores and transferred 4,260 equity shares to employees under its stock option plan.",
            "Sentiment": "negative",
            "PublishDate": 1753535868486,
            "Source": "earnings"
        },
        {
            "Title": "Zen Technologies Promoter Seeks Reclassification to Public Shareholder After Retirement",
            "Summary": "Mr. Ravi Kumar Midathala, a promoter of Zen Technologies Limited holding 5,00,000 equity shares (0.55% of total paid-up share capital), has requested reclassification from 'Promoter' to 'Public' shareholder category. His tenure as Whole-Time Director and Key Managerial Personnel ended on June 28, 2025. In his request, he confirms that he and his immediate relatives hold less than 10% voting rights, do not exercise control over company affairs, have no special rights, and are not represented on the Board of Directors. The reclassification requires approval from the company's Board of Directors and stock exchanges NSE and BSE under applicable regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753360708506,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zen Technologies Shareholders Approve Related Party Transactions and Executive Remuneration Increase",
            "Summary": "Zen Technologies announced results of a postal ballot where shareholders approved two ordinary resolutions through remote e-voting. The first resolution approved material related party transactions with Unistring Tech Solutions Private Limited, receiving 99.87% votes in favor from 878 shareholders representing 55,106,027 shares. The second resolution approved an increase in remuneration for Mr. Arjun Dutt Atluri, Vice President, receiving 78.50% votes in favor from 710 shareholders representing 28,076,594 shares. The e-voting period ran from June 21, 2025 to July 20, 2025, with a record date of June 13, 2025. A total of 993 shareholders participated in the voting process out of 314,070 total shareholders on record date.",
            "Sentiment": "positive",
            "PublishDate": 1753194056867,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Acquires 76% Stake in Tisa Aerospace",
            "Summary": "Zen Technologies has completed the acquisition of a 76% equity stake in Tisa Aerospace Private Limited. This acquisition makes Tisa Aerospace a subsidiary of Zen Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1751415253000,
            "Source": "default"
        },
        {
            "Title": "Zen Technologies Acquires Majority Stake in Tisa Aerospace",
            "Summary": "Zen Technologies has acquired a 76% stake in Tisa Aerospace, making it a subsidiary of Zen Technologies. This acquisition represents a significant corporate action in the aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1751369450000,
            "Source": "default"
        },
        {
            "Title": "Zen Technologies: Patent Grant Boosts Defence Tech Portfolio",
            "Summary": "Zen Technologies secured its 54th Indian patent for a 'Single ILU Long Pass Filter', enhancing laser-based military training systems. This brings the company's global patent count to 82. The new technology improves combat training simulators with integrated visible and infrared laser beams, offering greater durability and reduced maintenance. Shares gained 3.5% to Rs 1,992 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751264106000,
            "Source": "normal_news"
        },
        {
            "Title": "Zen Technologies: Patent Granted for Laser-Based Military Training Systems",
            "Summary": "Zen Technologies received its 54th Indian patent for a 'Single ILU Long Pass Filter' in military training systems. This innovation enhances combat training simulators by integrating visible and infrared laser beams. The company also announced the retirement of Whole Time Director Ravi Kumar Midathala.",
            "Sentiment": "positive",
            "PublishDate": 1751173066000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Technologies Secures Patent for Laser-Based Combat Training Innovation",
            "Summary": "Zen Technologies has obtained a patent for a new laser-based combat training innovation. This development suggests advancements in the company's training technology offerings for military or law enforcement applications.",
            "Sentiment": "positive",
            "PublishDate": 1751018143000,
            "Source": "default"
        },
        {
            "Title": "Zen Technologies: Board Approves Majority Stake Acquisition in TISA Aerospace",
            "Summary": "Zen Technologies' board has approved an investment of up to Rs 6.56 crore to acquire a majority stake in TISA Aerospace, a defence technology firm specializing in loitering munitions and UAVs. The acquisition includes 54.67% of TISA's equity shares and 4,00,000 units of 6% Compulsory Convertible Debentures.",
            "Sentiment": "positive",
            "PublishDate": 1750649705000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zen Tech Acquires Majority Stake in Tisa Aerospace",
            "Summary": "Zen Tech has acquired a majority stake in Tisa Aerospace Pvt Ltd. This acquisition allows Zen Tech to enter the loitering munitions and UAV (Unmanned Aerial Vehicle) sector. The move represents a strategic expansion for Zen Tech into new aerospace and defense technologies.",
            "Sentiment": "positive",
            "PublishDate": 1750645481000,
            "Source": "default"
        },
        {
            "Title": "Zen Technologies Acquires Majority Stake in Tisa Aerospace",
            "Summary": "Zen Technologies' board has approved the acquisition of a 54.67% stake and 400,000 Compulsorily Convertible Debentures (CCDs) in Tisa Aerospace for ₹6.56 crore. This move marks Zen Technologies' entry into the Unmanned Aerial Vehicle (UAV) sector in defense. As a result of this acquisition, Tisa Aerospace will become a subsidiary of Zen Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1750497574000,
            "Source": "default"
        },
        {
            "Title": "ZEN Technologies Unveils 12.7 Rotary Machine Gun for Anti-Drone Use",
            "Summary": "ZEN Technologies has introduced a new 12.7 rotary machine gun designed specifically for anti-drone applications. The weapon features four barrels, indicating a focus on rapid-fire capabilities for targeting unmanned aerial vehicles.",
            "Sentiment": "neutral",
            "PublishDate": 1749536335000,
            "Source": "default"
        },
        {
            "Title": "Taiwan Requests India's Drone Detection Systems",
            "Summary": "Taiwan has officially submitted a request to acquire India's Drone Detect, Deter, and Destroy (D4) systems. The news indicates a potential defense technology transfer between India and Taiwan.",
            "Sentiment": "neutral",
            "PublishDate": 1749182718000,
            "Source": "default"
        },
        {
            "Title": "Zen Technologies: Anti-Drone Systems Used in Operation Sindoor, Expecting Orders",
            "Summary": "Zen Technologies' anti-drone systems were utilized in Operation Sindoor against terror camps in Pakistan and PoK. The company received positive feedback from armed forces and anticipates orders. The armed forces have initiated emergency procurement processes for various systems, including counter UAV systems, with a potential upper limit of ₹24,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747636572000,
            "Source": "order&deals"
        },
        {
            "Title": "Zen Technologies: Targets ₹6,000 Crore Cumulative Revenue by FY28",
            "Summary": "Zen Technologies aims for ₹6,000 crore cumulative revenue by FY28 with 50% compound growth over next three years. Q4 revenues up 130% to ₹325 crore. Current order book at ₹691 crore, expecting ₹800 crore in new orders in H1 FY26. Company focuses on defence training systems, anti-drone solutions, and simulators.",
            "Sentiment": "positive",
            "PublishDate": 1747633249000,
            "Source": "earnings"
        },
        {
            "Title": "Zen Technologies: Share Price Hits Upper Circuit for 7th Straight Session on Strong Q4 Results",
            "Summary": "Zen Technologies' stock hit the 5% upper circuit for the seventh consecutive trading session, surging 34% in total. The company reported Q4 revenue of Rs 325 crore, up from Rs 141 crore last year. Ebitda rose to Rs 138 crore with a 42.5% margin, and net profit jumped to Rs 101 crore from Rs 35 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747628119000,
            "Source": "earnings"
        }
    ]
}