{
    "Symbol": "ZFCVINDIA",
    "ISIN": "INE342J01019",
    "News": [
        {
            "Title": "ZF Commercial Vehicle Reports Strong Q3 Performance",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited posted robust Q3 FY26 results with consolidated revenue of ₹107,491.09 lakhs and net profit of ₹14,017.43 lakhs, marking solid growth.",
            "Sentiment": "positive",
            "PublishDate": 1770719861462,
            "Source": "co_actions_results"
        },
        {
            "Title": "ZF Commercial Vehicle Block Trade Worth ₹79.14 Cr",
            "Summary": "ZF Commercial Vehicle Control Systems India executed a significant NSE block trade worth ₹79.14 crores involving 52,587 shares at ₹15,049.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770012341411,
            "Source": "co_actions_results"
        },
        {
            "Title": "ZF Commercial Vehicle Board Meet on Feb 10, 2026",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited has scheduled its board meeting for February 10, 2026, to consider Q3 FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768912848255,
            "Source": "co_actions_results"
        },
        {
            "Title": "ZF Commercial clarifies ADAS business sale impact",
            "Summary": "ZF Commercial Vehicle Control Systems India confirms that ZF Group's ADAS business sale to Harman International affects only passenger car operations, not commercial vehicle ADAS activities.",
            "Sentiment": "neutral",
            "PublishDate": 1768373078009,
            "Source": "stocks"
        },
        {
            "Title": "ZF Commercial Clarifies ADAS Business Sale Impact",
            "Summary": "ZF Commercial Vehicle Control Systems clarifies that Harman International sale affects only passenger car ADAS division, with commercial vehicle operations remaining unchanged and customer support continuing.",
            "Sentiment": "neutral",
            "PublishDate": 1768372529464,
            "Source": "co_actions_results"
        },
        {
            "Title": "ZF Commercial Receives ₹39.84 Cr CGST Demand Order",
            "Summary": "ZF Commercial Vehicle Control Systems India receives CGST demand order of ₹39.84 crores plus interest and penalty from Ranchi authorities over alleged GST classification issues.",
            "Sentiment": "negative",
            "PublishDate": 1766145077752,
            "Source": "stocks"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Secures ADAS Business from Indian E-Mobility OEM",
            "Summary": "ZF Commercial Vehicle Control Systems India won an Advanced Driver Assistance Systems (ADAS) business nomination from an Indian electric mobility commercial vehicle manufacturer, developing 16 advanced features for various electric vehicle platforms. The company's ADAS solution has undergone extensive testing covering over 300,000 kilometers on Indian roads, demonstrating readiness for deployment in the domestic electric commercial vehicle market.",
            "Sentiment": "positive",
            "PublishDate": 1764755912763,
            "Source": "stock"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Sees Rs. 116.57 Crore Block Trade on NSE",
            "Summary": "ZF Commercial Vehicle Control Systems India Ltd. witnessed a significant block trade worth Rs. 116.57 crores on the NSE, involving approximately 90,039 shares at Rs. 12,947.00 per share. The large-scale transaction indicates substantial institutional or bulk investor activity in the commercial vehicle components company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764144815731,
            "Source": "order&deals"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited has initiated a postal ballot process to appoint Mr. Ivan Brajdic as Non-Executive Non-Independent Director, with e-voting scheduled from November 19 to December 18, 2025. The appointment requires shareholder approval as Mr. Brajdic, who has 25 years of high-tech products and R&D experience and currently serves as Senior Vice President-Research Development in ZF Group-CVS Division, was initially appointed as Additional Director effective November 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763470000557,
            "Source": "corporate_action"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports 0.8% Revenue Growth in Q2 FY26",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited reported consolidated revenue of INR 958.21 crores for the quarter ended September 30, 2025, representing a marginal 0.8% increase from INR 950.18 crores in the same quarter of the previous year. For the first half of FY26, consolidated net profit reached INR 230.65 crores, up 10.6% from INR 208.55 crores in the corresponding period of FY25. The company maintained an EBITDA margin of 22.9% and profit after tax of INR 108.3 crores for the second quarter. OE sales grew 7.4% in Q2 FY26, driven by higher ESC penetration due to updated regulations effective September 2025. The aftermarket segment registered 12.6% growth, while exports declined 16% primarily due to volume reduction in the U.S. market caused by tariff-related cost pressures. Export of services grew 12.1% driven by increased engineering activities delivered from India to global centers. The company successfully started production of 60-dia exhaust brake wall and brake signal transmitter for e-mobility applications at its Oragadam facility.",
            "Sentiment": "neutral",
            "PublishDate": 1762966911330,
            "Source": "earnings"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reconstitutes Board Committees",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited has reconstituted five board committees effective November 5, 2025. The changes include leadership transitions across the Audit Committee, Nomination Remuneration Committee, Stakeholders Relationship Committee, Corporate Social Responsibility Committee, and Risk Management Committee. Key changes include Mr. Neeraj Sagar becoming Chairman of the Nomination Remuneration Committee, Ms. Amrita Verma Chowdhury taking over as Chairperson of the Stakeholders Relationship Committee, and Ms. Rashmi Urdhwareshe becoming Chairperson of the Risk Management Committee. Dr. Orlik Lars has been added to the Audit Committee replacing Mr. Christian Brenneke. The board meeting was held on November 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762299432330,
            "Source": "corporate_governance"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Announces Board Changes with Director Resignation and New Appointment",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited announced changes to its board of directors. Dr. Christian Brenneke resigned as Non-Executive Non-Independent Director effective from the close of business hours on November 4, 2025, citing personal and professional commitments as Head of U-Division (Electronic and ADAS) at ZF Group. The Board appointed Mr. Ivan Brajdic as an Additional Director (Non-Executive Non-Independent) effective from November 5, 2025, based on the recommendation of the Nomination and Remuneration Committee. Mr. Brajdic brings over 25 years of experience in high-tech automotive products and has been Managing Director of ZF CVS Systems Global GmbH since October 2024. The company confirmed that Mr. Brajdic is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1762259967461,
            "Source": "corporate_governance"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports Decline in Q2 Financial Performance",
            "Summary": "ZF Commercial Vehicle Control Systems India reported quarterly results showing a decline across key financial metrics. Net profit decreased to 1.06 billion rupees from 1.09 billion rupees year-over-year. Revenue fell to 9.02 billion rupees compared to 9.06 billion rupees in the same period last year. EBITDA dropped to 1.32 billion rupees from 1.39 billion rupees year-over-year. The company's EBITDA margin compressed to 14.65% from 15.38% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762253006550,
            "Source": "earnings"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Senior Executive Resigns",
            "Summary": "K. Venugopal has resigned from his position as Strategy and Market Intelligence Leader at ZF Commercial Vehicle Control Systems India Limited. His resignation, submitted on October 13, 2025, cites personal reasons related to his parents' health. The company has accepted his resignation and he will be relieved from duties at the close of business hours on October 31, 2025. Venugopal had been with the organization for 12 years and 5 months, joining in May 2013 when it was known as WABCO India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761917673247,
            "Source": "corporate_governance"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India CFO Meets with Motilal Oswal and Nippon India Mutual Funds",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited's CFO Ms. Sweta Agarwal conducted one-on-one investor meetings with Motilal Oswal Mutual Fund and Nippon India Mutual Fund on August 25, 2025. The discussions focused on providing an operational overview of the company. The company confirmed that no unpublished price sensitive information was shared during these meetings. ZF Commercial Vehicle Control Systems India Limited is a commercial vehicle solutions company, part of the global ZF Group and headquartered in Chennai, India.",
            "Sentiment": "neutral",
            "PublishDate": 1756129979375,
            "Source": "stock"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports Mixed Q1 Results with Higher Profit but Lower EBITDA",
            "Summary": "ZF Commercial Vehicle Control Systems India reported Q1 net profit of 1.2 billion rupees compared to 992 million rupees in the previous year. Revenue increased to 9.6 billion rupees from 9.38 billion rupees year-over-year. However, EBITDA declined to 1.28 billion rupees from 1.38 billion rupees, with EBITDA margin falling to 13.28% from 14.73% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1755005855705,
            "Source": "earnings"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Faces INR 21.06 Crore Customs Demand Over Import Classification",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited received an order from the Principal Commissioner of Customs (Air Cargo), Chennai imposing a demand of INR 21,06,40,522 plus applicable interest and penalty of equal amount. The demand relates to alleged incorrect classification of imported parts and components of Anti-lock braking system and Air braking System. The order was dated July 31, 2025 and received the same day via email. The company believes its classification was correct and plans to dispute the demand. ZF Commercial Vehicle Control Systems stated the order has no material impact on its financials, operations, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1754030099469,
            "Source": "stock"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Appoints K Inbarajan as Head - Legal",
            "Summary": "ZF Commercial Vehicle Control Systems India Limited has appointed K Inbarajan as Head - Legal in the capacity of Senior Management Personnel, effective July 30, 2025. Inbarajan brings over 20 years of experience in legal drafting, contracts, arbitration, litigation, M&A, compliance, and corporate advisory. He serves as General Manager – Legal at KONE Elevator India Pvt. Ltd., where he leads legal compliance, contract management, and dispute resolution. His previous experience includes senior legal roles at SIVA Industries, VGN Developers, and SAAG RR Infra. He holds an LLM in Contracts, a BL in Law, an MBA in HRD, and a B.Sc. in Computer Science. The appointment is on a full-time employment basis.",
            "Sentiment": "positive",
            "PublishDate": 1753944527663,
            "Source": "corporate_governance"
        },
        {
            "Title": "ZF Commercial Vehicle Control System India: Promoters Likely Sell 3.17% Stake in Block Deals",
            "Summary": "Block deals worth ₹792 crore took place for ZF Commercial Vehicle Control System India Ltd. 6 lakh shares (3.17% equity) changed hands at an average price of ₹13,191 per share. Promoters were likely sellers, intending to offload a 3.13% stake at ₹12,000 per share, a 10% discount to the previous closing price.",
            "Sentiment": "neutral",
            "PublishDate": 1749180397000,
            "Source": "block_deals"
        },
        {
            "Title": "WABCO to Sell 3.13% Stake in ZF Commercial",
            "Summary": "WABCO, a promoter of ZF Commercial, plans to sell a 3.13% stake in the company through a block transaction. The minimum price for the sale is set at ₹12,000 per share, with the total transaction value estimated at ₹720 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749128242000,
            "Source": "default"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports Q4 Results and Dividend",
            "Summary": "ZF Commercial Vehicle Control Systems India (formerly WABCO India) has announced its Q4 results and dividend. The company's Q4 EBITDA increased to 1.72 billion rupees from 1.47 billion rupees year-over-year. The EBITDA margin improved to 17.20% from 15.4% in the same period. Additionally, the company has recommended a dividend of 19 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747312566000,
            "Source": "result"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports Q4 Financial Results",
            "Summary": "ZF Commercial Vehicle Control Systems India (formerly WABCO India) has reported its Q4 financial results. The company's net profit increased to 1.25 billion rupees, up from 1.01 billion rupees year-over-year. Revenue for Q4 rose to 10 billion rupees from 9.56 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747312437000,
            "Source": "result"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports Strong Q3 EBITDA Growth",
            "Summary": "ZF Commercial Vehicle Control Systems India has reported a significant increase in its Q3 EBITDA, rising to 1.75 billion rupees from 1.31 billion rupees year-over-year. The company's EBITDA margin also improved, reaching 18.35% compared to 14.78% in the same period last year. This performance indicates substantial growth in profitability and operational efficiency for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738848249000,
            "Source": "earnings"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports Q3 Financial Results",
            "Summary": "ZF Commercial Vehicle Control Systems India has announced its financial results for the third quarter. The company reported a net profit of 1.25 billion rupees, up from 996 million rupees in the same period last year. Revenue for Q3 increased to 9.56 billion rupees from 8.87 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738848244000,
            "Source": "earnings"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India: WABCO Asia Divests 4.3% Stake",
            "Summary": "WABCO Asia Pvt., promoter of ZF Commercial Vehicle Control Systems India Ltd., sold 820,000 shares (4.3% stake) to institutional investors. ZF Group maintains majority control and views this as a strategic move to increase liquidity for growth plans in India.",
            "Sentiment": "neutral",
            "PublishDate": 1732715045000,
            "Source": "corporate_action"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India: Promoter to Sell 3.5% Stake",
            "Summary": "WABCO Asia, promoter of ZF Commercial Vehicle Control Systems India, plans to sell 3.5% equity in a block deal worth up to $98 million. The floor price is set at ₹12,400 per share, a 14% discount to the previous closing price. Citigroup Global Markets is the sole book runner for the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1732677498000,
            "Source": "block_deals"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems India Reports Q2 Financial Results",
            "Summary": "ZF Commercial Vehicle Control Systems India has released its Q2 financial results. The company's EBITDA for Q2 is 1.4 billion rupees, slightly down from 1.43 billion rupees in the same quarter last year. However, the EBITDA margin has improved to 15.38% from 14.68% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731059507000,
            "Source": "result"
        },
        {
            "Title": "ZF Commercial Vehicle Control Systems Reports Q2 Financial Results",
            "Summary": "ZF Commercial Vehicle Control Systems has announced its Q2 financial results. The company reported a net profit of 1.09 billion rupees, slightly up from 1.04 billion rupees in the same quarter last year. However, revenue decreased to 9.07 billion rupees from 9.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731059488000,
            "Source": "result"
        }
    ]
}