{
    "Symbol": "ZIMLAB",
    "ISIN": "INE518E01015",
    "News": [
        {
            "Title": "ZIM Laboratories Receives GST Demand of Rs. 2.19 Cr",
            "Summary": "ZIM Laboratories disclosed receipt of GST demand notice worth Rs. 2,19,64,841 from Maharashtra tax authorities for FY 2021-22, alleging excess input tax credit availed. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1770820921118,
            "Source": "stocks"
        },
        {
            "Title": "ZIM Laboratories Q3FY26 Revenue Jumps 12.8% to ₹1,087 Mn",
            "Summary": "ZIM Laboratories reported strong Q3FY26 performance with total operating income rising 12.8% YoY to ₹1,087 Mn. EBITDA grew 9.1% to ₹145 Mn while PAT increased 9.9% to ₹44 Mn, marking recovery from previous quarter losses.",
            "Sentiment": "positive",
            "PublishDate": 1770820751364,
            "Source": "co_actions_results"
        },
        {
            "Title": "ZIM Labs Appoints New President, Elevates Two VPs",
            "Summary": "ZIM Laboratories appointed Vikrant Bendre as President-International Business and categorized two Vice Presidents as Senior Management Personnel effective February 2, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770047087293,
            "Source": "stocks"
        },
        {
            "Title": "ZIM Labs Publishes EGM Notice for February 16, 2026",
            "Summary": "ZIM Laboratories Limited has published newspaper advertisements announcing its Extraordinary General Meeting scheduled for February 16, 2026, to be conducted through video conferencing as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769077207779,
            "Source": "mutualfunds"
        },
        {
            "Title": "Zim Labs Board Approves Share Issue Plan",
            "Summary": "Zim Laboratories' board approves issuance of up to 47,64,497 shares at ₹73.46 each to Florintree Trinex LLP, with shareholder meeting scheduled for February 16, 2026 to seek approval for the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1768974897887,
            "Source": "co_actions_results"
        },
        {
            "Title": "ZIM Laboratories Receives CDSCO Approval for Naproxen Esomeprazole Capsules",
            "Summary": "ZIM Laboratories Limited received permission from India's Central Drugs Standard Control Organization (CDSCO) to manufacture and market a Fixed Dose Combination of Naproxen Delayed Release and Esomeprazole capsules (375mg/500mg 20mg/20mg). The company has signed a commercial supply agreement with an Indian pharmaceutical company for this product and plans commercial launch in FY 2026-27, strengthening its presence in pain management and gastro-protective therapeutic areas.",
            "Sentiment": "positive",
            "PublishDate": 1764750530053,
            "Source": "stock"
        },
        {
            "Title": "ZIM Laboratories Reports Sequential Recovery in Q2 FY26 Despite EU-GMP Challenges",
            "Summary": "ZIM Laboratories posted INR 887 million operating income in Q2 FY26, up 23.6% sequentially, with EBITDA improving to 8.8% from 7.9% in Q1, while continuing EU-GMP remediation efforts targeting March 2026 audit completion. The company expects FY26 revenues to match FY25 levels and has initiated site transfers for key products including Tamsulosin Dutasteride to maintain business continuity during regulatory clearance delays.",
            "Sentiment": "neutral",
            "PublishDate": 1763386947809,
            "Source": "earnings"
        },
        {
            "Title": "ZIM Laboratories Reports Loss of Rs 187.49 Lakhs in Q2 FY2026",
            "Summary": "ZIM Laboratories Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a standalone net loss of Rs 187.49 lakhs for Q2, compared to a profit of Rs 145.16 lakhs in the same quarter last year. For the half year, the standalone loss was Rs 229.95 lakhs versus a profit of Rs 293.58 lakhs in the previous year. Total standalone income for Q2 was Rs 9,075.43 lakhs compared to Rs 9,346.44 lakhs in Q2 FY2025. The consolidated results showed similar trends with Q2 net loss of Rs 187.49 lakhs and half-year loss of Rs 229.95 lakhs. The company entered into an agreement to sell unused MIDC leasehold land along with building and certain assets, expected to complete before March 31, 2026. Additionally, the company purchased MIDC leasehold land adjacent to its existing plant after the quarter end. The results were reviewed by Deloitte Haskins Sells LLP and approved by the Board of Directors on November 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762975792942,
            "Source": "earnings"
        },
        {
            "Title": "ZIM Laboratories Seeks Shareholder Approval for Re-appointment of Two Whole-time Directors via Postal Ballot",
            "Summary": "ZIM Laboratories Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mr. Niraj Dhadiwal and Mr. Prakash Sapkal as Whole-time Directors for a two-year term from October 1, 2025, to September 30, 2027. The e-voting period runs from October 15 to November 13, 2025. Both directors will receive remuneration packages including fixed salary up to Rs. 1.50 crores and performance-linked incentives up to Rs. 50 lakhs, along with perquisites such as medical insurance, car with driver, and telephone facilities. The company has appointed Ms. Roshni Jethani as scrutinizer for the postal ballot process, with results to be announced by November 15, 2025. Both directors have over 30 years of experience in the pharmaceutical sector, with Dhadiwal focusing on business development and Sapkal on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1760357048522,
            "Source": "corporate_action"
        },
        {
            "Title": "ZIM Laboratories Board Approves Re-appointment of Two Whole-Time Directors",
            "Summary": "ZIM Laboratories Limited's Board of Directors approved the re-appointment of Mr. Niraj Dhadiwal and Mr. Prakash Sapkal as Whole-Time Directors for a two-year term starting October 1, 2025. The decision was made during a board meeting held on September 19, 2025, following recommendations from the Nomination and Remuneration Committee. Both appointments are subject to shareholder approval. Mr. Dhadiwal, a pharmacy graduate with business management diploma, has been with the company for nearly three decades and serves as Director – Business Development, overseeing business development and marketing functions. Mr. Sapkal, a pharmacy graduate with MBA, has been associated with the company for 26 years and has handled key operations in various capacities including Production Manager and Vice President – Operations. Both directors are confirmed to not be debarred from holding directorial positions and are not related to any other directors on the board.",
            "Sentiment": "positive",
            "PublishDate": 1758295672219,
            "Source": "corporate_governance"
        },
        {
            "Title": "ZIM Laboratories Approves Closure of UAE Subsidiary, Reports 12.3% Revenue Decline in Q1 FY26",
            "Summary": "ZIM Laboratories Limited's Board approved the closure of its step-down subsidiary ZIM Laboratories Middle East DMCC, subject to UAE regulatory approvals. The subsidiary contributed nil revenue and net worth during the last financial year. The company reported Q1 FY26 total operating income of ₹718 million, down 12.3% from ₹818 million in Q1 FY25, primarily due to supply difficulties with legacy clients caused by geo-political issues in Middle East and Bangladesh markets. EBITDA declined 36.7% to ₹57 million with margins falling to 7.9% from 11%. The company posted a net loss of ₹19 million compared to ₹9 million profit in Q1 FY25. Export revenue decreased 15.2% to ₹602 million while India business grew 30.2% to ₹100 million. ZIM received 2 marketing authorizations in Australia and invested ₹79 million in R&D, representing 11% of total operating income. The company earned ₹45 million in dossier licensing milestone payments during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754579838885,
            "Source": "corporate_action"
        },
        {
            "Title": "ZIM Laboratories Board Approves AED 450,000 Investment in Step-Down Subsidiary",
            "Summary": "ZIM Laboratories Limited's Board of Directors approved an investment of up to AED 450,000 in the share capital of ZIM Scientific Office L.L.C., a step-down subsidiary. The investment will be made through ZIM Laboratories Limited FZE, the company's wholly-owned subsidiary. ZIM Scientific Office L.L.C. was incorporated in Dubai, UAE in November 2024 and operates in the pharmaceutical industry with zero turnover since incorporation. The investment aims to expand and develop business in the GCC region. Following the investment, ZIM Laboratories FZE will maintain 100% shareholding in ZIM Scientific Office L.L.C. The transaction is classified as a related party transaction conducted at arm's length, with promoter Zulfiquar Kamal appointed as Director on the Board of ZIM Scientific Office L.L.C. The acquisition is expected to be completed within 2-3 months from the date of fund transfer.",
            "Sentiment": "positive",
            "PublishDate": 1754579044677,
            "Source": "corporate_action"
        },
        {
            "Title": "ZIM Laboratories Reports Loss in Q1 FY26, Appoints New Internal Auditor and Restructures Subsidiaries",
            "Summary": "ZIM Laboratories Limited reported a consolidated net loss of Rs 187.49 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 89.83 lakhs in the same quarter last year. Revenue from operations declined to Rs 7,175.61 lakhs from Rs 8,182.44 lakhs year-on-year. On a standalone basis, the company posted a net loss of Rs 169.19 lakhs versus a profit of Rs 75.90 lakhs in the previous year. The Board appointed Protiviti India Member Private Limited as internal auditors for FY 2025-26. The company approved an investment of up to AED 4,50,000 in ZIM Scientific Office L.L.C., a step-down subsidiary, through its wholly-owned subsidiary ZIM Laboratories FZE for business expansion in the GCC region. Additionally, the Board approved the closure of ZIM Laboratories Middle East DMCC, another step-down subsidiary. Earnings per share turned negative at Rs (0.38) compared to Rs 0.18 in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754576421421,
            "Source": "earnings"
        },
        {
            "Title": "Zim Laboratories Receives Approval to Market Tamsulosin + Dutasteride Capsules in Australia",
            "Summary": "Zim Laboratories has obtained regulatory approval to sell Tamsulosin + Dutasteride capsules in the Australian market. This approval allows the company to commercialize this pharmaceutical combination product in Australia.",
            "Sentiment": "positive",
            "PublishDate": 1754295768339,
            "Source": "stock"
        },
        {
            "Title": "ZIM Lab Facility Fails EU-GMP Inspection with Multiple Compliance Issues",
            "Summary": "ZIM Lab's facility failed to meet EU-GMP (Good Manufacturing Practice) standards during an inspection. The inspection identified 28 total issues: 2 critical deficiencies, 8 major problems, and 18 minor violations. The company has been given 4 weeks to submit an improvement plan to address these compliance failures. A re-inspection will be conducted after the improvement plan is implemented.",
            "Sentiment": "negative",
            "PublishDate": 1754049604866,
            "Source": "stock"
        },
        {
            "Title": "Zim Laboratories Receives First Australian Approval for Rizatriptan Benzoate Oral Films",
            "Summary": "Zim Laboratories has obtained its first regulatory approval in Australia for Rizatriptan Benzoate Oral Films through its subsidiary Zimtas. This marks the company's initial product approval in the Australian pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1753086689035,
            "Source": "stock"
        },
        {
            "Title": "Zim Laboratories Completes Rs 2.70 Crore Investment in Latvian Subsidiary",
            "Summary": "Zim Laboratories has finalized an investment of Rs 2.70 crore in its Latvian subsidiary, SIA ZIM. The news indicates a strategic financial move by the company to strengthen its presence in Latvia.",
            "Sentiment": "positive",
            "PublishDate": 1750308389000,
            "Source": "default"
        },
        {
            "Title": "ZIM Laboratories Reports Q4 Financial Results",
            "Summary": "ZIM Laboratories has released its Q4 financial results. The company's EBITDA for Q4 was 146 million rupees, compared to 156.5 million rupees in the same quarter last year. The EBITDA margin improved slightly to 13.42% from 13.28% year-over-year. Revenue for Q4 decreased to 1.09 billion rupees from 1.18 billion rupees in the previous year. The consolidated net profit for Q4 was 48.8 million rupees, down from 80.9 million rupees year-over-year and 40 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747757905000,
            "Source": "result"
        },
        {
            "Title": "ZIM Laboratories and Globalpharma Announce Strategic Collaboration for Oral Thin Film Products",
            "Summary": "ZIM Laboratories and Globalpharma Co. (L.L.C.) have entered into a strategic collaboration to commercialize oral thin film products in the Gulf Cooperation Council (GCC) region. This partnership aims to introduce innovative pharmaceutical delivery systems to the GCC market.",
            "Sentiment": "positive",
            "PublishDate": 1744190840000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zim Laboratories Receives Marketing Authorization for Dimethyl Fumarate Capsules in Portugal",
            "Summary": "Zim Laboratories has obtained Marketing Authorization (MA) for Dimethyl Fumarate (120 mg & 240 mg) Modified Release Capsules in Portugal, Europe. This authorization is expected to facilitate faster approvals in other European Union countries and the UK. According to IQVIA data, the EU market size for this product in 2023 was approximately USD 800 million, while the UK contributed USD 200 million. Other markets (excluding USA & Japan) contributed USD 42 million.",
            "Sentiment": "positive",
            "PublishDate": 1742429009000,
            "Source": "corporate_action"
        },
        {
            "Title": "ZIM Laboratories Receives Marketing Authorization for Dimethyl Fumarate in Portugal",
            "Summary": "ZIM Laboratories has obtained Marketing Authorization (MA) for Dimethyl Fumarate (120 mg & 240 mg) Modified Release Capsules in Portugal, Europe. This authorization is expected to expedite approvals in other European Union countries and the UK. According to IQVIA data, the EU market size for this product in 2023 was approximately USD 800 million, with the UK contributing an additional USD 200 million. Other markets (excluding USA & Japan) contributed USD 42 million.",
            "Sentiment": "positive",
            "PublishDate": 1742395387000,
            "Source": "corporate_action"
        },
        {
            "Title": "ZIM Laboratories Reports Steady Q3 EBITDA Growth",
            "Summary": "ZIM Laboratories has reported a slight increase in its Q3 EBITDA, rising to 116 million rupees from 115 million rupees year-over-year. The company's EBITDA margin also saw a minor improvement, increasing to 12% from 11.96% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739197862000,
            "Source": "earnings"
        },
        {
            "Title": "ZIM Laboratories Reports Q3 FY2024 Financial Results",
            "Summary": "ZIM Laboratories has reported its financial results for the third quarter. The company's consolidated net profit decreased to 40 million rupees from 48 million rupees in the same quarter last year. However, revenue remained stable at 963 million rupees, showing no year-over-year change.",
            "Sentiment": "neutral",
            "PublishDate": 1739197858000,
            "Source": "earnings"
        },
        {
            "Title": "Zim Laboratories and Neuraxpharm Secure Marketing Authorization for Buprenorphine Sublingual Film in Europe",
            "Summary": "Zim Laboratories and Neuraxpharm have been granted marketing authorization for their 'Buprenorphine Sublingual Film' in Europe. This development is significant in the context of the growing European market for buprenorphine-based opioid dependency treatments, which exceeded $355 million in 2023 according to IQVIA. The global market size for buprenorphine reached $1.3 billion in the same year, indicating substantial potential for the newly authorized product.",
            "Sentiment": "positive",
            "PublishDate": 1736727672000,
            "Source": "corporate_action"
        },
        {
            "Title": "ZIM Laboratories and Neuraxpharm Receive Marketing Authorization for Buprenorphine Sublingual Film in Europe",
            "Summary": "ZIM Laboratories and Neuraxpharm have been granted marketing authorization for their 'Buprenorphine Sublingual Film' in Europe. This approval allows the companies to market and distribute the product in European countries, potentially expanding their presence in the pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1736515215000,
            "Source": "corporate_action"
        },
        {
            "Title": "ZIM Laboratories Establishes Subsidiary in Dubai",
            "Summary": "ZIM Laboratories has incorporated a step-down subsidiary named 'ZIM Scientific Office L.L.C' in Dubai, United Arab Emirates. This move suggests an expansion of the company's operations into the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1731758876000,
            "Source": "corporate_action"
        }
    ]
}