{
    "Symbol": "ZODIAC",
    "ISIN": "INE761Y01019",
    "News": [
        {
            "Title": "Zodiac Energy Q3FY26 Results & Strategic Moves",
            "Summary": "Zodiac Energy reported Q3FY26 results with revenue of ₹13,755.90 lakhs and profit after tax of ₹507.49 lakhs. Board approved investment in Zenwatt Clean Energy and office relocation.",
            "Sentiment": "positive",
            "PublishDate": 1770621037685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zodiac Energy Signs 10.8 MW Solar Deal With Amanta",
            "Summary": "Zodiac Energy Limited entered into agreement with Amanta Healthcare Limited for installation of 10.8 MW solar power plant in Gujarat's Kheda district under SEBI Regulation 30 disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1767345545625,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zodiac Energy GST proceedings concluded with nil demand",
            "Summary": "Zodiac Energy Limited receives favorable order from Gujarat tax authorities, concluding GST proceedings for FY2021-22 with no financial impact on the company.",
            "Sentiment": "positive",
            "PublishDate": 1766581193240,
            "Source": "stocks"
        },
        {
            "Title": "Zodiac Energy Limited Shareholders Approve Special Resolution for Loans and Guarantees Under Section 185",
            "Summary": "Zodiac Energy Limited successfully passed a special resolution through postal ballot allowing the company to provide loans, guarantees, or security under Section 185 of the Companies Act, 2013. The resolution received overwhelming shareholder support with 99.9994% votes in favor from 99 shareholders who participated in the remote e-voting process conducted from November 8 to December 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765265304119,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Energy Restructures Solar Subsidiary Holdings with Strategic Acquisitions and Disposal",
            "Summary": "Zodiac Energy Limited increased its stake in two solar project LLPs from 51% to 98% each with effect from November 17, 2025, while completely disposing of its 50% stake in Dhwarkesh Solar Projects LLP on November 21, 2025. The transactions involve cash considerations of Rs. 98,000 for each acquisition and Rs. 50,000 for the disposal, with the moves aimed at expanding the company's solar power business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765024309020,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Energy Launches Three Solar Power Plants In Gujarat",
            "Summary": "Zodiac Energy has launched three solar power plants in Gujarat, expanding its renewable energy operations in the state. The development strengthens the company's solar energy portfolio and contributes to Gujarat's renewable energy capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763470676809,
            "Source": "stock"
        },
        {
            "Title": "Zodiac Energy Commissions 4.14 MWp and 1.02 MWp Solar Power Plants in Gujarat",
            "Summary": "Zodiac Energy Limited has successfully commissioned two solar power plants with capacities of 4.14 MWp and 1.02 MWp located at Village-Sudasana, Tal-Satlasna, Dist-Mahesana, Gujarat. The commissioning expands the company's operational solar power capacity and strengthens its renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763191590591,
            "Source": "stock"
        },
        {
            "Title": "Zodiac Energy Corrects Typographical Error in Q2 FY2026 Financial Results",
            "Summary": "Zodiac Energy Limited rectified a typographical error in its consolidated financial results for the quarter and half year ended September 30, 2025, correcting the Investment figure under Non-current assets to 2299.80 lakhs which was inadvertently omitted. The company submitted revised unaudited standalone and consolidated financial results to BSE and NSE, with no other changes to the Board-approved results from November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763041631549,
            "Source": "earnings"
        },
        {
            "Title": "Zodiac Energy Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Zodiac Energy Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 967.59 lakhs for the quarter compared to Rs 980.98 lakhs in the previous quarter. For the half year, revenue stood at Rs 1,976.55 lakhs versus Rs 1,932.57 lakhs in the corresponding previous period. However, the company posted a net loss after tax of Rs 85.79 lakhs for the quarter compared to a loss of Rs 28.95 lakhs in the previous quarter. For the half year, net loss after tax was Rs 96.95 lakhs against Rs 41.56 lakhs in the previous year. The company operates in two segments: trading of Solar Photovoltaic Modules and execution of EPC contracts, and Generation of Electricity. Basic earnings per share for the quarter was negative Rs 5.76 compared to negative Rs 1.94 in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762932565991,
            "Source": "earnings"
        },
        {
            "Title": "Zodiac Energy Reports Strong Q2 Growth with Revenue Nearly Doubling Year-over-Year",
            "Summary": "Zodiac Energy delivered robust Q2 performance with revenue surging to 968 million rupees from 528 million rupees in the same period last year. The company's EBITDA more than doubled to 103 million rupees compared to 49 million rupees year-over-year, while EBITDA margin improved to 10.6% from 9.3%. Net profit showed modest growth, rising to 27 million rupees from 25 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762931974619,
            "Source": "earnings"
        },
        {
            "Title": "Zodiac Energy Limited Seeks Shareholder Approval for Rs 500 Crore Loan/Guarantee Facility",
            "Summary": "Zodiac Energy Limited has issued a postal ballot notice seeking shareholder approval through special resolution for providing loans, guarantees, or securities up to Rs 500 crore to subsidiaries, associates, joint ventures, or group entities. The e-voting period runs from November 8, 2025 (9:00 AM) to December 7, 2025 (5:00 PM). The funds would be used for capital expenditure projects, working capital requirements, and purchase of fixed assets for principal business activities. The company has appointed SCS Co. LLP as scrutinizer for the postal ballot process. The cut-off date for determining voting eligibility is October 31, 2025. Results will be uploaded to stock exchanges within two working days of the voting conclusion.",
            "Sentiment": "neutral",
            "PublishDate": 1762444078915,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Energy Launches 10.4 MW Solar Power Plant in Gujarat",
            "Summary": "Zodiac Energy has launched a 10.4 MW solar power plant in Karsanpura, Gujarat. The project is aimed at boosting renewable energy capacity.",
            "Sentiment": "positive",
            "PublishDate": 1759912670621,
            "Source": "stock"
        },
        {
            "Title": "Zodiac Energy Commissions Two Solar Power Plants in Gujarat",
            "Summary": "Zodiac Energy has commissioned two solar power plants in Dalisana, Mehsana district, Gujarat. The plants have capacities of 1.57 MWp and 1.23 MWp respectively.",
            "Sentiment": "positive",
            "PublishDate": 1757517524068,
            "Source": "stock"
        },
        {
            "Title": "Zodiac Energy Launches 2.340 MWP Solar Power Plant in Gujarat",
            "Summary": "Zodiac Energy has launched a 2.340 MWP solar power plant in Gujarat, expanding its renewable energy operations in the state.",
            "Sentiment": "positive",
            "PublishDate": 1756731699027,
            "Source": "stock"
        },
        {
            "Title": "Zodiac Energy Acquires 50% Stake in Dhwarkesh Solar Projects LLP",
            "Summary": "Zodiac Energy has acquired a 50% stake in Dhwarkesh Solar Projects LLP. Following this acquisition, Dhwarkesh Solar Projects LLP has become an associate company of Zodiac Energy.",
            "Sentiment": "positive",
            "PublishDate": 1755862195834,
            "Source": "order&deals"
        },
        {
            "Title": "Zodiac Energy Limited Acquires 51% Stake in Dharmik Solar Projects LLP for Rs 51,000",
            "Summary": "Zodiac Energy Limited has acquired a 51% majority stake in Dharmik Solar Projects LLP through a cash consideration of Rs 51,000 out of the LLP's total capital of Rs 1,00,000. The acquisition makes Dharmik Solar Projects LLP a subsidiary of Zodiac Energy Limited. Dharmik Solar Projects LLP, incorporated on December 23, 2020, is engaged in setting up solar power plants, producing electricity through solar energy, and selling solar power. The LLP has reported nil turnover for the last three financial years (2022-23, 2023-24, and 2024-25). The acquisition aligns with Zodiac Energy's business objectives and is expected to result in further expansion of the company's operations. The transaction involves promoter and promoter group interest and is conducted on an arm's length basis. The acquisition process has been completed and no governmental or regulatory approvals were required.",
            "Sentiment": "positive",
            "PublishDate": 1755013040609,
            "Source": "order&deals"
        },
        {
            "Title": "Zodiac Energy Limited Approves Q1 FY2026 Results, Declares Rs. 0.75 Dividend, and Acquires 51% Stake in Solar Venture",
            "Summary": "Zodiac Energy Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company declared a dividend of Rs. 0.75 per equity share (7.5% of face value) for financial year 2024-25, with record date set for September 12, 2025. The board approved acquisition of 51% majority stake in Dharmik Solar Projects LLP through direct capital contribution effective August 12, 2025. The company scheduled its 33rd Annual General Meeting for September 19, 2025 at 2:30 PM via video conferencing. Key appointments include M/s. SCS and Co. LLP as Secretarial Auditor for five years (2025-2030) and M/s. Manubhai & Shah LLP as Internal Auditor for 2025-26, both subject to member approval. The board also approved the draft Directors' Report for 2024-25 and appointed NSDL as the remote e-voting agency for the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1755009235098,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Energy Reports Strong Q1 Growth with 16% Revenue Increase",
            "Summary": "Zodiac Energy reported quarterly net profit of 26.8 million rupees, up from 23 million rupees in the same period last year. Revenue increased to 980 million rupees from 793 million rupees year-over-year. EBITDA rose significantly to 67 million rupees from 42 million rupees, while EBITDA margin improved to 9.88% from 5.28% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755005817629,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat High Court Quashes GST Demand Against Zodiac Energy Limited",
            "Summary": "The Gujarat High Court quashed a Show Cause Notice and Order-in-Original issued by the Assistant Commissioner of State Tax against Zodiac Energy Limited regarding GST demands, interest, and penalties. The tax department had issued a Show Cause Notice under Section 74 of the CGST Act, demanding GST at 18% by treating the company's composite contracts for supply and installation of solar power generating systems as 'works contracts.' Zodiac Energy contended that such supplies were composite supplies taxable at 5% and that there was no fraud, wilful misstatement, or suppression to justify invoking the extended five-year limitation. The court's order dated July 17, 2025 set aside both the Show Cause Notice dated August 5, 2024 and the demand order dated February 4, 2025. The company stated there is no impact on its financial, operational, or other activities following the court's decision.",
            "Sentiment": "positive",
            "PublishDate": 1754918844542,
            "Source": "stock"
        },
        {
            "Title": "Zodiac Energy Launches Two Solar Power Facilities",
            "Summary": "Zodiac Energy has successfully launched two new solar power facilities. This development marks an expansion of the company's renewable energy portfolio and demonstrates its commitment to solar power generation.",
            "Sentiment": "positive",
            "PublishDate": 1752061805000,
            "Source": "default"
        },
        {
            "Title": "Zodiac Energy Launches 3.003 MWp Solar Power Plant in Gujarat",
            "Summary": "Zodiac Energy has successfully initiated operations of a solar power plant with a capacity of 3.003 MWp (Megawatt peak) in Gujarat, India.",
            "Sentiment": "positive",
            "PublishDate": 1750500728000,
            "Source": "default"
        },
        {
            "Title": "Zodiac Energy Reports Strong Q4 Financial Performance",
            "Summary": "Zodiac Energy has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 176 million rupees from 88 million rupees in the same quarter last year. The EBITDA margin improved to 10.28% from 8.27%. Net profit rose to 94 million rupees from 57 million rupees year-over-year, remaining stable at 57 million rupees quarter-over-quarter. Revenue for Q4 grew to 1.7 billion rupees from 1.06 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747404442000,
            "Source": "result"
        },
        {
            "Title": "Zodiac Energy Reports Significant EBITDA Growth in Q3",
            "Summary": "Zodiac Energy has announced its Q3 financial results, showing a substantial year-over-year increase in EBITDA from 51 million rupees to 103 million rupees. However, the company's EBITDA margin slightly decreased from 10.76% to 9.89% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739194442000,
            "Source": "earnings"
        },
        {
            "Title": "Zodiac Energy Reports Strong Q3 Financial Results",
            "Summary": "Zodiac Energy has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 57 million rupees, up from 29 million rupees in the same quarter last year. This also represents a quarter-over-quarter increase from 25 million rupees. Revenue for Q3 reached 1.04 billion rupees, more than doubling from 469 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739194368000,
            "Source": "earnings"
        },
        {
            "Title": "Zodiac Energy Secures $720,626 Order",
            "Summary": "Zodiac Energy has announced that it has received a new order valued at $720,626. This order represents a significant business development for the company, potentially impacting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1734654849000,
            "Source": "order&deals"
        },
        {
            "Title": "Zodiac Energy Secures $720,626 Order",
            "Summary": "Zodiac Energy has announced that it has received a new order valued at $720,626. This order represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1734617306000,
            "Source": "order&deals"
        },
        {
            "Title": "Zodiac Energy Secures Potential 100M Rupee Financing from SBI",
            "Summary": "Zodiac Energy has entered into a non-binding agreement with the State Bank of India (SBI) for potential financial assistance of up to 100 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732105692000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Energy: Secures Rs 154.27 Crore Solar Project Order",
            "Summary": "<p><span class='positive'>Zodiac Energy</span> has been <span class='positive'>awarded</span> a <span class='positive'>Rs 154.27 crore order</span> from <b>Ahmedabad Municipal Corporation</b> for a <span class='positive'>30 MW ground-mounted solar project</span> in <b>Gujarat</b>. The project includes <span class='neutral'>design, installation, and 5-year maintenance</span>, to be <span class='neutral'>delivered within 18 months</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728364805000,
            "Source": "normal_news"
        },
        {
            "Title": "Zodiac Energy Secures Major Contract",
            "Summary": "<p>Zodiac Energy has won a <span class='positive'>significant</span> order valued at <span class='positive'>154.3 crore rupees</span>. This <span class='positive'>substantial</span> contract represents a <span class='positive'>positive</span> development for the company's <b>business operations</b> and <b>financial outlook</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728307477000,
            "Source": "corporate_action"
        }
    ]
}