{
    "Symbol": "ZODIACLOTH",
    "ISIN": "INE206B01013",
    "News": [
        {
            "Title": "Zodiac Clothing Promoters Acquire 14.64L Shares",
            "Summary": "Zodiac Clothing Company's promoter and promoter group acquired 14,64,414 equity shares through preferential allotment on January 16, 2026, increasing total share capital to 2.75 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1768910227302,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zodiac Clothing shareholders approve all resolutions",
            "Summary": "Zodiac Clothing Company Limited shareholders passed four special resolutions through postal ballot including preferential allotment of equity shares, re-appointment of Managing Director, and director appointments with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1767599831218,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zodiac Clothing Seeks Shareholder Approval for Rs 15 Crore Preferential Issue to Promoter Group",
            "Summary": "Zodiac Clothing Company Limited has issued a postal ballot notice seeking member approval for issuing 14.64 lakh equity shares at Rs 102.43 per share to promoter group members, raising Rs 14.99 crores for capital expenditure and general corporate purposes. The company also seeks approval for re-appointing S.Y. Noorani as Managing Director for three years and appointing Mohamed Musaed Abu Nasr Noorani as Non-Executive Director.",
            "Sentiment": "neutral",
            "PublishDate": 1764851920080,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Clothing Approves Rs 15 Crore Preferential Issue to Promoters and Key Board Changes",
            "Summary": "Zodiac Clothing Company's Board approved a preferential issue of equity shares worth up to Rs 15 crores to promoters and promoter group members. The issue price will be determined on December 4, 2025, based on SEBI ICDR regulations pricing formula. The Board appointed Mohamed Musaed Abu Nasr Noorani as Additional Non-Executive, Non-Independent Director and approved the re-appointment of S.Y. Noorani as Managing Director for three years from March 1, 2026 to February 28, 2029. The company also amended Article 180 of its Articles of Association to allow the Managing Director to simultaneously hold the position of Chairman of Directors Meeting. All appointments and amendments are subject to shareholder approval through postal ballot. The company reported quarterly results for the period ended September 30, 2025, with unaudited standalone and consolidated financial results being approved by the Board.",
            "Sentiment": "neutral",
            "PublishDate": 1762959835626,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Clothing Company Receives CRISIL BB/Stable Rating for Rs 53 Crore Bank Facilities",
            "Summary": "Zodiac Clothing Company Limited received a CRISIL BB/Stable rating for its total bank loan facilities worth Rs 53 crore. The rating was assigned through CRISIL's letter dated October 31, 2025, and covers fund-based facilities from multiple banks including RBL Bank Limited, Bank of Maharashtra, ICICI Bank Limited, and HDFC Bank Limited. The company also has proposed fund-based bank limits of Rs 3 crore included in the total rated amount. The rating letter remains valid until March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762310798215,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Clothing Appoints Ms. Djena Sunavala as Independent Director for 5-Year Term",
            "Summary": "Zodiac Clothing Company Limited has appointed Ms. Djena Sunavala as an Additional Director in the category of Independent Director for a term of 5 years, from September 12, 2025 to September 11, 2030. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Ms. Sunavala brings over thirty years of experience as a practicing attorney in Mumbai and is a managing partner at Aurus Legal, Advocate & Solicitors, where she leads the real estate practice. She has represented Indian and foreign companies for industrial, commercial and residential projects, and has worked with domestic and global financial services groups for mutual funds and life insurance companies in India. Ms. Sunavala is not related to any existing Director of the Company and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1757670984875,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zodiac Clothing Reports Quarterly Loss, Schedules AGM and Reconstitutes Board Committees",
            "Summary": "Zodiac Clothing Company Ltd announced its unaudited financial results for the quarter ended June 30, 2025, showing a standalone loss of Rs. 862.77 lakhs compared to Rs. 942.34 lakhs loss in the same quarter last year. Revenue from operations stood at Rs. 3,902.78 lakhs versus Rs. 3,769.68 lakhs in the previous year quarter. On a consolidated basis, the company reported a loss of Rs. 931.99 lakhs for the quarter. The Board approved holding the 41st Annual General Meeting on September 29, 2025, through video conferencing. The company also reconstituted four board committees - Nomination and Remuneration Committee (chaired by Dr. Naushad Forbes), Stakeholders Relationship Committee, Corporate Social Responsibility Committee, and Risk Management Committee (all three chaired by Mr. Vaman Apte). The company operates exclusively in the clothing and clothing accessories business.",
            "Sentiment": "negative",
            "PublishDate": 1755099950453,
            "Source": "earnings"
        },
        {
            "Title": "Zodiac Clothing Cancels Preferential Share Issue Following Chairman's Death",
            "Summary": "Zodiac Clothing Company Limited cancelled its planned preferential issue of 13,44,086 equity shares at Rs. 111.60 per share following the death of Promoter and Chairman Mr. Mohamed Anees Noorani on July 29, 2025. Noorani was one of the proposed allottees in the issue. The other proposed allottee, Mr. Salman Yusuf Noorani (Vice Chairman & Managing Director), also did not subscribe due to bereavement after losing his elder brother. The company had received in-principle approval from BSE and NSE on July 24, 2025, but could not complete the issue within the statutory 15-day period. No shares were subscribed or allotted under this preferential issue.",
            "Sentiment": "negative",
            "PublishDate": 1754656267948,
            "Source": "corporate_action"
        },
        {
            "Title": "Zodiac Clothing Chairman and Promoter Mohamed Anees Noorani Passes Away",
            "Summary": "Zodiac Clothing Company Limited announced the death of Mohamed Anees Noorani, the company's Chairman and Promoter, on July 29, 2025. Noorani had been associated with the company since 1968, serving as Managing Director from March 1994 to February 2017, Vice Chairman from 2002 to 2019, and Chairman from February 2020. Beyond his role at Zodiac Clothing, he held various industry positions including Director at Indian Oil Corporation, President of the Indo-German Chamber of Commerce, and served on boards of multiple trade organizations and the National Institute of Fashion Technology. The Board and employees expressed condolences for his leadership and contributions over the decades.",
            "Sentiment": "negative",
            "PublishDate": 1753786450594,
            "Source": "corporate_governance"
        }
    ]
}