{
    "Symbol": "ZOTA",
    "ISIN": "INE358U01012",
    "News": [
        {
            "Title": "Zota Health Care Expands Davaindia Store Network by 310 Outlets in Q2FY26",
            "Summary": "Zota Health Care added 310 new Davaindia stores during Q2FY26, bringing its total store count to 2,055. The company's retail network consists of 1,207 company-owned company-operated (CoCo) stores and 848 franchise-owned franchise-operated (FoFo) stores.",
            "Sentiment": "positive",
            "PublishDate": 1759310158559,
            "Source": "stock"
        },
        {
            "Title": "Zota Health Care Approves Plan to Raise Up to 5 Billion Rupees",
            "Summary": "Zota Health Care has approved a plan to raise up to 5 billion rupees. The company has given its approval for this fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1756985238749,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Receives EU GMP Audit Report for Surat Facility",
            "Summary": "Zota Health Care has received the EU GMP (European Union Good Manufacturing Practice) audit report for its facility located in Surat. This suggests that the company's manufacturing practices at this site have been evaluated against European standards.",
            "Sentiment": "positive",
            "PublishDate": 1752758215000,
            "Source": "default"
        },
        {
            "Title": "Zota Healthcare Expands Davaindia Network to 1,760 Stores",
            "Summary": "Zota Healthcare has expanded its Davaindia network to 1,760 operational stores. The company has also surpassed 1,000 Company-Owned Company-Operated (CoCo) stores within this network. This expansion represents significant growth for Zota Healthcare's retail presence in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1751621753000,
            "Source": "default"
        },
        {
            "Title": "Zota Health Care Expands Davaindia Network",
            "Summary": "Zota Health Care has expanded its Davaindia network to 1,637 operational stores. The company has also surpassed 901 Company Owned Company Operated (COCO) operational stores.",
            "Sentiment": "positive",
            "PublishDate": 1747382484000,
            "Source": "default"
        },
        {
            "Title": "Zota Health Care Obtains Product Registration License in Cambodia",
            "Summary": "Zota Health Care has received a product registration license in Cambodia for their product Azitoz 500. The license is valid for a period of five years.",
            "Sentiment": "positive",
            "PublishDate": 1742256112000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Obtains Product Registration License in Cambodia",
            "Summary": "Zota Health Care has received a product registration license in Cambodia for their medication Azitoz 500. The license is valid for a period of five years.",
            "Sentiment": "positive",
            "PublishDate": 1742215652000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Zota Health Care has reported a decrease in its third quarter EBITDA, which fell to 13.8 million rupees from 21.3 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 1.92% from 4.97% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739465527000,
            "Source": "earnings"
        },
        {
            "Title": "Zota Health Care Reports Significant Revenue Growth in Q3",
            "Summary": "Zota Health Care has announced its Q3 financial results, reporting a revenue of 681.3 million rupees. This represents a substantial increase from the 428.3 million rupees reported in the same quarter of the previous year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739465521000,
            "Source": "earnings"
        },
        {
            "Title": "Zota Health Care Reports Significant Profit Growth in Q3",
            "Summary": "Zota Health Care has announced its Q3 financial results, showing a substantial increase in net profit. The company reported a net profit of 20.8 million rupees, up from 11.6 million rupees in the same quarter last year. This represents a year-over-year growth of approximately 79%. Additionally, the profit has increased from 23.5 million rupees in the previous quarter, indicating consistent financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739465514000,
            "Source": "earnings"
        },
        {
            "Title": "Zota Health Care Expands Davaindia Store Network",
            "Summary": "Zota Health Care has expanded its Davaindia network to 1,413 operational stores, with 707 of these being company-owned and company-operated (COCO) stores. This expansion represents significant growth in the company's retail presence.",
            "Sentiment": "positive",
            "PublishDate": 1738075233000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care to Issue New Shares Worth 943 Million Rupees",
            "Summary": "Zota Health Care has announced plans to issue new shares valued at 943 million rupees. This share issuance represents a significant corporate action that could potentially impact the company's capital structure and existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1736468274000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care to Issue Shares Worth 943 Million Rupees",
            "Summary": "Zota Health Care has announced plans to issue new shares valued at 943 million rupees. This share issuance represents a significant corporate action that could potentially impact the company's capital structure and existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1736424614000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Obtains Product Registration Licenses in Kyrgyzstan",
            "Summary": "Zota Health Care has received product registration licenses for two of its products in Kyrgyzstan. This development allows the company to expand its market presence in the Central Asian country.",
            "Sentiment": "positive",
            "PublishDate": 1735518162000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Secures Product Registration Licenses in Kyrgyzstan",
            "Summary": "Zota Health Care has obtained product registration licenses for two of its products in Kyrgyzstan. This development expands the company's market presence in Central Asia and potentially opens up new business opportunities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1735302154000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Limited: Expands Davaindia Pharmacy Chain to 1,294 Stores",
            "Summary": "Zota Health Care Limited has expanded its Davaindia pharmacy chain to 1,294 operational stores as of December 4, 2024. The company increased its Company-Owned Company-Operated (COCO) stores from 501 to 601 in two months. Chairman Ketankumar Zota emphasized the company's commitment to enhancing direct retail presence and improving healthcare accessibility.",
            "Sentiment": "positive",
            "PublishDate": 1733391545000,
            "Source": "normal_news"
        },
        {
            "Title": "Zota Health Care Limited Expands Davaindia Network to 1,294 Stores",
            "Summary": "Zota Health Care Limited has announced a significant expansion of its Davaindia network, reaching a total of 1,294 operational stores. Notably, the company has surpassed the milestone of 600 company-owned and company-operated (COCO) stores, indicating substantial growth in its retail presence.",
            "Sentiment": "positive",
            "PublishDate": 1733377526000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Obtains Product Registration License in Myanmar",
            "Summary": "Zota Health Care has received a product registration license for one of its products in Myanmar. This development suggests an expansion of the company's market presence in Southeast Asia.",
            "Sentiment": "positive",
            "PublishDate": 1732666556000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care Obtains Product Registration License in Myanmar",
            "Summary": "Zota Health Care has secured a product registration license for one of its products in Myanmar. This development indicates the company's expansion into the Myanmar market and potential for increased sales and market presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1732634007000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zota Health Care's DAVAINDIA Expands Retail Presence",
            "Summary": "<p><span class='neutral'>DAVAINDIA</span>, a subsidiary of <span class='neutral'>Zota Health Care</span>, has <span class='positive'>significantly expanded</span> its retail footprint, now operating <b>1,165 stores</b> across India. The company has placed a <span class='positive'>strategic emphasis</span> on the <span class='neutral'>Company-Owned Company-Operated (COCO)</span> model, with <b>501 stores</b> nationwide under this format. This expansion indicates DAVAINDIA's <span class='positive'>aggressive growth strategy</span> in the pharmaceutical retail sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728285637000,
            "Source": "corporate_action"
        }
    ]
}