{
    "Symbol": "ZTECH",
    "ISIN": "INE0ISZ01012",
    "News": [
        {
            "Title": "India's White-Collar Job Crisis: Tech Sector Faces Major Cuts",
            "Summary": "Saurabh Mukherjea warns India's white-collar job growth has crashed from 11% to 1% annually, with tech sector shedding roles and 2 million jobs at risk by 2031 due to AI disruption.",
            "Sentiment": "negative",
            "PublishDate": 1768025872865,
            "Source": "stocks"
        },
        {
            "Title": "India's deep tech sector matures with commercial focus",
            "Summary": "India's deep tech ecosystem raised $1.57 billion in 2025 YTD, marking 25.8% growth. Generative AI led with $417.6 million funding, up 201.8% YoY, as startups shift from proof-of-concept to revenue-focused models.",
            "Sentiment": "positive",
            "PublishDate": 1766590167940,
            "Source": "stocks"
        },
        {
            "Title": "Z-Tech India Secures ₹20 Crore Waste-to-Art Park Project",
            "Summary": "Z-Tech (India) has been awarded a ₹20 crore project by the Amdavad Municipal Corporation to develop a waste-to-art park. This project represents a significant order for the company, which has a market capitalization of ₹672 crore and is listed in the SME segment.",
            "Sentiment": "positive",
            "PublishDate": 1741667678000,
            "Source": "order&deals"
        },
        {
            "Title": "Z-Tech India Secures 94.5 Million Rupee Work Order",
            "Summary": "Z-Tech (India), a company with a market capitalization of 672 crore rupees, has received a significant work order valued at 94.5 million rupees. This development is particularly noteworthy for the company, which is classified as a Small and Medium Enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1741151778000,
            "Source": "order&deals"
        },
        {
            "Title": "Z-TECH India Launches Gaming Arena in Lucknow",
            "Summary": "Z-TECH (INDIA) has announced the launch of a new gaming and recreational facility called Fast Forward Gaming Arena. The facility is located at Harmony Park in Lucknow, expanding the company's presence in the entertainment sector.",
            "Sentiment": "positive",
            "PublishDate": 1740473346000,
            "Source": "corporate_action"
        }
    ]
}