{
    "Symbol": "ZUARIIND",
    "ISIN": "INE217A01012",
    "News": [
        {
            "Title": "Zuari Industries Q3FY26 Earnings Call on Feb 16",
            "Summary": "Zuari Industries Limited announces earnings conference call scheduled for February 16, 2026 at 4:30 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770801888137,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zuari Industries Postal Ballot Results Announced",
            "Summary": "Zuari Industries successfully concluded postal ballot voting on January 22, 2026, with shareholders approving appointments of Akshay Poddar as Non-Executive Director and Sanjeev Lall as Independent Director with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1769172532810,
            "Source": "stocks"
        },
        {
            "Title": "Zuari Industries Seeks Shareholder Approval for Directors",
            "Summary": "Zuari Industries Limited issues postal ballot notice for appointment of Akshay Poddar as Non-Executive Director and Sanjeev Lall as Independent Director through remote e-voting from December 24, 2025 to January 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766471517803,
            "Source": "stocks"
        },
        {
            "Title": "Jyotsna Poddar acquires 3L shares from Akshay Poddar",
            "Summary": "Jyotsna Poddar acquired 3,00,000 shares (1.01% stake) in Zuari Industries from immediate relative Akshay Poddar as gift on December 19, 2025, increasing her total holding to 1.25%.",
            "Sentiment": "neutral",
            "PublishDate": 1765782731276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zuari Industries Reports Strong Q2 Performance with 44% Higher Ethanol Production and Plans INR 800 Crore Debt Reduction",
            "Summary": "Zuari Industries achieved 44% higher ethanol production in Q2 FY26 with 311 operating days, improved EBITDA from INR 3.5 crores to INR 8.9 crores, and reduced finance costs by INR 3 crores. The company expects INR 800 crores cash inflow from its Dubai real estate project starting Q2 FY27, which will be entirely used for debt reduction from current gross external debt of INR 1,863 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763462604202,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Industries Shares Q2 FY26 Investor Presentation Highlighting Operational and Financial Performance",
            "Summary": "Zuari Industries Limited released its Q2 FY26 investor presentation showing mixed operational results with ethanol production up 44% year-on-year but sugar sales declining 12% year-on-year, while maintaining focus on financial control and governance strengthening. The company reported standalone revenue of Rs 248.1 crores for Q2 FY26 compared to Rs 224.7 crores in Q2 FY25, with its joint venture ZEBPL's grain-based distillery project 95% completed and expected to be operational by November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763057865867,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Industries Announces Aggressive Diversification Strategy Across Multiple Sectors",
            "Summary": "Zuari Industries has outlined an aggressive diversification plan spanning agriculture, real estate, and engineering sectors while monetizing its land bank for industrial parks and housing projects. The company is expanding its fertilizer and cement portfolio through subsidiaries and focusing on de-leveraging with an asset-light growth model to unlock shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1763056238868,
            "Source": "stock"
        },
        {
            "Title": "Zuari Industries Reports Strong Q2 Turnaround with 31M Rupees Net Profit",
            "Summary": "Zuari Industries reported quarterly results showing significant improvement in profitability. The company posted a net profit of 31 million rupees compared to a loss of 239 million rupees in the same period last year. EBITDA increased to 89 million rupees from 35 million rupees year-over-year, while EBITDA margin expanded to 4.37% from 1.71%. However, revenue declined to 2.05 billion rupees from 2.1 billion rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762953597970,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Global Receives Correction Request from Promoter Over Erroneous Share Acquisition Disclosure",
            "Summary": "Zuari Global Limited received a request from its promoter Adventz Finance Private Limited to rectify disclosures made under SEBI regulations. Adventz Finance had erroneously disclosed the acquisition of 25,000 equity shares of Zuari Global Limited on December 2, 2021, when the actual acquisition was of shares in Texmaco Infrastructure & Holdings Limited. The incorrect disclosure showed Adventz Finance's total holding as 28,91,277 shares representing 9.82% of Zuari Global's share capital. Following the correction request, Adventz Finance's actual holding in Zuari Global remains unchanged at 28,66,277 shares representing 9.74% of the total share capital. The company has requested the stock exchanges to consider the erroneous disclosures as null and void.",
            "Sentiment": "neutral",
            "PublishDate": 1761796161334,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Industries Redeems 8.4 Lakh Preference Shares, Pays Dividends on Remaining Holdings",
            "Summary": "Zuari Industries Limited has completed the redemption of 8,40,632 unlisted 7% Non-Convertible Redeemable Preference Shares and paid dividends on 59,22,080 such shares. Following the redemption, the company's paid-up Preference Share Capital stands at Rs. 5,08,14,480, consisting of 50,81,448 7% NCRPS with a face value of Rs. 10 each. The preference shares are unlisted and not traded on any stock exchange. The company had previously received board approval for these actions on September 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758805523597,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Industries Redeems 840,632 Preference Shares and Declares Interim Dividend",
            "Summary": "Zuari Industries Limited's Board of Directors approved the redemption of 840,632 unlisted 7% Non-Convertible Redeemable Preference Shares of Rs. 10 each, with their term completing on September 19, 2025. The company also declared an interim dividend on 5,922,080 preference shares at 1.82% rate (Rs. 0.182 per share) for the period from June 17 to September 19, 2025. These preference shares were originally issued to shareholders of Gobind Sugar Mills Limited as part of an amalgamation scheme. The preference shares are unlisted on any stock exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1757941058295,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Industries Reports Mixed Q1 FY26 Results with Revenue Decline but Improved Subsidiary Performance",
            "Summary": "Zuari Industries reported revenue from operations of Rs 210.3 crores in Q1 FY26, down from Rs 214.5 crores in the previous year. Operating EBITDA declined to Rs 22.4 crores from Rs 23.5 crores, while profit before tax decreased to Rs 0.9 crores from Rs 1.14 crores. However, consolidated revenue grew to Rs 257.5 crores from Rs 225.7 crores, and consolidated loss before tax improved significantly to Rs 0.4 crores from Rs 34.3 crores loss previously. The sugar division sold 3.6 lakh quintals at Rs 4,036 per quintal, while ethanol production increased 12% to 10,019 kiloliters. Subsidiaries showed strong performance with Zuari Infraworld revenue rising to Rs 27.1 crores, Zuari Finserv achieving 20% revenue growth, and Simon India's revenue jumping to Rs 15.9 crores from Rs 1.5 crores. The company is completing a 180 KLPD grain-based ethanol distillery and expanding real estate operations to new cities. Total debt stands at Rs 2,300 crores with management outlining a deleveraging roadmap.",
            "Sentiment": "neutral",
            "PublishDate": 1755599181163,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Industries Shares Audio Recording of Quarterly Earnings Conference Call",
            "Summary": "Zuari Industries Limited has made available the audio recording of its earnings conference call held on August 14, 2025. The call discussed the company's unaudited financial results for the quarter ended June 30, 2025. The audio recording has been posted on the company's website and the link was shared with stock exchanges BSE and NSE as part of regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755168256919,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Industries Plans Portfolio Transformation with Real Estate, Hospitality, and Renewable Energy Focus",
            "Summary": "Zuari Industries is planning to transform its business portfolio through new real estate projects, expansion in hospitality sector, and focus on renewable energy. The company's strong financial position and land holdings are positioned to support growth over the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1755016022199,
            "Source": "stock"
        },
        {
            "Title": "Zuari Industries Reports Q1 FY26 Results with Mixed Performance and Major Corporate Restructuring",
            "Summary": "Zuari Industries Limited announced its Q1 FY26 financial results with standalone revenue of ₹210.3 crores and consolidated revenue of ₹267.6 crores. The company's sugar operations faced challenges due to early mill closure from region-wide cane shortage, though sugar realization improved 4% to ₹4,036 per quintal. Ethanol sales increased marginally with higher realizations of ₹60.7 per liter. The Board approved several key decisions including re-appointment of statutory auditors for five years, appointment of new secretarial and internal auditors, shifting registered office from Goa to Haryana, and extension of ₹60 crore inter-corporate deposits to associate company Zuari Agro Chemicals Limited. The company also recognized impairment losses totaling ₹448.49 lakhs on furniture business investments and reduced borrowing costs from 10.41% to 10.29%.",
            "Sentiment": "neutral",
            "PublishDate": 1755008249671,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Industries Reports Turnaround with Q1 Profit After Previous Year Loss",
            "Summary": "Zuari Industries posted a consolidated net profit of 0.52 million rupees in Q1, marking a significant turnaround from a loss of 333 million rupees in the same quarter last year. The company's revenue grew to 2.57 billion rupees compared to 2.25 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755005882040,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Industries Receives Interim Relief from Allahabad High Court on Denatured Alcohol Export Fees",
            "Summary": "Zuari Industries Limited has obtained interim relief from the Allahabad High Court regarding export fees on denatured alcohol reinstated by the Uttar Pradesh government. The court's interim order dated 30 July 2025 permits movement of trucks carrying industrial alcohol from distilleries, subject to maintaining proper records and submitting indemnity bonds. The relief was granted in a writ petition filed by U.P. Sugar Mills Association, of which Zuari Industries is a member. The company had previously disclosed that it received a letter from the Assistant Excise Commissioner to deposit import/export pass fees on denatured alcohol retrospectively from FY 2018-19 and prospectively. The interim relief remains without prejudice to parties' rights and is pending final adjudication of the petition.",
            "Sentiment": "positive",
            "PublishDate": 1754210833034,
            "Source": "stock"
        },
        {
            "Title": "Zuari Industries Reports Q4 Financial Results and Dividend",
            "Summary": "Zuari Industries announced its Q4 financial results. The company reported a consolidated net loss of 207 million rupees, compared to a loss of 636 million rupees in the same quarter last year. The loss narrowed from 247 million rupees in the previous quarter. Q4 revenue increased to 2.7 billion rupees from 2.6 billion rupees year-over-year. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748390440000,
            "Source": "default"
        },
        {
            "Title": "Zuari Industries Reports Q4 Results and Dividend Recommendation",
            "Summary": "Zuari Industries has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA decreased to 276 million rupees from 1.37 billion rupees year-over-year, with EBITDA margin falling to 10.14% from 52.04%. The consolidated net loss for Q4 was 207 million rupees, compared to a loss of 636 million rupees in the same quarter last year and a loss of 247 million rupees in the previous quarter. Q4 revenue slightly increased to 2.7 billion rupees from 2.6 billion rupees year-over-year. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1748351376000,
            "Source": "result"
        },
        {
            "Title": "Zuari Industries Unit Signs Rs 130 Crore Deal with Texmaco for Mixed-Use Project",
            "Summary": "A subsidiary of Zuari Industries has entered into a binding term sheet with Texmaco to act as the development manager for a mixed-use project in West Bengal. The deal is valued at Rs 130 crore and is classified as an arm's length related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1744104011000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Industries Announces Major Real Estate Project",
            "Summary": "Zuari Industries has revealed plans for a large-scale residential project named Zuari Gangothri Tribhuja. The development is estimated to cost over 1500 crore rupees and will consist of nine high-rise residential towers. The project will offer 3 and 4 BHK apartments, indicating a focus on premium housing.",
            "Sentiment": "positive",
            "PublishDate": 1740977311000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Infraworld and Gangothri Group Collaborate on Premium Residences in Hyderabad",
            "Summary": "Zuari Infraworld, a subsidiary of Zuari Industries, has partnered with Gangothri Group to develop premium residential properties in Hyderabad. This collaboration aims to expand Zuari's real estate presence in the growing Hyderabad market.",
            "Sentiment": "positive",
            "PublishDate": 1740977249000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Industries Reports Increased Q3 Loss and Revenue",
            "Summary": "Zuari Industries has reported financial results for the third quarter. The company's loss before tax has widened to 237 million rupees, compared to a loss of 48 million rupees in the same period last year. However, the company's revenue has shown significant growth, increasing to 2.35 billion rupees from 1.16 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739442111000,
            "Source": "earnings"
        }
    ]
}