{
    "Symbol": "ZUARI",
    "ISIN": "INE840M01016",
    "News": [
        {
            "Title": "Zuari Agro Chemicals Q3 Profit Falls 27% YoY",
            "Summary": "Zuari Agro Chemicals reported Q3 consolidated net profit of 397 million rupees, down from 545 million rupees year-on-year, while revenue declined significantly to 3.4 billion rupees from 12.6 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1770210080157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zuari Agro Chemicals Gets Equity Shares from ZMPPL",
            "Summary": "Zuari Agro Chemicals receives 69,16,173 equity shares worth ₹6.92 crores from ZMPPL through conversion of preference shares on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766418847316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jyotsna Poddar Files Disclosure for Zuari Agro Share Gift",
            "Summary": "Jyotsna Poddar filed regulatory disclosure confirming receipt of 1,50,000 shares as gift from Akshay Poddar, increasing her holding to 1,71,621 shares (0.41%) in Zuari Agro Chemicals Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765535910515,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zuari Agro Chemicals Seeks Shareholder Approval for Executive Director Remuneration",
            "Summary": "Zuari Agro Chemicals Limited has issued a postal ballot notice seeking shareholder approval for payment of remuneration to Executive Director Nitin M. Kantak from January 10, 2026 to September 24, 2026, with proposed monthly compensation of Rs. 7 lakh including basic salary, allowances and statutory contributions. The e-voting process will commence on December 10, 2025 and conclude on January 8, 2026, with results to be announced on January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765260292004,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Agro Chemicals Receives 6.54 Crore Paradeep Phosphates Shares in Exchange Deal",
            "Summary": "Zuari Agro Chemicals Limited has been allotted 6,54,33,846 equity shares of Rs. 10 each in Paradeep Phosphates Limited through a scheme of arrangement. The allotment was made at a ratio of 187 PPL shares for every 100 MCFL shares, with Zuari exchanging its 3,49,91,362 equity shares in Mangalore Chemicals Fertilizers Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764843457682,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Agro Chemicals Board Approves Remuneration for Executive Director",
            "Summary": "Zuari Agro Chemicals' Board approved payment of remuneration to Executive Director Nitin M. Kantak for his services from January 10, 2026 to September 2, 2026. The approval is subject to shareholder consent through postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1764842164091,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Agro Chemicals Reports Exceptional Gains from Corporate Restructuring and Business Divestment",
            "Summary": "Zuari Agro Chemicals Limited announced quarterly results showing exceptional gains totaling Rs. 1,168.96 crores from corporate restructuring activities. The company transferred its investment in Mangalore Chemicals and Fertilizers Limited (MCFL) to Zuari Maroc Phosphates Private Limited for Rs. 418.13 crores and received equity shares in Paradeep Phosphates Limited through a composite scheme of arrangement, generating gains of Rs. 172.73 crores and Rs. 986.91 crores respectively. Additionally, the company completed the sale of its granulated single super phosphate plant at Mahad, Maharashtra to MCFL for Rs. 72.75 crores, recognizing a gain of Rs. 9.32 crores. MCFL ceased to be a subsidiary effective September 26, 2025, following NCLT approval of the composite scheme. The board also approved seeking extension of Rs. 110 crores Inter Corporate Deposit from Zuari Industries Limited and availing fresh ICDs of Rs. 85 crores from Adventz Finance Private Limited. The company has filed a joint settlement application with SEBI for an ongoing matter.",
            "Sentiment": "positive",
            "PublishDate": 1762508865559,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Agro Chemicals Completes INR 418 Crore Share Transfer to Zuari Maroc Phosphates",
            "Summary": "Zuari Agro Chemicals Limited completed the transfer of 2,90,37,000 equity shares of Mangalore Chemicals & Fertilizers Limited to Zuari Maroc Phosphates Private Limited for INR 418.13 crore. The share transfer was executed at INR 144 per share as part of a composite scheme of arrangement involving Mangalore Chemicals & Fertilizers Limited and Paradeep Phosphates Limited. The transaction was completed on October 13, 2025, which marked the 'Effective Date I' of the scheme after the relevant forms were filed and approved by the National Company Law Tribunals.",
            "Sentiment": "neutral",
            "PublishDate": 1760351488053,
            "Source": "order&deals"
        },
        {
            "Title": "NCLT Approves Merger Scheme Between Mangalore Chemicals & Fertilizers and Paradeep Phosphates",
            "Summary": "The National Company Law Tribunal, Bengaluru Bench has approved the scheme of arrangement between Mangalore Chemicals & Fertilizers Limited and Paradeep Phosphates Limited. The NCLT passed an order on September 24, 2025, sanctioning the second motion petition for the merger scheme involving the two companies and their respective shareholders and creditors. Mangalore Chemicals & Fertilizers serves as the transferor company while Paradeep Phosphates acts as the transferee company in this arrangement. Zuari Agro Chemicals Limited disclosed this development to stock exchanges, referencing their previous communications from February and March 2025 regarding the scheme.",
            "Sentiment": "positive",
            "PublishDate": 1758970114451,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Agro Chemicals Sells Mahad Plant to Subsidiary MCFL for INR 72.75 Crores",
            "Summary": "Zuari Agro Chemicals Limited's board approved the sale of its granulated single super phosphate plant and related assets in Mahad, Maharashtra to its subsidiary Mangalore Chemicals & Fertilizers Limited for INR 72.75 crores. The transaction is structured as a slump sale and requires shareholder approval. The Mahad plant generated turnover of INR 47.80 crores, representing 100% of Zuari's total turnover for the year ended March 31, 2025, with a net book value of INR 51.10 crores (38% of company's net worth). The deal is expected to complete within three months and aims to provide liquidity to help Zuari repay certain liabilities. Both companies operate in the fertilizer manufacturing and trading business.",
            "Sentiment": "neutral",
            "PublishDate": 1754637788834,
            "Source": "order&deals"
        },
        {
            "Title": "Zuari Agro Chemicals Reports Quarterly Results, Seeks Extension for Rs 60 Crore Inter Corporate Deposits",
            "Summary": "Zuari Agro Chemicals Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported a loss of Rs 18.55 crore compared to a loss of Rs 18.80 crore in the same quarter last year. Revenue from operations declined to Rs 0.94 crore from Rs 26.49 crore year-on-year. On a consolidated basis, the company posted a profit after tax of Rs 127.38 crore versus Rs 29.37 crore in the previous year quarter, with revenue from operations increasing to Rs 1,246.05 crore from Rs 1,096.65 crore. The Board also approved seeking an extension for repayment of Inter Corporate Deposits worth Rs 60 crore from related party Zuari Industries Limited for one additional year from their respective maturity dates. The company faces ongoing regulatory matters including a SEBI Show Cause Notice regarding alleged irregularities in financial statements for earlier years, for which a joint settlement application has been filed.",
            "Sentiment": "neutral",
            "PublishDate": 1753948431419,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Agro Chemicals Reports Strong Q1 Results with 890% Jump in Net Profit",
            "Summary": "Zuari Agro Chemicals delivered strong quarterly performance with consolidated net profit surging to 990 million rupees from 100 million rupees in the same period last year. Revenue grew to 12.5 billion rupees compared to 10.96 billion rupees year-over-year. The company's EBITDA increased to 1.4 billion rupees from 1.2 billion rupees, while EBITDA margin improved to 11.3% from 10.8% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753948056484,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Agro Chemicals Approves Investment of Up to Rs 180 Crores in Joint Venture ZMPPL",
            "Summary": "Zuari Agro Chemicals Limited's board has approved the execution of a securities subscription agreement to invest approximately up to Rs 180 crores in cash for non-voting compulsorily convertible preference shares of Zuari Maroc Phosphates Private Limited (ZMPPL). ZMPPL is a joint venture between Zuari Agro and OCP S.A, incorporated in 2002, engaged in trading fertilizers and industrial chemicals. Both Zuari Agro and OCP will subscribe to equal numbers of preference shares, maintaining their existing 50% shareholding each in ZMPPL. The investment is part of a scheme arrangement involving Mangalore Chemicals and Fertilizers Limited and Paradeep Phosphates Limited. The subscription is subject to certain conditions and must be completed within 100 days of the agreement execution. Additionally, an inter-se agreement will be signed among the parties to govern future acquisitions of securities in Paradeep Phosphates Limited. The transaction is considered a related party transaction and will be conducted on an arm's length basis.",
            "Sentiment": "neutral",
            "PublishDate": 1753710888744,
            "Source": "order&deals"
        },
        {
            "Title": "Zuari Agro Chemicals to Invest ₹180 Crore in Joint Venture ZMPPL",
            "Summary": "Zuari Agro Chemicals plans to invest ₹180 crore in its joint venture ZMPPL through subscription of Compulsorily Convertible Preference Shares (CCPS). The investment represents the company's commitment to funding its joint venture operations.",
            "Sentiment": "positive",
            "PublishDate": 1753710411234,
            "Source": "stock"
        },
        {
            "Title": "Zuari Agro Chemicals: Q4 Profit Drops 65%, FY25 Profit Surges 86%",
            "Summary": "Zuari Agro Chemicals reported a 65% decline in Q4 FY25 consolidated net profit to ₹27.20 crore due to higher expenses. Total income fell to ₹973.80 crore. However, full-year FY25 net profit increased by 86% to ₹230.96 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1747246173000,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Agro Chemicals Reports Mixed Q4 Financial Results",
            "Summary": "Zuari Agro Chemicals announced its Q4 financial results. The company's EBITDA increased to 324.7 million rupees from 186 million rupees year-over-year, with EBITDA margin improving to 3.41% from 2.07%. Revenue rose to 9.52 billion rupees from 8.97 billion rupees. However, consolidated net profit decreased to 198.4 million rupees from 752 million rupees year-over-year and 545.3 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747225336000,
            "Source": "result"
        },
        {
            "Title": "Zuari Agro Chemicals Temporarily Shuts Down Mahad SSP Plant",
            "Summary": "Zuari Agro Chemicals has announced the temporary closure of its Single Super Phosphate (SSP) plant located in Mahad. The company has not provided specific reasons for the shutdown or its expected duration.",
            "Sentiment": "negative",
            "PublishDate": 1747137857000,
            "Source": "default"
        },
        {
            "Title": "Zuari Agro Chemicals Reports Improved Q3 Financial Performance",
            "Summary": "Zuari Agro Chemicals has announced its Q3 financial results, showing significant improvement in key metrics. The company's EBITDA increased to 1.16 billion rupees, up from 752 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 9.20% from 8.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738843664000,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Agro Chemicals Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Zuari Agro Chemicals has announced its financial results for the third quarter. The company's consolidated net profit increased substantially to 545 million rupees, up from 134 million rupees in the same period last year. Revenue also saw significant growth, reaching 12.6 billion rupees compared to 8.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738843658000,
            "Source": "earnings"
        },
        {
            "Title": "Zuari Agro Chemicals to Transfer MCFL Shares to Zuari Maroc Phosphates",
            "Summary": "Zuari Agro Chemicals has announced that it will transfer its revised shares of Mangalore Chemicals and Fertilizers Limited (MCFL) to Zuari Maroc Phosphates. This move indicates a restructuring of ownership within the company's holdings.",
            "Sentiment": "neutral",
            "PublishDate": 1732533061000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Agro Chemicals Reports Significant Profit Increase in Q2",
            "Summary": "Zuari Agro Chemicals has reported a consolidated net profit of 812 million rupees for the second quarter, showing a substantial increase from 355 million rupees year-over-year and 92 million rupees quarter-over-quarter. However, the company's revenue decreased to 11.2 billion rupees from 16.5 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730897233000,
            "Source": "result"
        }
    ]
}