{
    "Symbol": "ZYDUSWELL",
    "ISIN": "INE768C01028",
    "News": [
        {
            "Title": "Zydus Wellness Insider Trading Disclosure Filed",
            "Summary": "Zydus Wellness Limited disclosed acquisition of 1,000 equity shares by Mrs. Nidhi Punit Adhia for ₹3,89,590 through open market purchase on NSE under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770738876442,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Wellness Reports Q3 Net Loss of 400M Rupees",
            "Summary": "Zydus Wellness posted a consolidated net loss of 400 million rupees in Q3, marking a significant decline from the 64 million rupees profit recorded in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770103153001,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Wellness Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Zydus Wellness Limited has scheduled its Board of Directors meeting for February 3, 2026, to approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768994002981,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Wellness Gets Court Relief on ₹56.33 Cr GST Demand",
            "Summary": "Gujarat High Court grants ad-interim relief to Zydus Wellness subsidiary, restraining proceedings on GST demand of ₹56.33 crores related to pre-acquisition period fully indemnified by Heinz Italia.",
            "Sentiment": "positive",
            "PublishDate": 1768025840935,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Wellness clarifies volume surge to BSE",
            "Summary": "Zydus Wellness Limited responds to BSE inquiry about significant volume increase in its equity shares, stating no undisclosed events and attributing movement to market forces.",
            "Sentiment": "neutral",
            "PublishDate": 1767257933038,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Wellness Reports Q2 Exceptional Costs of 342 Million Rupees from Acquisitions and Liquidation",
            "Summary": "Zydus Wellness reported exceptional costs of 342 million rupees in Q2 related to the acquisitions of Comfort Click Ltd and Naturell (India) Pvt Ltd, along with liquidation expenses. These one-time costs impact the company's quarterly financial results.",
            "Sentiment": "negative",
            "PublishDate": 1762330438270,
            "Source": "earnings"
        },
        {
            "Title": "Zydus Wellness Reports Q2 Net Loss of 528M Rupees Despite Revenue Growth",
            "Summary": "Zydus Wellness reported a net loss of 528 million rupees in Q2, compared to a profit of 209 million rupees in the same quarter last year. Revenue increased to 6.5 billion rupees from 4.93 billion rupees year-over-year. EBITDA rose to 230 million rupees from 196 million rupees, while EBITDA margin declined to 3.54% from 3.98% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762330054300,
            "Source": "earnings"
        },
        {
            "Title": "Zydus Wellness Subsidiary Receives Tax Notice of ₹563.3 Million",
            "Summary": "Zydus Wellness announced that one of its subsidiaries has received a tax notice amounting to ₹563.3 million rupees. The company disclosed this development regarding the tax matter affecting its subsidiary operations.",
            "Sentiment": "negative",
            "PublishDate": 1761747761880,
            "Source": "stock"
        },
        {
            "Title": "Zydus Wellness Appoints Manish Lal as Head of Global Demand and Supply Organization",
            "Summary": "Zydus Wellness has appointed Manish Lal as Head of Global Demand and Supply Organization. Lal brings over 25 years of supply chain experience to the role.",
            "Sentiment": "positive",
            "PublishDate": 1761572793579,
            "Source": "corporate_governance"
        }
    ]
}