{
    "Symbol": "ZYDUSLIFE",
    "ISIN": "INE010B01027",
    "News": [
        {
            "Title": "Zydus Settles US Patent Dispute with Astellas for $120M",
            "Summary": "Zydus Lifesciences reaches settlement agreement with Astellas Pharma regarding Myrbetriq patent litigation, agreeing to pay USD 120 million plus licensing fees to continue marketing generic Mirabegron in the US.",
            "Sentiment": "neutral",
            "PublishDate": 1770865398182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Lifesciences Board Addresses Exchange Penalties",
            "Summary": "Zydus Lifesciences board reviewed ₹11,800 penalties each from BSE and NSE for technical non-compliance with board meeting intimation requirements, citing inadvertent error due to holiday interpretation differences.",
            "Sentiment": "neutral",
            "PublishDate": 1770624371677,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Lifesciences Q3FY26 Results Show Strong Growth",
            "Summary": "Zydus Lifesciences reported Q3FY26 consolidated revenue of ₹68,645 million with net profit of ₹10,229 million. Standalone revenue reached ₹22,836 million with net profit of ₹2,965 million for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770624234162,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Lifesciences Senior VP Corporate Affairs Retires",
            "Summary": "Zydus Lifesciences Limited announces the superannuation of Mr. Manoj Kumar Kamra, Senior Vice President-Corporate Affairs, effective January 31, 2026, following regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769864597389,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Lifesciences Board Meet on Feb 9 for Q3 Results",
            "Summary": "Zydus Lifesciences Limited has scheduled its Board of Directors meeting for February 9, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769514306649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus USFDA Inspection Concludes with 3 Observations",
            "Summary": "Zydus Lifesciences' Unit-2 manufacturing plant at Ankleswar completed USFDA inspection from January 19-23, 2026, receiving 3 observations with no data integrity issues reported.",
            "Sentiment": "neutral",
            "PublishDate": 1769172462745,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Lifesciences ESG Rating Revised to 84/100",
            "Summary": "S&P Global has revised Zydus Lifesciences' Corporate Sustainability Assessment ESG Score from 83/100 to 84/100 for 2025, marking an improvement in the company's sustainability performance.",
            "Sentiment": "positive",
            "PublishDate": 1768886249058,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Completes Agenus Acquisition, Launches US Bio Unit",
            "Summary": "Zydus Lifesciences successfully completed acquisition of Agenus Inc.'s biologics facilities and equity stake, establishing Zylidac Bio LLC for US CDMO operations with regulatory approvals including CFIUS clearance.",
            "Sentiment": "positive",
            "PublishDate": 1768479302240,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Gets USFDA Nod for Eltrombopag Tablets",
            "Summary": "Zydus Lifesciences receives final USFDA approval for Eltrombopag Tablets in four strengths, targeting a USD 1262.50 million US market for thrombocytopenia treatment.",
            "Sentiment": "positive",
            "PublishDate": 1768463883388,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Gets FDA Approval for First Menkes Disease Drug",
            "Summary": "Zydus Lifesciences' subsidiary Sentynl Therapeutics receives FDA approval for ZYCUBO, the first and only approved treatment for rare genetic Menkes disease in the US.",
            "Sentiment": "positive",
            "PublishDate": 1768279534012,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Dissolves French Subsidiary Ampliman 2",
            "Summary": "Zydus Lifesciences announced the dissolution of its French wholly owned subsidiary Ampliman 2, effective January 9, 2026, with assets transferred to parent entity without impacting operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768035143102,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Dissolves Luxembourg Subsidiary Auroralux",
            "Summary": "Zydus Lifesciences announced dissolution of wholly owned subsidiary Auroralux S.A.S., Luxembourg effective December 31, 2025. Assets transferred to Zydus MedTech France with no business impact.",
            "Sentiment": "neutral",
            "PublishDate": 1767345576853,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Lifesciences Receives ₹2.8 Cr GST Demand Order",
            "Summary": "Zydus Lifesciences receives GST demand order of ₹2.8 crores from Gujarat tax authorities for FY 2018-19 related to input tax credit issues. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767100820795,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Partners with Bioeq for US Biosimilar Rights",
            "Summary": "Zydus Lifesciences enters strategic partnership with Swiss firm Bioeq for commercialisation of NUFYMCO, an FDA-approved interchangeable biosimilar to Lucentis in the US market worth $210 million.",
            "Sentiment": "positive",
            "PublishDate": 1766495394370,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Life Gets HC Nod for Semaglutide Manufacturing",
            "Summary": "High Court permits Zydus Lifesciences to manufacture and export semaglutide to select international markets, marking significant regulatory approval for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1766469355152,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Partners with Myriad for Cancer Testing",
            "Summary": "Zydus Lifesciences signs exclusive agreement with Myriad Genetics to launch cancer-risk assessment diagnostic tests in India, including MyRisk, MyChoice HRD Plus, and Prolaris tests.",
            "Sentiment": "positive",
            "PublishDate": 1766118268252,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Gets FDA Acceptance for CUTX-101 NDA Resubmission",
            "Summary": "Sentyln Therapeutics receives FDA acceptance for CUTX-101 NDA resubmission with PDUFA date of January 14, 2026, bringing potential first treatment for Menkes disease closer to approval.",
            "Sentiment": "positive",
            "PublishDate": 1765804176805,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Life Sciences Postal Ballot Results Dec 2025",
            "Summary": "Zydus Life Sciences announces postal ballot voting results for special resolution dated December 12, 2025, with remote e-voting conducted through CDSL platform from November 13 to December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765555802738,
            "Source": "stocks"
        },
        {
            "Title": "Zydus Lifesciences Partners with Formycon for Keytruda",
            "Summary": "Zydus Lifesciences enters exclusive partnership with Formycon for licensing and supply of biosimilar to Keytruda in the US and Canada markets.",
            "Sentiment": "positive",
            "PublishDate": 1765375095664,
            "Source": "co_actions_results"
        },
        {
            "Title": "Zydus Lifesciences Launches Biosimilar Denosumab for Cancer Patients' Bone Health",
            "Summary": "Zydus Lifesciences launched Zyrifa, a Denosumab biosimilar priced at Rs 12,495 MRP, designed to reduce skeletal complications in cancer patients with bone metastases across multiple tumor types including breast, prostate, lung, and kidney cancers. The therapy targets patients experiencing bone metastases, which affects 50-70% of advanced breast or prostate cancer patients and 15-40% of lung, kidney, thyroid, and melanoma cases, aiming to improve mobility and quality of life during cancer treatment.",
            "Sentiment": "positive",
            "PublishDate": 1765342325751,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Partners with Formycon for Biosimilar Keytruda in North America",
            "Summary": "Zydus Lifesciences and Formycon have entered an exclusive partnership for licensing and supply of a biosimilar to Keytruda in the US and Canada. The collaboration positions both companies to compete in the North American biosimilar market for the cancer treatment drug.",
            "Sentiment": "positive",
            "PublishDate": 1765322826491,
            "Source": "order&deals"
        },
        {
            "Title": "Zydus Lifesciences Receives VAI Classification from US FDA for Injectable Facility",
            "Summary": "Zydus Lifesciences received an Establishment Inspection Report from the US FDA classifying its injectable facility at Jarod, Vadodara as Voluntary Action Indicated (VAI) following a GMP follow-up inspection conducted from August 25 to September 5, 2025. The inspection was conducted following a Warning Letter issued by the US FDA on August 29, 2024, affecting the company's regulatory compliance status for its manufacturing operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764832940208,
            "Source": "stock"
        },
        {
            "Title": "Zydus Life Signs $100 Million Medicine Export Deal With Afghan Company",
            "Summary": "Zydus Life has entered into a $100 million agreement with an Afghan firm for medicine exports and potential future local production. The deal represents a significant international expansion opportunity for the pharmaceutical company into the Afghan healthcare market.",
            "Sentiment": "positive",
            "PublishDate": 1764299475614,
            "Source": "order&deals"
        },
        {
            "Title": "Zydus Lifesciences Receives Tentative USFDA Approval for Diabetes Drug Combination",
            "Summary": "Zydus Lifesciences has received tentative approval from the US Food and Drug Administration for Empagliflozin and Linagliptin tablets, a combination medication for diabetes treatment. This regulatory milestone positions the pharmaceutical company to potentially enter the US market with this diabetes drug combination once final approval is granted.",
            "Sentiment": "positive",
            "PublishDate": 1764288393118,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Partners with RK Pharma for Exclusive US Oncology Product Deal",
            "Summary": "Zydus Lifesciences entered an exclusive licensing and commercialization agreement with RK Pharma for a novel sterile injectable oncology supportive care product targeting the US market. The 505(b)(2) product is expected to be filed in 2026 and addresses a market opportunity of 6.2 million units according to IQVIA data, with RK Pharma handling manufacturing while Zydus manages NDA submission and commercialization.",
            "Sentiment": "positive",
            "PublishDate": 1764140704198,
            "Source": "order&deals"
        },
        {
            "Title": "Zydus Lifesciences Receives USFDA Final Approval for Verapamil Hydrochloride Extended-Release Tablets",
            "Summary": "Zydus Lifesciences has obtained final approval from the USFDA for Verapamil Hydrochloride Extended-release Tablets. This regulatory approval allows the pharmaceutical company to market and distribute this cardiac medication in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1764115911929,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Submits Corporate Presentation to Stock Exchanges",
            "Summary": "Zydus Lifesciences Limited submitted its corporate presentation to BSE and NSE exchanges under SEBI listing regulations compliance. The presentation covers the company's diversified life sciences business including India formulations, US formulations, international markets, consumer wellness, and medtech segments with revenue of INR 2,32,415 million in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1764050195080,
            "Source": "corporate_action"
        },
        {
            "Title": "Zydus Lifesciences Loses Wholly-Owned Subsidiary Status of Zydus Foundation After Share Allotment",
            "Summary": "Zydus Foundation ceased to be a wholly-owned subsidiary of Zydus Lifesciences Limited on November 19, 2025, following the allotment of 4,50,000 equity shares to Ramanbhai Foundation, a public charitable trust. Zydus Lifesciences will continue to hold 50,000 equity shares in Zydus Foundation, which had zero income and net worth contribution to the consolidated financial statements for the year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763551344507,
            "Source": "corporate_action"
        },
        {
            "Title": "Zydus Lifesciences Receives USFDA Approval for Prostate Cancer Injection",
            "Summary": "Zydus Lifesciences received final USFDA approval for its Leuprolide Acetate injection used for advanced prostate cancer treatment, enabling entry into a US market worth $69 million in annual sales. The approval brings the company's total USFDA approvals to 427 and follows strong quarterly results with net profit rising 39% year-on-year to ₹1,259 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763114900564,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Completes US FDA Inspection at Oncology Injectable Facility with Two Observations",
            "Summary": "The US FDA conducted a Pre-Approval Inspection at Zydus Lifesciences' SEZ Oncology Injectable manufacturing site in Ahmedabad from November 4-13, 2025, concluding with two observations and no data integrity issues. The company will work with the FDA to address the observations expeditiously as part of the approval process for their new isolator injectable line.",
            "Sentiment": "neutral",
            "PublishDate": 1763066240950,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Receives US FDA Approval for Multiple Sclerosis Treatment Drug",
            "Summary": "Zydus Lifesciences received tentative approval from the US FDA for Diroximel Fumarate delayed-release capsules (231 mg) used to treat relapsing forms of multiple sclerosis in adults. The drug had annual sales of USD 999.4 million in the United States, and Zydus now has 426 total approvals with 487 ANDAs filed since FY2003-04.",
            "Sentiment": "positive",
            "PublishDate": 1763060513486,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Receives CE Mark Approval for 'Andy' Surgical Robot",
            "Summary": "Zydus Lifesciences has obtained CE Mark certification for its surgical robot named 'Andy'. This approval opens up market potential in the European Union. The surgical robot combines navigation technology with robotic assistance capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1763018193847,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Reports 17% Revenue Growth to Rs 61.2 Billion in Q2 with Strong Performance Across Segments",
            "Summary": "Zydus Lifesciences delivered consolidated revenues of Rs 61.2 billion, up 17% year-on-year in the second quarter ended September 30, 2025. EBITDA margin improved to 32.9%, an increase of 500 basis points year-on-year, with EBITDA at Rs 20.2 billion (up 38%) and net profit at Rs 12.6 billion (up 38%). The US formulations business grew 14% to Rs 27.4 billion with strong double-digit growth driven by volume expansion and new product launches. The company filed six ANDAs, received four approvals including one tentative approval, and launched seven new products during the quarter. In October 2025, Zydus launched Beizray, an albumin-solubilized docetaxel injection, strengthening its 505(b)(2) portfolio. The branded formulations business in India grew 9% year-on-year, outpacing market growth. The company made its first international acquisition by acquiring UK-based Comfort Click Limited (CCL), a digital consumer healthcare platform in the vitamins, minerals, and supplements space. International markets formulations business posted revenues of Rs 7.5 billion with 39% year-on-year growth. The consumer wellness business recorded revenues of Rs 6.4 billion, up 31% year-on-year. Zydus reported positive results from the Pivotal EPICS-III Phase 2(b)/3 trial of Saroglitazar Magnesium in patients with PBC for the US market, meeting the primary endpoint. The company is on track to file the new drug application with the US FDA in Quarter 4 of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763014140120,
            "Source": "earnings"
        },
        {
            "Title": "Zydus Lifesciences Seeks Shareholder Approval for Rs 5,000 Crore Fundraising Through Securities Issuance",
            "Summary": "Zydus Lifesciences Limited has issued a postal ballot notice seeking shareholder approval through special resolution for raising funds up to Rs 5,000 crores. The fundraising will be conducted through issuance of eligible securities including equity shares, non-convertible debentures with warrants, or convertible securities in one or more tranches. The company plans to use multiple methods such as qualified institutions placement, rights issue, preferential allotment, or private placement. The funds will be utilized for prepayment of outstanding borrowings by the company and its subsidiaries, funding organic or inorganic growth opportunities through strategic acquisitions, capital expenditure for growth and expansion, and other general purposes as permitted under applicable laws. The remote e-voting period runs from November 13, 2025 (9:00 AM IST) to December 12, 2025 (5:00 PM IST). The company has appointed Ashish Doshi of SPANJ Associates as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1762840560857,
            "Source": "corporate_action"
        },
        {
            "Title": "Zydus Lifesciences Receives First NMPA Approval in China for Venlafaxine Extended-Release Capsules",
            "Summary": "Zydus Lifesciences has received its first approval from China's National Medical Products Administration (NMPA) for Venlafaxine Extended-Release Capsules in 75mg and 150mg strengths. The capsules are approved for treating major depressive disorder and anxiety disorders.",
            "Sentiment": "positive",
            "PublishDate": 1762835235709,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Receives Tentative USFDA Approval for Olaparib Tablets",
            "Summary": "Zydus Lifesciences has received tentative approval from the USFDA for Olaparib tablets in 100 mg and 150 mg dosages. This regulatory milestone allows the pharmaceutical company to potentially market these cancer treatment tablets in the US market pending final approval conditions.",
            "Sentiment": "positive",
            "PublishDate": 1762519390549,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Maintains FY26 Growth Targets and 26%+ EBITDA Margin Guidance",
            "Summary": "Zydus Lifesciences management expects to achieve their targeted top-line growth and profitability for FY26. The company maintains guidance of 26%+ EBITDA margin for the full year, despite lower margins from recent acquisitions like Comfort Click. The pharmaceutical company expects to launch 25+ products in the US market this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1762486850085,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Reports 13.5% Growth in US Formulations Business",
            "Summary": "Zydus Lifesciences announced 13.5% growth in its US formulations business. This growth rate represents an improvement compared to the company's full-year US business growth, which was in single digits.",
            "Sentiment": "positive",
            "PublishDate": 1762415327663,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Reports Strong Q2 Growth with 38% Revenue Jump and Board Approves ₹5,000 Crore Fundraising Plan",
            "Summary": "Zydus Lifesciences delivered robust quarterly performance with revenue rising to ₹61 billion from ₹52.4 billion year-over-year. EBITDA increased significantly to ₹20.15 billion compared to ₹14.6 billion in the same period last year. The company's EBITDA margin expanded to 32.92% from 27.91% year-over-year. Additionally, the board has approved a fundraising plan of up to ₹5,000 crores through various securities, pending shareholder and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1762414955160,
            "Source": "earnings"
        },
        {
            "Title": "Zydus Lifesciences Reports 38% Jump in Quarterly Net Profit to 12.6 Billion Rupees",
            "Summary": "Zydus Lifesciences reported consolidated net profit of 12.6 billion rupees for Q2, representing a significant increase from 9.1 billion rupees in the same quarter of the previous year. This marks a year-over-year growth of approximately 38% in the pharmaceutical company's quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1762414543605,
            "Source": "earnings"
        },
        {
            "Title": "Zydus Lifesciences Receives USFDA Orphan Drug Status for Beta-Thalassemia Treatment",
            "Summary": "Zydus Lifesciences has received orphan drug status from the USFDA for Desidustat, a treatment for beta-thalassemia. This designation grants the company seven-year marketing exclusivity following approval. Orphan drug status is typically granted to treatments for rare diseases and provides regulatory advantages including market exclusivity periods.",
            "Sentiment": "positive",
            "PublishDate": 1762403521962,
            "Source": "stock"
        },
        {
            "Title": "Zydus Life Sciences Receives FDA Approval for SEZ-II Manufacturing Facility in Ahmedabad",
            "Summary": "Zydus Life Sciences announced that the US FDA has concluded its inspection of the company's SEZ-II manufacturing facility in Ahmedabad with zero observations. The FDA conducted a Pre-Approval Inspection from August 11-14, 2025, and classified the facility as 'No Action Indicated' (NAI), meaning the facility meets regulatory standards. The company received an Establishment Inspection Report (EIR) confirming the successful completion of the inspection process.",
            "Sentiment": "positive",
            "PublishDate": 1762322406827,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Receives Tentative USFDA Approval for Budesonide Capsules, Total Approvals Reach 425",
            "Summary": "Zydus Lifesciences has received tentative USFDA approval for 4 mg Budesonide delayed-release capsules intended for treating mild to moderate active Crohn's disease. With this approval, the company's total number of approvals has reached 425.",
            "Sentiment": "positive",
            "PublishDate": 1762247353596,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Schedules Board Meeting to Discuss ₹50 Billion Fundraising",
            "Summary": "Zydus Lifesciences has scheduled a board meeting for November 6 to discuss fundraising of up to 50 billion rupees. The meeting will focus on potential capital raising activities for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1762171208035,
            "Source": "corporate_action"
        },
        {
            "Title": "Zydus Lifesciences Receives ₹74.23 Crore IGST Demand Order, Plans Appeal",
            "Summary": "Zydus Lifesciences Limited received a demand order from Joint Commissioner of Common Adjudication Authority CGST, Ahmedabad, Gujarat for ₹74.23 crores. The order relates to alleged excess refund claim of IGST on export of goods for the period from April 2018 to March 2024. The tax authority claims the company used CIF (Cost, Insurance Freight) value instead of FOB (Free On Board) value for export calculations. The order covers 4 GST registrations across Gujarat, Maharashtra, Himachal Pradesh and Goa. The company received the order on October 31, 2025 and states it will challenge the order by filing an appeal. Zydus Lifesciences believes it has a strong case and indicated there is no material financial impact on the company.",
            "Sentiment": "negative",
            "PublishDate": 1761975940424,
            "Source": "stock"
        },
        {
            "Title": "Zydus Lifesciences Receives USFDA Approval for Baddi Manufacturing Plant",
            "Summary": "Zydus Lifesciences has received approval from the US Food and Drug Administration for its Baddi manufacturing plant. The approval has been labeled as a voluntary action indicated.",
            "Sentiment": "positive",
            "PublishDate": 1761743073311,
            "Source": "stock"
        },
        {
            "Title": "Zydus Life Schedules Q2 Financial Performance Review for November 6",
            "Summary": "Zydus Life has announced it will review its Q2 financial performance on November 6. The company has set this date for examining its quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1761721139584,
            "Source": "earnings"
        },
        {
            "Title": "Zydus Lifesciences Completes Full Acquisition of Amplitude Surgical SA",
            "Summary": "Zydus Lifesciences has completed its acquisition of French company Amplitude Surgical SA through its wholly owned subsidiary Zydus MedTech France SAS. The subsidiary acquired the remaining 14.4% share capital and voting rights on October 24, 2025, through mandatory tender offer and squeeze-out, bringing its total ownership to 100%. Zydus MedTech France had previously acquired 85.6% of Amplitude Surgical's share capital and voting rights in July 2025. The transaction was consummated on October 24, 2025, making Amplitude Surgical a wholly owned subsidiary of Zydus MedTech France.",
            "Sentiment": "positive",
            "PublishDate": 1761460148989,
            "Source": "order&deals"
        },
        {
            "Title": "Zydus Lifesciences Receives Health Canada Approval for Generic Mesalamine Suppositories",
            "Summary": "Zydus Lifesciences Limited has received Notice of Compliance from Health Canada for generic Mesalamine suppositories 1000 mg. The medication is indicated for treating mildly to moderately active ulcerative proctitis. The suppositories will be manufactured at Zydus' facility in Changodar, Ahmedabad, Gujarat, India. Mesalamine suppositories had annual sales of 4.86 million Canadian dollars in Canada according to IQVIA data from June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761320328364,
            "Source": "stock"
        },
        {
            "Title": "Zydus Healthcare Receives Rs 2.17 Million Tax Demand from CGST Authority",
            "Summary": "Zydus Healthcare Limited, a wholly owned subsidiary of Zydus Lifesciences, received a demand order totaling Rs 2.17 million from the Assistant Commissioner of CGST, Cuttack-I Division, Odisha. The demand relates to disallowed Input Tax Credit and short payment of tax under Reverse Charge Mechanism for the period April 2018 to March 2023. The order was received at 12:06 p.m. on October 16, 2025. Zydus Healthcare intends to challenge the order by filing an appeal and states there is no material financial impact on the subsidiary or parent company.",
            "Sentiment": "negative",
            "PublishDate": 1760680713217,
            "Source": "stock"
        }
    ]
}